#!/usr/bin/env python
# -*- coding: UTF-8 -*-
# Language Version: 2.7+
# Last Modified: 2021-11-15 20:48:26
from __future__ import unicode_literals, division, absolute_import, print_function

"""
藏语威利转写
"""

__all__ = []
__author__ = "北京秘银科技 赵文平(email:wenping_zhao@126.com tel:13511028685)"
__version__ = "0.0.1"

import re

TT = {'XXX': 'XXX',

'ཀ': 'ka',
'ཁ': 'kha',
'ག': 'ga',
'གྷ': 'gha',
'ང': 'nga',
'ཅ': 'ca',
'ཆ': 'cha',
'ཇ': 'ja',
'ཉ': 'nya',

'ཏ': 'ta',
'ཐ': 'tha',
'ད': 'da',
'ན': 'na',
'པ': 'pa',
'ཕ': 'pha',
'བ': 'ba',
'མ': 'ma',

'ཙ': 'tsa',
'ཚ': 'tsha',
'ཛ': 'dza',
'ཝ': 'wa',
'ཞ': 'zha',
'ཟ': 'za',
'འ': "'a",
'ཡ': 'ya',

'ར': 'ra',
'ལ': 'la',
'ཤ': 'sha',
'ཥ': 'ssa',
'ས': 'sa',
'ཧ': 'ha',
'ཨ': 'a',

'ཨི': 'i',
'ཨུ': 'u',
'ཨེ': 'e',
'ཨོ': 'o',

'ཀ\u0f72': 'ki',
}

pt = re.compile('|'.join(sorted(TT.keys(), key=len, reverse=True)))
print(pt)

def wylie_trans(ctx):
    '''藏语威利转写'''
    for i in pt.findall(ctx):
        ctx = ctx.replace(i, TT[i])
    return ctx

ctx = '''ཐུགས་ཀྱི་སྙིང་པོ་གསང་བ་གསང་བ་འདུས་པ་རྡོ་རྗེ་གསུམ་བསྟན་པའི་ལེའུ་སྟེ་གཉིས་པའོ།། །།དེ་ནས་ཡང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་རྡོ་རྗེ་དང་། གསུང་རྡོ་རྗེ་དང་། ཐུགས་རྡོ་རྗེ་གཉིས་སུ་མེད་པའི་ཡེ་ཤེས་སྟོན་པར་མཛད་པའི་ཕྱིར། གསང་བའི་བདག་པོ་རྡོ་རྗེ་འཛིན་པ་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་ལས་རྣམ་པར་རྟོག་པ་མེད་ཅིང་རྡུལ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས། འཁོར་འདུས་པ་རྣམས་ལ་ཡང་དག་པའི་སྣང་བ་སྟོན་པར་མཛད་པའི་ཕྱིར་འདི་གསུངས་སོ། །ཆོས་རྣམས་མི་འགྱུར་ནམ་མཁའ་བཞིན། །དབང་ཕྱུག་ཆེན་པོ་ལྷག་པའི་ལྷ། །རྡོ་རྗེ་སེམས་དཔའ་དེ་བཞིན་གཤེགས། །བླ་མ་ཉིད་དུ་སྟོན་པར་མཛད། །སྔགས་ཀྱི་སྤྱོད་པ་སྤྱོད་མཆོག་གིས། །གསང་བའི་ཚུལ་འདི་སྤྱད་པ་ན། །གང་སྤྱོད་དེ་ཡིས་ཡེ་ཤེས་འཐོབ། །ཚུལ་འདི་ཤིན་ཏུ་འདའ་དཀའ་བའོ། །མཁའ་དང་མཚུངས་པ་མཉམ་འགྱུར་བས། །རྣམ་པར་མི་རྟོག་ངོ་བོ་ཉིད། །ཆོས་རྣམས་རང་བཞིན་དག་པ་ལས། །ཡང་དག་སྐུ་ནི་རབ་ཏུ་འབྱུང་། །ཨོཾ་སྭ་བྷཱ་བ་ཤུད་དྷཱཿསརྦ་དྷ་རྨཱཿསྭ་བྷཱ་བ་ཤུད་དྷོ྅ཧྃ། ཨོཾ་ཡོ་ག་ཤུད་དྷཱཿསརྦ་དྷརྨཱཿཡོ་ག་ཤུད་དྷོ྅ཧྃ། ཨོཾ་ཤཱུ་ནྱ་ཏཱ་ཛྙཱ་ན་བཛྲ་ན་བཛྲ་སྭ་བྷཱ་བ་ཨཱཏྨ་ཀོ྅་ཧྃ། །དག་པའི་སྔགས་ཀྱི་སྒྲ་རྣམས་དང་། །སྔགས་དང་རླུང་དུ་སྦྱར་བ་ཉིད། །རང་བཞིན་དག་པའི་ཡེ་ཤེས་ལྔ། །ཆོས་རྣམས་ཡི་གེ་སྟོང་པར་བརྗོད། །རྡོ་རྗེ་མི་བསྐྱོད་རྒྱལ་མཆོག་ནི། །ཞེ་སྡང་ཅན་གྱི་གདུལ་བྱ་ལ། །རྡོ་རྗེ་རིགས་ཀྱི་དཀྱིལ་འཁོར་གྱིས། །གཏུམ་ཞིང་གདུག་པ་ཐམས་ཅད་འདུལ། །དཀོན་མཆོག་དཔལ་གྱི་རྒྱ་ཆེན་གྱིས། །ང་རྒྱལ་ཅན་གྱི་གདུལ་བྱ་རྣམས། །རིན་ཆེན་རིགས་ཀྱི་དཀྱིལ་འཁོར་གྱིས། །སེར་སྣས་འཇུངས་པ་ཐམས་ཅད་བཏུལ། །ཚེ་དཔག་མེད་ཀྱིས་འོད་བྱེད་ཀྱིས། །འདོད་ཆགས་ཀྱིས་ནི་བཅིངས་པ་རྣམས། །པདྨ་རིགས་ཀྱི་དཀྱིལ་འཁོར་གྱིས། །སྲེད་པ་ཅན་གྱི་གདུག་པ་'''

print(wylie_trans(ctx))

def main():
    ''''''

def test():
    ''''''

if __name__ == "__main__":
    # main()
    test()

