{
    "header": {"title": "阿毗達磨辭典", "author": "", "desc": "　　這是一部專門解釋小乘佛教名詞的辭典。"},
    "一來向補特伽羅": "　　一來果向補特伽羅者，謂於修道中已斷欲界五品煩惱安住彼道，所以者何？由見道後已斷欲界乃至中中品煩惱及住彼斷道故。",
    "一來果": "　　謂一來果。略有二種。一者有為。二者無為。所言有為一來果者。謂彼果得。及彼得得。有學根力有學尸羅。有學善根。八有學法。及彼種類諸有學法。是名有為一來果。所言無為一來果者。謂於此中。三結永斷。及彼種類結法永斷。即是八十八諸隨眠永斷。及彼種類結法永斷。並貪瞋癡多分永斷。及彼種類結法多分永斷。是名無為一來果。",
    "一來果者": "　　謂現法中。已於三結。永斷徧知。及斷多分貪慾瞋恚。彼住此斷中。未能進求不還果證。名一來果。",
    "一來果補特伽羅": "　　一來果補特伽羅者，謂於修道中已斷欲界第六品煩惱安住彼道，所以者何？由已永斷中軟品煩惱斷道究竟，建立此故。",
    "一分攝": "　　一分攝者，謂所有法蘊界處所攝，但攝一分非餘，如戒蘊但攝色蘊等一分，定慧蘊等但攝行蘊一分，欲恚害界但攝法界一分，空無邊處等但攝意法處一分，如是等。",
    "一分眾生": "　　復次何緣一分眾生，於方廣分廣大甚深不生勝解，反懷怖畏耶？由遠離法性故，未種善根故，惡友所攝故。法性者，謂菩薩種性是彼自體故，由一分眾生無菩薩種性故，心性下劣於廣大甚深教不能勝解，是故怖畏。又一分眾生雖有菩薩種性，而於大菩提未種正願等諸善根故，於此不能勝解，是故怖畏。又一分眾生雖已種善根，而為誹謗大乘眾生，惡友所攝故，於此不能勝解，是故怖畏。復次何緣一分眾生於方廣分廣大甚深雖生勝解，而不得出離耶？由深安住自見取故，常堅執著如言義故，深安住自見取者更不進求了義經故，常堅執著如言義者恒堅封執不了義經故，如聞一切法畢竟無自性言故，便撥一切諸法性相皆無所有，如是於餘不了義經堅執如言義亦爾，是故雖信大乘而不得出離，以大乘經由種種意說故。依此密意薄伽梵於大法鏡經中說如是言，若諸菩薩隨言取義，不如正理思擇法故，便生二十八不正見。何等名為二十八不正見耶？謂相見、損減施設見、損減分別見、損減真實見、攝受見、轉變見、無罪見、出離見、輕毀見、憤發見、顛倒見、出生見、不立宗見、矯亂見、敬事見、堅固愚癡見、根本見、於見無見見、捨方便見、不出離見、障增益見、生非福見、無功果見、受辱見、誹謗見、不可與言見、廣大見、增上慢見。相見者，謂聞大乘經中所說一切諸法皆無自性無生無滅本來寂靜自性涅槃等言，不善密意但隨此言義便生勝解，謂佛所說一切諸法定無自性定無生等，執著如是無性等相，是名相見。彼執著如是無性等相時，便謗三自性，謂遍計所執自性，依他起自性，圓成實自性。遍計所執自性者，謂諸愚夫於色等相，周遍計度起增益執，謂此是色乃至此是涅槃，此所執義無實無體，唯有名言之所施設。依他起自性者，謂即此色等唯是虛妄分別自體，又因果性或異不異。圓成實自性者，謂一切法真如實性，於此三性起誹謗行，即次三見，謂損減施設見、損減分別見、損減真實見。彼如是誹謗一切種一切法時，為欲成立此邪見故，便復攝受少分道理。又於所有開示離言諸法實性了義契經，廣設方便皆悉轉變令順己見，如是二種即次二見謂攝受見。轉變見，彼又起如是見，若依此見行善不善，定皆無罪無有過失，一切所行皆歸妙善，先所積習一切障垢皆得出離，如是二種即次二見，謂無罪見。出離見，彼如是執自見已，便於此見相違安立蘊等諸法，聲聞藏中妄生輕毀。又於不信如是邪見聲聞人等深生憎嫉，如是二種即次二見，輕毀見，憤發見。彼又隨順自惡邪見，謂我當建立如實空無相無願，於非彼相起彼相想，而於彼相顛倒建立，又作是思惟，若能悟入如是法性，或令他入一切皆生無量功德。如是二種即次二見，謂顛倒見，出生見，若他於彼所起惡見如理詰責，彼於爾時竟不樂欲，建立自宗，反以譏弄妄理詰責於他。如是二種即次二見，謂不立宗見，矯亂見，彼又起如是增上慢，謂若能如是修行，是真供養恭敬諸佛世尊，如是見者名敬事見。諸有善達無倒法性者，為令捨離彼惡見故，雖以種種真實成立道理方便開悟，堅守愚見曾無捨心，謂唯此真餘並邪妄，如是見者名堅固愚癡見。如上所說，諸見所有習氣麤重，是名根本見，為欲開示如上所說十七種見諸過失門。復說餘見，謂即相見名於見無見見，此實堅執無性等相而起，不執一切相想故，即損減施設見，損減分別見，損減真實見，名捨方便見。由彼誹謗一切法性，於勤精進起無用想故，即攝受見轉變見，名不出離見。非方便修學不能證果故，即無罪見出離見，名障增益見。所行邪僻無容盡障故，即輕毀見憤發見，名生非福見。由於正法同梵行所起邪行門，便能引發大衰損故，即顛倒見出生見名無功果見，由所安立非正法性授者受者俱不能證勝進果故，即不立宗見矯亂見，名受辱見。非理興論無宜得勝故，即敬事見名誹謗見，所不應說強增益故，即堅固愚癡見名不可與言見，邪執空者不應與言，徒設多詞終無所益故，即根本見名廣大見，由此當來諸惡見類轉增廣故。即上所說二十七見，皆名增上慢見，並能發起虛妄無實增上慢故。此云何知？由彼經中即次後說，如是諸見十七即十，十即十七，二十七即一，一即二十七故。",
    "一切五取蘊苦": "　　云何略說一切五取蘊苦？五取蘊。謂色取蘊受想行識取蘊。總名五取蘊。何因緣故。略說一切五取蘊為苦。謂五取蘊。無常轉動。勞倦羸篤。是失壞法。迅速不停。衰朽非恆。不可保信。是變壞法。有增有減。暫住速滅。本無而有。有已還無。由此因緣。略說一切五取蘊為苦。如說取蘊皆性是苦。不安隱故。違聖心故。如是諸苦。名苦諦者。謂此名無常真實。是無常此名為苦。真實是苦。若佛出世。若不出世。如是苦法。法住法界。一切如來。自然通達。等覺宣說。施設建立。分別開示。令其顯了。謂此是無常。此是苦。此是無常性。此是苦性。是真是實。是諦是如。非妄非虛。非倒非異。故名苦諦。名聖諦者。聖謂諸佛。及佛弟子。此是彼諦。謂彼於此。知見解了。正覺為諦。由是因緣。名苦聖諦。復次苦聖諦者。是假建立名想言說。謂苦聖諦。過殑伽沙佛及弟子。皆共施設如是名故。",
    "一切墮僧寶攝。皆得僧和敬耶": "　　應作四句。有墮僧寶攝非得僧和敬。謂正學勤策勤策女鄔波索迦等。已得見諦。於未來果。已能現觀。有得僧和敬非墮僧寶攝。謂苾芻苾芻尼。未得見諦。於未來果。未能現觀。有墮僧寶攝亦得僧和敬。謂苾芻苾芻尼。已得見諦。於未來果。已能現觀。有非墮僧。寶攝非得僧和敬。謂正學勤策勤策女鄔波索迦鄔波斯迦未得見諦。於未來果。未能現觀及余異生未見諦者。",
    "一切種妙智": "　　一切種妙智者，謂於蘊界處一切種妙智性具足中，若定若慧及彼相應諸心心法。云何於蘊界處一切種妙智性具足？謂於蘊等自性差別相，通達一切差別邊際智成滿故。\n　　一切種妙智作何業？謂能絕一切有情一切疑網，令正法眼長時得住，由此有情未成熟者令成熟，已成熟者令解脫，絕疑網者於一切處智無礙故。令正法眼得久住者，於彼彼時方為斷所化有情疑惑，宣說種種法門差別，諸結集者次第結集，令不滅故。依此法眼未成熟有情令速成熟，已成熟者速令解脫。復次於諸現觀位證得後後勝品道時，捨前所得下劣品道，如證得此果所攝道時，即捨此向所攝道，以不復現前故。",
    "一切諸法無生無滅": "　　又於彼說言，一切諸法無生無滅，本來寂靜自性涅槃。依何密意說？如無自性無生亦爾，如無生無滅亦爾，如無生無滅本來寂靜亦爾，如本來寂靜自性涅槃亦爾。",
    "一切遍行同行相應": "　　復有一切遍行同行相應，謂受想思觸作意識。",
    "一切鄔波索迦。皆世尊弟子耶": "　　應作四句。有鄔波索迦非世尊弟子。謂鄔波索迦。未得見諦。於未來果。未能現觀。有世尊弟子非鄔波索迦。謂苾芻苾芻尼。正學勤策勤策女鄔波斯迦等。已得見諦。於未來果。已能現觀。有鄔波索迦亦世尊弟子。謂鄔波索迦。已得見諦。於未來果。已能現觀。有非鄔波索迦非世尊弟子。謂苾芻苾芻尼。正學勤策勤策女鄔波斯迦。未得見諦。於未來果。未能現觀。及余異生未見諦者。",
    "一切鄔波索迦。皆歸佛法僧耶": "　　除諸世俗鄔波索迦。一切皆歸佛法僧寶。有歸佛法僧寶而非鄔波索迦。謂苾芻苾芻尼。正學勤策勤策女鄔波斯迦等。",
    "一間補特伽羅": "　　一間補特伽羅者，謂即一來，或於天上唯受一有得盡苦際，所以者何？即一來果進至不還果向，或於天上唯受一有得般涅槃故，唯有一隙容此一生故名一間。",
    "七種婦": "　　何等為七？一授水婦。二財貨婦。三軍掠婦。四意樂婦。五衣食婦。六同活婦。七須臾婦。\n　　授水婦者。謂女父母。授水與男。以女妻之。為彼家主。名授水婦。\n　　財貨婦者。謂諸丈夫。以少多財。貿易他女。將為己婦。名財貨婦。\n　　軍掠婦者。謂有丈夫。因伐他國。抄掠他女。將為己婦。復有國王。因破敵國。取所欲已。余皆捨棄。有諸丈夫。力攝他女。將為己婦。如是等類。名軍掠婦。\n　　意樂婦者。謂有女人。於男子家。自信愛樂。願住為婦。名意樂婦。\n　　衣食婦者。謂有女人。於男子家。為衣食故。願住為婦。名衣食婦。\n　　同活婦者。謂有女人。詣男子家。謂男子曰。我持此身。願相付託。彼此所有。共為無二。互相存濟。以盡餘年。冀有子孫。歿後承祭。名同活婦。\n　　須臾婦者。謂有女人。樂與男子。暫時為婦。名須臾婦。",
    "七種建立": "　　云何建立？略有七種，謂病行差別故、出離差別故、任持差別故、方便差別故、果差別故、界差別故、修行差別故。病行差別復有七種，謂貪行、瞋行、癡行、慢行、尋思行、等分行、薄塵行。出離差別有三種，謂聲聞乘、獨覺乘、大乘。任持差別有三種，謂未具資糧、已具未具資糧、已具資糧。方便差別有二種，謂隨信行、隨法行。果差別有二十七，謂信解見至身證，慧解脫俱解脫，預流向預流果，一來向一來果，不還向不還果，阿羅漢向阿羅漢果，極七返有，家家一間，中般涅槃，生般涅槃，無行般涅槃，有行般涅槃，上流，退法阿羅漢，思法阿羅漢，護法阿羅漢，住不動阿羅漢，堪達阿羅漢，不動法阿羅漢。界差別者，謂欲界異生有學無學，如欲界有三色界無色界亦爾，又有欲色界菩薩，又有欲界獨覺。不可思議如來修行差別略有五種，一勝解行菩薩，二增上意樂行菩薩，三有相行菩薩，四無相行菩薩，五無功用行菩薩，如是等補特伽羅無量差別。貪行補特伽羅者，謂有猛利長時貪欲，雖於下劣可愛境界，而能發起上品貪故，起即長時無斷絕故，如貪行者乃至尋思行者亦爾，各隨自境，猛利長時如理配釋。",
    "七種方便": "　　方便有七種，謂任持方便、瑜珈方便、相方便、決擇方便、隔越方便、鄰次方便、鄰次隔越方便。通達有五種，謂有相文字通達、所攝能攝通達、遲通達、速通達、法性通達。修有四種，謂得修、習修、除去修、對治修。圓證有四種，謂果圓證、離欲圓證、根滿足圓證、功德圓證。究竟有六種，謂智究竟、斷究竟、畢竟究竟、不畢竟究竟、下劣究竟、廣大究竟。引發有二十種，謂無量引發乃至一切種妙智引發。",
    "七種施": "　　又差別者，謂施有七種，一根本施，謂種性位菩薩所有施波羅蜜多，依止種性而行施故。二弘誓施，謂發心位菩薩所有施波羅蜜多，依受大願而行施故。三攝受施，謂自他利行位菩薩所有施波羅蜜多。四無執受施，謂觀真實義位菩薩所有施波羅蜜多，以無施者等分別執受故。五無攝受施，謂威德位菩薩所有施波羅蜜多，雖不攝受外資生具，但由虛空藏等三摩地力，舉手麾空隨欲皆雨珍寶等物。六隨所應施，謂成熟位菩薩所有施波羅蜜多，隨所化宜而行施故。七廣大施，謂最勝菩提位所有施波羅蜜多，以無上故，如施有七種，乃至慧亦爾，隨其所應。",
    "七種清淨": "　　清淨有七種，謂戒清淨、心清淨、見清淨、度疑清淨、道非道智見清淨、行智見清淨、行斷智見清淨。",
    "七覺支": "　　何等為七？謂念覺支、擇法覺支、精進覺支、喜覺支、輕安覺支、定覺支、捨覺支。\n　　如是覺支。漸次而起。漸次而得。修令圓滿。時彼苾芻。復白佛言。云何覺支？漸次而起。漸次而得。修令圓滿。\n　　佛告苾芻。若有於身。住循身觀。安住正念。遠離愚癡。爾時便起念覺支。\n　　得念覺支。修令圓滿。彼由此念。於法簡擇極簡擇。遍尋思。遍伺察。審諦伺察。爾時便起擇法覺支。\n　　得擇法覺支。修令圓滿。彼由擇法。發勤精進。心不下劣。爾時便起精進覺支。\n　　得精進覺支。修令圓滿。彼由精進。發生勝喜。遠離愛味。爾時便起喜覺支。\n　　得喜覺支。修令圓滿。彼由此喜。身心輕安。遠離粗重。爾時便起輕安覺支。\n　　得輕安覺支。修令圓滿。彼由輕安。便受快樂。樂故心定。爾時便起定覺支。\n　　得定覺支。修令圓滿。彼由心定。能滅貪憂。住增上捨。爾時便起捨覺支。\n　　得捨覺支。修令圓滿。於受心法。住循受心法觀廣說亦爾。如是覺支。漸次而起。漸次而得。修令圓滿。",
    "三句": "　　三句者，謂於所問唯三句答。如有問言，若蘊數亦處數耶，設處數亦蘊數耶，此應三句答，或蘊數非處數，謂色蘊或處數非蘊數，謂法處，或蘊數亦處數，謂識蘊意處，俱非數者，於蘊處中決定不有。",
    "三品順決擇分": "　　此中三品順決擇分者，謂除世第一法，由此世第一法性唯一剎那必不相續，即此生時定入現觀非前位故，從下中品順解脫分，順決擇分有可退義，此唯退現行非退習氣，已依涅槃先起善根者，不復新發起故。",
    "三摩地": "　　三摩地者，於所觀事令心專一為體，智所依止為業，令心專一者，於一境界令心不散故，智所依者，心處靜定知如實故。",
    "三摩地善巧菩薩相": "　　復次方廣分中於法三摩地善巧菩薩相。云何可知？謂由五種因故，一剎那剎那消除一切麤重所依，二出離種種想得樂法樂，三了知無量無分別相，四順清淨分無分別相恒現在前，五能攝受轉上轉勝，圓滿成就佛法身因。",
    "三根": "　　三根者，謂未知欲知根、已知根、具知根。未知欲知根者，謂於方便道及於見道十五心剎那中所有諸根，此中顯示順決擇分所攝方便道，及見道十五剎那所有諸根，是未知欲知根體。言諸根者，謂意根信等五根，由未至等地所依差別故，如其所應有樂喜憂捨根隨一。憂根者，謂方便道時順決擇分後，於上解脫希求欲證愁慼所攝，如是十根先未知真，為欲得知修習轉故，名未知欲知根。已知根者，從第十六見道心剎那已上，於一切有學道中所有諸根，是已知根體。所以者何？即前十根從第十六見道心剎那，乃至金剛喻定，於如是有學道中，未有所應知境，曾所不知故，名已知根。具知根者，謂於無學道所有諸根，言諸根者，即前所說九根除憂根，於無學道中說名具知根，具知者，謂阿羅漢等此所有根名具知根，無學身中無有憂根所應學無故。\n　　復次依止修道分別修義，謂依初靜慮地現修道時，亦修欲界繫所有善根，於彼得自在故。如依初靜慮地修欲界善如是依一切上地現修道時，皆能修習下界下地所有善根，於彼得自在故。當知此中所說義者，謂依止上地現前修習道時，下界下地所有善根，雖不現前亦皆修習，何以故？於彼得自在故，自在者，謂轉增勝現行自在故。",
    "三種業": "　　如契經言，有三種業，謂福業、非福業、不動業。何等福業？謂欲界繫善業。何等非福業？謂不善業。何等不動業？謂色無色界繫善業。",
    "三自性": "　　復次於遍計所執自性，相無性故，於依他起自性，生無性故，於圓成實自性，勝義無性故，更依異門顯無性義故言。復次一切法者即三自性，謂遍計所執自性、依他起自性、圓成實自性。遍計所執自性定無自相，自相無故名相無性，相無性故名為無性。依他起自性待眾緣故非自然生，無自然生性故名生無性，生無性故名為無性。圓成實自性清淨所緣故，於依他起中無遍計所執相所顯自體故，勝義為自體故，無性所顯故名勝義無性，勝義無性故名為無性，由此道理是故如來說，一切法皆無自性，非一切種性相俱無說為無性。\n　　又彼說言，一切諸法無生無滅本來寂靜自性涅槃，此依何密意說，如無自性無生亦爾，如無生無滅亦爾，如無生無滅本來寂靜亦爾，如本來寂靜自性涅槃亦爾。",
    "三身差別": "　　三身差別者，謂證得圓滿自性受用變化身故。",
    "上流補特伽羅": "　　上流補特伽羅者，謂於色界地地中皆受生已，乃至最後入色究竟，於彼無漏聖道現前得盡苦際。復有乃至往到有頂聖道現前得盡苦際，此中顯示二種上流，一極至色究竟，二極至有頂。極至色究竟者，謂多愛味補特伽羅，由多生起軟等靜慮差別愛味故始從梵眾天乃至色究竟，於一切處次第各受一生，乃至最後入色究竟得般涅槃。極至有頂者，謂不雜修第四靜慮，唯避淨居，如前次第生一切處，乃至有頂方般涅槃。又雜修第四靜慮有五品差別，一下品修，二中品修，三上品修，四上勝品修，五上極品修，由此五品雜修第四靜慮故，如其次第生五淨居。",
    "上道": "　　上道者，謂上軟、上中上、上三品道，由此道故，能捨三界所繫地地中軟上軟中軟軟三品煩惱。\n　　如是軟中上品道，復各別分為軟等三建立九品，為顯修道所斷煩惱漸次斷故，復何因緣軟軟品道，能斷上上品煩惱，由此煩惱於極猛利毀滅慚愧無羞恥者身中，麤重現行易可覺了易可分別，是故此上品煩惱猶如麤垢，微少對治即能除遣，若下下品煩惱在與上相違者身中，微隱現行難可覺了難可分別，如微隱垢大力對治方能除遣，由此道理當知所餘能治所治相翻建立亦爾。",
    "不作意": "　　謂於出家遠離所生善法。不引發。不憶念。不思惟。不已思惟。不當思惟。心無警覺。總名不作意。",
    "不信": "　　不信者，謂愚癡分，於諸善法心不忍可，心不清淨，心不悕望為體，懈怠所依為業。懈怠所依者，由不信故無有方便加行樂欲。",
    "不共佛法": "　　不共佛法者，即十八不共佛法，彼復云何？謂於不共身語意業清淨具足中，於所依及果根未得不退具足中，於不共業現行具足中，於不共智住具足中，若定若慧乃至廣說。何等十八？如經言，如來無有誤失，無卒暴音，無忘失念，無不定心，無種種想，無不擇捨，志欲無退，精進無退，念無退，定無退，慧無退，解脫無退，一切身業智為前導隨智而轉，一切語業智為前導隨智而轉，一切意業智為前導隨智而轉，知過去世無著無礙，知未來世無著無礙，知現在世無著無礙，建立彼相如經廣說。\n　　不共佛法作何業？謂由身語意業清淨以得不退若行若住，映蔽一切聲聞獨覺，如此諸句依前所說，於不共三業清淨具足等相，如應配釋。",
    "不動": "　　不動者，謂已離遍淨欲，未離上欲，苦樂滅無為。",
    "不動法阿羅漢": "　　不動法阿羅漢者，謂利根性，若遊散若不遊散，皆能不退現法樂住。",
    "不動行": "　　謂四無色定。諸有漏善。是名不動行。",
    "不動阿羅漢": "　　不動阿羅漢者，謂鈍根性，若遊散若不遊散，皆能不退現法樂住，亦不能練根。練根者，謂轉下鈍根成上利根，是故不動法不說能練根，性是利根故。",
    "不可思議": "　　復次即善不善業處差別、事差別、因差別、異熟差別、品類差別等，皆不可思議，由即此業處差別等，無量無邊難可思議故。處者，謂住如是處造如是業，或於城邑或於村落如是等。事者，謂所依事，或有情數或非有情數。因者，謂善不善根如其所應。異熟者，謂異熟內身。品類者，謂種種差別無量品類。又有種種外事差別，能感業用不可思議。由何等業感棘刺等鋒鋩銛利，如是等類，墮在世間，不思議攝，思議世間佛所制故。又末尼珠藥草咒術相應業用不可思議，末尼相應業者，謂月愛珠等能出水等業用難思。藥相應業者，謂執持此藥藏隱形等。咒相應業者，謂誦此咒便不燒等。術相應業者，謂由彼彼術故治熱病等。又諸觀行者威德業用不可思議，云何彼心威德力故，能動大地昇虛空等。又諸菩薩自在業用不可思議，所謂命自在故，心自在故，財自在故，業自在故，生自在故，勝解自在故，願自在故，神通自在故，智自在故，法自在故，諸大菩薩由如是等自在力故。所作業用不可思議，謂諸菩薩，由命自在力持諸壽行，隨所欲樂爾所時住，由心自在力隨其所樂，於三摩地入出自在，由勝解自在力轉大地等為水火等。勝解自在，由願自在力隨其所樂，能引無數自利利他圓滿大願。由神通自在力為欲攝化無量有情，顯示種種神通變現。由智自在力於諸法義訓釋言詞，無滯辯說圓滿究竟。由法自在力以無量種名句文身，建立素怛纜等無上教法隨其所應，乃至一切有情於一時間能令彼心皆大歡喜。又一切佛所作諸佛應所作事，業用不可思議。云何如來到於究竟無功用處？證得清淨一味法界，諸佛世尊之所應作，利益安樂諸有情事，隨時如應皆能成立，如是諸佛及佛境界不可思議。",
    "不可思議如來補特伽羅": "　　何等不可思議如來補特伽羅？謂且於欲界始從示現，安住睹史多天妙寶宮殿，乃至示現大般涅槃，示現一切諸佛菩薩所行大行。",
    "不和軟性": "　　謂心剛強。心堅硬。心𢤱悷。心不明淨。心不潤滑。心不柔軟。心無堪任。總名不和軟性。",
    "不善": "　　云何不善？幾是不善？為何義故觀不善耶？謂自性故、相屬故、隨逐故、發起故、第一義故、生得故、方便故、現前供養故、損害故、引攝故、所治故、障礙故，是不善義。五蘊十界四處一分是不善，為捨執著非法合我故，觀察不善。自性不善者，謂除染污意相應及色無色界煩惱等，所餘能發惡行煩惱隨煩惱，此復云何？謂欲界繫不任運起者是不善，若任運起能發惡行者亦是不善，所餘是有覆無記。相屬不善者，謂即此煩惱隨煩惱相應法。隨逐不善者，謂即彼習氣。發起不善者，謂彼所起身業語業。第一義不善者，謂一切流轉。生得不善者，謂由串習不善故感得如是異熟，由此自性即於不善任運樂住。方便不善者，謂依止親近不善丈夫故，聽聞不正法不如理作意，行身語意惡行。現前供養不善者，謂想對歸依隨一天眾已，或殺害意為先，或邪惡見為先，建立祠廟興供養業，令無量眾廣樹非福，殺害意為先建立祠廟者，謂於是處害牛羊等以祭天神，邪惡見為先建立祠廟者，謂於是處受自餓等苦求福求願。損害不善者，謂於一切處起身語意種種邪行。引攝不善者，謂行身語意諸惡行已，於惡趣善趣引攝不愛果異熟，或引或滿，於惡趣中具受引滿果異熟，於諸善趣唯受滿果，謂生彼已由惡行力受貧窮苦。所治不善者，謂諸對治所對治法。障礙不善者，謂能障礙諸善品法，如數與眾集等。",
    "不善界": "　　謂不善身語業。心心所法。不相應行。是名不善界。",
    "不喜足": "　　謂有一類。於已獲得色香味觸及余資具。不生喜足。復悕復欲。復樂復求。總名不喜足。",
    "不圓滿": "　　不圓滿者。謂諸有學或預流果攝，或一來果攝，或不還果攝等所有滅。",
    "不害": "　　不害者，無瞋善根一分心悲愍為體，不損惱為業，當知不害不離無瞋故亦是假。",
    "不律儀業": "　　不律儀業者，謂諸不律儀者，或由生彼種姓中故，或由受持彼事業故，所期現行彼業決定。何等名為不律儀者？所謂屠羊養雞養豬捕鳥捕魚獵鹿罝兔，劫盜魁膾害牛縛象，立壇咒龍守獄讒搆好為損等。屠羊者，為欲活命屠養買賣，如是養雞豬等隨其所應。縛象者恒處山林調執野象。立壇咒龍者，習咒龍蛇戲樂自活。讒搆者，以離間語毀壞他親持用活命，或由生彼種姓中或由受持彼事業者，謂即生彼家若生餘家。如其次第，所期現行彼業決定者，謂身語方便為先決定要期現行，彼業是名不律儀業。",
    "不忍": "　　謂有一類。不能堪忍寒熱飢渴風雨蚊虻蛇蠍惡觸。及余苦事。復有一類。於他暴惡。能發自身猛利剛獷切心奪命辛楚苦受凶勃穢言。不能堪忍。即此及前。總名不忍。",
    "不思議如來": "　　不思議如來者，謂且於欲界始從示現安住睹史多天妙寶宮殿，乃至示現大般涅槃，示現一切諸佛菩薩所行大行。一切菩薩所行者，謂從示現睹史多天宮，乃至現大神變降伏魔軍。諸佛所行者，謂從示現成等正覺，乃至示現大般涅槃。",
    "不恭敬": "　　謂有一類。若親教親教類。軌範軌範類。及余隨一尊重可信。往還朋友。如法告言。汝從今去。勿壞身業。勿壞語業。勿壞意業。勿行不應行處。勿親近惡友。勿作三惡趣業。如是教誨。稱法應時。於所修道。隨順磨瑩。增長嚴飾。宜便常委。助伴資糧。而彼有情。不欣不喜。不愛不樂。於師等言。違戾左取。而不右取。毀訾非撥。諸如是等。名不恭敬。",
    "不放逸": "　　不放逸者，依止正勤無貪瞋癡修諸善法，於心防護諸有漏法為體，成滿一切世出世福為業，謂由正勤等為先能修一切善法及防有漏，是故依此四法假立不放逸體。有漏法者，謂諸漏及漏處所境界。",
    "不染污": "　　云何不染污？幾是不染污？為何義故觀不染污耶？謂善及無覆無記法，是不染污義。八界八處全，諸蘊及餘界處一分是不染污。為捨執著離煩惱我故，觀察不染污。",
    "不樂": "　　謂有一類。得好親教親教類。軌範軌範類。及余隨一尊重可信。往還朋友。教誡教授。繫念思惟。房舍臥具。而心不喜。不愛不樂。悵望慘戚。總名不樂。",
    "不正知": "　　不正知者，煩惱相應慧為體，由此慧故起不正知身語心行，毀犯所依為業。不正知身語心行者，謂於往來等事不正觀察，以不了知應作不應作故多所毀犯。",
    "不死尋": "　　謂有一類。作是思惟。我於佛教所說勝定。且未修習。先應誦持經律對法。為諸有情。宣說法要。學諸傳記製造疏論。居阿練若。但持三衣。廣說乃至。隨得而坐。作此事已。然後習定。\n　　復有一類。作是思惟。我於佛教所說勝定。且未修習。先應歷觀山川國土園林池沼岩窟塚間。禮旋制多。遊觀諸寺。為此事已。然後習定。\n　　復有一類。作是思惟。我於佛教所說勝定。且未修習。待過七年六年五年四年三年二年一年。或過七月乃至一月。或過七日乃至一日。或過此晝。或過此夜。過此時已。然後習定。如是思惟。於自身命。不了危脆。起心尋求遍尋求。乃至思惟分別。總名不死尋。",
    "不相離相應": "　　何等不相離相應？謂一切有方分色與極微處互不相離。",
    "不知言知": "　　謂為耳識曾受曾了。名為已聞。彼無耳識曾受曾了。隱藏如是想忍見樂。言我已聞。如是名為不知言知。",
    "不與": "　　謂他攝受有情無情。諸資生具。不捨不棄。不惠不施。",
    "不與取者": "　　謂於他攝受諸資生具。起他攝受。及不與想。復起噁心不善心劫心盜心執心著心取心現前。依如是業如是加行如是思惟如是策勵如是勇猛如是門如是路。於他攝受諸資生具。以執著取。劫盜故思。舉離本處。由如是業如是加行如是思惟如是策勵如是勇猛如是門如是路。於他攝受諸資生具。以執著取。劫盜故思。舉離本處。",
    "不行現觀": "　　不行現觀者，謂已證得無作律儀故，雖居學位而謂我今已盡地獄畜生餓鬼顛墜惡趣，我不復能造惡趣業感惡趣異熟，已得無作律儀者，謂已證得聖所愛戒所攝律儀，由得此故，此所對治地獄異熟等必不復行，由地獄等永盡不行故，名不行現觀。",
    "不見言見": "　　謂為眼識曾受曾了。名為已見。彼無眼識曾受曾了。隱藏如是想忍見樂。言我已見。如是名為不見言見。",
    "不調柔性": "　　謂身剛強。身堅硬。身𢤱悷。身不明淨。身不潤滑。身不柔軟。身無堪任。總名不調柔性。",
    "不護": "　　不護者，即三不護，謂大師御眾時，於隨所欲教授教誡方便具足中，若定若慧，乃至廣說。何等為三？如經言，如來身業清淨現行無不清淨，現行身業可須覆藏，謂勿他知我之所有語業意業，現行亦爾，由彼大師心無懼慮，善御所化一切大眾隨其所欲，自然強力折伏攝受，教誡教授方便具足。\n　　不護作何業？謂能無間斷教授教誡所化徒眾，由無藏護自過慮顯彰故。",
    "不還一法": "　　謂貪若永斷者。我能保彼定得不還。如是嗔癡忿恨覆惱嫉慳誑諂無慚無愧慢過慢慢過慢我慢增上慢卑慢邪慢憍放逸傲憤發矯妄詭詐現相激磨以利求利惡欲大欲顯欲不喜足不恭敬起惡言樂惡友不忍耽嗜遍耽嗜染貪非法。貪著貪惡貪有身見有見無有見貪慾瞋恚惛沉睡眠掉舉惡作疑瞢憒不樂頻申欠呿食不調性心昧劣性種種想不作意粗重抵突饕餮不和軟性不調柔性不順同類欲尋恚尋害尋親裡尋國土尋不死尋陵蔑尋假族尋愁嘆苦憂擾惱。於此一法。若永斷者。我能保彼定得不還。",
    "不還向者": "　　已得無間道。能證不還果。謂此無間證不還果。彼於欲界貪慾瞋恚。由世間道或先永斷。於四聖諦。先未現觀。今修現觀。或住一來果已。能進求不還果證。名不還向。",
    "不還向補特伽羅": "　　不還果向補特伽羅者，謂於修道中已斷欲界第七第八品煩惱安住彼道，所以者何？由一來果後已斷欲界軟上軟中品煩惱及住彼斷道建立此故。",
    "不還果": "　　謂不還果。略有二種。一者有為。二者無為。所言有為不還果者。謂彼果得。及彼得得。有學根力。有學尸羅。有學善根。八有學法。及彼種類諸有學法。是名有為不還果。所言無為不還果者。謂於此中。五順下分結永斷。及彼種類結法永斷。即是九十二諸隨眠永斷。及彼種類結法永斷。是名無為不還果。",
    "不還果者": "　　謂現法中。於五順下分結。已永斷徧知。謂有身見。戒禁取疑。貪慾瞋恚。彼住此斷中。未能進求阿羅漢果證。名不還果。",
    "不還果補特伽羅": "　　不還果補特伽羅者，謂於修道中已斷欲界第九品煩惱安住彼道，所以者何？由彼永斷欲界軟軟品煩惱斷道究竟，建立此故。問若已永斷一切見道所斷煩惱，及已永斷欲界修道所斷一切煩惱得不還果，何故但言永斷五順下分結得不還果耶？答最勝所攝故，云何最勝？由此五結能為下趣下界勝因故名最勝，所以者何下趣者，謂地獄畜生餓鬼，下界者，謂欲界，以薩迦耶見戒禁取疑為最勝因，令諸有情不越下趣故，以貪欲瞋恚為最勝因，令諸有情下越下界故。",
    "不順同類": "　　謂有一類。於親教親教類。軌範軌範類。及余隨一尊重可信。往還朋友。不正隨順。是名不順同類。",
    "世事差別而轉": "　　云何世事差別而轉？謂諸世間最初相見，既相見已更相問訊，既問訊已即受沐浴塗香花鬘，次受種種上妙飲食，次受種種臥具侍女，然後意界處處分別，以內界次第故建立外界，隨此次第建立識界，如界次第處亦如是。",
    "世俗": "　　何等世俗故？謂以世間道摧伏種子所得滅，是故世尊別名說為彼分涅槃。",
    "世俗有": "　　云何世俗有？幾是世俗有？為何義故觀世俗有耶？謂雜染所緣是世俗有義，一切皆是世俗有，為捨執著雜染相我故，觀察世俗有雜染所緣者，能發一切雜染義故，雜染相我者，執我為雜染因故。",
    "世應供者": "　　謂聖弟子。能淨世間。應供器故。已行應供。淸淨道故。成就應供。三淨業故。名世應供。",
    "世間": "　　云何世間？幾是世間？為何義故觀世間耶？謂三界所攝及出世智後所得似彼顯現是世間義，似彼顯現者，謂似三界所攝相顯現，似真如等所現相貌，是出世間，未曾得故，如是諸蘊一分十五界十處全，及三界二處一分，是世間。一分者，謂除正智所攝及後所得似出世間相顯現并無為法，為捨執著世依我故，觀察世間。",
    "世間解": "　　謂五取蘊。名為世間。如來於彼。知見解了正等覺。故名世間解。又說五趣。名為世間。如來於彼。知見解了正等覺。故名世間解。又說六處。名為世間。如來於彼。知見解了正等覺。故名世間解。又說三界所攝諸處。名為世間。從彼而生。從彼而起。從彼而出。因彼而生。因彼而起。因彼而出。如來於彼。知見解了正等覺。故名世間解。",
    "世間道": "　　世間道者，謂世間初靜慮、第二靜慮、第三靜慮、第四靜慮，空無邊處，識無邊處，無所有處，非想非非想處，如是靜慮無色，由四種相應廣分別，謂雜染故、清白故、建立故、清淨故。\n　　雜染者，謂四無記根，一愛二見三慢四無明，由此四惑染污其心，於諸染污靜慮定門令色無色界一切有覆無記，煩惱隨煩惱生長不絕。所以者何？由有愛故味上靜慮雜染所染，貪味淨定輕安樂故，由有見故見上靜慮雜染所染，依止靜慮發起計度先際等見故，由有慢故慢上靜慮雜染所染，依證勝定起高慢故，由無明故疑上靜慮雜染所染，求解脫者由未通達真實道理，於勝品所證常生疑惑，為解脫耶不解脫耶？如是煩惱恒染其心，令色無色大小二惑相續流轉。",
    "中不寂靜苦": "　　云何中不寂靜苦？謂生色界遠離順解脫分者。",
    "中界": "　　謂有漏善。及無覆無記法。是名中界。",
    "中般涅槃補特伽羅": "　　中般涅槃補特伽羅者，謂生結已斷起結未斷，或中有纔起，即便聖道現前得盡苦際，或中有起已，為趣生有纔起思惟，即便聖道現前得盡苦際，或思惟已發趣生有，未到生有即便聖道現前得盡苦際。此中顯示三種中般，由煩惱力往趣生處令生有相續，此煩惱已盡，唯由隨眠力令命終後諸蘊續起，此隨眠餘猶未盡，或中有纔起由串習力聖道現前斷餘隨眠，即於此位入般涅槃，或中有起已，為往生有纔發思惟。聖道現前斷餘隨眠入般涅槃，或思惟已往生有處，未得生有聖道現前，斷餘隨眠入般涅槃，如是三種望生有處，未發纔發已遠去位差別建立，隨順七善丈夫趣經。",
    "中道": "　　中道者，謂中軟、中中、中上品道，由此道故，能捨三界所繫地地中中上中中中軟三品煩惱。",
    "二十九種差別": "　　差別者有二十九種，一非有所緣，謂顛倒心心法及緣，過去未來夢影幻等所緣境界。二有所緣，謂餘所緣境界。三無所緣所緣，謂色心不相應行無為。四有所緣所緣，謂心心法。五正性所緣，謂善法。六邪性所緣，謂染污法。七非正性非邪性所緣，謂無覆無記法。八如理所緣，謂善心心法。九不如理所緣，謂染污心心法。十非如理非不如理所緣，謂異此心心法。十一同類所緣，謂善等緣善等，自地緣自地，有漏緣有漏，無漏緣無漏，如是等。十二異類所緣，謂善等緣不善等，餘地緣餘地，有漏無漏緣無漏有漏，如是等。十三異性所緣，謂有尋有伺心心法所緣。十四一性所緣，謂無尋無伺心心法所緣。十五威勢所緣，謂無想及彼方便心心法所緣境界，及空識無邊處所緣境界，此中前二句能除想故名威勢。所餘性大故名威勢。十六略細所緣，謂無所有處所緣境界。十七極細所緣，謂非想非非想所緣，過此更無極細性故。十八煩惱所緣，謂即此能有所緣故，如經中說斷滅所緣。十九法所緣，謂聖教名句文身。二十義所緣，謂依此法義。二十一狹小所緣，謂聲聞乘等。二十二廣大所緣，謂大乘。二十三相所緣，謂止舉捨相。二十四無相所緣，謂涅槃及第一有。二十五真實所緣，謂真如及十六行所緣諸諦。二十六安住所緣，謂滅盡定及定方便心心法所緣。二十七自在所緣，謂解脫等乃至一切種智諸功德所緣。二十八須臾所緣，謂無學所緣唯此生故。二十九隨轉所緣，謂佛菩薩所緣境界。",
    "二十二種根": "　　謂眼根。耳根。鼻根。舌根。身根。意根。女根。男根。命根。樂根。苦根。喜根。憂根。捨根。信根。精進根。念根。定根。慧根。未知當知根。已知根。具知根。此二十二。攝一切根。",
    "二十八不正見": "　　何因緣故一分眾生於方廣分廣大甚深雖生勝解而不出離？由深安住自見取故，常堅執著如言義故，依此密意薄伽梵於大法鏡經中說如是言。若諸菩薩隨言取義，不如正理思擇法故，便生二十八不正見。何等名為二十八不正見？謂相見，損減施設見，損減分別見，損減真實見，攝受見，轉變見，無罪見，出離見，輕毀見，憤發見，顛倒見，出生見，不立宗見，矯亂見，敬事見，堅固愚癡見，根本見，於見無見見，捨方便見，不出離見，障增益見，生非福見，無功果見，受辱見，誹謗見，不可與言見，廣大見，增上慢見。",
    "二十句薩迦耶見": "　　問於五取蘊有二十句薩迦耶見，謂計色是我我有諸色，色屬於我我在色中，如是計受想行識是我我有識等識等屬我我在識等中，於此諸見幾是我見幾我所見？答五是我見，十五是我所見，謂計色是我，計受想行識是我。此五是我見，餘十五是我所見。何因十五是我所見？相應我所故，隨轉我所故，不離我所故。相應我所者，謂我有色乃至我有識，所以者何？由我與彼相應說有彼故，隨轉我所者，謂色屬我乃至識屬我，所以者何？若彼由此自在力轉，或捨或役，世間說彼是我所故。不離我所者，謂我在色中乃至我在識中，所以者何？彼計實我處在蘊中遍體隨行故。\n　　問薩迦耶見當言於事了不了耶？答當言於事不得決了，如於繩上妄起蛇解，於事不決了者，若能決了色等實相，必不應起虛妄我見，譬如有人欻爾見繩遂執為蛇，不了繩相而起蛇執。",
    "云何愛斷愛修": "　　謂若未斷惡不善法。未修善法。彼於斷修。無愛無勝愛。有引頸悕望。若有已斷惡不善法已修善法。彼於斷修。有愛有勝愛。無引頸悕望。",
    "云何樂斷樂修": "　　謂於斷修。有樂有勝樂。云何精勤隨學？斷修愛樂。謂於斷修愛樂。為增上故。精勤隨學。彼由如是斷修愛樂。終不自舉陵蔑他者。",
    "五怖罪怨不寂靜者": "　　謂殺生者。殺生緣故。生怖罪怨。不離殺生。是名第一。\n　　不與取者。劫盜緣故。生怖罪怨。不離劫盜。是名第二。\n　　欲邪行者。邪行緣故。生怖罪怨。不離邪行。是名第三。\n　　虛誑語者。虛誑緣故。生怖罪怨。不離虛誑。是名第四。\n　　飲味諸酒放逸處者。飲味諸酒放逸處緣故。生怖罪怨。不離飲酒諸放逸處。是名第五。",
    "五怖罪怨能寂靜者": "　　謂離殺生者。離殺生緣故。滅怖罪怨。能離殺生。是名第一。\n　　離不與取者。離劫盜緣故。滅怖罪怨。能離劫盜。是名第二。\n　　離欲邪行者。離邪行緣故。滅怖罪怨。能離邪行。是名第三。\n　　離虛誑語者。離虛誑緣故。滅怖罪怨。能離虛誑。是名第四。\n　　離飲諸酒放逸處者。離飲諸酒放逸處緣故。滅怖罪怨。能離飲酒諸放逸處。是名第五。",
    "五根": "　　五根所緣境者，謂四聖諦，由諦現觀方便所攝作此行故。\n　　五根自體者，謂信精進念定慧。\n　　五根助伴者，謂彼相應心心法等。\n　　五根修習者，謂信根於諸諦起忍可行修習，精進根於諸諦生忍可已為覺悟故。起精進行修習，念根於諸諦發精進已。起不忘失行修習，定根於諸諦既繫念已。起心一境性行修習，慧根於諸諦心既得定。起簡擇行修習，五根修果者，謂能速發諦現觀，由此增上力不久能生見道故，又能修治煖頂引發忍世第一法，即現此身已入順決擇分位故。\n　　如五根五力亦爾，差別者，由此能損減所對治障不可屈伏故名為力，謂五力所緣境等與根相似，然果有差別。所以者何？如說果者，謂能損減不信等障故，勝過於前雖與五根所緣境界自體等相似，然不可屈伏義有差別故。別立力分。",
    "五相差別": "　　五相差別者，謂清淨等五相差別，一清淨差別，謂永斷一切煩惱并習氣故。二圓淨差別，謂遍修治佛淨土故。三身差別，謂法身圓滿故。四受用差別，謂一切時處大集會與諸菩薩受用種種大法樂故。五業差別，謂隨其所應起種種變化，遍於十方無量無邊諸世界中作諸佛事故。",
    "五種拔濟差別": "　　五種拔濟差別者，謂拔濟災橫等五事，一拔濟災橫，謂如來入城邑等時，令盲聾等得眼耳等。二拔濟非方便，謂令得世間正見遠離一切邪惡見故。三拔濟惡趣，謂令生見道越諸惡趣故。四拔濟薩迦耶，謂令證阿羅漢果永脫三界故。五拔濟乘，謂令諸菩薩不樂下乘故。",
    "五蓋": "　　即貪慾蓋。瞋恚蓋。惛沉睡眠蓋。掉舉惡作蓋。疑蓋。",
    "五蘊": "　　謂色蘊。受蘊。想蘊。行蘊。識蘊。是名五蘊。",
    "令未生隨一種類惡不善法永不復生": "　　起欲發勤精進策心持心者。云何未生惡不善法？謂未來五蓋。云何為令未生惡不善法不生故正勝？謂有苾芻。為令未生諸貪慾蓋永不生故。如理思惟。彼貪慾蓋多諸過患。謂是不善法。是下賤者。信解受持。佛及弟子。賢貴善士。共所訶厭。能為自害。能為他害。能為俱害。能滅智慧。能礙彼類。能障寂滅。受持彼法。不生通慧。不引菩提。不證涅槃。如是思惟。發勤精進。勇健勢猛。熾盛難制。勵意不息。此道名為能令未生諸貪慾蓋。不生正勝。彼於此道。生已修習多修習故。便令未生諸貪慾蓋永不復生。\n　　起欲者。謂為令未生諸貪慾蓋永不生故。便起等起及生等生。聚集出現。欲樂欣喜。求趣悕望。彼由生起此諸欲故。便令未生諸貪慾蓋永不復生。\n　　發勤精進者。謂為令未生諸貪慾蓋永不生故。發勤精進。廣說乃至。勵意不息。彼由此故。便令未生諸貪慾蓋永不復生。\n　　策心者。謂為令未生諸貪慾蓋永不生故。精勤修習。喜俱行心。欣俱行心。策勵俱行心。不下劣俱行心。不闇昧俱行心。捨俱行心。定俱行心。彼由修習如是心故。便令未生諸貪慾蓋永不復生。持心者。謂為令未生諸貪慾蓋永不生故。持心修習八支聖道。彼於此道。持心修習多修習故。便令未生諸貪慾蓋永不復生。復有苾芻。為令未生諸貪慾蓋永不生故。如理思惟。出家功德。如是出家。是真善法。是尊勝者。信解受持。廣說乃至。能證涅槃。如是思惟。發勤精進。廣說乃至。勵意不息。此道名為能令未生諸貪慾蓋不生正勝。彼於此道。生已修習多修習故。便令未生諸貪慾蓋永不復生。起欲乃至策心持心。皆如前說。\n　　復有苾芻。為令未生諸貪慾蓋永不生故。如理思惟。彼貪慾蓋。如病如癰。廣說乃至。是變壞法。如是思惟。發勤精進。廣說乃至。勵意不息。此道名為能令未生諸貪慾蓋不生正勝。彼於此道。生已修習多修習故。便令未生諸貪慾蓋永不復生。起欲乃至策心持心。皆如前說。\n　　復有苾芻。為令未生諸貪慾蓋永不生故。如理思惟。滅為寂靜。道能出離。如是思惟。發勤精進。廣說乃至。勵意不息。此道名為能令未生諸貪慾蓋不生正勝。彼於此道。生已修習多修習故。便令未生諸貪慾蓋永不復生。起欲乃至策心持心。皆如前說。如貪慾蓋。余四亦爾。有差別者。應說自名。\n　　復有苾芻。為令未生隨一種類惡不善法永不生故。如理思惟。彼惡不善法。多諸過患。謂是不善法。是下賤者。信解受持。廣說乃至不證涅槃。如是思惟。發勤精進。廣說乃至勵意不息。此道名為能令未生隨一種類惡不善法不生正勝。彼於此道。生已修習多修習故。便令未生隨一種類惡不善法永不復生起欲者。謂為令未生隨一種類惡不善法永不生故。便起等起。廣說乃至求趣悕望。彼由生起此諸欲故。便令未生隨一種類惡不善法永不復生。\n　　發勤精進者。謂為令未生隨一種類惡不善法永不生故。發勤精進。廣說乃至。勵意不息。彼由此故。便令未生隨一種類惡不善法永不復生策心者。謂為令未生隨一種類惡不善法永不生故。精勤修習。喜俱行心。廣說乃至。定俱行心。彼由修習如是心故。便令未生隨一種類惡不善法永不復生。\n　　持心者。謂為令未生隨一種類惡不善法永不生故。持心修習八支聖道。彼於此道。持心修習多修習故。便令未生隨一種類惡不善法永不復生。\n　　復有苾芻。為令未生隨一種類惡不善法永不生故。如理思惟出家功德。如是出家。是真善法。是尊勝者。信解受持。廣說乃至。能證涅槃。如是思惟。發勤精進。廣說乃至。勵意不息。此道名為能令未生隨一種類惡不善法不生正勝。彼於此道。生已修習多修習故。便令未生隨一種類惡不善法永不復生。起欲乃至策心持心。皆如前說。\n　　復有苾芻。為令未生隨一種類惡不善法永不生故。如理思惟。彼惡不善法。如病如癰。廣說乃至。是變壞法。如是思惟。發勤精進。廣說乃至。勵意不息。此道名為能令未生隨一種類惡不善法不生正勝。彼於此道。生已修習多修習故。便令未生隨一種類惡不善法永不復生。起欲乃至策心持心。皆如前說。\n　　復有苾芻。為令未生隨一種類惡不善法永不生故。如理思惟。滅為寂靜。道能出離。如是思惟。發勤精進。廣說乃至。勵意不息。此道名為能令未生隨一種類惡不善法不生正勝。彼於此道。生已修習多修習故。便令未生隨一種類惡不善法永不復生。起欲乃至策心持心。皆如前說。",
    "以利求利": "　　謂有一類。先從余家。求得衣缽。及余隨一支身命緣。持往余家。而現之曰。彼某甲家。與我此物。然彼施主。於長時中。恆資給我衣缽等物。汝家若能如彼施者。便亦是我所依止處。因前方便。獲後利者。如是總名以利求利。",
    "以如是相隨念僧": "　　謂以此相此門此理。於諸僧所。起念隨念。專念憶念。不忘不失。不遺不漏。不失法性心明記性。是故名為以如是相隨念於僧。",
    "以無量門正為開示苦真是苦": "　　云何名為以無量門正為開示苦真是苦？謂正開示生苦老苦病苦死苦怨憎會苦愛別離苦求不得苦。略說一切五取蘊苦。如有頌言。\n　　諸蘊起為苦　　生及出亦苦\n　　生已有老苦　　病苦與死苦\n　　煩惱生為苦　　生已住亦苦\n　　非聰敏悔苦　　不調伏死苦\n　　無智有情苦　　增羯吒私苦\n　　愚夫生死苦　　多劫馳流苦",
    "以無量門正為開示道真是道": "　　云何名為以無量門正為開示道真是道？謂正開示。此道此行。於去來今眾苦。能斷能棄。能吐能盡。能離染。能滅能寂靜。能令永滅沒。此復云何？謂八支聖道。正見正思惟正語正業正命正精進正念正定。如有頌言。\n　　此威猛一趣　　如鳥路淸虛\n　　牟尼定所行　　為眾數宣說\n　　哀愍說一趣　　見道盡生邊\n　　此道於瀑流　　去來今能度\n　　能究竟調靜　　能盡生死流\n　　能通達多界　　能開明眼道\n　　如殑伽駛流　　速趣於大海\n　　開示廣慧道　　速證於涅槃\n　　哀愍一切眾　　轉未聞法輪\n　　教導諸天人　　稽首度有海",
    "任持增上": "　　任持增上者，謂風輪等，於水輪等器世間，於有情世間大種，於所造諸根，於諸識如是等。引發增上者，謂一切有情共業於器世間故，有漏業於異熟果，如是等俱有增上者，謂心於心法作意，於心觸，於受，如是等。此後增上依二十二根建立，境界增上者，謂眼耳鼻舌身意根，由此增上力色等生故。產生增上者，謂男女根，由此增上力得入胎故。住持增上者，謂命根，由此增上力眾同分得住故。受用果增上者，謂苦樂憂喜捨根，依此能受愛非愛異熟故。世間清淨離欲增上者，謂信勤念定慧根，由此制伏諸煩惱故。出世清淨離欲增上者，謂所建立，未知欲知根，已知根，具知根，由此永害諸隨眠故。",
    "任持差別": "　　任持差別者，謂滿大劫阿僧企耶，福智資糧圓滿故。",
    "任持離欲": "　　何等任持離欲？謂飽食已於諸美膳生厭背性",
    "伴攝": "　　伴攝者，謂色蘊與餘蘊互為伴故，即攝助伴。餘蘊界處亦爾。如色蘊與餘受等互為助伴能攝五蘊，如是受等一一助伴各攝五蘊，如蘊界處亦爾，互為伴故，一一皆攝一切界處。",
    "伺": "　　伺者，或依思或依慧伺察意言令心細為體，依思依慧者，於推度不推度位，如其次第伺察行相意言分別，如是二種安不安住所依為業，尋伺二種行相相類故，以麤細建立差別。",
    "住": "　　住者，謂於眾同分諸行相續不變壞性，假立為住。",
    "住不動阿羅漢": "　　何等住不動阿羅漢？謂鈍根性，若遊散若不遊散，皆能不退現法樂住，亦不能練根。",
    "住法": "　　云何於諸法中安住於法？若不得修慧唯勤方便修習聞思，不得名為安住於法，若不得聞思唯勤方便修習修慧，亦不得名安住於法，若俱得二種方便安住，如是乃名安住於法。如經言，大德當知，若諸比丘如是住法，乃可名為住法比丘，於此經中世尊顯示，若能具依聞思修住，方名住法，非隨住一方便修習得名住法。若唯於法受持讀誦為他宣說等，是名聞思所生慧，如說若於是處多究其文，讀誦宣說又多尋思，唯修聞思慧不修習，修慧捨離瑜伽等，不可建立為住法。若修三摩地方便不知足，是名修所生慧，如說若有不得聞思唯修修慧，亦不可立為住法。是故世尊因住法比丘說如是言，若比丘於法究竟，所謂契經應頌乃至廣說，已後復說言，不捨瑜伽，如是等應如理知，若有具得聞思修慧依二種住，是名住法不捨瑜伽。如是等者，謂修三摩地方便不知足，顯示修所生慧，三摩地方便者，謂無間殷重方便，及無顛倒方便。此則顯示二種方便，一無間殷重方便所攝，如說不捨瑜伽故。二無顛倒方便所攝，如說不捨作意故，不知足者，謂不生味著修上奢摩他方便，如說不捨內心奢摩他故，此則顯示不生味著故，及修上奢摩他方便故，名為不捨。",
    "何等名為下至捃多比畢洛迦皆不離殺": "　　言捃多者。謂蚊蚋等諸小蟲類。比畢洛迦。即諸蟻子。下至此類微碎眾生。皆起噁心。欲興殺害。是故名為能殺生者。",
    "佛": "　　謂於如來無學智見明鑒覺慧照現觀等已能具起及得成就。故名為佛。",
    "佛證淨": "　　如世尊言。此聖弟子。以如是相。隨念諸佛。謂此世尊。是如來阿羅漢正等覺明行圓滿善逝世間解無上丈夫調御士天人師佛薄伽梵。所言此者。謂此欲界。或此世界。此贍部洲。又言此者。謂即此身持等持軀等軀聚得自體。又言此者。謂此處生。佛及弟子。諸僊牟尼。諸聰睿者。善調伏者。善調順者。又言此者。謂即於此教授教誡善說法中。是故言此。言聖弟子者。聖謂佛法僧。歸依佛法僧故。名聖弟子。以如是相隨念佛者。謂以此相此門此理。於諸佛所。起念隨念。專念憶念。不忘不失。不遺不漏。不失法性。心明記性。是故名為以如是相隨念諸佛。所言謂者。謂如是相。如是狀。如是種。如是類。是故言謂所言此者。謂如是戒。如是法。如是慧。如是通。如是解脫。如是多住。是故言此。言世尊者。如後當釋。言如來者。如世尊言。從菩薩證無上正等菩提夜。乃至佛無餘依般涅槃界夜。於其中間。諸有所說。宣暢敷演。一切皆如。無有虛妄。無有變異。諦實如理。無有顛倒。皆以如是如實正慧。見已而說故。名如來。阿羅漢者。略有二種阿羅漢性。一者有為。二者無為。云何有為阿羅漢性？謂彼果得。及彼得得。無學根力。無學尸羅。無學善根。十無學法。及彼種類諸無學法。是名有為阿羅漢性。云何無為阿羅漢性？謂貪瞋癡。一切煩惱皆悉永斷超一切趣。斷一切道。三火永靜。焦渴永息。憍逸永離。窟宅永破。度四瀑流。無上究竟。無上寂靜。無上愛盡。離滅涅槃。是名無為阿羅漢性。如來具足圓滿成就。如是所說有為無為阿羅漢性。故名阿羅漢。又貪瞋癡。及余煩惱。皆悉應斷。如來於彼。永斷徧知。如多羅樹永斷根頂無復遺余。皆得當來永不生法。故名阿羅漢。又身語意三種惡行。皆應永斷。如來於彼。永斷徧知乃至廣說。故名阿羅漢。又過去佛。皆已遠離惡不善法。所有雜染。後有熾然。苦異熟果。皆得當來永不生法。今佛亦爾。故名阿羅漢。又佛世尊。成就最勝吉祥功德。應受上妙衣服飲食諸坐臥具醫藥資緣種種供養。故名阿羅漢。如有頌言。\n　　世所應受用　　種種上妙物\n　　如來皆應受　　故名阿羅漢\n　　正等覺者。如世尊言。諸所有法。一切正性。如來一切知見解了正等覺。故名正等覺。又等法者。謂四念住。四正勝。四神足。五根五力。七等覺支。八聖道支。如來一切知見解了正等覺。故名正等覺。又於一切苦集滅道。能現觀道。能證預流果一來果不還果阿羅漢果道。能證神境智作。證通天耳智作。證通他心智作。證通宿住隨念智作。證通死生智作。證通漏盡智作。證通道能盡貪瞋癡慢憍垢道。如來一切皆正等覺。至誠堅住。殷重作意。以因以門。以理以相正等覺故。名正等覺。明行圓滿者。何等為明？謂佛所有無學三明。一者無學宿住隨念智作證明。二者無學死生智作證明。三者無學漏盡智作證明。是謂為明。何等為行？謂佛所有無學身律儀。語律儀。命淸淨。是謂為行。又佛所有上妙威儀。往來顧視。屈伸俯仰。服僧伽胝。執持衣缽。悉皆嚴整。是謂為行。此行前明。總謂明行。如來具足圓滿成就如是明行。一向鮮白。一向微妙。一向無罪。是故名為明行圓滿。言善逝者。謂佛成就極樂安隱無艱無難往趣妙法。故名善逝。又貪瞋癡。及余煩惱所生。種種難往趣法。如來於彼。永斷徧知。如多羅樹永斷根頂無復遺余。皆得當來永不生法。故名善逝。又如過去諸佛世尊。皆乘如實。無虛妄道。趣出世間。殊勝功德。一至永至。無復退還今佛亦然。故名善逝。世間解者。謂五取蘊。名為世間。如來於彼。知見解了正等覺。故名世間解。又說五趣。名為世間。如來於彼。知見解了正等覺。故名世間解。又說六處。名為世間。如來於彼。知見解了正等覺。故名世間解。又說三界所攝諸處。名為世間。從彼而生。從彼而起。從彼而出。因彼而生。因彼而起。因彼而出。如來於彼。知見解了正等覺。故名世間解。無上丈夫者。如世尊言。所有有情。無足二足。四足多足。有色無色。有想無想。非想非非想。如來於中。最稱第一。最勝最尊。最上無上。由此故說無上丈夫。調御士者。謂佛世尊。略以三種巧調御事。調御一切所化有情。一於一類。一向柔軟。二於一類。一向粗獷。三於一類。柔軟粗獷。云何如來於彼一類一向柔軟？謂為彼說此身妙行。此身妙行所感異熟。此語妙行。此語妙行所感異熟。此意妙行。此意妙行所感異熟。此天此人。此善趣。此樂世。此涅槃。是名如來於彼一類一向柔軟。云何如來於彼一類一向粗獷？謂為彼說。此身惡行。此身惡行所感異熟。此語惡行。此語惡行。所感異熟。此意惡行。此意惡行。所感異熟此地獄。此傍生。此鬼界。此險難。此惡趣。此墮落。是名如來於彼一類一向粗獷。云何如來於彼一類柔軟粗獷？謂於時時為說。身妙行。語妙行。意妙行。或於時時為說。身妙行語妙行。意妙行。所感異熟。或於時時為說。身惡行。語惡行。意惡行。或於時時為說。身惡行。語惡行。意惡行。所感異熟。或於時時為說。天人善趣。樂世涅槃。或於時時為說。地獄傍生。鬼界險難。惡趣墮落。是名如來於彼一類柔軟粗獷。如來於彼。以此三種巧調御事。如是調伏。如是止息。如是寂靜。如是令其無餘。永捨貪瞋癡等一切煩惱。如是令其無餘。永盡貪瞋癡等一切煩惱。令永調伏。令永止息。令永寂靜。得上調御。得勝調御。得勝淸涼。永除曲穢。善滅慢覆及諂垢濁。是故如來名調御士。天人師者。如世尊告阿難陀言。我非但與苾芻苾芻尼鄔波索迦鄔波斯迦四眾為師。然我亦與諸天魔梵沙門婆羅門等諸天人眾。為師為勝師。為隨師。為范為勝范。為隨范。為將為導。是故如來名天人師。所言佛者。謂於如來無學智見明鑒覺慧照現觀等已能具起及得成就。故名為佛。且如有一大婆羅門。來詣佛所。以妙伽他。讚問佛曰。\n　　稽首世導師　　名最上覺者\n　　何緣父母等　　號尊名佛陀\n　　世尊哀愍彼婆羅門。亦以伽他而告彼曰。\n　　婆羅門當知　　我如去來佛\n　　成就覺者相　　故我名佛陀\n　　婆羅門當知　　我觀三世行\n　　皆有生滅法　　故我名佛陀\n　　婆羅門當知　　我於應知斷\n　　證修事已辦　　故我名佛陀\n　　婆羅門當知　　我於一切境\n　　具一切智見　　故我名佛陀\n　　婆羅門當知　　我於無量劫\n　　修諸純淨行　　經無量死生\n　　今於最後身　　離塵垢毒箭\n　　證得無上覺　　故我名佛陀\n　　薄伽梵者。謂有善法。名薄伽梵。成就無上諸善法故。或修善法。名薄伽梵。已修無上諸善法故。又佛世尊。圓滿修習身戒心慧。成就大悲。我無限無量。成無量法。名薄伽梵。又佛世尊。具大威德。能往能至。能壞能成。能自在轉。名薄伽梵。又佛世尊。永破一切貪瞋癡等惡不善法。永破雜染後有熾然苦異熟果。永破當來生老病死。名薄伽梵。如有頌言。\n　　永破貪瞋癡　　惡不善法等\n　　具勝無漏法　　故名薄伽梵\n　　又佛世尊。於未聞法。能自通達。得最上覺。成現法智。無障礙智。善解當來。修梵行果。為諸弟子。分別解說。設大法會。普施有情。名薄伽梵。如有頌言。\n　　如來設法會　　普哀愍無依\n　　如是天人師　　稽首度有海\n　　又佛世尊。為諸弟子。隨宜說法皆令歡喜。恭敬信受。如教修行。名稱普聞。遍諸方域。無不讚禮。名薄伽梵。若聖弟子。以如是相隨念諸佛。見為根本。證智相應諸信信性。現前信性。隨順印可愛慕愛慕性。心證心淨。是名佛證淨。若能於此。勸勵安立。當知是名方便勸勵安立令住佛證淨中。",
    "作事相應": "　　何等作事相應？謂於一所作事展轉相攝，如二苾芻隨一所作更互相應。",
    "作意": "　　作意者，發動心為體，於所緣境持心為業，於所緣境持心者，謂即於此境數數引心，是故心得定者名得作意。",
    "依": "　　界所依者，謂欲界等所攝身。趣所依者，謂五趣所攝身。洲渚所依者，謂贍部洲等。村田所依者，謂若依此村田而有即用此為所依。補特伽羅所依者，謂若依此補特伽羅而有即用此為所依。無病所依者，謂若依無病而有即用此為所依。尸羅所依者，謂若依尸羅而有即用此為所依。莊嚴所依者，謂若依彼彼沙門莊嚴諸功德生，即用彼為所依。眾具依者，謂四依即衣服等。善友依者，謂若依此善等生起。法依者，謂契經等十二分教。作意依者，謂七種作意即了相作意等。三摩鉢底依者，謂七依定如經言，我說依初靜慮能盡諸漏，乃至依無所有處亦爾。",
    "依出離": "　　云何依出離？幾是依出離？為何義故觀依出離耶？謂依耽嗜相違是依出離義，乃至無染有爾所量，出離亦爾，為捨執著離耽嗜我故，觀察出離。",
    "依止任持修": "　　依止任持修復有四種，一依止因修，謂由種性力於波羅蜜多修習正行。二依止報修，謂由勝自體力於波羅蜜多修習正行。三依止願修，謂由本願力於波羅蜜多修習正行。四依止簡擇力修，謂由慧力於波羅蜜多修習正行。",
    "依止作意修": "　　依止作意修亦有四種，一依止勝解作意修，謂於一切波羅蜜多相應經教起增上勝解。二依止愛味作意修，謂於已得波羅蜜多見勝功德起深愛味。三依止隨喜作意修，謂於一切世界一切有情所行施等深生隨喜。四依止喜樂作意修，謂於自他當來勝品波羅蜜多深生願樂。",
    "依止尸羅": "　　從是已後依止尸羅。釋佛經中護身等義。云何名為防護身語？由彼正解所攝持故。云何身語具足圓滿？終不毀犯所毀犯故。云何身語清淨現行？由無悔等漸次修行，乃至得定為依止故。云何身語極善現行？染污尋思所不雜故。云何身語無罪現行？遠離邪願修梵行故。云何身語無害現行？不輕陵他易共住故。云何身語隨順現行？由能隨順涅槃得故。云何身語隨隱顯現行？隱善顯惡故。云何身語親善現行？同梵行者攝受尸羅故。云何身語應儀現行？於尊尊位離憍慢故。云何身語敬順現行？於尊教誨敬順受故。云何身語無熱現行？遠離苦行熱惱下劣欲解故。云何身語不惱現行？棄捨財業無悔惱故。云何身語無悔現行？雖得少分不以為喜而無悔恨故。如世尊說，如是有情皆由自業，業所乖諍，從業所生依業出離業能分別一切有情高下勝劣。云何有情皆由自業？由自造業而受異熟故。",
    "依止差別": "　　何等依止差別？謂乃至有情依止差別有爾所，當知蘊界處亦爾。",
    "依止意樂修": "　　依止意樂修復有六種，謂由無厭意樂、廣大意樂、歡喜意樂、恩德意樂、無染意樂、善好意樂故，修諸波羅蜜多。此中菩薩於施波羅蜜多無厭意樂者，謂諸菩薩於一有情一剎那頃，假使殑伽沙等世界滿中七寶以用布施，又以殑伽沙等身命布施，如是布施經殑伽沙等大劫，如於一有情所，如是乃至於一切有情界如是施時，皆令彼於阿耨多羅三藐三菩提速得成熟。修行如是差別施時，菩薩意樂由不厭足，如是意樂是名菩薩於施波羅蜜多無厭意樂。又諸菩薩修行如是施波羅蜜多時，展轉相續無一剎那有退有斷，乃至究竟坐菩提座，如是意樂是名菩薩於施波羅蜜多廣大意樂。又諸菩薩修行如是施波羅蜜多時，於施所攝諸有情所生大歡喜，是諸有情施所攝受雖生歡喜猶不能及如是意樂，是名菩薩於施波羅蜜多歡喜意樂。又諸菩薩修行如是施波羅蜜多時，觀施所攝一切有情，於我己身有大恩德，不見己身於彼有恩，由資助我阿耨多羅三藐三菩提故，如是意樂是名菩薩於施波羅蜜多恩德意樂。又諸菩薩修行如是施波羅蜜多時雖於無量諸有情所興大施福，而不希報恩當來果報，如是意樂是名菩薩於施波羅蜜多無染意樂。又諸菩薩修行如是施波羅蜜多時，以所修行廣大施聚所得果報，施諸有情不自為己，又以此福共諸有情迴向阿耨多羅三藐三菩提如是意樂是名菩薩於施波羅蜜多善好意樂。又諸菩薩修行戒波羅蜜多乃至慧波羅蜜多時無厭意樂者，謂諸菩薩假使經於殑伽沙等生，是一一生殑伽沙等大劫壽量，於此長時諸資生具常所匱乏，三千大千世界滿中熾火，恒在其中行住坐臥，唯能修習一剎那戒波羅蜜多，或乃至慧波羅蜜多如是展轉差別修習，所有戒聚乃至慧聚究竟滿足，現能證得阿耨多羅三藐三菩提，是諸菩薩修行如是戒波羅蜜多乃至慧波羅蜜多時，於此戒聚乃至慧聚，修習意樂猶不滿足，如是意樂是名菩薩於所修習戒波羅蜜多乃至慧波羅蜜多無厭意樂。又諸菩薩修行如是戒波羅蜜多乃至慧波羅蜜多時，展轉相續無一剎那有退有斷，乃至究竟坐菩提座，如是意樂是名菩薩於所修行戒波羅蜜多乃至慧波羅蜜多廣大意樂。又諸菩薩修行如是戒波羅蜜多乃至慧波羅蜜多時，於此所攝諸有情所生大歡喜，是諸有情由此所攝雖生歡喜，猶不能及如是意樂，是名菩薩於所修行戒波羅蜜多乃至慧波羅蜜多歡喜意樂。又諸菩薩修行如是戒波羅蜜多乃至慧波羅蜜多時，觀此所攝一切有情，於我己身有大恩德，不見己身於彼有恩，由資助我阿耨多羅三藐三菩提故，如是意樂是名菩薩於所修行戒波羅蜜多乃至慧波羅蜜多恩德意樂。又諸菩薩修行如是戒波羅蜜多乃至慧波羅蜜多時，雖於無量諸有情所興大戒福乃至慧福，而不希報恩當來果報，如是意樂是名菩薩於所修行戒波羅蜜多乃至慧波羅蜜多無染意樂。又諸菩薩修行如是戒波羅蜜多乃至慧波羅蜜多時，以所修行廣大戒聚乃至慧聚所得果報，施諸有情不自為己，又以此福共諸有情迴向阿耨多羅三藐三菩提，如是意樂是名菩薩於所修行戒波羅蜜多乃至慧波羅蜜多善好意樂。",
    "依止方便修": "　　依止方便修復有三種，謂由無分別智觀察三輪皆清淨故，所以者何？由此方便一切作意所修諸行速成滿故。依止自在修亦有三種，謂身自在故、行自在故、說自在故。身自在者，謂諸如來自性受用。二身行自在者，謂諸如來變化身，由此能示現一切有情一切種同法行故。說自在者，謂能宣說六波羅蜜多一切種差別無有滯礙故。差別云何？謂由十八種任持以顯六波羅蜜多差別，何等十八？謂身任持，心任持，善法任持，善任持，菩提任持，悲任持，不捨有情任持，捨下劣心任持，無生法忍任持，善根方便任持，善根圓證任持，善根無盡任持，無厭倦任持，諸所思事成滿任持，御眾業任持，證入大地任持，引發佛性任持，建立佛事任持。施等六種各三差別，如其次第三三所攝，施三種者，謂財施、無畏施、法施。戒三種者，謂律儀戒、攝善法戒、饒益有情戒。忍三種者，謂耐怨害忍、安受苦忍、諦察法忍。精進三種者，謂被甲精進、方便精進、饒益有情精進。靜慮三種者，謂現法樂住靜慮、引發神通靜慮、饒益有情靜慮。慧三種者，謂緣世俗慧、緣勝義慧、緣有情慧。當知財施能任持身，由飲食等諸資生具攝益受者所依身故，無畏施能任持心，安慰他心離憂怖故，如是餘句隨義應思。下劣心者，謂諸菩薩厭生死苦同二乘心，由安受苦忍所任持故方捨此心。善根無盡者，謂窮生死際恒作一切有情利益安樂事，乃至於無餘涅槃界亦不棄捨，由饒益有情精進所任持故。御眾業者，謂依止內證故，教授教誡所化有情，心未定者令其得定，心已定者令其解脫，由饒益有情靜慮所任持故。證入大地者，謂先信解甚深教法，資糧圓滿速能證入初極喜地，由緣世俗慧所任持故，所餘易了故不重釋。",
    "依耽嗜": "　　云何依耽嗜？幾是依耽嗜？為何義故觀依耽嗜耶？謂依如是貪瞋癡故，染著五欲。彼自性故、彼相屬故、彼所縛故、彼隨逐故、彼隨順故、彼種類故，是依耽嗜義。何等瞋恚能起染著？謂憎嫉出離如是乃至有染有爾所量，依耽嗜亦爾，為捨執著耽嗜合我故，觀察依耽嗜。",
    "信": "　　信者，於有體有德有能忍可清淨希望為體，樂欲所依為業，謂於實有體起忍可行信，於實有德起清淨行信，於實有能起希望行信，謂我有力能得能成。",
    "信勝解補特伽羅": "　　何等信勝解補特伽羅？謂隨信行已至果位。",
    "信根": "　　謂依出家遠離所生善法。所起諸信信性。現前信性。隨順印可。愛慕愛慕性。心澄淨。是名信根。復次學信無學信。及一切非學非無學信。皆名信根。",
    "信解補特伽羅": "　　信解補特伽羅者，謂隨信行已至果位，見至補特伽羅者，謂隨法行已至果位。",
    "修": "　　修云何？略說有四種，謂得修、習修、除去修、對治修。得修者，謂未生善法修習令生。習修者，謂已生善法修令堅住不忘倍復增廣。除去修者，謂已生惡不善法修令永斷。對治修者，謂未生惡不善法修令不生，如是四種修差別相，隨其所應依四正斷說，為得故修名為得修。由此修力得所未得諸善法故，習即是修名為習修，由此修力數習已得諸善法故，為除故修名除去修，由此修力除去現行位諸不善法故，修習對治名對治修，對治未來諸不善法令成不生法故又道生時能安立自習氣，是名得修，從此種類展轉增盛相續生故。又即此道現前修習，是名習修，由即此道現前行故，又即此道現在前時能捨自障，是名除去修，由此能滅自所對治麤重障故，又即此道既捨自障，又令彼未來住不生法中，是名對治修，由已得轉依於未來世安置彼障令住不生法故。又由具四種對治故，名對治修，謂厭壞對治，斷對治，持對治，遠分對治。厭壞對治者，於有漏諸行見多過患，謂以如病如癰等行厭壞五取蘊故。斷對治者，謂方便及無間道，由彼能斷諸煩惱故。持對治者，謂解脫道，由彼任持斷得故。遠分對治者，謂此後諸道，由彼令先所斷煩惱轉遠離故，如是四種對治差別，是前對治修差別義。",
    "修如是諸道": "　　復云何修如是諸道？謂得修、習修、除去修、對治修。得修者，謂未生善法修習令生。習修者，謂已生善法修令堅住不忘倍復增廣。除去修者，謂已生惡不善法修令永斷。對治修者，謂未生惡不善法修令不生。又道生時能安立自習氣，是名得修。即此道現前修習，是名習修。即此道現在前時能捨自障，名除去修。即此道既捨自障，令彼未來住不生法，名對治修。復有四種對治名對治修，謂厭壞對治、斷對治、持對治、遠分對治。云何厭壞對治？謂於有漏諸行見多過患。云何斷對治？謂加行道及無間道。云何持對治？謂解脫道。云何遠分對治？謂此後諸道。",
    "修所斷": "　　云何修所斷？幾是修所斷？為何義故觀修所斷耶？謂得見道後，見所斷相違諸有漏法，是修所斷義。見所斷相違者，謂除分別所起染污見等，餘有漏法，有漏法言亦攝隨順決擇分善，麤重所隨故，一切一分是修所斷。一分者，除見所斷及無漏法，為捨執著修圓滿我故，觀察修所斷。",
    "修梵行者": "　　苾芻尼。正學勤策女。及鄔波斯迦。出家外道女。下至在家修苦行女。謂有男子。捨自妻媵。告言善賢。放汝自在修諸梵行。彼聞受持。苦行無怠。",
    "修習": "　　又修習者，謂欲勤策勵勇猛不息正念正知及不放逸，修習差別故。欲修習者，謂為對治不作意隨煩惱。勤修習者，謂為對治懈怠隨煩惱。策修習者，謂為對治沈掉隨煩惱。勵修習者，謂為對治心下劣性隨煩惱。心下劣性者，謂於勝品所證功德，由自輕蔑門心生怯弱性。勇猛修習者，謂為對治疏漏疲倦隨煩惱。疏漏疲倦者，謂能引蚊虻等處所生逼惱。不息修習者，謂為對治得少善法生知足喜隨煩惱，由得少善生知足喜故，止息所餘勝進善品。正念修習者，謂為對治忘失尊教隨煩惱。正知修習者，謂為對治毀犯追悔隨煩惱。毀犯追悔者，謂於往來等事不正知而行，先越學處後生悔惱。不放逸修習者，謂為對治捨諸善軛隨煩惱。捨善軛者，由放逸過失故，於所造修勝進善品，捨勤方便不能究竟。念住修果者，謂斷四顛倒趣入四諦身等離繫，是名修果斷。四顛倒者，謂四念住隨其次第能斷淨樂常我四種顛倒，修不淨觀故，了知諸受皆是苦故，通達諸識依緣差別念念變異故，觀察染淨唯有諸法無作用者故。又此四種如其次第趣入四諦，亦名修果，由身念住趣入苦諦，所有色身皆行苦相，麤重所顯故，是故修觀行時能治此輕安，於身差別生故，由受念住趣入集諦，以樂等諸受是和合愛等所依處故，由心念住趣入滅諦，觀離我識當無所有懼我斷門生涅槃怖永遠離故，由法念住趣入道諦，為斷所治法為修能治法故。又此四種如其次第能證得身受心法離繫果，由此修習漸能遠離身等麤重故。",
    "修行差別": "　　云何修行差別？略有五種，一勝解行菩薩，二增上意樂行菩薩，三有相行菩薩，四無相行菩薩，五無功用行菩薩，補特伽羅差別故。",
    "修道": "　　云何修道？謂見道上所有世間道、出世間道、軟道、中道、上道、方便道、無間道、解脫道、勝進道等，皆名修道。所以者何？諸佛聖弟子已得諦現觀，從此已上為斷餘結方便數習世間道等，是名修道。",
    "俱分解脫補特伽羅": "　　俱分解脫補特伽羅者，謂已斷諸漏及具證八解脫定，由煩惱障分及定障分俱得解脫故，預流果向補特伽羅者，謂住順決擇分位，及住見道十五心剎那位，此中意說，始從一座順決擇分乃至，未得初果，皆名預流果向。",
    "俱有相應": "　　何等俱有相應？謂一身中諸蘊界處，俱時流轉同生住滅。",
    "假族尋": "　　謂有一類。於非親族。托為親族。欲令安樂。得勝朋伴。無有惱害。成就一切無惱害法。王臣愛重。國人敬慕。五穀豐熟。降澤以時。緣此等故。起心尋求遍尋求。乃至思惟分別。總名假族尋。",
    "假有": "　　云何假有？幾是假有？為何義故觀假有耶？謂待於名言此餘根境是假有義，一切皆是假有，為捨執著，實有我故，觀察假有。",
    "傲": "　　謂有一類。應供養者而不供養。應恭敬者而不恭敬。應尊重者而不尊重。應讚歎者而不讚嘆。應問訊者而不問訊。應禮拜者而不禮拜。應承迎者而不承迎。應請坐者而不請坐。應讓路者而不讓路。由此發生。身不卑屈。不等卑屈。不極卑屈。身傲心傲。自傲誕性。總名為傲。",
    "僧證淨": "　　若聖弟子。以如是相隨念僧伽。見為根本證智相應諸信信性現前信性隨順印可。愛慕愛慕性心證心淨。是名僧證淨。若能於此勸勵安立。當知是名方便勸勵安立令住僧證淨中。",
    "入一切法": "　　入一切法有八種，謂一切法欲為根本，作意所生觸所集起，受所引攝定為上首，慧為最勝，解脫為堅固，出離為後邊。",
    "內無色想觀外諸色解脫": "　　云何內無色想觀外諸色解脫？謂於內已伏見者色想，或現安立見者無色想，觀所見色住具足中若定若慧，餘如前說。內無色想者，謂於內身已依無色定伏除見者色想故，或見者無色想，安立現前故，謂見者名想現在前行，餘如前釋。",
    "內門": "　　云何內門？幾是內門？為何義故觀內門耶？謂外門相違是內門義，除四界二處全及所餘一分，是內門。為捨執著離欲我故，觀察內門。",
    "內門同行相應": "　　復有內門同行相應，謂諸定地所有心心所。",
    "內門差別": "　　何等內門差別？謂一切定地。",
    "八何詞": "　　八何詞者，謂何誰信、何所信、用何信、為何信、由何信、何之信、於何信、幾何信。八若詞者，謂若能信、若所信、若用信、若為信、若由信、若彼信、若於信、若爾所信，如是等無量法門皆有八種。不畢竟出離者，謂由世間道。畢竟出離者，謂由出世間道，前四易解故不重釋。相甚深者，謂三自性。雜染甚深者，謂真如云何染而不染。清淨甚深者，謂即真如云何淨而不淨。緣起甚深者，謂無有法於所生起有實作用，然彼諸法種種生起，如是等又實無我似我顯現。業甚深者，謂有業有果報而作者不可得。智甚深者，謂無分別智。云何此智無有分別？而能分明觀真如性。生甚深者，謂諸菩薩不由業煩惱力而示現受生。菩提甚深者，謂於無漏界中諸佛菩提不可建立，一性無量相續所證故，不可建立種種性，所依無差別故。諸佛甚深者，謂於一大集會中，有無量無邊諸佛世尊種種身種種意樂，然不謂有自他差別。又化身佛不住佛相，而能造作種種佛事。教甚深者，謂於大乘教中有種種祕密意樂差別三解脫門及一切法，欲為根本等，已說其相，不復重釋。",
    "八聖道支": "　　八聖道支所緣境者，謂即此後時四聖諦如實性，由見道後所緣境界，即先所見諸諦如實性為體故。\n　　道支自體者，謂正見、正思惟、正語、正業、正命、正精進、正念、正定，如是八法名道支自體。正見者，是分別支，如先所證真實簡擇故。正思惟者，是誨示他支，如其所證方便安立發語言故。正語正業正命者，是令他信支。如其次第，令他於證理者決定信有見戒正命清淨性故，所以者何？由正語故隨自所證，善能問答論議決擇，由此了知有見清淨。由正業故往來進止正行具足，由此了知有戒清淨，由正命故如法乞求佛所聽許衣鉢資具，由此了知有命清淨。正精進者，是淨煩惱障支由此永斷一切結故。正念者，是淨隨煩惱障支，由此不忘失正止舉相等，永不容受沈掉等隨煩惱故。正定者，是能淨最勝功德障支，由此引發神通等無量勝功德故。\n　　道支助伴者，謂彼相應心心法等。\n　　道支修習者，如覺支說，謂依止遠離，依止無欲，依止寂滅，迴向棄捨修習正見，乃至廣說。如是諸句義如前所說道理應隨順知\n　　道支修果者，謂分別誨示他，令他信煩惱障淨隨煩惱障淨最勝功德障淨故。",
    "八隻補特伽羅者": "　　謂顯安立。預流向等補特伽羅。八種各別佛弟子眾者。顯示開曉佛弟子眾具勝功德。戒具足者。謂學無學僧。成就具足學無學戒。定具足者。謂學無學僧。成就具足學無學定。慧具足者。謂學無學僧。成就具足學無學慧。解脫具足者。謂學無學僧。成就具足學無學解脫。解脫智見具足者。謂學無學僧。成就具足學無學解脫智見言應請者。謂應惠施應供養應祠祀。故言應請。言應屈者。謂已惠施。善惠施已供養。善供養已祠祀。善祠祀少作功勞。獲大果利。故名應屈。應恭敬者。謂若識知。若不識知。皆應起迎曲躬合掌稽首接足。",
    "六受身": "　　云何建立受蘊？謂六受身眼觸所生受，乃至意觸所生受，若樂若苦若不苦不樂，復有樂身受苦身受不苦不樂身受，樂心受苦心受不苦不樂心受，復有樂有味受苦有味受不苦不樂有味受，樂無味受苦無味受不苦不樂無味受，復有樂依耽嗜受苦依耽嗜受不苦不樂依耽嗜受，樂依出離受苦依出離受不苦不樂依出離受。身受者，謂五識相應受。心受者，謂意識相應受。有味受者，謂自體愛相應受。無味受者，謂此愛不相應受。依耽嗜受者，謂妙五欲愛相應受。依出離受者，謂此愛不相應受。如是建立由四種因，謂所依故自體故，集所依故，雜染清淨故，集色所依建立身受，集無色所依建立心受，由雜染故建立有味等。由清淨故建立無味等，此愛不相應者，謂離繫及隨順離繫。",
    "六思身": "　　云何建立行蘊？謂六思身，眼觸所生思，乃至意觸所生思，由此思故思作諸善，思作雜染，思作分位差別，又即此思除受及想與餘心所有法并心不相應行，總名行蘊。雖除受想，一切心所有法及心不相應行，皆行蘊相，然思最勝與一切行為導首，是故偏說。為顯此義故，說由思造善法等，善者，謂當說信等。雜染者，謂當說貪等，根本煩惱及貪等煩惱分少分煩惱。分位差別者，謂於思所發種種行位，假設心不相應行。",
    "六想身": "　　云何建立想蘊？謂六想身，眼觸所生想，乃至意觸所生想，由此想故或了有相，或了無相，或了小大無量，或了無少所有無所有處有相想者，謂除不善言說無相界定及有頂定想所餘想。無相想者，謂前所除想。小想者，謂能了欲界想。大想者，謂能了色界想。無量想者，謂能了空。無邊處識無邊處想，無所有處想者，謂能了無所有處想。不善言說想者，謂未學語言故，雖於色起想而不能了，此名為色故名無相想。無相界定想者，謂離色等一切相無相涅槃想故，名無相想，有頂定想者，謂彼想不明利，不能於境圖種種相故。名無相想，小者，謂欲界下劣故。大者，謂色界增上故。無量者，謂空無邊處識無邊處無邊際故，是故緣彼諸想亦名小大無量。",
    "六種差別": "　　又蘊界處有六種差別，謂外門差別、內門差別、長時差別、分限差別、暫時差別、顯示差別。外門差別者，謂多分欲界差別，多分言為簡等流法，為因聞思所生慧。內門差別者，謂一切定地。長時差別者，謂諸異生。分限差別者，謂諸有學及除最後剎那蘊界處，所餘無學。暫時差別者，謂諸無學最後剎那蘊界處。顯示差別者，謂諸佛及已得究竟菩薩摩訶薩，所示現諸蘊界處。",
    "六種識": "　　識有六種，謂眼識耳鼻舌身意識。受有三種，謂苦樂、不苦、不樂。想有二十種，謂無常想、無常苦想、苦無我想、厭離食想、一切世間不可樂想、過患想、斷想、離欲想、滅想、死想、不淨想、青瘀想、膿爛想、破壞想、膖脹想、食噉想、血塗想、離散想、骨鎖想、空觀想。作意有七種，謂了相作意、勝解作意、遠離作意、攝樂作意、觀察作意、方便究竟作意、方便究竟果作意。智有十種，謂法智、類智、世俗智、他心智、苦智、集智、滅智、道智、盡智、無生智。遍知有九種，謂欲繫見苦集所斷斷遍知，色無色繫見苦集所斷斷遍知，欲繫見滅所斷斷遍知，色無色繫見滅所斷斷遍知，欲繫見道所斷斷遍知，色無色繫見道所斷斷遍知，順下分結斷遍知，色愛盡遍知，無色愛盡遍知。",
    "六種順決擇分": "　　復有六種順決擇分，謂隨順順決擇分、勝進順決擇分、通達順決擇分、餘轉順決擇分、一生順決擇分、一座順決擇分。若最初所起緣諦境行下品善根，是名隨順順決擇分，即此善根轉成中品，是名勝進順決擇分，望前下品是增勝故，即此善根增至上品，於此生中決定堪能通達諦理，是名通達順決擇分。又即此位中不定種性者，為迴向最勝菩提，及諸獨覺為求無師自證菩提，轉趣餘生，是名餘轉順決擇分。若於此生定能通達，是名一生順決擇分。若於此座定能通達，是名一座順決擇分。",
    "六處": "　　六處有二種業，一攝諸有情自體圓滿，二與觸作緣。",
    "六處緣觸": "　　謂眼及色為緣生眼識。三和合故生觸。乃至意及法為緣生意識。三和合故生觸。是名六處緣觸。\n　　復次眼及色為緣生眼識。三和合故生觸。此中眼為內緣。色為外緣。生眼觸。乃至意及法為緣生意識。三和合故生觸。此中意為內緣。法為外緣。生意觸。是名六處緣觸。\n　　復次眼及色為緣生眼識。三和合故生觸。此中眼觸。以眼色眼識為緣。乃至意及法為緣生意識。三和合故生觸。此中意觸。以意法意識為緣。是名六處緣觸。\n　　復次眼及色為緣生眼識。三和合故生觸。此中眼色眼識。皆非是觸。由三和合。而有觸生乃至意及法為緣生意識。三和合故生觸。此中意法意識。皆非是觸。由三和合。而有觸生。是名六處緣觸。如是諸觸。六處為緣。六處為依。六處為建立。故起等起生等生。聚集出現。故名六處緣觸。",
    "共業、不共業、強力業、劣力業": "　　復次如經言有共業，有不共業，有強力業，有劣力業。云何共業？若業能令諸器世間種種差別。云何不共業？若業能令有情世間種種差別。或復有業，令諸有情展轉增上，由此業力說諸有情更互相望為增上緣，以彼互有增上力故，亦名共業，由此勢力諸有情類展轉互為諸心心法變異生因。是故經言，如是有情與餘有情互相見等，而不受用不易可得。云何強力業？謂對治力強補特伽羅故，思所造諸不善業，由對治力所攝伏故，令當受那落迦業轉成現法受，應現法受業轉令不受，所以此業名強力者。由能對治業力強故，此能治業望所治業其力強勝，令彼所感諸苦異熟轉變滅故。又故思所造一切善業望不善業，對治力強皆名強力，依此業故薄伽梵說，我聖弟子能以無量廣大之業善熏其心，諸所造作有量之業，此業不能牽引不能留住，亦不能令墮在彼數。又對治力劣補特伽羅，故思所造諸不善業望諸善業皆名強力。又故思造業異熟決定，不斷不知名強力業。此中意說，一切善不善業無有差別，但異熟決定，諸聖道力所不斷者，皆名強力業。又欲界繫諸不善業性皆是強，眾多煩惱隨煩惱等為助伴故。又先所串習名強力業，以數熏習於相續故又依強位名強力業，由處盛年所造諸業猛利執著淨信所發故。又不可治者，所造諸業，名強力業，由無涅槃法者所有諸業，非對治力所能伏故。又由田故發強力業，謂害母等業。又由心加行故發強力業，謂於無上菩提發強大願等，此所生業其力猛盛名強力業。復次由九種因發強力業，謂田故、事故、自體故、所依故、作意故、意樂故、助伴故、多修習故、與多眾生共所行故。由此九因發強力業田者，謂具大功德堪為福田。事者，謂所施物多而精妙。自體者，謂戒勝於施修勝於戒如是等。所依者，謂已離欲者作諸福業。作意者，謂猛利淨信俱行作意。意樂者，謂希求涅槃所有意樂。助伴者，謂更廣修習餘福業事共相攝受。多修習者，謂數數修習或數數尋思。與多眾生共所行者，謂自作教他見作隨喜，與此相違是劣力業。\n　　如世尊說，若有說言，彼彼丈夫補特伽羅，隨如是如是業若作若增長還受如是如是異熟，若有是事便不應修清淨梵行，亦不可知正盡諸苦作苦邊際，若有說言，彼彼丈夫補特伽羅，隨如是如是順所受業若作若增長，還受如是如是順所受異熟，若有是事便應修習清淨梵行。又亦可知正盡諸苦作苦邊際，如是經言有何密意，此中佛意為欲遮止如是邪說，謂樂俱行業還能感得樂俱行異熟，苦俱行業還能感得苦俱行異熟，不苦不樂俱行業還能感得不苦不樂俱行異熟，故作是說，若有說言，彼彼丈夫補特伽羅，隨如是如是業若作若增長，還受如是如是異熟，若有是事便不應修清淨梵行，亦不可知正盡諸苦作苦邊際。何故便不應修清淨梵行，以諸煩惱極猛利者要由智慧自勵自策，與憂苦俱護持禁戒，若於當來受彼異熟時，還與憂苦俱者護持禁戒應無義利。又於他妻等與喜樂俱毀犯禁戒，若於當來受彼異熟時，還與喜樂俱者精勤遠離即為唐捐，是故說言，若有是事便不應修清淨梵行。何故亦不可知正盡諸苦作苦邊際即由如是修習梵行招苦異熟故，是故世尊為遮如是外道邪說，樂俱行業還受樂異熟，苦俱行業還受苦異熟，不苦不樂俱行業還受不苦不樂異熟，異熟因異熟果決定相似故說是經。又為開許如是正說，謂樂俱行業，順樂受者還受樂異熟順苦受者還受苦異熟，順不苦不樂受者還受不苦不樂異熟，苦俱行業，順樂受者還受樂異熟，順苦受者還受苦異熟，順不苦不樂受者還受不苦不樂異熟，不苦不樂受俱行業，順樂受者還受樂異熟，順苦受者還受苦異熟，順不苦不樂受者還受不苦不樂異熟。樂俱行業有二種，謂善不善，隨其所應順當來世苦受樂受不苦不樂受，還能感得樂等異熟，如是苦俱行業，不苦不樂俱行業，各有二種，隨順樂等感樂等異熟，隨其所應，如是名為此經密意。",
    "具分攝": "　　具分攝者，謂所有法蘊界處所攝，能攝全分，如苦蘊攝五取蘊，欲界攝十八界，無想有情處攝十處除香味，由此道理於餘經中諸蘊界處所攝，一切法能攝全分。",
    "具正勤": "　　謂有苾芻。於此內身。從足至頂。隨其處所。觀察思惟。種種不淨。穢惡充滿。謂此身中。唯有種種發毛爪齒塵垢皮肉筋脈骨髓髀腎心肺肝膽腸胃肪膏腦膜膿血肚脂淚汗涕唾生熟二藏大小便利。如是思惟不淨相時。所起於法簡擇極簡擇。最極簡擇。解了等了近了。機黠通達。審察聰睿。覺明慧行。毘缽舍那。是循內身觀。亦名身念住。成就此觀。現行隨行。徧行遍隨行。動轉解行。說名為住。彼觀行者。能發起勤精進。勇健勢猛熾盛難制。勵意不息。復能於此。急疾迅速。名具正勤。",
    "具正念": "　　彼觀行者。具念隨念。專念憶念。不忘不失。不遺不漏。不失法性。心明記性。名具正念。",
    "具正知": "　　彼觀行者。能起於法簡擇。乃至毘缽舍那。復能於此所起勝慧。轉成上品上勝上極。能圓滿極圓滿。名具正知。",
    "具知根": "　　謂阿羅漢。所有無學慧慧根。及慧解脫。俱解脫。於四聖諦。已現觀。而現觀。為得現法樂住故。諸根轉。是名具知根。",
    "具足": "　　具足者。謂此依出家。及依遠離所生善法。精勤修習。無間無斷。方得圓滿。故名具足。",
    "出世": "　　云何出世？幾是出世？為何義故觀出世耶？謂能對治三界，無顛倒無戲論無分別故，是無分別出世間義，能對治三界者，謂諸聖道此復二種。一聲聞獨覺所得，對治常等顛倒，無顛倒分別故名無分別。二菩薩等所得，對治一切色等法戲論，無戲論分別故名無分別，諸無為法非一切分別所依處故，名無分別。又出世後所得，亦名出世，依止出世故，如是諸蘊一分，及三界二處一分是出世，為捨執著獨存我故，觀察出世。",
    "出世道": "　　出世間道者，謂於修道中法智類智品所攝苦智集智滅智道智，如是八智相於見道中已廣說，及彼相應三摩地等，或未至定所攝，或初靜慮乃至無所有處所攝，非想非非想處唯是世間，不明了想恒現行故。由不明了想恒現在前，非極明了現行聖道之所依止，是故一向世間所攝。由此道理彼想羸劣不能猛利，取所緣相故名無相。復云何知非想非非想處無有聖道？由世尊說，乃至有想三摩鉢底，方能如實照了，通達滅盡三摩鉢底，是出世間。由聖道後所證得故，要於人趣方能引發，言引發者是初起義，或於人趣或於色界能現在前，先已生起後重現前故，或於人趣者謂即於此生，或於色界者，謂後生彼。云何聖弟子已得無色定已離色界，欲復生色界耶？不必永離色界，欲方入無色定，是故此中應作四句。若已離色界欲者，一切皆能入無色界寂靜解脫定耶？設能入無色界寂靜解脫定者，一切已離色界欲耶？答此初句者，謂依未至定已離色界欲，而不能得入無色界寂靜解脫定。第二句者，謂諸聖者已得第四靜慮，不求生無色界而起厭背，第四靜慮行恒現在前，捨斷結道依勝進道，漸次能入無色界寂靜解脫定。第三句者，謂即此行者勤求離欲依斷結道，漸次能入無色界寂靜解脫定。第四句者，謂除上爾所相，問無色界中何故滅定不起現前？答生無色界此滅盡定多分不起現前，由住寂靜解脫異熟者於此滅定多不發起勤方便故。所以者何？諸聖弟子為欲安住寂靜住故，於人趣等引此滅定令現在前，若已生無色界者，不由功用自然安住第一寂靜解脫異熟住不復發起方便功用求此滅定令現在前。",
    "出苦道無畏": "　　出苦道無畏者，謂依止靜慮由利他門，於一切種說出離道法自稱德號建立具足中，若定若慧，餘如前說。如經言，又我為諸弟子說出離道，諸聖修習決定出離決定通達，設有世間沙門婆羅門若天魔梵，依法立難，或令憶念言，修此道非正出離，不正盡苦及證苦邊，我於是事正見無緣，乃至廣說。如是四無畏略說有二，謂自利利他，前二是自利，由智斷差別故。後二是利他，由遠離所治法修習能治法故。以正等覺無畏由內智自利門言，我於一切種所知境界差別邊際皆正等覺，於一切世間前自稱德號立正無難具足中所有定慧乃至廣說，當知餘，無畏如應亦爾，一切種漏盡者，謂諸煩惱并習氣永盡，一切種障礙法者謂一切雜染所，對治法一切種出離道者，謂從方便道乃至究竟道。",
    "出離": "　　出離有六種，謂世間出離、聲聞出離、獨覺出離、大乘出離、不畢竟出離、畢竟出離。",
    "出離差別": "　　出離差別者，謂依十地而出離故。",
    "分位同行相應": "　　復有分位同行相應，謂與樂受諸相應法，與苦受不苦不樂受諸相應法。",
    "分位攝": "　　分位攝者，謂樂位蘊界處即自相攝，苦位不苦不樂位亦爾，分位等故，如色受等雖同蘊類，然苦樂等分位差別，樂位還攝樂位非苦等位，如是苦位不苦不樂位還自相攝，如蘊界處亦爾。",
    "分別差別": "　　何等分別差別？謂即於蘊界處中，實有假有，世俗有勝義有，有色無色，有見無見，如是等無量差別分別如前說。",
    "分別支": "　　分別支者，謂分別緣生為十二分，由十二支緣起差別故。何等十二？謂無明、行、識、名、色、六處、觸、受、愛、取、有生及老死。",
    "分別顯示決擇": "　　分別顯示決擇者，謂於如所說蘊等法中，隨其所應作一行、順前句、順後句、二句三句四句、述可句、遮止句等，一行者即問論法，謂以一法與餘法，一一互相問已除此法，更以第二法與餘法互相問，如是一一問一切法。如有問言，若成就眼處亦色處耶，設成就色處亦眼處耶，此應作順前句答。若成就眼處亦耳處耶，此應作四句答，如是乃至對意處如理應說。若成就眼處亦法處耶，此亦應作順前句答。若成就色處亦眼處耶，設成就眼處亦色處耶，此應作順後句答。若成就色處亦耳處耶，此亦應作順後句答，如是乃至對法處如理應說。若成就耳處亦眼處耶，此應作四句答。如是乃至對法處如理應說，如是一一次第漸減，諸處更互如理應說。",
    "分限差別": "　　何等分限差別？謂諸有學，及除最後剎那蘊界處，所餘無學。",
    "初靜慮": "　　初者謂此靜慮。順次數中。最居首故。復次此於九種次第定中。最在前故。靜慮者。謂在此定中。尋伺喜樂。心一境性。總此五支。名初靜慮。如有頌言。\n　　心隨貪慾行　　或復隨瞋恚\n　　而修靜慮者　　諸佛不稱譽\n　　惛睡蓋纏心　　無知修靜慮\n　　身相雖安靜　　諸佛不稱譽\n　　掉悔蓋纏心　　諸根不寂靜\n　　雖勤修靜慮　　諸佛不稱譽\n　　三寶四諦中　　心懷猶豫者\n　　雖勤修靜慮　　諸佛不稱譽\n　　遠離欲及惡　　尋伺皆如理\n　　身柔軟安靜　　受離生喜樂\n　　身如沐浴團　　遍體皆津膩\n　　不強亦不弱　　愛水不能漂\n　　尋伺等五支　　賢聖僊所證\n　　總名初靜慮　　諸佛所稱譽\n　　在此定中。諸心意識。名初靜慮。俱有之心。諸思等思。現前等思。已思當思。造心意業。名初靜慮。俱有意業。諸心勝解。已勝解。當勝解。名初靜慮。俱有勝解。在此定中。若受若想。若欲若作意。若念若定。若慧等名。初靜慮俱有諸法。如是諸法。亦得名初靜慮。",
    "別別引門": "　　別別引門者，謂若處顯示先標經一句，後以無量義門廣釋。如經言，若比丘成就六法，尚能口風吹碎高廣大雪山王，況無明死屍，何等為六？若諸比丘心生善巧乃至方便善巧，云何比丘心生善巧？所謂比丘離欲惡不善法，乃至第四靜慮具足住，如是比丘心生善巧。云何比丘心住善巧？所謂比丘善修習故，所有順退分靜慮轉為順住分，如是比丘心住善巧。云何比丘心起善巧？所謂比丘善修習故，所有順住分靜慮轉為順勝進分，如是比丘心起善巧。云何比丘生長善巧？所謂比丘未生善法方便令生，乃至廣說二正斷，如是比丘生長善巧。云何比丘損減善巧？所謂比丘已生惡法方便令斷，乃至廣說二正斷，如是比丘損減善巧。云何比丘方便善巧？所謂比丘欲三摩地，斷行成就修如意足，乃至廣說四如意足，如是比丘方便善巧。",
    "別解脫律儀所攝業": "　　別解脫律儀所攝業者，即是七眾所受律儀，謂比丘律儀比丘尼律儀，式叉摩那律儀，沙彌律儀，沙彌尼律儀，鄔波索迦律儀，鄔波斯迦律儀，及近住律儀。依止何等補特伽羅建立出家律儀，依能修行遠離惡行遠離欲行，由比丘等出家五眾，乃能盡壽遠離殺生等惡行，及能遠離非梵行故。依止何等補特伽羅建立鄔波索迦律儀鄔波斯迦律儀，依能盡壽遠離惡行不遠離欲行，由彼二眾建立盡壽離欲邪行，非離非梵行故。依止何等補特伽羅建立近住律儀，依止不能遠離惡行，及不遠離欲行，是故為彼但制日夜近住律儀，為令漸漸俱修學故。問若唯修學鄔波索迦一分學處，為說成就鄔波索迦律儀，為說不成就耶？答應說成就而名犯戒。問扇搋半擇迦等為遮彼受鄔波索迦律儀不耶？答不遮彼受鄔波索迦律儀，然遮彼鄔波索迦性，不堪親近承事比丘比丘尼等二出家眾故，如扇搋半擇迦，不堪親近承事比丘比丘尼等二出家眾故，遮彼鄔波索迦性，二形亦爾。男女煩惱恒俱現行，不堪親近承事二眾故不別說，又半擇迦有五種，謂生便半擇迦，嫉妒半擇迦，半月半擇迦，灌灑半擇迦，除去半擇迦。",
    "別離相": "　　何等別離相？謂於諸行失增上力，或他所攝執為己有。",
    "剎那相": "　　何等剎那相？謂諸行剎那後必不住故。",
    "力": "　　力者，謂如來十力，一處非處智力，二自業智力，三靜慮解脫三摩地三摩鉢底智力，四根上下智力，五種種勝解智力，六種種界智力，七遍趣行智力，八宿住隨念智力，九死生智力，十漏盡智力。\n　　力作何業？謂為除捨無因惡因論不作而得論，無倒宣說增上生道，悟入一切有情心行正說法器，意樂隨眠境界資糧當能出離，隨其所應宣說決定勝道降伏諸魔，善能記別一切問論。此中顯初二力能說增上生道，餘八力能說決定勝道。如是二種具足顯示諸佛所作，所以者何？世尊由處非處智力折伏一切世間無因論者惡因論者，宣說無倒增上生道，諸外道等於增上生或謂無因或謂自性，自在等為因故，名無因惡因論。由自業智力折伏一切世間不作而得論者，無倒宣說善趣正道，諸外道等謂不作業自然得報故，名不作而得論。由靜慮解脫等持等至智力，悟入一切有情心行，心所修行故名心行。由根上下智力，悟入一切正說法器，以信等根若善成熟能為法器故。由種種勝解智力，悟入一切勝劣意樂。由種種界智力，悟入一切可破隨眠諸煩惱性。由遍趣行智力，悟入一切大小乘教法所攝境界。由宿住隨念智力，悟入一切資糧前生所集聖道因緣，是名資糧。由死生智力，悟入一切當來功能性。由漏盡智力，悟入一切三界出離，由如是悟入已隨其所應宣說解脫出世聖道。此十名力者，善能降伏諸魔故，善能記別一切問論故。降伏諸魔者，由此十力能降伏蘊魔煩惱魔天魔死魔，為最勝故，雖斷所知障亦不能為礙故名最勝，記別一切問論者，謂於處非處乃至漏盡一切處，所有問論記別無滯故。",
    "力無力門": "　　力無力門者，謂若處顯示諸一一句皆有功能，若不說一句義即不了，如緣起經說，此有故彼有，此生故彼生，所謂無明緣行等，如是諸句一一皆有功能，如前緣起相中說。",
    "功德": "　　功德者，謂依五果無量無邊稱讚勝利，皆名功德，謂能永斷自所對治，是諸波羅蜜多離繫果，於現法中由此施等攝受自他，是士用果於當來世後後增勝展轉生起，是等流果，大菩提是增上果，感大財富往生善趣，無怨無壞多諸喜樂，有情中尊身無損害，廣大宗族隨其次第，是施等波羅蜜多異熟果。更互決擇者略有三種，一方便、二差別、三差別顯示。方便者，謂施方便中一切可得，如捨內外一切身財，是施方便，此方便中若捨一切，是施波羅蜜多。即於此中若慈悲心，遮防一切損害逼迫惱亂他性，是戒波羅蜜多。即於此中忍受遮礙損害疲倦，是忍波羅蜜多。即於此中數數發起勇勵施心，是精進波羅蜜多。即於此中其心純善，繫心一境不外流散，是靜慮波羅蜜多。即於此中善取施行如實因果不取異見，是慧波羅蜜多。如是乃至慧波羅蜜多方便中，隨其所應當善建立，由無畏施一切處有施故。",
    "功德圓滿差別": "　　功德圓滿差別者，謂力無所畏不共佛法等無邊功德永成滿故。",
    "加行善": "　　何等加行善？謂依止親近善丈夫故。聽聞正法如理作意，修習淨善法隨法行。",
    "加行無記": "　　何等加行無記？謂非染非善心者。所有威儀路工巧處法。",
    "加行道": "　　云何加行道？謂由此道能捨煩惱，是名修道中加行道。",
    "劣界": "　　謂不善有覆無記法。是名劣界。",
    "助伴": "　　助伴者，謂諸法共有而生，必無缺減，如四大種及所造色隨其所應，非一切聚定有四大及色等所造，若於是處有爾所量，此必俱生互不相離。",
    "勝生差別": "　　勝生差別者，謂如世間腹所孕子繼父種族令不斷絕，如是菩薩紹隆佛種令不斷絕，是佛真子相故。",
    "勝義": "　　勝義者，謂以聖慧永拔種子所得滅。",
    "勝義善": "　　何等勝義善？謂真如。",
    "勝義攝": "　　何等勝義攝？謂蘊界處真如所攝，於攝善巧得何勝利，得於所緣略集勝利，隨彼彼境略聚其心，如是如是善根增勝。",
    "勝義有": "　　云何勝義有？幾是勝義有？為何義故觀勝義有耶？謂清淨所緣是勝義有義，一切皆是勝義有，為捨執著清淨我相故，觀察勝義有，清淨所緣者，為得清淨緣此境界，是最勝智所行義故，一切皆是勝義有者，以一切法不離真如故，諸法無我性是名真如。彼無我性真實有故。",
    "勝義無記": "　　何等勝義無記？謂虛空非擇滅。",
    "勝處": "　　勝處者，謂八勝處，廣說如經，前四勝處由二解脫所建立後四勝處由一解脫所建立，從彼所流故，所以者何？謂內有色想觀外色少，若好若惡若劣若勝，於彼諸色勝知勝見得如實想，是初勝處。內有色想觀外色多若好若惡，廣說乃至得如實想，是第二勝處。此二勝處從有色觀諸色解脫所出，內無色想觀外色少，廣說乃至得如實想，是第三勝處。內無色想觀外色多，廣說乃至得如實想，是第四勝處。此二勝處從內無色想觀外諸色解脫所出，是故前四勝處。由二解脫所建立，內無色想觀外諸色，若青青顯青現青光，猶如烏莫迦花，或如婆羅痆斯深染青衣，若青青顯青現青光，如是內無色想觀外諸色，若青乃至青光亦爾，於彼諸色勝知勝見得如實想，是第五勝處。內無色想觀外諸色，若黃乃至黃光，猶如羯尼迦花，或如婆羅痆斯深染黃衣，若黃廣說乃至得如實想，是第六勝處。內無色想觀外諸色，若赤乃至赤光，猶如般豆時縛迦花，或如婆羅痆斯深染赤衣，若赤廣說乃至得如實想，是第七勝處。內無色想觀外諸色，若白白顯白現白光，猶如烏沙斯星色，或如婆羅痆斯極鮮白衣若白白顯白現白光，如是內無色想觀外諸色，若白白顯白現白光亦爾，於彼諸色勝知勝見得如實想，是第八勝處。如是四勝處從淨解脫身，作證具足住所出，此中解脫是意解所緣，勝處是勝伏所緣，少多等境隨意自在，或令隱沒故或隨欲轉故少色者，有情數色。其量小故多色者，非有情數色，舍林地山等其量大故。好色惡色者，淨不淨顯色所攝。劣色勝色者，若人若天隨其次第，於彼諸色勝者自在轉故，知者由奢摩他道故，見者由毘鉢舍那道故，得如實想者謂於已勝未勝中得無增上慢想故，若青者是總句青顯者是俱生青，青現者是和合青。青光者，謂彼二所放鮮淨光青，如青黃赤白廣說亦爾，於一處說二譬喻者為顯俱生和合二顯色故，謂若青者總舉花衣二青，青顯者依花青說，以俱生故。青現者依衣青說，以和合方成故，青光者依二種說，由彼二種俱有鮮淨光故，如是二譬喻中若青青顯等，總句釋句如相應知，如青黃等亦爾，餘如解脫中說。何等為餘？謂內有色想觀外色等，如有色觀諸色等隨相應釋，已說勝處勝所緣境界。\n　　勝處作何業？謂能令前三解脫所緣境界自在而轉，由勝伏所緣故。",
    "勝解": "　　勝解者，於決定事隨所決定印持為體，不可引轉為業，隨所決定印持者，謂是事必爾非餘決了勝解，由勝解故所有勝緣不能引轉。",
    "勝解行菩薩": "　　勝解行菩薩者，謂住勝解行地中，成就菩薩下中上忍，由其安住菩薩種姓，始從初發大菩提願，乃至未入極歡喜地，未得出世真實內證故，名勝解行菩薩。",
    "勝解行菩薩補特伽羅": "　　何等勝解行菩薩補特伽羅？謂住勝解行地中成就菩薩下中上忍。",
    "勝進道": "　　云何勝進道？謂為斷餘品煩惱，所有加行無間解脫道，是名勝進道。又復棄捨斷煩惱加行或勤方便思惟諸法，或勤方便安住諸法，或進修餘三摩鉢底諸所有道名勝進道，又為引發勝品功德，或復安住諸所有道，名勝進道。",
    "勢速": "　　勢速者，謂於因果迅疾流轉，假立勢速。",
    "勤": "　　勤者，被甲方便無下無退，無足心勇為體成滿善品為業，謂如經說，有勢有勤有勇堅猛不捨善軛，如其次第應配釋被甲心勇等諸句。滿善品者，謂能圓滿隨初所入根本靜慮。成善品者，謂即於此極善修治。",
    "勤三摩地勝行成就神足者": "　　云何勤？云何三摩地？云何勝？云何勝行？而名勤三摩地勝行成就神足耶。此中勤者。謂依出家遠離所生善法。所起勤精進。勇健勢猛。熾盛難制。勵意不息。是名勤。三摩地者。謂勤增上所起。心住等住。近住安住。不散不亂。攝止等持。心一境性。是名三摩地。勝者。謂勤增上所起八支聖道。是名勝。勝行者。謂有苾芻。依過去勤得三摩地。是謂勤三摩地。彼成就勤三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信乃至。若捨。是名勝行。即此勝行。及前所說勤三摩地。總名勤三摩地勝行成就神足。\n　　復有苾芻。於諸善法住下羸劣弱極弱勤。彼作是念。我今不應於諸善法住下羸劣弱極弱勤。然我理應於諸善法。安住不下不羸不劣不弱不極弱勤。彼由此勤增上力故。得三摩地。是謂勤三摩地。彼成就勤三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說勤三摩地。總名勤三摩地勝行成就神足。\n　　復有苾芻。生起惡勤。彼作是念。我今不應生起惡勤。然我理應斷除惡勤修集善勤。彼由此勤增上力故。得三摩地。是謂勤三摩地。彼成就勤三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說勤三摩地。總名勤三摩地勝行成就神足。\n　　復有苾芻。生起貪瞋癡俱行惡勤。彼作是念。我今不應生起貪瞋癡俱行惡勤。然我理應斷除貪瞋癡俱行惡勤。修集無貪無嗔無癡俱行善勤。彼由此勤增上力故。得三摩地。是謂勤三摩地。彼成就勤三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說勤三摩地。總名勤三摩地勝行成就神足。\n　　復有苾芻。生起不離貪瞋癡惡勤。彼作是念。我今不應生起不離貪瞋癡惡勤。然我理應斷除不離貪瞋癡惡勤。修集離貪瞋癡善勤。彼由此勤增上力故。得三摩地。是謂勤三摩地。彼成就勤三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說勤三摩地。總名勤三摩地勝行成就。神足。\n　　復有苾芻。於諸善法安住不下乃至不極弱勤。彼作是念。我於善法。安住不下乃至不極弱勤甚為應理。彼由此勤增上力故。得三摩地。是謂勤三摩地。彼成就勤三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法。堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說勤三摩地。總名勤三摩地勝行成就神足。\n　　復有苾芻。生起善勤。彼作是念。我今生起如是善勤。甚為應理。彼由此勤增上力故。得三摩地。是謂勤三摩地。彼成就勤三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說勤三摩地。總名勤三摩地勝行成就神足。\n　　復有苾芻。生起無貪無嗔無癡俱行善勤。彼作是念。我今生起無貪無嗔無癡俱行善勤。甚為應理。彼由此勤增上力故。得三摩地。是謂勤三摩地。彼成就勤三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說勤三摩地。總名勤三摩地勝行成就神足。\n　　復有苾芻。生起離貪瞋癡善勤。彼作是念。我今生起離貪瞋癡善勤。甚為應理。彼由此勤增上力故。得三摩地。是謂勤三摩地。彼成就勤三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲。若勤若信乃至若捨。是名勝行。即此勝行。及前所說勤三摩地。總名勤三摩地勝行成就神足。一切勤三摩地。皆從勤起。是勤所集。是勤種類。是勤所生。故名勤三摩地勝行成就神足。",
    "匱": "　　匱有三種，謂貪、瞋、癡。由依止貪瞋癡故，於有及資生具恒起追求無有厭足，常為貧乏眾苦所惱故，故名匱，以貪瞋癡能令身心恒乏短故。",
    "十不善業道異熟果": "　　十不善業道異熟果者，於三惡趣中隨下中上品，受傍生餓鬼那落迦異熟，等流果者，各隨其相於人趣中感得自身眾具衰損增上果者，各隨其相感得所有外事衰損，廣說如經。",
    "十二處": "　　一切法者。何謂一切？世尊告曰。一切法者。謂十二處。何等十二？謂眼處。色處。耳處。聲處。鼻處。香處。舌處。味處。身處。觸處。意處。法處。是謂十二。若有說言。此非一切。言一切者。更別有法。彼但有言。而無實事。若還詰問。便不能了。彼後審思。自生迷悶。以一切法。非彼境故。",
    "十二處法": "　　復次若欲自求利益安樂，於諸論軌應善通達，不應與他而興諍論，如薄伽梵於大乘阿毘達磨經中說如是言。若諸菩薩欲勤精進修諸善品，欲行貞實法隨法行，欲善攝益一切有情，欲得速證阿耨多羅三藐三菩提者，當正觀察十二處法，不應與他共興諍論。何等十二？一者宣說證無上義微妙法時，其信解者甚為難得。二者作受教心而請問者甚為難得。三者時眾賢善觀察德失甚為難得。四者凡所興論能離六失甚為難得。何等為六？謂執著邪宗失、矯亂語失、所作語言不應時失、言退屈失、麤惡語失、心恚怒失，五者凡興論時不懷獷毒甚為難得。六者凡興論時善護他心甚為難得。七者凡興論時善護定心甚為難得。八者凡興論時欲令己劣他得勝心甚為難得。九者己劣他勝心不煩惱甚為難得。十者心已煩惱得安隱住甚為難得。十一者既不安住常修善法甚為難得。十二者於諸善法既不恒修。心未得定能速得定，心已得定能速解脫，甚為難得。於此經中已說欲勤精進修諸善品，何故復言欲行貞實法隨法行？為顯意樂清淨故，所以者何？不為利養恭敬等事修聞思等諸善品故。欲善攝益有情者，為別聲聞等行，由諸菩薩以利他行為勝故，如是菩薩自利利他行具足已，速證無上正等菩提。又此經中諸句義意，謂興論時大乘法性無上甚深，若無諍心解尚為難，況為諍競，凡興諍論雖起請問，無心求解但求過失。又傍證者心不賢直，不善宗門樂著僻執，凡所言論多具六失，所以者何？凡興論時或有私心執著邪宗，或矯方便求他誤失，或不待言竟便興亂語，或敵論者言稱正理反相誹撥，或作麤言，惱敵論者及時眾心，或復於彼自懷恚怒，多具如是六種過失。又興論時身心寂靜甚為難得，不寂靜故二事難成，謂善護他心善護自心，由此令他心得淨信，於解脫處正勤方便令自心定。又興論時多起此心，云何令我得勝？他墮負處，若不遂心，即懷熱惱，由有此故，不安樂住，由此不能無間修善，是故於彼增上證法有未得退。",
    "十善業道異熟果": "　　十善業道異熟果者，於人天趣中受人天異熟，等流果者，即於彼處各隨其相，感得自身眾具興盛，增上果者，即於彼處各隨其相，感得所有外事興盛。",
    "十四門辯釋決擇": "　　又十四門辯釋決擇，何等十四？謂攝釋門、攝事門、總別分門、後後開引門、遮止門、轉變字門、壞不壞門、安立數取趣門、安立差別門、理趣門、遍知等門、力無力門、別別引門、引發門。",
    "卑慢": "　　謂於多勝謂己少劣。由此起慢。乃至心自取總名卑慢。",
    "取": "　　取有四種，謂欲取、見取、戒禁取、我語取。執取諍根執取後有是取義，所以者何？由貪著欲繫縛耽染為因，諸在家者更相鬥諍，此諍根本是第一取，由貪著見繫縛耽染為因，諸出家者更相鬥諍，此諍根本是後三取，六十二見趣是見取，各別禁戒多分苦行是戒禁取，彼所依止薩迦耶見是我語取，由見取戒禁取諸外道輩更相諍論，以於是處見不一故，由我語取諸外道輩互無諍論，於我有性皆同見故。然由此取諸外道等與正法者互有諍論，由彼不信有無我故，如是執著諍論根本，復能引取後有苦異熟故名為取。",
    "取結": "　　取結者，謂見取戒禁取，取結所繫故，於邪出離方便妄計執著，棄捨八聖支道，妄執薩迦耶見等，及彼為先若戒若禁為清淨道，以妄執著邪出離方便故，廣行不善不行諸善，由此能招未來世苦與苦相應。",
    "取結者": "　　取結者，謂見取戒禁取，取結所繫故，於邪出離方便妄計執著，以妄執著邪出離方便故，廣行不善不行諸善，由此能招未來世苦，與苦相應。",
    "取緣有": "　　謂取為緣施設多有。謂佛或說三界五蘊名有。或說能感後有業名有。或說生分五蘊名有。云何說三界五蘊名有？如說三有。謂欲有色有無色有。云何說能感後有業名有？如世尊告阿難陀言。若業能感後有名有。云何說生分五蘊名有？如世尊告頗勒窶那。識為食故。後有生起。復次大因緣經中。尊者慶喜問佛。諸有為有緣不。佛言有緣。此緣謂取。廣說乃至。若全無取為可施設有諸有不。不也世尊。是故慶喜。諸有皆以取為其緣。是名取緣有。如是諸有。取為緣。取為依。取為建立。故起等起生等生。聚集出現。故名取緣有。",
    "取蘊": "　　問云何名取蘊？答以取合故名為取蘊取者，謂諸蘊中所有欲貪。何故欲貪說名為取？謂於未來現在諸蘊能引不捨故，希求未來染著現在欲貪名取欲者希求相。貪者染著相，由欲希求未來自體為方便故，引取當蘊令起現前，由貪染著現在自體為方便故，執取現蘊令不捨離，是故此二說名為取。問何故界處說有取法？答應如蘊說，當知界處與取合故名有取法。",
    "受": "　　受有二種業，一令諸有情於所受用生果流轉，二與愛作緣。",
    "受用無記": "　　何等受用無記？謂如有一以無簡擇無染污心受用資具。",
    "受界": "　　謂六受身。即眼觸所生受。乃至意觸所生受。是名受界。",
    "受緣愛": "　　謂眼及色為緣生眼識。三和合故生觸。觸為緣故生受。受為緣故生愛。乃至意及法為緣生意識。三和合故生觸。觸為緣故生受。受為緣生愛。是名受緣愛。\n　　復次眼味受為緣故。數復於眼隨順而住。由隨順故。數復於眼。起貪等貪執藏防護堅著愛染。乃至意味受為緣故。數復於意。隨順而住。由隨順故。數復於意。起貪等貪。執藏防護堅著愛染。是名受緣愛。\n　　復次取蘊經中。佛作是說。苾芻當知。我於色味。已審尋思。諸有於色。或已起味。或今起味。我以正慧。審見審知。彼以色味受為緣故。數復於色。隨順而住。由隨順故。數復於色。起貪等貪執藏防護堅著愛染。乃至我於識味。以審尋思。諸有於識。或已起味。或今起味。我以正慧。審見審知。彼以識味。受為緣故。數復於識。隨順而住。由隨順故。數復於識。起貪等貪執藏防護堅著愛染。是名受緣愛。\n　　復次取蘊經中。世尊又說。苾芻當知。若諸色中。都無味者。有情不應於色起染。以諸色中非都無味。是故有情於色起染。彼以色味受為緣故。數復於色。隨順而住。由隨順故。數復於色。起貪等貪執藏防護堅著愛染。乃至若諸識中。都無味者。有情不應於識起染。以諸識中非都無味。是故有情。於識起染。彼以識味受為緣故。數復於識。隨順而住。由隨順故。起貪等貪執藏防護堅著愛染。是名受緣愛。\n　　復次六處經中。佛作是說。苾芻當知。我於眼味。已審尋思。諸有於眼。或已起味。或今起味。我以正慧。審見審知。彼以眼味受為緣故。數復於眼。隨順而住。由隨順故。數復於眼。起貪等貪執藏防護堅著愛染。乃至我。於意味。已審尋思。諸有於意。或已起味。或今起味。我以正慧。審見審知。彼以意味。受為緣故。數復於意。隨順而住。由隨順故。數復於意。起貪等貪執藏防護堅著愛染。是名受緣愛。\n　　復次六處經中。世尊又說。苾芻當知。若諸眼中。都無味者。有情不應於眼起染。以諸眼中非都無味。是故有情。於眼起染。彼以眼味受為緣故。數復於眼。隨順而住。由隨順故。數復於眼。起貪等貪執藏防護堅著愛染。乃至若諸意中。都無味者。有情不應於意起染。以諸意中非都無味。是故有情。於意起味。彼以意味受為緣故。數復於意。隨順而住。由隨順故。數復於意。起貪等貪執藏防護堅著愛染。是名受緣愛。\n　　復次六處經中。世尊復說。苾芻當知。我於色味。已審尋思。諸有於色。或已起味。或今起味。我以正慧審見審知。彼以色味受為緣故。數復於色。隨順而住。由隨順故。數復於色。起貪等貪執藏防護堅著愛染。乃至我於法味。已審尋思。諸有於法。或已起味。或今起味。我以正慧。審見審知。彼以法味受為緣故。數復於法。隨順而住。由隨順故。數復於法。起貪等貪執藏防護堅著愛染。是名受緣愛。\n　　復次六處經中。世尊又說。苾芻當知。若諸色中。都無味者。有情不應於色起染。以諸色中非都無味。是故有情。於色起染。彼以色味受為緣故。數復於色。隨順而住。由隨順故。數復於色。起貪等貪執藏防護堅著愛染。乃至若諸法中。都無味者。有情不應於法起染。以諸法中非都無味。是故有情。於法起染。彼以法味受為緣故。數復於法。隨順而住。由隨順故。數復於法起貪等貪執藏防護堅著愛染。是名受緣愛。\n　　復次佛為大名離呫毗說。大名當知。若色一向是苦非樂。非樂所隨。非樂喜受之所纏執。應無有情為求樂故。於諸色中。起貪起染。煩惱纏縛。大名以色。非一向苦。彼亦是樂。是樂所隨。是樂喜受之所纏執。故有有情。為求樂故。於諸色中。起貪起染。煩惱纏縛。彼以色味受為緣故。數復於色。隨順而住。由隨順故。數復於色。起貪等貪執藏防護堅著愛染。乃至若識一向是苦非樂。非樂所隨。非樂喜受之所纏執。應無有情為求樂故。於諸色中。起貪起染。煩惱纏縛。大名以識。非一向苦。彼亦是樂。是樂所隨。是樂喜受之所纏執。故有有情。為求樂故。於諸識中。起貪起染。煩惱纏縛。彼以識味受為緣故。數復於識。隨順而住。由隨順故。數復於識。起貪等貪執藏防護堅著愛染。是名受緣愛。\n　　復次滿月經中。佛作是說。苾芻當知。色為緣故。起樂生喜。是名色味。彼以色味受為緣故。數復於色。隨順而住。由隨順故。數復於色。起貪等貪執藏防護堅著愛染。乃至識為緣故。起樂生喜。是名識味。彼以識味受為緣故。數復於識。隨順而住。由隨順故。起貪等貪執藏防護堅著愛染。是名受緣愛。\n　　復次大因緣經中。佛告慶喜。愛為緣故求。求為緣故得。得為緣故集。集為緣故著。著為緣故貪。貪為緣故慳。慳為緣故攝受。攝受為緣故防護。因防護故。執持刀仗。斗訟諍競。諂詐虛誑。生無量種惡不善法。佛告慶喜。執持刀仗。斗訟諍競。諂詐虛誑。生無量種惡不善法。皆因防護。防護為緣。有如是事。防護若無。有此事不。阿難陀曰。不也世尊。是故執持刀仗等事。防護為由緒。防護為因。防護為集。防護為緣。而得生起。如是防護。因於攝受。攝受為緣。而有防護。攝受若無。有防護不。不也世尊。是故防護攝受為由緒。攝受為因。攝受為集。攝受為緣。而得生起。廣說乃至。如是諸求。皆因於愛。愛為緣故。而有諸求。此愛若無。為有求不。不也世尊。是故諸求。愛為由緒。愛為其因。愛為其集。愛為其緣。而得生起。慶喜當知。愛有二種。一者欲愛。二者有愛。此二種愛。依受而有。受若無者。二愛亦無是名受緣愛。如是諸愛。受為緣。受為依。受為建立。故起等起生等生。聚集出現。故名受緣愛。",
    "受蘊": "　　問受蘊何相？答領納相是受相，謂由受故領納種種淨不淨業所得異熟。若清淨業受樂異熟，不清淨業受苦異熟淨不淨業受不苦不樂異熟。所以者何？由淨不淨業感得異熟阿賴耶識，恒與捨受相應，唯此捨受是實異熟體，苦樂兩受從異熟生故，假說名異熟。",
    "句身": "　　句身者，謂於諸法差別增言，假立句身。差別增言者，謂說諸行無常一切有情當死等義。文身者，謂於彼二所依諸字，假立文身。彼二所依諸字者謂，自性差別增言所依諸字如𧙃壹鄔等。又自性差別及此二言總攝一切，如是一切由此三種之所詮表，是故建立此三為名句文身。此言文者，能彰彼二故，此又名顯能顯義故，此復名字無異轉故，所以者何？如眼名眼異，此名外更有照了導等異名改轉，由彼同顯此想故，非𧙃壹等字離𧙃壹等差別外更有差別能顯此，字故無異轉說名，為字無異，轉者謂不流變。",
    "合": "　　合者，為引所餘此種類義，令就此法正說理趣，謂由三分成立如前所成義已，復為成立餘此種類所成義故，遂引彼義令就此法，正說道理是名合。",
    "同分彼同分": "　　云何同分彼同分？幾是同分彼同分？為何義故觀同分彼同分耶？謂不離識彼相似根於境相續生故，離識自相似相續生故，是同分彼同分義。初是同分，諸根與識俱識相似，於諸境界相續生故，由根與識相似轉義，說名同分。第二是彼同分，諸根離識自類相似，相續生故，由根不與識合，唯自體相似相續生，根相相似義，說名彼同分。色蘊一分，眼等五有色界處一分，是同分彼同分。為捨執著與識相應不相應我故，觀察同分彼同分。",
    "同檢問等": "　　謂或為證。或究其身。眾集量宜。同檢問曰。咄哉男子。今對眾前。應以誠言具款情實。若於是事。見聞覺知。宜當宣說施設摽示。若於是事。無見聞等。勿當宣說施設摽示。如是名為同檢問等。",
    "同行相應": "　　同行相應者，謂心心法於一所緣展轉同行，此同行相應復有多義，謂他性相應非己性，如心不與餘心相應，受不與餘受相應，如是等。又不相違相應非相違，如貪瞋不相應，善不善不相應，如是等。又同時相應非異時，如現在去來不相應。又同分界地相應非異分界地，如欲界色無色界不相應，初靜慮第二靜慮不相應，如是等。又有一切遍行同行相應，謂受想思觸作意及識，由此六法於一切位決定相應，隨無一法餘亦無故。又有染污遍行同行相應，謂於染污意四種煩惱，由此四法於一切時恒相應故。又有非一切時同行相應，謂依止心或時起信等善法，或時起貪等煩惱隨煩惱法。又有分位同行相應，謂與樂受諸相應法，與苦受不苦不樂受諸相應法。又有無間同行相應，謂在有心位又有有間同行相應，謂無心定所間。又有外門同行相應，謂多分欲界繫心心法。又有內門同行相應，謂諸定地所有心心法。又有曾習同行相應，謂諸異生所有心心法，及有學無學者一分心心法，一分言謂攝一向世間善不善無記法，如其所應。又有未曾習同行相應，謂出世間諸心心法，及初後時出世後所得諸心心法，初後時言為顯非先種類初念已去及第二念等已去出世心心法是未曾習性。\n　　問於相應善巧得何勝利？答能善了悟，唯依止心，有受想等染淨諸法相應不相應義，由此了悟，即能捨離計我能受能想能思能念染淨執著，又能善巧速入無我。",
    "名想建立": "　　名想建立者，謂於四靜慮中三摩地差別無量名字不可算數不可思議，何以故？於初靜慮所攝定中諸佛世尊及得究竟大威德菩薩摩訶薩所入三摩地，彼三摩地一切聲聞及獨覺等尚不了其名，豈能知數。況復證入如般若波羅蜜多經中說，三摩地其數過百，如是於餘大乘經中說，三摩地其數無量，如於初靜慮所攝定，於餘靜慮無色所攝定亦爾，如是所說皆依靜慮波羅蜜多。",
    "名色": "　　名色有二種業，一攝諸有情自體，二與六處作緣。",
    "名色緣六處": "　　謂有一類。為寒所逼。希求於暖。得好暖故。便起身中暖俱大種。此中若暖若暖俱大種名為色。即彼所生受想行識。名為名。由此名色。眼耳鼻舌身及意根。皆得增長。是名名色緣六處。為熱所逼。希求於冷。應知亦爾。\n　　復有一類。為饑所逼。希求於食。得好食故。便起身中食俱大種。此中若食若食俱大種。名為色。即彼所生受想行識。名為名。由此名色。六根增長。是名名色緣六處。復有一類。為渴所逼。希求於飲。得好飲故。便起身中飲俱大種。此中若飲若飲俱大種。名為色。即彼所生受想行識。名為名。由此名色。六根增長。是名名色緣六處。\n　　復有一類。勞倦所逼。希求止息。按摩睡眠。由遂意故。便起身中彼俱大種。此中若按摩等。若彼俱大種。名為色。即彼所生受想行識。名為名。由此名色。六根增上。是名名色緣六處。\n　　復有一類。於盛熱時。熱渴所逼。入淸涼池。恣意飲浴。便起身中彼俱大種。此中若淸冷水。若彼俱大種。名為色。即彼所生受想行識。名為名。由此名色。六根增長。是名名色緣六處。\n　　復次教誨頗勒窶那經中。佛作是說。頗勒窶那。識為食故。後有生起。此識云何？謂健達縛。廣說乃至。與羯剌藍自體和合。此羯剌藍自體和合。名為色。即彼所生受想行識。名為名。爾時非理作意俱生名色為緣。母胎藏中。六根生起。是名名色緣六處。\n　　復次教誨莎底經中。佛作是說。三事和合。入母胎藏。廣說乃至。此識無間。入母胎藏。此所託胎。名為色。即彼所生受想行識。名為名。爾時非理作意俱生名色為緣。母胎藏中。六根生起。是名名色緣六處。\n　　復有一類。由貪瞋癡纏縛心故。造身語意三種惡行。此中身語惡行。名為色。意惡行。名為名由此惡行。名色為緣。身壞命終。墮於地獄。六根生起。是名名色緣六處。如說地獄。傍生鬼界。應知亦爾。\n　　復有一類。於人趣樂。繫心希求。因此希求。造能感人趣身語意妙行。此中身語妙行。名為色。意妙行。名為名。由此妙行名色為緣。身壞命終。生於人趣。六根生起。是名名色緣六處。如說人趣。四大王眾天。乃至他化自在天。應知亦爾。\n　　復有一類。於梵眾天。繫心希求。因此希求。勤修加行。離欲惡不善法。乃至初靜慮具足住。於此定中。諸身律儀。語律儀。命淸淨。名為色。即彼所生受想行識。名為名。由此為緣。身壞命終。生梵眾天眾同分中。六根生起。是名名色緣六處。如說梵眾天。梵輔天。乃至非想非非想處天。隨其所應。當知亦爾。是名名色緣六處。如是六處。名色為緣。名色為依。名色為建立。故起等起生等生。聚集出現。故名名色緣六處。",
    "名色緣觸": "　　謂眼及色為緣生眼識。三和合故生觸。此中眼及色。名為色。即彼所生受想行識。名為名。如是名色為緣生眼觸。是名名色為緣觸。乃至意及法為緣生意識。三和合故生觸。此中諸意識所了色。名為色。即彼所生受想行識。名為名。如是名色為緣生意觸。是名名色緣觸。\n　　復次教誨頗勒窶那經中。佛作是說。頗勒窶那。識為食故後有生起。此識云何？謂健達縛。廣說乃至。與羯剌藍自體和合。此羯剌藍自體和合。名為色。即彼所生受想行識。名為名。爾時非理作意俱生名色為緣。母胎藏中。諸觸生起。是名名色緣觸。\n　　復次教誨莎底經中。佛作是說。三事和合。入母胎藏。廣說乃至。此識無間。入母胎藏。此所託胎。名為色。即彼所生受想行識名為名。爾時非理作意俱生名色為緣。母胎藏中。諸觸生起。是名名色緣六處。\n　　復有一類。由貪瞋癡纏縛心故。造身語意三種惡行。此中身語惡行。名為色。意惡行。名為名。由此惡行名色為緣。身壞命終。墮於地獄。諸觸生起。是名名色緣觸。如說地獄。傍生鬼界。應知亦爾。\n　　復有一類。於人趣樂。繫心希求。因此希求。造能感人趣身語意妙行。此中身語妙行。名為色。意妙行。名為名。由此妙行名色為緣。身壞命終。生於人趣。諸觸生起。是名名色緣觸。如說人趣。四大王眾天。乃至他化自在天。應知亦爾。\n　　復有一類。於梵眾天。繫心悕求。因此悕求。勤修加行。離欲惡不善法。乃至初靜慮具足住。於此定中。諸身律儀。語律儀。命淸淨。名為色。即彼所生受想行識。名為名。由此為緣。身壞命終。生梵眾天眾同分中。諸觸生起。是名名色緣觸。如說梵眾天梵輔天乃至非想非非想天。隨其所應。當知亦爾。\n　　復次大因緣經中。尊者慶喜問佛。諸觸為有緣不。佛言有緣。此謂名色。廣說乃至。若依止此相。施設名身。此相若無為可施設增語觸不。不也世尊。若依止此相。施設色身。此相若無為可施設有對觸不。不也世尊。若名色身。都無所有為可施設有諸觸不。不也世尊。是故慶喜。諸觸皆以名色為緣。是名名色緣觸。如是諸觸。名色為緣。名色為依。名色為建立。故起等起生等生。聚集出現。故名名色緣觸。",
    "名色緣識": "　　謂眼色為緣生眼識。此中眼及色，名為色。即彼所生受想行識，名為名。於中作意等，能助生眼識，是名名色緣識。乃至意法為緣生意識。此中諸意識所了色，名為色。即彼所生受想行識，名為名。於中作意等能助生意識，是名名色緣識。\n　　復次教誨頗勒窶那經中，佛作是說：頗勒窶那。識為食故。後有生起。此識云何？謂健達縛。廣說乃至。與羯剌藍自體和合。此羯剌藍自體和合，名為色。即彼所生受想行識，名為名。爾時非理作意俱生名色為緣，起俱生識，是名名色緣識。\n　　復次教誨莎底經中，佛作是說：三事和合，入母胎藏。廣說乃至此識無間，入母胎藏。此所託胎名為色。即彼所生受想行識名為名。爾時非理作意俱生名色為緣，起俱生識，是名名色緣識。\n　　復有一類。由貪瞋癡纏縛心故，造身語意三種惡行。此中身語惡行名為色。意惡行名為名。由此惡行名色為緣，身壞命終，墮於地獄。於彼起識，是名名色緣識。如說地獄、傍生、鬼界。應知亦爾。\n　　復有一類。於人趣樂，係心悕求。因此悕求，造能感人趣身語意妙行。此中身語妙行名為色。意妙行名為名。由此妙行名色為緣，身壞命終，生於人趣。於彼起識，是名名色緣識。\n　　有不繫心希求人樂，但由無明蔽動心故，造身語意三種妙行。此中身語妙行名為色。意妙行名為名。由此妙行名色為緣，身壞命終，生於人趣。於彼起識，是名名色緣識。如說人趣、四大王眾天、乃至他化自在天。應知亦爾。\n　　復有一類。於梵眾天，係心希求。因此希求，勤修加行，離欲惡不善法，乃至初靜慮具足住。於此定中，諸身律儀、語律儀，命淸淨，名為色。即彼所生受想行識，名為名。由此為緣，身壞命終，生梵眾天眾同分中。於彼起識，是名名色緣識。如說梵眾天、梵輔天、乃至非想非非想處。隨其所應。當知亦爾。\n　　復次大因緣經中，尊者慶喜問佛「諸識為有緣不？」佛言「有緣。此謂名色。」\n　　佛告慶喜「若無名色，諸識轉不？」阿難陀曰「不也，世尊。」\n　　「若無名色為所依止，後世所受生老死識，為得生不？」「不也，世尊。」\n　　「若諸名色，都無所有為可施設。有諸識不？」「不也，世尊。」\n　　「是故慶喜，諸識皆以名色為緣，是名名色緣識。如是諸識，名色為緣，名色為依，名色為建立，故起等起生等生。聚集出現。故名名色緣識。」",
    "名身": "　　名身者，謂於諸法自性增言，假立名身。自性增言者，謂說天人眼耳等事。",
    "味": "　　味者，四大種所造舌根所取義，謂苦酢甘辛鹹淡。若可意若不可意若俱相違，若俱生若和合若變異，建立此味應如香說。",
    "味處": "　　謂味為舌。已正當嘗。及彼同分。是名味處。又味為舌增上發舌識。已正當了別。及彼同分。是名味處。又味於舌。已正當礙。及彼同分。是名味處。又味為舌。已正當行。及彼同分。是名味處。如是過去未來現在諸所有味。名為味處。亦名所知。乃至所等證。\n　　此復云何？謂四大種所造。根味莖味。枝味葉味。花味果味。食味飲味。及諸酒味。苦味酢味。甘味辛味。醎味淡味。可意味不可意味。順捨處味。及余所有舌根所嘗。舌識所了。所有名號。異語增語。想等想。施設言說。謂名味。名味界。名味處。名彼岸。如是味處。是外所攝。",
    "命根": "　　命根者，謂於眾同分先業所感，住時決定假立壽命。眾同分者，於一生中諸蘊相續，住時決定者，齊爾所時令眾同分常得安住，或經百年或千年等，由業所引功能差別。",
    "和合": "　　和合者，謂於因果眾緣集會，假立和合。因果眾緣集會者，且如識法因果相續，必假眾緣和會，謂根不壞境界現前能，生此識作意正起，如是於餘一切如理應知。",
    "和合作業差別": "　　和合作業差別者，謂化導一一有情作用，皆一切佛增上力故。",
    "和合相應": "　　何等和合相應？謂極微已上，一切有方分色更互和合。",
    "品類建立": "　　品類建立者，於初靜慮定具三品熏修，謂軟中上，如初靜慮餘靜慮及無色三品熏修亦爾，由軟中上品熏修初靜慮故，於初靜慮中還生三異熟，如初靜慮於餘靜慮中若熏修若生果各三品亦爾。諸靜慮中三品熏修生三果者，謂梵眾天梵輔天大梵天，如是等廣說如前，於無色界中無別處所故，不立生果差別，所以者何於無色界無有安堵宮殿等處故，不建立生果差別，然由三品熏修無色定故，彼異熟生時有高有下有劣有勝。彼異熟生時有高有下者，由壽命等有差別故。有劣勝者，染污不染污多分少分有差別故。",
    "善": "　　云何善？幾是善？為何義故觀善耶？謂自性故、相屬故、隨逐故、發起故、第一義故、生得故、方便故、現前供養故、饒益故、引攝故、對治故、寂靜故、等流故，是善義。五蘊十界四處一分是善，十界者，謂七識色聲法界，四處者，謂色聲意法處，為捨執著法合我故，觀察善。自性善者，謂信等十一心所有法。相屬善者，謂彼相應法。隨逐善者，謂即彼諸法習氣。發起善者，謂彼所發身業語業。第一義善者，謂真如。生得善者，謂即彼諸善法，由先串習故感得如是報，由此自性即於是處不由思惟任運樂住。即於是處者，謂於信等處。由此自性不由思惟者，謂無功用不假善友力等。任運樂住者，非唯欲樂，是生得，亦信等俱任運起故。方便善者，謂依止親近善丈夫故，聽聞正法如理作意，修習淨善法隨法行。修習淨善者，謂於正法中一切聞等所生善法。現前供養善者，謂想對如來建立靈廟圖寫尊容，或想對正法書治法藏興供養業。饒益善者，謂以四攝事饒益一切有情。引攝善者，謂以施性福業事及戒性福業事故，引攝生天樂異熟，引攝生富貴家，引攝隨順清淨法，引攝生天樂異熟及生富貴家者，顯得尊貴因，引攝隨順清淨法者，顯得涅槃因。對治善者，謂厭壞對治，斷對治，持對治，遠分對治，伏對治，離繫對治，煩惱障對治，所知障對治，此諸對治後當廣釋。寂靜善者，謂永斷貪欲永斷瞋恚永斷愚癡，永斷一切煩惱，若想受滅，若有餘依涅槃界，若無餘依涅槃界，若無所住涅槃界，如是皆名寂靜善法。等流善者，謂已，得寂靜者，由此增上力故，發起勝品神通等世出世共不共功德。",
    "善不善業": "　　善不善業，於善趣惡趣中感生異熟時，有招引業圓滿業。招引業者，謂由此業能感異熟果。圓滿業者，謂由此業生已領受愛不愛果。或有業由一業力牽得一身，或有業由一業力牽得多身，或有業由多業力牽得一身，或有業由多業力牽得多身，若一有情成就多業。云何次第受異熟果？於彼身中重者先熟，或將死時現在前者，或先所數習者，或最初所行者，彼異熟先熟。",
    "善士": "　　云何為善士？謂佛及弟子。又諸所有補特伽羅。具戒具德。離諸瑕穢。成調善法。堪紹師位。成就勝德。知羞悔過。善守好學。具知具見。樂思擇愛稱量。喜觀察性。聰敏具覺。慧息追求有慧類。離貪趣貪滅。離嗔趣嗔滅。離癡趣癡滅。調順趣調順。寂靜趣寂靜。解脫趣解脫。越度趣越度。妙覺趣妙覺。涅槃趣涅槃。樂調順諦。離憍放逸。好慧忍辱柔和。升直道如見。專自調伏。專自寂靜。專自涅槃。為才支身。游諸國邑王都聚落。求衣食等具。質直具。調順具足。質直及調順具。忍辱具。柔和具足。忍辱及柔和具。供養具。恭敬具足。供養及恭敬具。正行具。守根具足。正行及守根具。軌範具。所行具足。軌範及所行具。信尸羅。及聞捨慧。自具淨信。亦能勸勵安立有情。同具淨信。自具尸羅。及聞捨慧。亦能勸勵安立有情。同具尸羅。及聞捨慧。是名善士。何故名善士。以所說善士。離非善法。成就善法。具足成就四念住四正勝四神足五根。五力七等覺支八聖道支。故名善士。",
    "善巧": "　　復次云何於諸法中法善巧？云何義善巧？云何文善巧？云何詞善巧？云何前際後際密意善巧？如是五問隨順經中所說諸句，如尊者阿難告舍利子，長老當知，若諸比丘成就五法，即能速受多受善受受已不失，於此經中即由五法如其所應成速受等四種句義。云何法善巧？謂多聞故，於法善巧便能速受，由具多聞者多分能速受文句差別故。云何義善巧？謂於阿毘達磨毘奈耶中善知其相故，於義善巧便能多受，若善了知阿毘達磨等相，乃於蘊界處等所說事中，便能攝集眾多文故。云何文善巧？謂善知訓釋文詞故。云何詞善巧？謂能善知我我所等世俗言詞，不深執著隨順說故，若於文詞俱得善巧，便能妙善領受所說，善知訓釋文詞故，善知我我所等世俗言詞，不深執著隨順說故，即能無倒領受文義。云何前際後際密意善巧？謂能善知於前際領受於後際出離故，若於前際後際密意善巧，便能受已而不失壞，依止前際所受法，後能證得出離故，由善了知如來密意，便能證取聖教堅實。",
    "善法真如": "　　何等善法真如？謂無我性，亦名空性無相實際勝義法界",
    "善界": "　　謂善身語業。心心所法。不相應行。及擇滅。是名善界。",
    "善逝": "　　言善逝者。謂佛成就極樂安隱無艱無難往趣妙法。故名善逝。又貪瞋癡。及余煩惱所生。種種難往趣法。如來於彼。永斷徧知。如多羅樹永斷根頂無復遺余。皆得當來永不生法。故名善逝。又如過去諸佛世尊。皆乘如實。無虛妄道。趣出世間。殊勝功德。一至永至。無復退還今佛亦然。故名善逝。",
    "喜": "　　云何為喜？謂有一類。作是思惟。有情獲益。深可欣慰。彼依出家。或依遠離。由思擇力。內所發起。色界定善心欣極欣現前極欣欣性。欣類適意悅意喜性。喜類樂和合不別離。歡欣悅豫有堪任性。踴躍踴躍性。歡喜歡喜性。總名為喜。\n　　復次與喜相應受想行識。及所等起身語二業。不相應行。亦名為喜。\n　　復次喜心定。有二種。一狹小。二無量。云何狹小喜心定加行？修何加行。入狹小喜心定。謂有一類。於諸可愛可樂可喜可意有情。謂父母兄弟姊妹。及余隨一親屬朋友。彼於如是狹小有情。令狹小喜俱心住等住近住安住調伏寂靜最極寂靜一趣等持。度彼有情得樂離苦。彼於爾時。若心散亂。馳流余境。不能一趣。不能守念。令住一緣。而度狹小有情獲益。齊此未名狹小喜心定加行。亦未名入狹小喜心定。\n　　彼若爾時。攝錄自心。令不散亂。馳流余境。能令一趣。住念一緣。思惟狹小諸有情相。欣慰狹小諸有情相欣慰狹小有情獲益。如是思惟。發勤精進。乃至勵意不息。是名狹小喜心定加行。亦名入狹小喜心定。彼於此道。生已修習。多修習故。便令心住等住近住安住一趣等持無二無退。欣慰狹小有情獲益。齊此名為已入狹小喜心定。又此定中。諸心意識。名狹小喜俱有心。諸思等思。乃至造心意業。名狹小喜俱有意業。諸心勝解。已勝解。當勝解。名狹小喜俱有勝解。又此定中。若受若想。乃至若慧等。名狹小喜俱有諸法。如是諸法。亦得名狹小喜心定加行。亦名入狹小喜心定。云何無量喜心定加行？修何加行。入無量喜心定。謂即於狹小喜心定。數數修習。令心隨順調伏寂靜。數復調練。令其質直柔軟堪能。與後勝定作所依止。然後漸令勝解徧滿。於東方等無量有情。欣慰獲益。彼於爾時。若心散亂。馳流余境。不能一趣。不能守念。令住一緣。欣慰無量有情獲益。齊此未名無量喜心定加行。亦未名入無量喜心定。\n　　彼若爾時。攝錄自心。令不散亂。馳流余境。能令一趣。住念一緣。思惟無量諸有情相。欣慰無量有情獲益。如是思惟。發勤精進乃至勵意不息。是名無量喜心定加行。亦名入無量喜心定。\n　　彼於此道。生已修習。多修習故。便令心住等住近住安住一趣等持無二無退。欣慰無量有情獲益。齊此名為已入無量喜心定。\n　　又此定中。諸心意識。名無量喜俱有心。諸思等思。乃至造心意業。名無量喜俱有意業。諸心勝解。已勝解。當勝解。名無量喜俱有勝解。又此定中。若受若想。乃至若慧等。名無量喜俱。有諸法。如是諸法。亦得名無量喜心定加行。亦名入無量喜心定。",
    "喜根": "　　謂順喜觸所生心喜。平等受。受所攝。是名喜根。復次修初二靜慮。順喜觸所生心喜。平等受。受所攝。是名喜根。",
    "喜界": "　　謂順喜觸所起心喜平等受。受所攝。是名喜界。復次修初二靜慮。順喜觸所起心喜平等受。受所攝。是名喜界。",
    "喜覺支": "　　謂世尊說。大名當知。若聖弟子。以如是相隨念諸佛。謂此世尊。是如來、阿羅漢、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、薄伽梵。\n　　彼聖弟子。以如是相隨念佛時。貪不纏心。嗔不纏心。癡不纏心。於如來所。其心正直。心正直故。得義威勢。得法威勢。於如來所。能引起欣。欣故生喜心。喜故身安。身安故受樂。樂故心定。心定故於不平等諸有情類。得住平等。於有惱害諸有情類。住無惱害。得預法流於諸佛所修隨念故。乃至能證究竟涅槃。\n　　復次大名。若聖弟子。以如是相隨念正法。謂佛正法。善說現見。無熱應時。引導近觀。智者內證。彼聖弟子。以如是相隨念法時。貪不纏心。嗔不纏心。癡不纏心。於正法所。其心正直。心正直故。得義威勢。得法威勢。於正法所。能引起欣欣故生喜心。喜故身安。身安故受樂。樂故心定。心定故於不平等諸有情類。得住平等。於有惱害諸有情類。住無惱害。得預法流。於正法所。修隨念故。乃至能證究竟涅槃。\n　　復次大名。若聖弟子。以如是相隨念僧伽。謂佛弟子。具足妙行、質直行、如理行、法隨法行、和敬行、隨法行。又佛弟子，有預流向，有預流果。有一來向，有一來果。有不還向，有不還果。有阿羅漢向，有阿羅漢果。如是總有四雙八隻補特伽羅。如是僧伽。戒具足、定具足、慧具足、解脫具足、解脫智見具足。應請應屈。應恭敬無上福田。世所應供。彼聖弟子。以如是相隨念僧時。貪不纏心。嗔不纏心。癡不纏心。於僧伽所。其心正直。心正直故。得義威勢。得法威勢。於僧伽所。能引起欣。欣故生喜。心喜故身安。身安故受樂。樂故心定。心定故於不平等諸有情類。得住平等。於有惱害諸有情類。住無惱害。得預法流。於僧伽所。修隨念故。乃至能證究竟涅槃。\n　　復次大名。若聖弟子。以如是相隨念自戒。謂我淨戒。不缺不穿。不雜不穢。堪受供養無隱昧。善究竟。善受持。智者稱讚。常無譏毀。彼聖弟子。以如是相隨念自戒時。貪不纏心。嗔不纏心。癡不纏心。於自戒所。其心正直。心正直故。得義威勢。得法威勢。於自戒所。能引起欣。欣故生喜。心喜故身安身安故受樂。樂故心定。心定故於不平等諸有情類。得住平等。於有惱害諸有情類。住無惱害。得預法流。於自戒所。修隨念故。乃至能證究竟涅槃。\n　　復次大名。若聖弟子。以如是相隨念自施。謂我今者善得勝利。雖居無量慳垢所纏眾生眾中。而心遠離一切慳垢。能行惠施。雖處居家。而能不著一切財寶。舒手佈施。作大祠祀。供養福田。惠捨具足。樂等分佈。彼聖弟子。以如是相隨念自施時。貪不纏心。嗔不纏心。癡不纏心。於自施所。其心正直。心正直故。得義威勢。得法威勢。於自施所。能引起欣。欣故生喜。心喜故身安。身安故受樂。樂故心定。心定故於不平等諸有情類。得住平等。於有惱害諸有情類。住無惱害。得預法流。於自施所。修隨念故。乃至能證究竟涅槃。\n　　復次大名。若聖弟子。以如是相隨念諸天。謂有四大王眾天。三十三天。夜摩天。睹史多天。樂變化天。他化自在天。如是諸天。成就信故戒故聞故捨故慧故。從此處沒。生彼天中。受諸快樂。我亦有信。戒聞捨慧。亦當生彼。與諸天眾。同受快樂。彼聖弟子。以如是相隨念天時。貪不纏心。嗔不纏心。癡不纏心。於諸天所。其心正直。心正直故。得義威勢。得法威勢。於諸天所。能引起欣。欣故生喜。心喜故身安。身安故受樂。樂故心定。心定故於不平等諸有情類。得住平等。於有惱害諸有情類。住無惱害。得預法流。於諸天所。修隨念故。乃至能證究竟涅槃。彼修如是六隨念時。所有無漏作意相應。心欣極欣。現前極欣。欣性欣類。適意悅意。喜性喜類。樂和合不別離。歡欣悅預。有堪任性。踴躍踴躍性。歡喜歡喜性。總名為喜。亦名喜覺支。是聖出世無漏無取道隨行道俱有道隨轉。能正盡苦。住苦邊際。諸有學者如所見諸行。思惟觀察。令至究竟。於諸行中深見過患。於永涅槃深見功德。若阿羅漢。如解脫心。思惟觀察。令至究竟。所有無漏作意相應。心欣極欣。乃至歡喜歡喜性。是名喜覺支。",
    "嗔": "　　謂於有情。欲為損害。內懷栽杌。欲為擾惱。已嗔當嗔現嗔。樂為過患。極為過患。意極憤恚。於諸有情。各相違戾。欲為過患。已為過患。當為過患。現為過患。總名為嗔。",
    "嘆": "　　謂有一類。或因父母兄弟姊妹師友死等。便發自身乃至苦受。彼於爾時。心熱乃至心中愁箭。由此緣故。而傷嘆言。苦哉苦哉。我父我母。廣說乃至。我財我位。如何一旦。忽至於此。其中所有傷怨言詞。種種語業。總名為嘆。",
    "器世成壞相": "　　何等器世成壞相？謂火、水、風三種成壞有三災。\n　　頂謂第二第三第四靜慮，第四靜慮外宮殿等，雖無外災成壞，然彼諸天與宮殿等俱生俱滅說有成壞，復有三種中劫，所謂饑饉、疫病、刀兵，此小三災劫究竟位方乃出現，謂世界成已。一中劫初唯減，一中劫後唯增，十八中劫亦增亦減，二十中劫世界正壞，二十中劫世界壞已住，二十中劫世界正成，二十中劫世界成已住，合此八十中劫為一大劫。由此劫數顯色無色界諸天壽量，如說以壽盡故福盡故業盡故，彼彼有情從彼彼處沒。云何壽盡？謂時死。云何福盡？謂非時死即非福死。以彼有情貪著定味，福力減盡因此命終。云何業盡？謂順生受業順後受業俱盡故死。",
    "四修定": "　　何等為四？謂有修定。若習若修。若多所作。能令證得現法樂住。復有修定。若習若修。若多所作。能令證得殊勝智見。復有修定。若習若修。若多所作。能令證得勝分別慧。復有修定。若習若修。若多所作。能令證得諸漏永盡。\n　　云何修定？若習若修。若多所作。能令證得現法樂住。謂有苾芻。即於自身。離生喜樂。滋潤遍滋潤。充滿徧充滿。適悅遍適悅。故離生喜樂。於自身中。無有少分而不充滿。是名修定。若習若修。若多所作。能令證得現法樂住。\n　　云何修定？若習若修。若多所作。能令證得殊勝智見。謂有苾芻。於光明想。善攝受。善思惟。善修習。善通達。若晝若夜。無有差別。若前若後。無有差別。若下若上。無有差別。開心離蓋。修照俱心。除闇昧心。修無量定。是名修定。若習若修。若多所作。能令證得殊勝智見。\n　　云何修定若習若修？若多所作。能令證得勝分別慧。謂有苾芻。善知受生。善知受住。善知受滅盡沒。於此住念非不住念。及善知想善知尋。於此住念非不住念。是名修定。若習若修。若多所作。能令證得勝分別慧。\n　　云何修定？若習若修。若多所作。能令證得諸漏永盡。謂有苾芻。於五取蘊。數數隨觀。生滅而住。謂此是色。此是色集。此是色滅。此是受想行識。此是受想行識集。此是受想行識滅。是名修定。若習若修。若多所作。能令證得諸漏永盡。爾時世尊。為攝前義。而說頌言。\n　　斷欲想憂惱　　離惛沉惡作\n　　得淸淨捨念　　法尋伺前行\n　　現法樂為初　　次勝知見慧\n　　破無明等漏　　後證解脫果",
    "四句": "　　四句者，謂於所問作四句答。如有問言，若成就眼根亦耳根耶，設成就耳根亦眼根耶，應四句答，初句，謂聾者眼根已生不捨。第二句，謂盲者耳根已生不捨。第三句，謂眼耳根已生不捨。第四句除上爾所相。",
    "四大種": "　　四大種者，謂地水火風界。地界者堅勁性，水界者流濕性，火界者溫熱性，風界者輕動性，所造色者，謂眼等五根。色聲香味所觸一分及法處所攝色。眼根者，謂四大種所造眼識所依，清淨色為體。耳根者，謂四大種所造耳識所依，清淨色為體。鼻根者，謂四大種所造鼻識所依，清淨色為體。舌根者，謂四大種所造舌識所依，清淨色為體。身根者，謂四大種所造身識所依，清淨色為體。",
    "四天道": "　　何等為四？謂有一類離欲惡不善法。有尋有伺。離生喜樂。初靜慮具足住。是名第一天道。復有一類。尋伺寂靜。內等淨心一趣性。無尋無伺。定生喜樂。第二靜慮具足住。是名第二天道。復有一類離喜住捨。正念正知。身受樂聖說應捨。第三靜慮具足住。是名第三天道。復有一類斷樂斷苦。先喜憂沒。不苦不樂。捨念淸淨。第四靜慮具足住。是名第四天道。如是四種。皆令有情未淨者淨淨者鮮白。",
    "四念住": "　　復次一切菩提分法無有差別，皆由五門而得建立，謂所緣故自體故助伴故修習故修果故，如初四念住有五門，所餘菩提分法亦爾。\n　　四念住所緣境者，謂身受心法，復有四事，謂我所依事、我受用事、我自體事、我染淨事。何故唯建立此為所緣境？由顛倒覺愚癡凡夫多分計我，依止有根身，受用苦樂等，取了境為相，由貪等染污，由信等清淨，是故最初為正觀察真實事相，是故建立此四種事為所緣境。\n　　念住自體者，謂慧及念，由佛經中有於身等循觀言故，及有念住言故，如其次第。\n　　念住助伴者，謂彼相應心心法等，彼者彼念慧二法。\n　　念住修習者，謂於內身等修循身等觀，如於內於外於內外亦爾。內身者，謂於此身中所有內色處，由自身中眼耳鼻舌身根內處所攝故，墮有情數故名內。外身者，謂外所有外色處，由外色聲香味觸等外處所攝故，非有情數故名外。內外身者，謂內處相應所有外處根所依止，由己身中眼等五處相應根所依住所有色等外處墮有情數故，外處所攝故名內外，又於他身中所有內色處，約處建立約身建立說名內外。云何於身修循身觀？謂以分別影像身與本質身平等，循觀於身境循觀身相似性故，名於身循身觀，由循觀察分別影像身門，審諦觀察本質身故。內受者，謂因內身所生受，緣眼等處為境界故，依自身生故名內。外受者，謂因外身所生受，緣色等處為境界故，依他身生故名外。內外受者，謂因內外身所生受，緣自身中外處為境故，緣他身中內處為境故名內外，如受心法亦爾，如於身修循身觀，如是於受等修循受等觀如其所應。",
    "四正勝": "　　何等為四？謂有苾芻。為令已生惡不善法斷故。起欲發勤精進。策心持心。是名第一。為令未生惡不善法不生故。起欲發勤精進。策心持心。是名第二。為令未生善法生故。起欲發勤精進。策心持心。是名第三。為令已生善法堅住不忘修滿倍增。廣大智作證故。起欲發勤精進。策心持心。是名第四。",
    "四正斷": "　　四正斷所緣境者，謂已生未生所治能治法，初正斷緣已生所治法為境，為斷已生惡不善法，樂欲生故。第二正斷緣未生所治法為境，第三正斷緣未生能治法為境，第四正斷緣已生能治法為境。如經所說，應廣配釋。\n　　正斷自體者，謂精進。\n　　正斷助伴者，謂彼相應心心法等。\n　　正斷修習者，如經說生欲策勵，發起正勤策心持心，此中諸句顯修正勤及所依止。所依止者，謂欲樂欲，為先發精進故。正勤者，謂策勵等，於止舉捨相作意等中，若由止等相作意，不顧戀所緣境，純修習對治，爾時名策勵，為欲損減沈沒掉舉發起正勤。所以者何？若沈沒隨煩惱生時，為損減彼故，以淨妙等作意策練其心，若掉舉隨煩惱生時，即以內證略攝門制持其心，爾時名為發起正勤，即為顯此損減沈掉善巧方便，故次說言策心持心。\n　　正斷修果者，謂盡棄捨一切所治，於能對治若得若增，是名修果。初二正斷盡捨一切所治，如其所應，斷捨一切已生未生惡不善法故。第三正斷得能對治，能生未生諸善法故，第四正斷增能對治，已生善法令增廣故。",
    "四正行": "　　四正行者，謂苦遲通行，苦速通行，樂遲通行，樂速通行，初謂鈍根未得根本靜慮，第二謂利根未得根本靜慮，第三謂鈍根已得根本靜慮，第四謂利根已得根本靜慮。苦正行者，謂依未至及無色地，如其次第，奢摩他毘鉢舍那微劣故。樂正行者，謂依靜慮雙道轉故。遲通者，謂鈍根依苦樂二地。速通者，謂利根依苦樂二地。",
    "四法迹": "　　四法迹者，謂無貪無瞋正念正定，無貪無瞋能令增上戒學清淨，不因貪恚門毀犯學處故，正念能令增上心學清淨，由於所緣無有忘失持心令定故，正定能令增上慧學清淨，由定心者能如實遍知故。",
    "四無色": "　　何等為四？謂有苾芻。超諸色想。滅有對想。不思惟種種想。入無邊空。空無邊處具足住。是名第一。復有苾芻。超一切種空無邊處入無邊識。識無邊處具足住。是名第二。復有苾芻。超一切種識無邊處。入無所有。無所有處具足住是名第三。復有苾芻。超一切種無所有處。入非想非非想處具足住。是名第四。",
    "四無量": "　　何等為四？謂有一類慈俱行心。無怨無敵。遠離惱害。廣大無量。善修習故。想對一方。勝解徧滿。具足而住。及對第二第三第四上下或傍。一切世間亦復如是。是名第一。\n　　復有一類悲俱行心。無怨無敵。遠離惱害。廣大無量。善修習故。想對一方。勝解徧滿。具足而住。及對第二第三第四。上下或傍。一切世間。亦復如是。是名第二。\n　　復有一類喜俱行心。無怨無敵。遠離惱害。廣大無量。善修習故。想對一方。勝解徧滿。具足而住。及對第二第三第四。上下或傍。一切世間。亦復如是。是名第三。\n　　復有一類捨俱行心。無怨無敵。遠離惱害。廣大無量。善修習故。想對一方。勝解徧滿。具足而住。及對第二第三第四。上下或傍。一切世間。亦復如是。是名第四。",
    "四神足": "　　何等為四？謂欲三摩地勝行成就神足。是名第一。勤三摩地勝行成就神足。是名第二。心三摩地勝行成就神足。是名第三。觀三摩地勝行成就神足。是名第四。",
    "四種如實智": "　　復次於法正勤修尋思已，必於諸法得如實智。云何而起如實智耶？謂起四如實智，一名尋思所引如實智，二事尋思所引如實智，三自體假立尋思所引如實智，四差別假立尋思所引如實智。名尋思所引如實智者，謂如實知名不可得智。事尋思所引如實智者，謂如實知事相亦不可得智。自體假立尋思所引如實智者，謂如實知實有自性不可得智。差別假立尋思所引如實智者，謂如實知實有差別不可得智。此四如實智如前所尋思了知，名等如實皆不可得說。",
    "四種尋思": "　　云何而起尋思？謂起四種尋思，一名尋思、二事尋思、三自體假立尋思、四差別假立尋思。名尋思者，謂推求諸法名身句身文身自相皆不成實，由名身等是假有故，觀彼自相皆不成實。事尋思者，謂推求諸法蘊界處相皆不成實，由諸蘊等如名身等，所宣說事皆不成實，是故觀彼相不成實，推求者是觀察義。自體假立尋思者，謂於諸法能詮所詮相應中推求自體，唯是假立言說因性，能詮所詮相應者，謂此二互為領解因性，所以者何？善名言者，但聞能詮由憶念門，便於所詮得生領解，或但得所詮由憶念門，便於能詮得生領解，於如是種類共立相應中，眼等自相唯是假立，但於肉團等名言，因中起此名言故，若如是觀察是名自體假立尋思。差別假立尋思者，謂於諸法能詮所詮相應中推求差別，唯是假立名言因性，所以者何？以於能詮所詮相應中，推求若常無常有上無上有色無色有見無見等差別相，唯是假立名言因性，如是觀察是名差別假立尋思。",
    "四種差別": "　　差別者略有四種，一自體差別、二助伴差別、三勸讚差別、四種殖差別。施等波羅蜜多自體差別者，如其次第，以棄捨防護堪耐策勤心住決擇為體。助伴差別者，謂施等方便中餘波羅蜜多悉皆隨轉，如前廣說。勸讚差別者，謂於施等勸勵讚美隨喜慶悅。種殖差別者，謂於他相續中建立施等波羅蜜多。此中施波羅蜜多是財施，餘五波羅蜜多是無畏施，一切六是法施，皆於他相續中種殖故。差別顯示者，謂由一行等差別顯示施等波羅蜜多，如有問言，若施波羅蜜多亦戒波羅蜜多耶？設戒波羅蜜多亦施波羅蜜多耶？為答此問應作順後句，謂所有戒波羅蜜多皆是施波羅蜜多，或有施波羅蜜多非戒波羅蜜多，謂戒波羅蜜多所不攝施波羅蜜多，如是乃至以慧波羅蜜多對施波羅蜜多，皆應作順後句，餘互相望亦如理應思。此中依始業地漸次修者，說後必待前前不待後，是故皆作順後句，若已串習六種頓修皆互相攝，如菩薩地說。攝善法戒者，謂六波羅蜜多若依純雜相資助說應作四句。復次諸所有施皆波羅蜜多耶？設波羅蜜多皆是施耶？為答此問應作三句，或有是施非波羅蜜多，謂所行施不迴向大菩提，或有亦施亦波羅蜜多，謂所行施等迴向大菩提，或有非施非波羅蜜多，謂除上所說法，如是乃至依慧波羅蜜多，一一皆應作四句如理當思。復次一切行施皆能生施波羅蜜多種類福耶？此應作四句，初句，謂所行施不迴向大菩提。第二句，謂於施波羅蜜多勸勵讚美隨喜慶悅。第三句謂所行施迴向大菩提。第四句，謂除上爾所相，如是乃至依慧波羅蜜多，各作四句如理應思。",
    "四種意趣": "　　復次有四種意趣，由此意趣故，方廣分中一切如來所有意趣應隨決了，何等為四？謂平等意趣、別時意趣、別義意趣、眾生意樂意趣。平等意趣者，如說我於爾時曾名勝觀如來應正等覺，與彼法身無差別故。別時意趣者，如說若有願生極樂世界皆得往生，若暫得聞無垢月光如來名者，即於阿耨多羅三藐三菩提決不退轉，如是等言意在別時故。別義意趣者，如說一切諸法皆無自性，如是等言不可如文便取義故。眾生意樂意趣者，謂於一善根，或時稱讚，為令歡喜勇猛修故，或時毀呰，為遮得少善生喜足故，為貪行者稱讚佛土富樂莊嚴，為慢行者稱讚諸佛或有增勝，為恒悔惱障修善者。說如是言，於佛菩薩雖行輕毀，然彼眾生亦生天趣，為不定種性者，捨離聲聞下劣意樂故，記大聲聞當得作佛，又說一乘更無第二。復次有四種祕密，由此祕密故，於方廣分中一切如來所有祕密應隨決了，何等為四？謂令入祕密、相祕密、對治祕密、轉變祕密，如是四種於大乘中略攝如來一切所說祕密道理。令入祕密者，謂於聲聞乘說色等諸法皆有自性，為令無怖畏漸入聖教故。相祕密者，謂於三自性說一切法皆無自性無生無滅等。對治祕密者，謂為調伏諸過失者，如來宣說種種密教，如為對治八種障故說最上乘。何等為八？謂輕佛法懈怠少善生喜足貪慢行惡作不定性差別，廣說指事隨其所應如四意趣說。轉變祕密者，謂經所說隱密名言，如說於不堅堅覺深住於顛倒，極煩惱所惱。得最上菩提此中密意者，謂於不散動起堅固勝覺，所以者何？堅有二義，一貞實，二散動，由此散動令心剛逸故亦名堅。深住於顛倒者，謂翻常樂我淨四倒為無常等故名顛倒，於此不退故名深住。極煩惱所惱者，謂於長時精勤苦行極為勞倦所逼惱故。得最上菩提者，若具如上所說，三事定速當證無上菩提。復次方廣分中於法三摩地善巧菩薩相云何可知，謂由五種因故，一剎那剎那消除一切麤重所依，二出離種種想得樂法樂，三了知無量無分別相大法光明，四順清淨分無分別相恒現在前，五能攝受轉上轉勝，圓滿成就佛法身因，如是五種依諸菩薩三種稱讚功德說，謂奢摩他稱讚功德，毘鉢舍那稱讚功德，此二俱分稱讚功德。奢摩他稱讚功德復有二種，一剎那剎那勝進輕安無有間缺，遍所依故，剎那剎那消除一切麤重所依，二勝解諦觀一切教法無有差別，同一味故，遠離種種蘊界處等諸義相想，得契經等喜樂法樂。毘鉢舍那稱讚功德亦有二種，一隨所擇法無有間缺，不忘失故，由憶念門於無量無分別相契經等法，以慧照了二轉依前所有色像無分別無加行相恒現在前，第五一種，是此二俱分稱讚功德法身者，謂所知障永斷轉依所攝，此於第十地名圓滿，於如來地名成就，為令法身速得圓滿成就故，引殖轉上轉勝等流習氣故名攝受，彼因如是五種，即顯五修能得五果。何等為五？謂息相修、和合修、無相修、無功用修、轉相修。\n　　問聲聞藏法菩薩藏法等從法身所流，何故眾生以香鬘等供養菩薩藏法，便生廣大無邊福聚，非聲聞藏法耶？答以菩薩藏法是一切眾生利益安樂所依處故，能建大義故，無上無量大功德聚所生處故。",
    "四種祕密": "　　復次有四種祕密，由此祕密故於方廣分中一切如來所有祕密應隨決了。何等為四？一令入祕密，二相祕密，三對治祕密，四轉變祕密。",
    "四種自性": "　　自性有四種，謂實自性、假自性、世俗自性、勝義自性。因有四種，謂生因、成因、轉因、還因。境界有七種，謂有相境、有分別境、對治境、安住境、增益境、損減境、自在境。行相有五種，謂分析行相、差別行相、正解行相、觀察行相、作隨作行相。等無間有九種，謂自類等無間，異類等無間，三摩鉢底等無間，退等無間，生等無間，鄰次等無間，隔越等無間，起等無間，滅等無間。增上有七種，謂取增上、生增上、住增上、受用雜染增上、清淨增上、田增上、執受增上。所依有八種，謂界所依、趣所依、洲渚所依、村田所依、補特伽羅所依、無病所依、尸羅所依、莊嚴所依。依有五種，謂眾具依、善友依、法依、作意依、三摩鉢底依。攝有十一種，謂界攝、相攝、種類攝、分位攝、助伴攝、時攝、方攝、具分攝、一分攝、更互攝、勝義攝。相應有十種，謂他性相應、不相違相應、遍行相應、不遍行相應、所治相應、能治相應、曾習相應、未曾習相應、下劣相應、廣大相應。成就有三種，謂種子成就、自在成就、現行成就。雜染有四種，謂煩惱雜染、業雜染、生雜染、障雜染。",
    "四種道": "　　又依奢摩他毘鉢舍那立四種道，或有一類已得奢摩他非毘鉢舍那，此類依奢摩他進修毘鉢舍那，或有一類已得毘鉢舍那非奢摩他，此類依毘鉢舍那進修奢摩他，或有一類不得奢摩他亦非毘鉢舍那，此類專心制伏惛沈掉舉雙修二道，或有一類已得奢摩他及毘鉢舍那，此類奢摩他毘鉢舍那二道和合平等雙轉。",
    "四種順解脫分": "　　又有四種順解脫分，一者依憑順解脫分，二者勝解順解脫分，三者愛樂順解脫分，四者趣證順解脫分。從善法欲乃至為求解脫所有善根，皆名依憑順解脫分。於彼相應教法所有勝解俱行善根，是名勝解順解脫分。緣解脫境作意相續清淨喜俱所有善根，是名愛樂順解脫分。即於此生決定發起順決擇分所有善根，是名趣證順解脫分。",
    "四通行": "　　何等為四？謂苦遲通行。苦速通行。樂遲通行。樂速通行。",
    "四道理": "　　復次因辯觀察契經等法，應當解釋諸法道理，由依此道理能觀彼法故。問若欲於諸法正勤審觀察，由幾種道理能正觀察耶？答由四種道理，謂觀待道理、作用道理、證成道理、法爾道理。觀待道理者，謂諸行生時要待眾緣，如芽生時要待種子時節水田等緣，諸識生時要待根境作意等緣，如是等。作用道理者，謂異相諸法各別作用，如眼根等為眼識等所依作用，色等境界為眼識等所緣作用，眼等諸識了別色等，金銀匠等善修造金銀等物，如是比。證成道理者，謂為證成所應成義，宣說諸量不相違語。所應成義者，謂自體差別所攝所應成義。諸量不相違語者，謂現量等不相違立宗等言。法爾道理者，謂無始時來於自相共相所住法中，所有成就法性法爾，如火能燒水能爛，如是等諸法成就法性法爾。如經言，眼雖圓淨空無有常乃至無我，所以者何？其性法爾，復次於諸法中正勤觀察四道理已。",
    "四雙補特伽羅者": "　　謂預流向預流果。是第一雙。一來向一來果。是第二雙。不還向不還果。是第三雙。阿羅漢向阿羅漢果。是第四雙。",
    "因": "　　生因者，謂因等四緣。成因者，謂三量，一現量、二比量、三聲量。轉因者，謂順緣起。還因者，謂逆緣起。",
    "因緣": "　　何等因緣？謂阿賴耶識及善習氣，又自性故差別故、助伴故、等行故、增益故、障礙故、攝受故，是因緣義。",
    "國土尋": "　　謂於所愛國土人眾。欲令安樂。廣說乃至。降澤以時。緣此等故。起心尋求遍尋求。乃至思惟分別。總名國土尋。",
    "圓滿": "　　圓滿者，謂諸無學阿羅漢果攝等所有滅。無莊嚴者，謂慧解脫阿羅漢所有滅，無三明等最勝功德所莊嚴故。",
    "地界": "　　謂地界有二種。一內。二外。云何內地界？謂此身內所有各別堅性堅類有執有受。此復云何？謂發毛爪齒。乃至糞穢。復有所餘身內各別堅性堅類有執有受。是名內地界。云何外地界？謂此身外諸外所攝堅性堅類無執無受。此復云何？謂大地山。諸石瓦礫蚌蛤蝸牛。銅鐵錫鑞。末尼真珠。琉璃螺貝。珊瑚璧玉。金銀石藏杵藏。頗胝迦。赤珠右旋。沙土草木。枝葉花果。或復有地依水輪住。復有所餘在此身外堅性堅類無執無受。是名外地界。前內此外。總名地界。",
    "垢": "　　垢有三種，謂貪、瞋、癡。由依止貪瞋癡故，毀犯如是尸羅學處，由此有智同梵行者，或於聚落或閑靜處見已，作如是言，此長老作如是事行如是行，為聚落刺點染不淨，說名為垢，以貪瞋癡能現犯戒不淨相故。",
    "執受": "　　云何執受？幾是執受？為何義故觀執受耶？謂受生所依色故，是執受義。若依此色受得生，是名執受，色蘊一分，五有色界處全，及四一分，是執受。色蘊一分者，謂根根居處所攝，五有色界處全者，謂眼等，四一分者，謂不離根色香味觸，為捨執著身自在轉我故，觀察執受。",
    "堪達阿羅漢": "　　堪達阿羅漢者，謂鈍根性，若遊散若不遊散，皆能不退現法樂住，堪能練根。",
    "境": "　　有相境者，謂眼等五識所緣色等五境，由緣此所生唯有無分別相故。有分別境者，謂意識所緣境，由緣此境有分別生故。對治境者，謂緣此境棄捨雜染，由能對治故。安住境者，謂緣此境能生聖天梵住，由眾聖所住故。增益境者，謂緣此境能轉勝進，是增勝因故。損減境者，謂緣此境能入無想定滅盡定，是損減心心法因故。自在境者，謂緣此境發神通等勝品功德，是自在因故。",
    "境界": "　　境界者，謂一切煩惱還用一切煩惱為所緣境，及緣諸煩惱事。又欲界煩惱除無明見疑，餘不能緣上地為境，此無明等雖亦有能緣上地者，然彼不能親緣上地如緣自地，由依彼門起分別故，立彼為所緣。所言無明緣上地者，謂與見等相應見者，除薩迦耶見不見世間，緣他地諸行執為我故，上地諸煩惱不緣下地為境，已離彼地欲故。又緣滅道諦諸煩惱，不能親緣滅道為境，由滅道諦出世間智及後得智內所證故，唯由依彼妄起分別說為所緣，分別所計境不離分別故。又煩惱有二種，謂緣無事及緣有事，緣無事者，謂見及見相應法，見謂薩迦耶見及邊執見，所餘煩惱名緣有事。",
    "境界差別": "　　境界差別者，謂緣方廣大乘為境故。",
    "增上": "　　取增上者，謂眼等根望能取境界，有增上力故。生增上者，謂男女根望生胎孕，有增上力故。住增上者，謂命根望身等住，有增上力故。受用雜染增上者，謂五受根望所受用，有增上力故。又為貪等所隨眠故，謂樂貪所隨眠，苦瞋所隨眠，不苦不樂癡所隨眠。清淨增上者，謂信等五根未知欲知等三根望世出世清淨法，有增上力故。田增上者，謂共業望器世間生，有增上力故。執受增上者，謂四大種望所造色。",
    "增上意樂行菩薩": "　　增上意樂行菩薩者，謂十地中所有菩薩，由已證得出世內證清淨意樂故。",
    "增上意樂行菩薩補特伽羅": "　　何等增上意樂行菩薩補特伽羅？謂十地中所有菩薩。",
    "增上慢": "　　謂未得謂得。未獲謂獲。未觸謂觸。未證謂證。由此起慢。乃至心自取。總名增上慢。",
    "增上緣": "　　增上緣者，謂任持增上故，引發增上故，俱有增上故，境界增上故，產生增上故，住持增上故，受用果增上故，世間清淨離欲增上故，出世清淨離欲增上故，是增上緣義。",
    "增上離欲": "　　何等增上離欲？謂得勝處已於下劣處生厭背性。",
    "增益": "　　增益者，謂前際修習善不善無記法故，能令後際善等諸法展轉增勝後後生起。前際修習者，謂先所數習現行義。後際展轉增勝後後生起者，謂由彼長養諸種子故，於未來世即彼種類增勝而生，如是諸法能為相似增長因故立同類因。",
    "增益見": "　　問如是五見幾增益見幾損減見？答四是增益見，於所知境增益自性及差別故，於諸見中增益第一及清淨故，謂於五取蘊所知無我境。增益我我所自性，是薩迦耶見。增益我常無常差別，是邊執見。於諸惡見增益第一，是見取。即於此見增益清淨，是戒禁取。一多分是損減見，一多分者，由邪分別不必損減故。\n　　問計前後際所有諸見，彼於此五幾見所攝？答或二或一切。問於不可記事所有諸見，彼於此五幾見所攝？答或二或一切，二者，謂邊執見及邪見自相故，一切者謂五見眷屬故。",
    "壞不壞門": "　　壞不壞門者，謂若處顯示失壞不失壞，彼二方便彼二差別，如善生經說。失壞者，謂染著內外依事，內依事五取蘊為相，外依事四宅妻子等為相。不失壞者，謂遠離此二種染著。失壞方便者，謂不出家雖復出家，而行放逸不得漏盡與此相違是無失壞方便。佛告善生，族姓子，有二種事俱為美妙，若落鬚髮乃至趣於非家，若盡諸漏乃至自稱不受後有者，此正顯不失壞及彼方便，兼顯失壞及彼方便，由與此相相違故。不失壞差別者，如伽他中顯，謂諸比丘美妙寂靜離諸漏，此顯出家及漏盡。為顯漏盡復說餘句，謂離欲離繫縛，無執受涅槃任持最後身。摧伏魔所使者，此顯由世間道離欲，由出世道永斷順下分結，永斷順上分結。永斷內依事，此則略說因盡果盡，亦兼顯失壞差別，由與此相相違故。安立數取趣門者，謂若處顯示依爾所補特伽羅說如是言，如水喻經中依二數取趣說三種四種差別言，何等為二？謂異生及見諦異生，差別有三，謂無白法、少白法、多白法。見諦差別有四，謂住、四果、三有學、一無學。",
    "壞滅相": "　　何等壞滅相？謂諸行生已即滅，暫有還無故。",
    "壞苦性": "　　云何壞苦性？幾是壞苦性？為何義故觀壞苦性耶？謂樂受變壞自相故，隨順樂受法變壞自相故，於彼愛心變壞故，是壞苦性義。此中樂受及隨順樂受法，於變壞位能生憂惱故，此變壞是壞苦性。又由愛故令心變壞，亦是壞苦，如經中說，入變壞心一切一分，是壞苦性。為捨執著有樂我故，觀察壞苦性。",
    "外門": "　　云何外門？幾是外門？為何義故觀外門耶？謂欲界所繫法是外門義，除依佛教所生聞思慧及彼隨法行所攝心心法等。問何故聞思所生慧及彼隨法行所攝心心法等，非外門耶？答等流法為因故，由此勢力緣涅槃等。等流法者，謂諸佛真證種類教法，鼻識舌識香味四界，香味兩處全及餘一分欲界所攝，是外門，為捨執著不離欲我故，觀察外門。",
    "外門同行相應": "　　復有外門同行相應，謂多分欲界繫心心所。",
    "外門差別": "　　何等外門差別？謂多分欲界差別。",
    "大乘補特伽羅": "　　大乘補特伽羅者，謂住菩薩法性若定不定性是利根，為求解脫一切有情，發弘大願修無住處涅槃意樂，以菩薩藏為所緣境，精進修行法隨法行，成熟眾生修淨佛土，得受大記，證成無上正等菩提，得受大記者，謂住第八菩薩地，證得無生法忍故。",
    "大乘阿毘達磨集": "　　何故此論名為大乘阿毘達磨集？略有三義，謂等所集故、遍所集故、正所集故，由釋詞理以顯得名故為此問。等所集者，謂證真現觀諸大菩薩共結集故。遍所集者，謂遍攝一切大乘阿毘達磨經中諸思擇處故。正所集者，謂由無倒結集方便，乃至證得佛菩提故。",
    "大悲": "　　大悲者，謂於緣無間苦境大悲住具足中，若定若慧乃至廣說。此中顯示於緣一切三界有情無間一切種苦境大悲住具足中所有三摩地等，是名大悲。\n　　大悲作何業？謂日夜六時遍觀世間，誰減誰退誰增誰進，如是等種種觀察。",
    "大欲": "　　謂多貪者。為得廣大財利等故。而起於欲。已欲當欲。總名大欲。",
    "天人師": "　　如世尊告阿難陀言。我非但與苾芻苾芻尼鄔波索迦鄔波斯迦四眾為師。然我亦與諸天魔梵沙門婆羅門等諸天人眾。為師為勝師。為隨師。為范為勝范。為隨范。為將為導。是故如來名天人師。",
    "天耳通": "　　天耳通者，謂依止靜慮於隨聞種種音聲威德具足中，若定若慧，餘如前說。種種聲者，謂人天等聲。",
    "契經": "　　契經者，謂以長行綴緝略說所應說義。問何故如來不廣開演所應說義耶？答如來觀察十種勝利略說諸法，謂易可建立，易可宣說，易可受持，恭敬法故，菩提資糧速得圓滿，速能通達諸法實性，於諸佛所得證淨信，於法僧所得證淨信，觸證第一現法樂住，談論決擇悅智者心得預聰明英叡者數。云何名為易可建立？諸說法者以無量門安立開示所應說義，今以略言易建立故。云何名為易可宣說？能以少言詞廣顯大義故，如說能令心住等住，如是廣說。易可受持者，令能聞者易受持故，恭敬法故，菩提資糧速得圓滿者，了知佛法深慧所證，即於是法深生敬愛，由敬愛門信等資糧速圓滿故。速能通達諸法實性者，即由敬法方便力故，令其智慧轉復猛利，漸能通達諸法實性。於三寶所得證淨信者，由悟聖教妙善建立，於說者等淨信生故。觸證第一現法樂住者，於諸如來密意深義，猛利加行正思量已，獲得增上證歡喜故。談論決擇悅智者心者，善能開發深隱義故。得預聰明英叡者數者，廣大美稱流布十方故，當知後二種合為一勝利。",
    "奢摩他": "　　奢摩他者，謂於內攝心令住、等住、安住、近住，調順寂靜最極寂靜，專注一趣平等攝持，如是九行令心安住，是奢摩他，令住者攝外攀緣內離散亂，最初繫心故。等住者，最初繫縛麤動心已，即於所緣相續繫念，微細漸略故。安住者，或時失念於外馳散，尋復斂攝故。近住者，從初已來為令其心於外不散，親近念住故。調順者，從先已來於散亂因色等法中，起過患想增上力故，調伏其心令不流散故。寂靜者，於擾動心散亂惡覺隨煩惱中深見過患，攝伏其心令不流散故。最極寂靜者，或時失念散亂覺等率爾現行，即便制伏令不更起故。專注一趣者，精勤加行無間無缺，相續安住勝三摩地故。平等攝持者，善修習故，不由加行遠離功用，定心相續離散亂轉故。毘鉢舍那者，謂簡擇諸法最極簡擇，普遍尋思周審觀察，為欲對治麤重相結故，為欲制伏諸顛倒故，令無倒心善安住故，此中諸句依正行所緣境說，或依善巧所緣境說，或依淨煩惱所緣境說。簡擇諸法者，盡所有故。最極簡擇者，如所有故。普遍尋思者，由有分別作意俱行慧建立諸法相故。周審觀察者，委具推求故。\n　　又依奢摩他毘鉢舍那立四種道，或有一類，已得奢摩他非毘鉢舍那，此類依奢摩他進修毘鉢舍那，或有一類，已得毘鉢舍那非奢摩他，此類依毘鉢舍那進修奢摩他，或有一類，不得奢摩他亦非毘鉢舍那，此類專心制伏沈掉雙修二道，或有一類，已得奢摩他及毘鉢舍那，此類奢摩他毘鉢舍那二道和合平等雙轉。此中依於止觀說四種道，初已得止故宴坐住心，乃至平等攝持，未得觀故還復宴坐，依三摩地簡擇諸法，乃至周審觀察。第二與此相違，第三二俱未得雙進修習，云何修習？謂聽聞法由受持門進修正觀，以此為先進修於止，第四已得二種相應俱轉。",
    "如來": "　　如世尊言。此聖弟子。以如是相。隨念諸佛。謂此世尊。是如來阿羅漢正等覺明行圓滿善逝世間解無上丈夫調御士天人師佛薄伽梵。所言此者。謂此欲界。或此世界。此贍部洲。又言此者。謂即此身持等持軀等軀聚得自體。又言此者。謂此處生。佛及弟子。諸僊牟尼。諸聰睿者。善調伏者。善調順者。又言此者。謂即於此教授教誡善說法中。是故言此。言聖弟子者。聖謂佛法僧。歸依佛法僧故。名聖弟子。以如是相隨念佛者。謂以此相此門此理。於諸佛所。起念隨念。專念憶念。不忘不失。不遺不漏。不失法性。心明記性。是故名為以如是相隨念諸佛。所言謂者。謂如是相。如是狀。如是種。如是類。是故言謂所言此者。謂如是戒。如是法。如是慧。如是通。如是解脫。如是多住。是故言此。言世尊者。如後當釋。言如來者。如世尊言。從菩薩證無上正等菩提夜。乃至佛無餘依般涅槃界夜。於其中間。諸有所說。宣暢敷演。一切皆如。無有虛妄。無有變異。諦實如理。無有顛倒。皆以如是如實正慧。見已而說故。名如來。",
    "如來無有誤失": "　　如來無有誤失者，謂阿羅漢比丘雖漏已盡，為乞食故出遊城邑，或於一時與惡象惡馬惡牛惡狗等共為遊止，或於一時踐躡叢刺齊足越坑，或於一時入女人家，不依正理而作語言，或於林野捨棄正道而行邪徑，或與盜賊猛惡獸等共為遊止，如是等誤失事阿羅漢猶有，如來永無。",
    "如是便集純大苦蘊": "　　謂於如是老死位中。積集一類大災大橫具大過患眾苦蘊聚。復次無明苦蘊為緣。起行苦蘊。行苦蘊為緣。起識苦蘊。識苦蘊為緣。起名色苦蘊。名色苦蘊為緣。起六處苦蘊。六處苦蘊為緣。起觸苦蘊。觸苦蘊為緣。起受苦蘊。受苦蘊為緣。起愛苦蘊。愛苦蘊為緣。起取苦蘊取苦蘊為緣。起有苦蘊。有苦蘊為緣。起生苦蘊。生苦蘊為緣。起老死苦蘊。由老死故。發生種種愁嘆苦憂擾惱苦蘊。故總說言如是便集純大苦蘊。",
    "如理作意": "　　謂從善士。聞正法已。內自慶慰。歡喜踴躍。奇哉世尊。能說如是深妙正法。佛所說苦。實為真苦。佛所說集。實為真集。佛所說滅。實為真滅。佛所說道。實為真道。彼由如是內自慶慰歡喜踴躍。引攝其心。隨攝等攝。作意發意。審正觀察深妙句義。如是名為如理作意。",
    "如理行": "　　謂八支聖道。名為如理。佛弟子眾。於此中行。名如理行。又世尊說四念住四正勝四神足五根五力七等覺支及正定並資並具。名為如理。如世尊言。此一趣道。令諸有情。皆得淸淨。超諸愁嘆。滅諸憂苦。證如理法。",
    "妙界": "　　謂無漏善法。是名妙界。",
    "妙行": "　　言妙行者。謂世尊說有四種行。一苦遲通行。二苦速通行。三樂遲通行。四樂速通行。佛弟子眾。於此中行。故名妙行。又世尊說有四種行。一不安隱行。二安隱行。三調伏行。四寂靜行。佛弟子眾。唯行後三。故名妙行。",
    "嫉": "　　謂有一類。見他獲得恭敬供養尊重讚歎可愛五塵衣服飲食臥具醫藥及余資具。作是思惟。彼既已獲恭敬等事。而我不得。由此發生諸戚極戚。苦極苦。妒極妒。嫉極嫉。總名為嫉。",
    "嫉結": "　　嫉結者，謂耽著利養不耐他榮發起心妒，嫉結所繫故愛重利養不尊敬法，重利養故廣行不善不行諸善，由此能招未來世苦與苦相應。",
    "嫉結者": "　　嫉結者，謂耽著利養不耐他榮發起心妒，嫉結所繫故，愛重利養不尊敬法，重利養故，廣行不善不行諸善，由此能招未來世苦，與苦相應。",
    "學界": "　　謂學五蘊。是名學界。",
    "學處": "　　言學處耶。所言學者。謂於五處。未滿為滿。恆勤堅正。修習加行。故名為學。所言處者。即離殺等。是學所依。故名為處。又離殺等。即名為學。亦即名處。故名學處。",
    "安": "　　安者，止息身心麤重身心調暢為體，除遣一切障礙為業，除遣一切障礙者，謂由此勢力依止轉故。",
    "安立": "　　安立者，謂所緣境體非真實，唯安立故，由四種因知所緣境體非真實，謂相違識相故，無所緣境，識可得故不由功用，應無倒故隨三智轉故，由此道理能取體性亦非真實，三智者，謂自在智，觀察智無。\n　　遍知者，謂如實知相差別安立所緣境界。\n　　斷者，謂聲聞等及與大乘所得轉依，聲聞乘等所得轉依，雖於蘊界處所緣得解脫，然於彼不得自在，大乘所得轉依具得二種已說，所緣緣隨文決擇義。",
    "安立差別門": "　　安立差別門者，謂若處顯示四句等所問義，如無常經說，若正觀者一切觀色耶，設觀色者一切正觀耶。應作四句，初句，謂於受等四蘊無有常淨樂我顛倒增益，又觀彼為應知應斷。第二句，謂於色蘊有常淨樂我顛倒增益，又觀彼為不應知不應斷。第三句，謂於色蘊無有常淨樂我顛倒增益，又觀彼為應知應斷。第四句，謂於受等四蘊有常淨樂我顛倒增益，又觀彼為不應知不應斷。如因色作四句，如是因受等一切處應廣說乃至說言，若所作已辦者，一切自謂不受後有耶，設自謂不受後有者，一切所作已辦耶。此應作四句，初句，謂諸異生乃至命終恒行妙行。第二句，謂斷見者。第三句，謂無學。第四句，謂除上爾所相。",
    "定根": "　　謂依出家遠離所生善法。所起心住等住。近住安住。不散不亂。攝正等持。心一境性。是名定根。復次學定無學定。及一切善非學非無學定。皆名定根。",
    "定異": "　　定異者，謂於因果種種差別假立定異，因果種種差別者，謂可愛果妙行為因，不可愛果惡行為因，諸如是等種種因果展轉差別。",
    "定覺支": "　　謂世尊說。苾芻當知。我說依初靜慮。能盡諸漏。如是我說。依第二第三第四靜慮。空無邊處。識無邊處。無所有處。能盡諸漏。苾芻當知我依何故。作如是說。依初靜慮。能盡諸漏。謂有苾芻。先由如是諸行相狀。離欲惡不善法。有尋有伺。離生喜樂。初靜慮具足住。彼不思惟如是諸行相狀。但思惟彼所得所趣色受想行識。謂此諸法。如病如癰如箭惱害。無常苦空非我。彼於此法。深心厭患。怖畏遮止。然後攝心。置甘露界。思惟此界。寂靜微妙。捨一切依愛盡離染。永滅涅槃。如善射師。或彼弟子。先學近射泥團草人。後能遠射大堅固物。亦令破壞。苾芻亦爾。先由如是諸行相狀。離欲惡不善法。有尋有伺。離生喜樂。初靜慮具足住。彼不思惟如是諸行相狀。但思惟彼所得所趣色受想行識。謂此諸法。如病如癰。如箭惱害。無常苦空非我。彼於此法。深心厭患。怖畏遮止。然後攝心。置甘露界。思惟此界寂靜微妙。捨一切依愛盡離染。永滅涅槃。彼如是知如是見故。便從欲漏心得解脫。亦從有漏及無明漏。心得解脫。既解脫已。能自知見。我得解脫。我生已盡。梵行已立。所作已辦。不受後有。我依此故。作如是說。依初靜慮。能盡諸漏。如說依初靜慮能盡諸漏。說依第二第三第四靜慮。空無邊處。識無邊處。無所有處。能盡諸漏。隨所應亦爾。謂第二靜慮。應作是說。\n　　復有苾芻。先由如是諸行相狀。尋伺寂靜。內等淨心一趣性。無尋無伺。定生喜樂。第二靜慮具足住。彼不思惟如是諸行相狀。乃至廣說。乃至無所有處。應作是說。\n　　復有苾芻。先由如是諸行相狀。超一切種識無邊處。入無所有無所有處具足住。彼不思惟如是諸行相狀。但思惟彼所得所趣受想行識。乃至廣說。苾芻當知。乃至想定能辦如是所應作事。復有非想非非想處。及滅盡定。我說於彼修定苾芻。應數入出彼修如是七依定時。所有無漏作意相應。心住等住。乃至心一境性。總名為定。亦名定根。亦名定力。亦名定覺支。亦名正定。是聖出世無漏無取道隨行道俱有道隨轉。能正盡苦。作苦邊際。諸有學者如所見諸行。思惟觀察。令至究竟。於諸行中深見過患。於永涅槃深見功德。若阿羅漢。如解脫心。思惟觀察。令至究竟。所有無漏作意相應。心住等住。乃至心一境性。是名定覺支。",
    "害": "　　害者，瞋之一分無哀無悲無愍為體，損惱有情為業。",
    "害尋": "　　謂害相應諸心尋求遍尋求。乃至思惟分別。總名害尋。",
    "害界": "　　謂以手塊刀杖等物。隨一苦具。捶打有情。諸損等損害等害。瞋恚所起。能起苦事。總名害界。復次諸害及害相應受想行識並所等起身業語業。不相應行。總名害界。",
    "家家補特伽羅": "　　何等家家補特伽羅？謂即預流果，或於天上或於人中，從家至家得盡苦際。",
    "宿住隨念智力": "　　宿住隨念智力者，謂於一切種宿住隨念智無著無礙現行中，所有三摩地等。",
    "宿住隨念通": "　　宿住隨念通者，謂依止靜慮於隨念前際所行威德具足中若定若慧，餘如前說。隨念前際所行者，謂隨念過去生名字種族等展轉差別事。",
    "寂靜不寂靜苦": "　　云何寂靜不寂靜苦？謂即此為世間道離欲已種善根者。",
    "寂靜善": "　　何等寂靜善？謂永斷貪欲、永斷瞋恚、永斷愚癡、永斷一切煩惱。若想受滅，若有餘依涅槃界，若無餘依涅槃界，若無所住涅槃界。",
    "寂靜無記": "　　何等寂靜無記？謂色無色界諸煩惱等，由奢摩他所藏伏故。",
    "寂靜苦": "　　云何寂靜苦？謂即此已生順解脫分善根者。",
    "實有": "　　問蘊界處中云何實有？幾是實有？為何義故觀實有耶？答謂不待名言此餘根境是實有義，一切皆是實有，為捨執著實有我故，觀察實有，所以建立此三問者，為斷相事二愚及增益執故。云何實有者辯實有相為斷相愚？一切實有者為斷事愚，捨著實我者為斷增益執，如是餘處如理應知，不待名言根境者，謂不分別色受等名言而取自所取義，不待此餘根境者，謂不待此所餘義而覺自所覺境，非如於瓶等事要待名言及色香等方起瓶等覺。",
    "寶現觀": "　　寶現觀者，謂於佛證淨於法證淨於僧證淨，由佛聖弟子於三寶所已得決定證清淨信，謂薄伽梵是真正等覺者，法毘奈耶是真善妙說，聖弟子眾是真淨行者。",
    "尋": "　　尋者，或依思或依慧尋求意言令心麤為體，依思依慧者，於推度不推度位，如其依第追求行相意言分別。",
    "尋伺寂靜者，第二靜慮": "　　尋伺寂靜者。尋及伺。如前說第二靜慮。此二寂靜遍寂靜。近寂靜。空無所有。故名尋伺寂靜。內等淨者。云何內等淨？謂尋伺寂靜。故諸信信性。現前信性。隨順印可愛慕愛慕性。心澄心淨。總名內等淨。心一趣性者。云何心一趣性？謂尋伺寂靜故。心不散不亂不流。安住一境。故名心一趣性。無尋無伺者。謂第二靜慮。尋伺不可得不現行非有非等有。故名無尋無伺。定生喜樂者。云何定？謂尋伺寂靜者。心住等住。近住安住。不散不亂。攝止等持。心一境性。總名為定。云何喜？謂尋伺寂靜者。心欣極欣。廣說乃至。歡喜歡喜性。總名為喜。云何樂？謂尋伺寂靜者。已斷身重性心重性。廣說乃至。身調柔性。心調柔性。總名為樂。云何定生喜樂？謂前喜樂。因定依定。定所建立。由定勢力。起等起生等生。趣入出現。故說此名定生喜樂。第二者。謂此靜慮。順次數中。居第二故。復次此於九種次第定中。在第二故。靜慮者。謂在此定中。內等淨喜樂心一境性。總此四支。名第二靜慮。如有頌言。\n　　尋伺俱寂靜　　如雨息埃塵\n　　內淨心一趣　　觸菩提妙樂\n　　無尋伺有喜　　樂內淨及定\n　　名第二靜慮　　諸佛所稱譽\n　　在此定中。諸心意識。名第二靜慮。俱有之心。諸思等思。乃至造心意業。名第二靜慮。俱有意業。諸心勝解。已勝解。當勝解。名第二靜慮。俱有勝解。在此定中。若受若想。乃至若慧等。名第二靜慮。俱有諸法。如是諸法。亦得名為第二靜慮。此靜慮名。所依之義。具足及住。皆如前說。",
    "尋伺差別": "　　令心粗性是尋令。心細性是伺。此復如何。如打鐘時。粗聲暫發。細聲隨轉。粗聲喻尋。細聲喻伺。搖鈴扣缽。吹螺擊鼓。放箭震雷。粗細二聲為喻亦爾。又如眾鳥飛翔虛空。鼓翼踴身。方得隨意。鼓翼喻尋。踴身喻伺。是謂尋伺二相差別。",
    "對執理": "　　謂閑法律。固正斷者。此執理眾。聚集現前。同檢問時。名對執理。",
    "對大眾": "　　大眾有四。一剎帝利眾。二婆羅門眾。三居士眾。四沙門眾。此諸大眾。聚集現前。同檢問時。名對大眾。",
    "對平正": "　　平正有三。一村平正。二城平正。三國平正。此諸平正。聚集現前。同檢問時。名對平正。",
    "對治善": "　　何等對治善？謂厭壞對治、斷對治、持對治、遠分對治、伏對治、離繫對治、煩惱障對治、所知障對治。",
    "對治無記": "　　何等對治無記？謂如有一為治疾病得安樂故，以簡擇心好服醫藥。",
    "對治離欲": "　　何等對治離欲？謂由世間出世間道斷諸煩惱。",
    "對王家": "　　謂諸國王。及余宰輔。理公務者。彼若聚集。現前檢問。名對王家。",
    "對親族": "　　謂諸親族聚集現前。同檢問時。名對親族。",
    "差別": "　　何等差別故？謂識生差別故、內死生差別故、外穀等生差別故、成壞差別故、食持差別故、愛非愛趣分別差別故、清淨差別故、威德差別故，是差別義",
    "已具未具資糧": "　　已具未具資糧者，謂緣諦增上法為境，於諸諦中成就中品諦察法忍，成就中品順決擇分，已定生時。",
    "已具未具資糧補特伽羅": "　　已具未具資糧補特伽羅者，謂緣諦增上法為境，發起中品清信勝解，成就中品順解脫分，已定生時",
    "已具資糧": "　　已具資糧者，謂緣諦增上法為境，於諸諦中成就上品諦察法忍，成就上品順決擇分，即此生時。\n　　如是三種補特伽羅，由成就順解脫分順決擇分各三品故，約能引生順決擇分，及諦現觀如其次第。未定已定即此生時，於諦增上法清信勝相，是順解脫分，即於此法諦察法忍相，是順決擇分，如其次第信增上故，慧增上故。此中三品順決擇分者，謂除世第一法，由世第一法性唯一剎那必不相續，即此生時定入現觀非前位故，從下中品順解脫分順決擇分有可退義，此唯退現行非退習氣，已依涅槃先起善根者，不復新起故，依此下品順解脫分善根薄伽梵說，若有具世間增上品正見，雖經歷千生不墮三惡趣。",
    "已具資糧補特伽羅": "　　已具未具資糧補特伽羅者，謂緣諦增上法為境，發起中品清信勝解，成就中品順解脫分，已定生時。",
    "已生": "　　云何已生？幾是已生？為何義故觀已生耶？謂過去現在是已生義，一切一分是已生，為捨執著非常我故，觀察已生。又有二十四種已生，謂最初已生、相續已生、長養已生、依止已生、轉變已生、成熟已生、退墮已生、勝進已生、清淨已生、不清淨已生、運轉已生、有種已生、無種已生、影像自在示現已生、展轉已生、剎那壞已生、離會已生、異位已生、生死已生、成壞已生、先時已生、死時已生、中時已生、續時已生。最初已生者，謂初續生時。相續已生者，謂續生已後。長養已生者，謂由眠夢飲食梵行定為因，四種長養。依止已生者，謂內諸根。轉變已生者，謂能隨順生樂受等諸根變異。成熟已生者，謂於衰老位。退墮已生者，謂捨善趣生惡趣中。勝進已生者，謂與彼相違。清淨已生者，謂遊戲忘念意相憤怨，樂變化天，他化自在色無色界諸天，多放逸故，隨其所應，於所受用境及所住定自在而轉。不清淨已生者，謂彼所餘。運轉已生者，謂往來位。有種已生者，謂除阿羅漢最後蘊。無種已生者，謂最後蘊。影像自在示現已生者，謂所知事同分色，解脫所生色，及如來等色，如其次第。展轉已生者，謂前後生相續。剎那壞已生者，謂一一剎那諸行相。離會已生者，謂愛不愛於會離位，及心於有貪離貪等位。異位已生者，謂於羯邏藍等位。生死已生者，謂有情世間。成壞已生者，謂器世間。先時已生者，謂先時有。死時已生者，謂死有。中時已生者，謂中有。續時已生者，謂生有。",
    "已知根": "　　云何謂已見諦者？所有學慧慧根。及信勝解。見至身證。於四聖諦。已現觀。而現觀為斷余煩惱故。諸根轉。是名已知根。",
    "希法": "　　希法者，若於是處宣說聲聞諸大菩薩及如來等最極希有甚奇特法。",
    "廣大不寂靜苦": "　　云何廣大不寂靜苦？謂生欲界未曾積集諸善根者。",
    "建立": "　　建立者，有四種建立，謂支分建立、等至建立、品類建立、名想建立、於諸靜慮具四建立，諸無色中唯有，三種除支分。",
    "建立八無為": "　　如是建立八無為中，當知所依差別故，分析真如假立三種，不由自性故。善法真如者，謂無我性空性，無相實際，勝義法界。何故真如說名真如？由彼自性無變異故，謂一切時無我實性無改轉故說無變異，當知此則是無我性，離二我故。何故復說此名空性？一切雜染所不行故。所以者何？由緣此故能令一切諸雜染事悉皆空寂，雖復有時說有雜染，當知但是客塵煩惱之所染污。何等名為客塵染污？謂由未拔所取能取種子故，令依他性心二行相轉，非法性心，以諸法法性自性清淨故。何故復說此名無相？諸相寂靜故。諸相者，謂色受等乃至菩提，諸所戲論，真如性中彼相寂滅，故名無相。何故復說此名實際？無倒所緣故。實者，謂無顛倒，此處究竟故名為實際，過無我性更無所求故。何故復說此名勝義？最勝聖智所行處故。何故復說此名法界？一切聲聞獨覺諸佛妙法所依相故，如善法真如，當知不善法真如無記法真如亦爾。虛空者，謂無色性，容受一切所作業故。無色性者，謂唯違於色，無性相法意識境界，是名虛空。意識境界者，謂法界攝故，唯違色言，為別受等共有真如擇滅非擇滅無常性等，雖兔角等亦是無性，然彼不與諸法相違，以彼唯是畢竟無故。又兔角等非唯違色，由與受等諸法共故，是故唯說與色相違無性相言，為別受等無色之法。何以故？受等自體是有性相非無性相故。",
    "建立差別": "　　建立差別者，謂善修治諸佛淨土故。",
    "建立支業": "　　建立支業者，謂無明支有二種業：一令諸有情於有愚癡，二與行作緣。令諸有情於有愚癡者，謂由彼所覆於前中後際不如實知故，由此因緣起如是疑，我於過去世為有為無如是等。與行作緣者，由彼勢力令後有業得增長故。行有二種業：一令諸有情於諸趣中種種差別，二與識作緣。令諸有情於趣差別者，由業勢力令諸有情趣種種異趣故。與識作緣者，由習氣力能使當來名色等生起種子得增長故。識有二種業：一持諸有情所有業縛，二與名色作緣。持諸有情業縛者，與行所引習氣俱生滅故。與名色作緣者，由識入母胎名色得增長故。名色有二種業：一攝諸有情自體，二與六處作緣。攝有情自體者，由彼生已得預有情眾同分差別數故。與六處為緣者，由名色等前支為依止六處等後支得生起故。六處有二種業：一攝諸有情自體圓滿，二與觸作緣。攝諸有情體圓滿者，由彼生已餘根無缺故。觸有二種業：一令諸有情於所受用境界流轉，二與受作緣。令有情於境轉者，依此為門，受用順樂受等三種境界故。受有二種業：一令諸有情於所受用生果流轉，二與愛作緣。令有情於受用生果流轉者，由此為依受用種種可愛等業異熟故。與愛為緣者，悕求與此和合等為門，諸愛生故。愛有二種業：一引諸有情流轉生死，二與取作緣。引諸有情流轉生死者，由彼勢力生死流轉無斷絕故。與取作緣者，愛味求欲為門，於欲等中貪欲轉故。取有二種業：一為取後有令諸有情發有取識，二與有作緣。為取後有發有取識者，為那落迦趣等差別後有相續不斷，令業習氣得決定故。與有作緣者，由此勢力諸行習氣得轉變故。有有二種業：一令諸有情後有現前，二與生作緣。令後有現前者，能引無間餘趣故。與生作緣者，由此勢力餘眾同分轉故。生有二種業：一令諸有情名色六處觸受次第生起，二與老死作緣。令名色等次第起者，能引後後位差別故。與老死作緣者，由有此生彼相續變壞皆得有故。老死有二種業：一數令有情時分變異壞少盛故，二數令有情壽命變異壞壽命故。",
    "建立支緣": "　　建立支緣者，謂習氣故、引發故、思惟故、俱有故。建立支緣隨其所應，依四緣相建立支緣，且如無明望行，前生習氣故，得為因緣。由彼熏習相續所生諸業能造後有故，當於爾時現行無明能引發故，為等無間緣，由彼引發差別諸行流轉相續生故，思惟彼故，為所緣緣，以計最勝等不如理思惟緣愚癡位為境界故，彼俱有故，為增上緣。由彼增上力令相應思顛倒緣境而造作故，如是一切隨其所應盡當知。",
    "建立現觀": "　　建立現觀略有十種，謂法現觀、義現觀、真現觀、後現觀、寶現觀、不行現觀、究竟現觀、聲聞現觀、獨覺現觀、菩薩現觀。",
    "建立色蘊": "　　云何建立色蘊？謂諸所有色，若四大種及四大種所造。所造者，謂以四大種為生依立持養因義，即依五因說名為造。生因者即是起因謂離大種色不起故，依因者即是轉因謂捨大種諸所造色無有功能，據別處故，立因者即隨轉因，由大變異能依造色隨變異故，持因者即是住因，謂由大種諸所造色相似相續生，持令不絕故，養因者即是長因，謂由大種養彼造色令增長故。",
    "建立補特伽羅": "　　云何建立補特伽羅？略有七種，謂病行差別故，出離差別故，任持差別故，方便差別故，果差別故，界差別故，修行差別故，應知建立補特伽羅。",
    "引導": "　　言引導者。謂八支聖道。名為引導所以者何。以八支聖道習修多修習。能於苦集滅道。現觀能引能導能隨能逐。故佛正法名為引導。",
    "引攝善": "　　何等引攝善？謂施性福業事及戒性福業事故，引攝生天樂異熟，引攝生富貴家，引攝隨順清淨法。",
    "引攝無記": "　　何等引攝無記？謂如有一於工巧處串習故，於當來世復引攝如是相身，由此身故習工巧處速疾究竟。",
    "引發功德": "　　云何引發如是等功德？謂依止清淨四靜慮，若外道若聲聞若菩薩等，引發四無量五神通，多分依止邊際第四靜慮，若聲聞若菩薩若如來等引發所餘功德。何因引發如是功德？謂依止靜慮數數思惟，隨所建立法故，如是等功德略有二種，一現前發起自所作用，二安住自性，若現發起自所作用，以出世後所得世俗智為體，若安住自性，用出世智為體。",
    "引發如是等功德": "　　云何引發如是等功德？謂依止清淨四靜慮，若外道若聲聞若菩薩等，引發四無量五神通，多分依止邊際第四靜慮，若聲聞若菩薩若如來等引發所餘功德，何因引發如是功德？謂依止靜慮數數思惟，隨所建立法故。此中顯示如是等功德引發所依止，能引發補特伽羅，能引發方便。云何能引發方便？謂於隨所建立教法，以眾多作意定心，起數數思惟行相，如欲引發無量時依止靜慮，於慈俱心無恨無怨等教法，以修慧相應作意數數思惟，欲引發神通等時依止靜慮，於變一為多等教法，以修慧相應作意數數思惟，如是於一切處數數思惟，如所建立隨相應知。",
    "引發門": "　　引發門者，謂若處顯示一一句中宣說四句，是一一句復分四句，如是展轉無邊引發，如引佛經言。諸菩薩有四種淨修菩提法，一者善修空性，二者於諸眾生心無罣礙，三者常攝利益諸菩薩眾，四者以無染心廣開法施，如是四法於自利利他門淨修菩提，為欲對治四種所治障故，何等為四？一貪著定味，二瞋恚，三慢，四愛著利養。又有差別，初顯煩惱斷對治，餘顯遠離下劣乘，由諸菩薩三種因緣遠下劣乘，一攝受一切有情，二已入法者令成熟，三未入法者令入正法。又有差別，初顯智資糧，餘顯福資糧，此三差別者，攝受成熟令入三門，各能生長勝品福故。又由二緣差別，一由意樂，謂慈心俱，二由正行，謂說證教二行。又諸菩薩成就四法能修空性，一者於內心無動搖，二者信解擇力所持，三者於一切法如實通達，四者解脫一切障，如是四法顯修所依及修差別，以何為依？謂靜慮波羅蜜多。云何修差別？一由異生道，謂聞思力所持。二由學道，謂達諸法實性。三由無學道，謂脫一切障。又諸菩薩成就四法，於諸有情心無罣礙，一者修慈，二者不毀正行，三者不分別相，四者堪忍劬勞，如是四法顯所依及無罣礙心差別。誰為所依？謂過去生所修慈。云何無罣礙心差別？謂於住邪行所心無違毀，於怨家所不分別怨相，為利益他精勤無懈。又諸菩薩成就四法，常能攝益諸菩薩眾，一者不自稱量，二者正教誨轉，三者柔和易可共住，四者精勤承事供養，如是四法顯示所依及攝益差別，何等為依？謂摧伏憍慢。",
    "彼或為己": "　　謂有一類。身行劫盜。王等執問。汝為賊不。彼得問已。竊自思惟。若實答者。必為王等。或殺或縛。或復驅擯。或奪資財。我今宜應自隱自覆自藏實事。故以正知。說虛誑語。既思惟已。答王等言。我實不為不與取事。是名為己。",
    "律儀業": "　　復次業差別有三種，謂律儀業、不律儀業、非律儀非不律儀業。律儀業復有三種，謂別解脫律儀所攝、靜慮律儀所攝、無漏律儀所攝。",
    "後後開引門": "　　後後開引門者，謂若處顯示能為後後開引所依故，此諸法如是次第說，如信等五根先後次第，必先信受乃發精進發精進已然後念住，既念住已心得安定，心安定已方如實知，如是等。",
    "後現觀": "　　後現觀者，謂一切修道，由見道後一切世間出世間道皆名後現觀故。",
    "得": "　　得者，謂於善不善無記法。若增若減假立獲得成就，善不善無記法者，顯依處。若增若減者，顯自體。何以故？由有增故說名成就上品信等，由有減故說名成就下品信等。假立獲得成就者，顯假立，如是於餘隨其所應建立當知。",
    "得決擇": "　　云何得決擇？略說有二種，謂建立補特伽羅，建立現觀。前為能證，後是所證。補特伽羅雖非實有，由四種緣是故建立，謂言說易故，順世間故，離怖畏故，顯示自他具德失故。言說易者，若於無量色等差別無量差別相想法中，總合建立一假有情，即呼召往來等，種種言說遂不為難。順世間者，非諸世間，唯依法想而起言說，多分依有情想而起言說，是故聖者為化世間，必應同彼方便建立補特伽羅。離怖畏者，世間有情未會甚深緣起法性，若聞一切有情無我，便生怖畏不受正化，顯示自他具德失者，若離假立有情差別。唯說諸法染淨相者，是則一切無有差別，不可了知如是身中如此過失若斷未斷，如是身中如此功德若證未證，是故建立補特伽羅。",
    "得謂於善不善無記法": "　　何等為得謂於善不善無記法？若增若減假立獲得成就。",
    "復令修練根行": "　　復次若諸菩薩性是利根，云何復令修練根耶？謂令依利軟根引發利中根，復依利中根引發利利根故。前已說一切菩薩性是利根，而復說於時時中應修練根者，由於自種類復有軟等三品後後相引發故，說名練根，若異此者諸利根種性補特伽羅應根唯一品，諸菩薩等根品差別應不可得，然有可得，是故利根復有差別。",
    "循內受觀，受念住": "　　云何於此內受住循受觀？若具正勤正知正念。除世貪憂。內受者。謂自受。若在現相續中。已得不失於此內受。循受觀者。謂有苾芻。於此內受。觀察思惟內受諸相。\n　　受樂受時。如實知我受樂受。\n　　受苦受時。如實知我受苦受。\n　　受不苦不樂受時。如實知我受不苦不樂受。\n　　受樂身受時。如實知我受樂身受。\n　　受苦身受時。如實知我受苦身受。\n　　受不苦不樂身受時。如實知我受不苦不樂身受。\n　　受樂心受時。如實知我受樂心受。\n　　受苦心受時。如實知我受苦心受。\n　　受不苦不樂心受時。如實知我受不苦不樂心受。\n　　受樂有味受時。如實知我受樂有味受。\n　　受苦有味受時。如實知我受苦有味受。\n　　受不苦不樂有味受時。如實知我受不苦不樂有味受。\n　　受樂無味受時。如實知我受樂無味受。\n　　受苦無味受時。如實知我受苦無味受。\n　　受不苦不樂無味受時。如實知我受不苦不樂無味受。\n　　受樂耽嗜依受時。如實知我受樂耽嗜依受。\n　　受苦耽嗜依受時。如實知我受苦耽嗜依受。\n　　受不苦不樂耽嗜依受時。如實知我受不苦不樂耽嗜依受。\n　　受樂出離依受時。如實知我受樂出離依受。\n　　受苦出離依受時。如實知我受苦出離依受。\n　　受不苦不樂出離依受時。如實知我受不苦不樂出離依受。\n　　如是思惟內受相時。所起於法簡擇乃至毘缽舍那。是循內受觀。亦名受念住。成就此觀現行隨行。乃至解行。說名為住。\n　　復有苾芻。於內諸受。觀察思惟。多諸過患。謂此諸受。如病如癰。廣說乃至是變壞法。如是思惟受過患時。所起於法簡擇。乃至毘缽舍那。是循內受觀。亦名受念住。住具正勤正知正念。除世貪憂。皆如前說。\n　　云何於彼外受？住循受觀。若具正勤正知正念。除世貪憂。外受者。謂自受。若在現相續中。未得已失。及他有情所有諸受。於彼外受。循受觀者。謂有苾芻。於他諸受。觀察思惟外受諸相。\n　　受樂受時。如實知彼受樂受。\n　　受苦受時。如實知彼受苦受。\n　　受不苦不樂受時。如實知彼受不苦不樂受。\n　　廣說乃至受樂出離依受時。如實知彼受樂出離依受。\n　　受苦出離依受時。如實知彼受苦出離依受。\n　　受不苦不樂出離依受時。如實知彼受不苦不樂出離依受。\n　　如是思惟外受相時。所起於法簡擇。乃至毘缽舍那。是循外受觀。亦名受念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　復有苾芻。於外諸受。觀察思惟。多諸過患。謂彼諸受。如病如癰。廣說乃至是變壞法。如是思惟受過患時。所起於法簡擇。乃至毘缽舍那。是循外受觀。亦名受念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　云何於內外受？住循受觀。若具正勤正知正念。除世貪憂。內受者。謂自受。若在現相續中。已得不失。外受者。謂自受。若在現相續中。未得已失。及他有情所有諸受。合說二種。名內外受。於內外受。循受觀者。謂有苾芻合自他受。總為一聚。觀察思惟自他受相。\n　　受樂受時。如實知受樂受。\n　　受苦受時。如實知受苦受。\n　　受不苦不樂受時。如實知受不苦不樂受。\n　　廣說乃至。受樂出離依受時。如實知受樂出離依受。\n　　受苦出離依受時。如實知受苦出離依受。\n　　受不苦不樂出離依受時。如實知受不苦不樂出離依受。\n　　如是思惟諸受相時。所有於法簡擇。乃至毘缽舍那。是循內外受觀。亦名受念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　復有苾芻。合自他受。總為一聚。觀察思惟諸受過患。謂此彼受。如病如癰。廣說乃至是變壞法。如是思惟受過患時。所起於法簡擇。乃至毘缽舍那。是循內外受觀。亦名受念住。住具正勤正知正念。除世貪憂。亦如前說。",
    "循內外身觀，身念住": "　　復有苾芻。於此內身。觀察思惟諸界差別。謂此身中。唯有種種地界水界火界風界空界識界。如是思惟諸界相時。所起於法簡擇。乃至毘缽舍那。是循內身觀。亦名身念住。住具正勤正知正念。除世貪憂。皆如前說。\n　　復有苾芻。於此內身。觀察思惟多諸過患。謂此身者。如病如癰。如箭惱害。無常苦空非我轉動。勞疲羸篤。是失壞法。迅速不停衰朽非恆。不可保信。是變壞法。如是思惟身過患時。所起於法簡擇。乃至毘缽舍那。是循內身觀。亦名身念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　外身者。謂自身。若在現相續中未得已失。及他有情所有身相。於彼外身。循身觀者。謂有苾芻。於他身內。從足至頂。隨其處所。觀察思惟。種種不淨。穢惡充滿。謂彼身中。唯有種種發毛爪齒。廣說乃至。大小便利。如是思惟不淨相時。所起於法簡擇。乃至毘缽舍那。是循外身觀。亦名身念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　惟不淨相時。所起於法簡擇。乃至毘缽舍那。是循外身觀。亦名身念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　復有苾芻。於他身內。觀察思惟諸界差別。謂彼身中。唯有種種地界水界火界風界空界識界。如是思惟諸界相時。所起於法簡擇。乃至毘缽舍那。是循外身觀。亦名身念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　復有苾芻。於他身內。觀察思惟多諸過患。謂彼身者。如病如癰。廣說乃至。是變壞法。如是思惟身過患時。所起於法簡擇。乃至毘缽舍那。是循外身觀。亦名身念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　云何於內外身？住循身觀。若具正勤正知正念。除世貪憂。內身者。謂自身。若在現相續中。已得不失。外身者。謂自身。若在現相續中。未得已失。及他有情所有身相。合說二種。名內外身。於內外身。循身觀者。謂有苾芻。合自他身。總為一聚。從足至頂。隨其處所。觀察思惟。種種不淨。穢惡充滿。謂此彼身。唯有種種發毛爪齒。廣說乃至大小便利。如是思惟不淨相時。所起於法簡擇。乃至毘缽舍那。是循內外身觀。亦名身念住住具正勤正知正念。除世貪憂。亦如前說。\n　　復有苾芻。合自他身。總為一聚。觀察思惟諸界差別。謂此彼身。唯有種種地界水界火界風界空界識界。如是思惟諸界相時。所起於法簡擇。乃至毘缽舍那。是循內外身觀。亦名身念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　復有苾芻。合自他身。總為一聚。觀察思惟。多諸過患。謂此彼身。如病如癰。廣說乃至是變壞法。如是思惟身過患時。所起於法簡擇。乃至毘缽舍那。是循內外身觀。亦名身念住。住具正勤正知正念。除世貪憂。亦如前說。",
    "循內心觀，亦名心念住": "　　云何於此內心住循心觀？若具正勤正知正念。除世貪憂。內心者。謂自心。若在現相續中。已得不失。於此內心。循心觀者。謂有苾芻。於此內心。觀察思惟內心諸相。\n　　於內有貪心。如實知是內有貪心。\n　　於內離貪心。如實知是內離貪心。\n　　於內有嗔心。如實知是內有嗔心。\n　　於內離嗔心。如實知是內離嗔心。\n　　於內有癡心。如實知是內有癡心。\n　　於內離癡心。如實知是內離癡心。\n　　於內聚心。如實知是內聚心。\n　　於內散心。如實知是內散心。\n　　於內沉心。如實知是內沉心。\n　　於內策心。如實知是內策心。\n　　於內小心。如實知是內小心。\n　　於內大心。如實知是內大心。\n　　於內掉心。如實知是內掉心。\n　　於內不掉心。如實知是內不掉心。\n　　於內不靜心。如實知是內不靜心。\n　　於內靜心。如實知是內靜心。\n　　於內不定心。如實知是內不定心。\n　　於內定心。如實知是內定心。\n　　於內不修心。如實知是內不修心。\n　　於內修心。如實知是內修心。\n　　於內不解脫心。如實知是內不解脫心。\n　　於內解脫心。如實知是內解脫心。\n　　如是思惟內心相時。所有於法簡擇。乃至毘缽舍那。是循內心觀。亦名心念住。\n　　復有苾芻。於內諸心。觀察思惟多諸過患。謂此心者。如病如癰。廣說乃至是變壞法。如是思惟心過患時。所起於法簡擇。乃至毘缽舍那。是循內心觀。亦名心念住。住具正勤正知正念。除世貪憂。皆如前說。\n　　云何於彼外心？住循心觀。若具正勤正知正念。除世貪憂。外心者。謂自心。若在現相續中。未得已失。及他有情所有諸心。於彼外心。循心觀者。謂有苾芻。於他諸心。觀察思惟外心諸相。於外有貪心。如實知是外有貪心。廣說乃至。於外解脫心。如實知是外解脫心。如是思惟外心相時。所起於法簡擇。乃至毘缽舍那。是循外心觀。亦名心念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　復有苾芻。於外諸心。觀察思惟多諸過患。謂彼心者。如病如癰。廣說乃至是變壞法。如是思惟心過患時。所起於法簡擇。乃至毘缽舍那。是循外心觀。亦名心念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　云何於內外心？住循心觀。若具正勤正知正念。除世貪憂。內心者。謂自心。若在現相續中。已得不失。外心者。謂自心。若在現相續中。未得已失。及他有情所有諸心。合此二種。名內外心。於內外心。循心觀者。謂有苾芻。合自他心。總為一聚。觀察思惟自他心相。於有貪心。如實知是有貪心。廣說乃至於解脫心。如實知是解脫心。如是思惟諸心相時。所有於法簡擇。乃至毘缽舍那。是循內外心觀。亦名心念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　復有苾芻。合自他心。總為一聚。觀察思惟多諸過患。謂此彼心。如病如癰。廣說乃至。是變壞法。如是思惟心過患時。所起於法簡擇。乃至毘缽舍那。是循內外心觀。亦名心念住。住具正勤正知正念。除世貪憂亦如前說。",
    "微薄不寂靜苦": "　　云何微薄不寂靜苦？謂生無色界遠離順解脫分者。",
    "微薄寂靜苦": "　　云何微薄寂靜苦？謂諸有學。",
    "心": "　　心者，謂蘊界處習氣所熏，一切種子阿賴耶識，亦名異熟識，亦名阿陀那識，以能積集諸習氣故。習氣者，謂由現行蘊等令彼種子皆得增益，一切種子識者，謂能生蘊等諸法種子所積集故。阿賴耶識者，謂能攝藏諸法種子故，又諸有情取為我故，異熟識者，先業所生故。阿陀那識者，謂能數數令生相續，持諸根等令不壞故。又言心者，謂能積集一切法習氣故。\n　　云何知有阿賴耶識？若無此識，執受初明了種子業身受無心定命終無，皆不應理，釋此伽他，如攝決擇分說，由八種相，證阿賴耶識決定是有，謂若離阿賴耶識依止執受不可得故，最初生起不可得故，明了生起不可得故，種子體性不可得故，業用體性不可得故，身受體性不可得故，處無心定不可得故，命終之識不可得故。云何依止執受不可得耶？由五因故，謂阿賴耶識先行因感眼等，轉識現緣因發，如說根境作意力故諸轉識生，乃至廣說，是名初因。又六識身善惡可得，是第二因。又六識身一類異熟無記性攝必不可得，是第三因。又六識身各別依轉，隨所依止彼識生時，即應彼識執所依止，餘無執受不應道理，設許執受亦不應理，以離識故，是第四因。又所依止應成數數執受過失，所以者何？由彼眼識於一時轉一時不轉，餘識亦爾，是第五因。\n　　云何最初生起不可得耶？謂設有難言，若有阿賴耶識，應一有情二識俱起，應告彼曰：汝於非過妄生過想，容有二識俱時轉故。所以者何？猶如有一俱時欲見乃至欲識，隨有一識，最初生起不應道理。何以故？爾時作意無有差別，根及境界不壞現前，何因緣故識不俱轉。\n　　云何明了生起不可得耶？謂若有定執識不俱生，與眼等識俱行一境，明了意識應不可得。所以者何？若時隨憶曾所受境，爾時意識不明了生，非於現境所生意識，得有如是不明了相，是故應信諸識俱轉，或應許彼第六意識無明了性。\n　　云何種子體性不可得耶？謂六轉識身各各異故。所以者何？此六轉識從善無間不善性生，不善無間善性復生，從二無間無記性生，下界無間中界生，中界無間妙界生，妙界無間乃至下界生，有漏無間無漏生，無漏無間有漏生世間無間出世生，出世無間世間生，非如是相識為種子體應正道理。又心相續長時間斷經久流轉不息，是故轉識能持種子不應道理。云何業用不可得耶？謂若無諸識同時生，起業用俱轉不應道理。所以者何？略說識業有四種，謂了別外器，了別依止，能了別我，了別境界。如是四種識了別業，一一剎那俱現可得，非於一識一剎那中有如是等差別業用，是故必有諸識俱起。\n　　云何身受體性不可得耶？謂如有一，或如理思，或不如理思，或不思惟，或復推尋，若心在定若不在定，身受生起非一眾多，若無阿賴耶識如是身受應不可得，既現可得，是故定有阿賴耶識。\n　　云何處無心定不可得耶？如世尊說，入無想定及滅盡定，當知爾時識不離身，若無阿賴耶識，爾時識應離身，識若離身便應捨命，非謂處定。\n　　云何命終之識不可得耶？謂臨命終時識漸捨離所依身分，發起冷觸或上或下，非彼意識有時不轉。故知唯有阿賴耶識，能執持身隨於身分，若捨此識冷觸可得身無覺受，意識不然。是故若無阿賴耶識，命終之識必不可得。",
    "心三摩地勝行成就神足者": "　　云何心？云何三摩地？云何勝？云何勝行？而名心三摩地勝行成就神足耶。此中心者。謂依出家遠離所生善法。所起心意識。是名心。三摩地者。謂心增上所起。心住等住。近住安住。不散不亂。攝止等持。心一境性。是名三摩地。勝者。謂心增上所起八支聖道。是名勝。勝行者。謂有苾芻。依過去心得三摩地。是謂心三摩地。彼成就心三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說心三摩地。總名心三摩地勝行成就神足。\n　　復有苾芻。於諸善法住下羸劣弱極弱心。彼作是念。我今不應於諸善法住下羸劣弱極弱心然。我理應於諸善法安住不下不羸不劣不弱不極弱心。彼由此心增上力故。得三摩地。是謂心三摩地。彼成就心三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說心三摩地。總名心三摩地勝行成就神足。\n　　復有苾芻。生起噁心。彼作是念。我今不應生起噁心。然我理應斷除噁心修集善心。彼由此心增上力故。得三摩地。是謂心三摩地。彼成就心三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說。心三摩地總名心三摩地勝行成就神足。\n　　復有苾芻。生起貪瞋癡俱行噁心。彼作是念。我今不應生起貪瞋癡俱行噁心。然我理應斷除貪瞋癡俱行噁心修集無貪無嗔無癡俱行善心。彼由此心增上力故。得三摩地。是謂心三摩地。彼成就心三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行及前所說心三摩地。總名心三摩地勝行成就神足。\n　　復有苾芻。生起不離貪瞋癡噁心。彼作是念。我今不應生起不離貪瞋癡噁心。然我理應斷除不離貪瞋癡噁心修集離貪瞋癡善心。彼由此心增上力故。得三摩地。是謂心三摩地。彼成就心三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說心三摩地。總名心三摩地勝行成就神足。\n　　復有苾芻。於諸善法安住不下乃至不極弱心。彼作是念。我於善法安住不下乃至不極弱心。甚為應理。彼由此心增上力故。得三摩地。是謂心三摩地。彼成就心三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說心三摩地。總名心三摩地勝行成就神足。\n　　復有苾芻。生起善心。彼作是念。我今生起如是善心。甚為應理。彼由此心增上力故。得三摩地。是謂心三摩地。彼成就心三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說心三摩地。總名心三摩地勝行成就神足。\n　　復有苾芻。生起無貪無嗔無癡俱行善心。彼作是念。我今生起無貪無嗔無癡俱行善心。甚為應理。彼由此心增上力故。得三摩地。是謂心三摩地。彼成就心三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說心三摩地。總名心三摩地勝行成就神足。\n　　復有苾芻。生起離貪瞋癡善心。彼作是念。我今生起離貪瞋癡善心。甚為應理。彼由此心增上力故。得三摩地。是謂心三摩地。彼成就心三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說心三摩地。總名心三摩地勝行成就神足。一切心三摩地。皆從心起。是心所集。是心種類。是心所生。故名心三摩地勝行成就神足。",
    "心不相應行": "　　何等名為心不相應行？謂得無想定滅盡定無想異熟命根眾同分生老住無常名身句身文身異生性流轉定異相應勢速次第時方數和合等。如是心不相應行，應以五門建立差別，謂依處故、自體故、假立故、作意故、地故。二無心定具足五門，無想天異熟除作意，餘唯初三。",
    "心差別通": "　　心差別通者，謂依止靜慮於入他有情心行差別威德具足中，若定若慧，餘如前說。入他有情心行差別者，謂如實知有貪等心行差別。",
    "心昧劣性": "　　謂心惛昧劣弱卷局。總名心昧劣性。",
    "心生": "　　問為一切心無間一切心生耶？為有各別決定耶？答有，今於此中若廣別說如是心無間如是心生者，便生無量言論，是故唯應略總建立心生起相，謂諸心生起由十種力，一由串習力，二由樂欲力，三由方便力，四由等至力，五由引發力，六由因力，七由境界力，八由憶念力，九由作意力，十由相續力。\n　　串習力者復有三種，謂下中上品，若於諸定入住出相，未了達故是下品，雖已了達未善串習故是中品，既了達已復善習故是上品。若有下品串習力者，於諸靜慮諸無色定唯能次第入，若有中品串習力者，亦能超越入，唯能方便超越一間，若有上品串習力者，隨其所欲或超一切，若順若逆入諸等至。\n　　樂欲力者，謂已得第二靜慮者入初靜慮已，若欲以第二靜慮地心出，或欲以欲界善及無覆無記心出，即能現前而出於定，如是廣說，餘一切地如理當知。\n　　方便力者，謂初修行者唯欲界善心無間色界心生，未至定善心無間初根本靜慮心生，初根本靜慮善心無間第二靜慮地心生。如是廣說，乃至有頂皆如理知。\n　　等至力者，謂已入清淨三摩鉢底，或時還生清淨等至，或時生染。引發力者，謂從三摩地起乃至現行定地心，與不定剎那心間雜隨轉，乃至由彼相違煩惱現行故，即便退失，此相違煩惱相應心，復由因等四力方得現行。\n　　因力者，謂先以積習能退障故決定應退。\n　　境界力者，謂淨相勢力增上境界現前故，能隨順生貪等煩惱。\n　　憶念力者，謂憶念分別過去境界而生戲論。\n　　作意力者，謂由觀察作意思惟種種淨妙相貌。",
    "忍波羅蜜多相": "　　云何忍波羅蜜多相？謂諸菩薩安住菩薩法性菩提心為依止，以悲導心堪忍安受諸怨苦時所有身語意業。",
    "忘念": "　　忘念者，煩惱相應念為體，散亂所依為業。",
    "念": "　　念者，於串習事令心明記不忘為體，不散亂為業，串習事者，謂先所受，不散亂業者，由念於境明記憶故令心不散。",
    "念住": "　　念住者，即諸如來三不共念住謂御大眾時於一切種煩惱不現行具足中，若定若慧，廣說如前。何等為三念住？所謂大師哀愍一切，欲求義利起大悲心，為諸弟子宣說法要，告諸比丘，汝等當知，此能利益，此能安樂，此能利益安樂。爾時若有諸弟子眾恭敬聽聞，聞已諦受住奉教心，精進修行法隨法行，如來於彼不生歡喜心不踊躍，但起大捨住念正知，隨諸聖眾所應修習教誡教授，是名初不去念住\n　　又復大師哀愍一切，欲求義利起大悲心，為諸弟子宣說法要，乃至此能利益安樂。爾時若有諸弟子眾不恭敬聽聞，乃至不精進修行法隨法行，如來於彼不生恚恨，不捨保任心無悵恨，但起大捨，乃至廣說，是名第二不共念住。\n　　又復大師哀愍一切，欲求義利起大悲心，為諸弟子宣說法要，乃至此能利益安樂。爾時一分弟子恭敬聽聞，乃至精進修行法隨法行，一分弟子不恭敬聽聞，乃至不精進修行法隨法行，如來於彼不生歡喜，乃至心不悵恨，如是三念住，顯大師御眾時隨其次第，於一切種愛恚俱煩惱并習氣不現行具足中，所有定慧等為體。\n　　念住作何業？謂能不染污攝御大眾，由於恭敬聽聞等無愛恚等諸煩惱故。",
    "念根": "　　謂依出家遠離所生善法。所起諸念隨念。專念憶念。不忘不失。不遺不漏。不失法性。心明記性。是名念根。復次學念無學念。及一切善非學非無學念。皆名念根。",
    "念覺支": "　　謂世尊說。若聖弟子。於此內身。住循身觀。若具正勤正知正念。除世貪憂。於彼外身。住循身觀。若具正勤正知正念。除世貪憂。於內外身。住循身觀。若具正勤正知正念。除世貪憂。於內外俱受心法三。廣說亦爾。修習如是四念住時。所有無漏作意相應。諸念隨念。專念憶念。不忘不失。不遺不漏。不失法性。心明記性。總名為念。亦名念根。亦名念力。亦名念覺支。亦名正念。是聖出世無漏無取道隨行道俱有道隨轉。能正盡苦。作苦邊際。諸有學者如所見諸行思惟觀察。令至究竟。於諸行中深見過患。於永涅槃深見功德。若阿羅漢。如解脫心。思惟觀察。令至究竟。所有無漏作意相應。諸念隨念。乃至心明記性。是名念覺支。",
    "忿": "　　忿者，依止現前不饒益相瞋之一分，心怒為體，執仗憤發所依為業，當知忿等是假建立，離瞋等外無別性故。",
    "思": "　　思者，於心造作意業為體，於善不善無記品中役心為業，於心造作意業為體者，此辯其相，於善等品中役心為業者，此辯其業，以於所作善等法中發起心故。",
    "思法阿羅漢": "　　思法阿羅漢者，謂鈍根性若遊散若不遊散，若不思惟即可退失現法樂住，若思惟已能不退失。",
    "怨憎會苦": "　　云何怨憎會苦？怨憎會。謂諸有情等。不可愛。不可樂。不可喜。不可意。而與彼俱。一處為伴。不別不異。不離不散。聚集和合。總名怨憎會何因緣故。說怨憎會為苦。謂諸有情。怨憎會時。領納攝受種種身苦事故。廣說乃至領納攝受種種身心燒然事故。說彼為苦。\n　　復次怨憎會時。受二種苦。一者苦苦。二者行苦。故名怨憎會苦。",
    "恒食人所吐　　是最上丈夫": "　　今此頌中宣說世間極下劣義，所有文字轉變密顯餘最上義，世間下劣凡有四種，謂意業下劣、身業下劣、語業下劣、受用下劣。意業下劣復有二種，一者不信善生相違，不信有後世等，不行施等故。二不知恩順生不善，不顧往恩違越世理，起害母等所有惡行故。身業下劣者，謂行竊盜攻牆密處最可輕賤，活命業故。語業下劣者，謂妄語等最可輕賤，於善眾中所不容故。受用下劣者，謂鬼犬鳥等好食所吐故，顯此義者名說世間極下劣義文字。云何轉此文字顯無上義？謂不信等言轉變密顯餘勝義故。不信者，謂解脫智見，自現證故。不知恩者，謂涅槃智，有為名恩，無為非恩，知非恩故，名不知恩。斷密者，謂永斷後有續因煩惱故。無容處者，謂於當來諸趣苦處不復生故。食吐者，謂於現法中雖假資具力暫持身，而於命財不生欣樂故，若能如是，是最上丈夫。又如經說：\n　　覺不堅為堅　　善住於顛倒",
    "恚尋": "　　謂瞋恚相應諸心尋求遍尋求。乃至思惟分別。總名恚尋。",
    "恚界": "　　謂於有情。欲為損害。乃至現為過患。總名恚界。復次瞋恚及瞋恚相應受想行識。並所等起身業語業。不相應行。總名恚界。",
    "恚結": "　　恚結者，謂於有情苦及順苦法心有損害，恚結所繫故，於恚境相心不棄捨，不棄捨故廣行不善不行諸善，由此能招未來世苦與苦相應。",
    "恚結者": "　　恚結者，謂於有情苦及順苦法心有損害，恚結所繫故。於恚境相心不棄捨，不棄捨故廣行不善不行諸善，由此能招未來世苦，與苦相應。",
    "恨": "　　恨者，自此已後即瞋一分，懷怨不捨為體，不忍所依為業自此後者，謂從忿後，不忍者，謂不堪忍不饒益事。",
    "悲": "　　云何為悲？謂有一類。作是思惟。願諸有情。皆得離苦。彼依出家。或依遠離。由思擇力。內所發起。色界定善。諸悲悲性。若惻愴惻愴性。若酸楚酸楚性。總名為悲。復次與悲相應受想行識。及所等起身語二業。不相應行。亦名為悲。\n　　復次悲心定。有二種一狹小。二無量。云何狹小悲心定加行？修何加行。入狹小悲心定。謂有一類。於諸可愛可樂可喜可意有情。謂父母兄弟姊妹。及余隨一。親屬朋友。彼於如是狹小有情。令狹小悲俱心住等住近住安住調伏寂靜最極寂靜一趣等持。願彼有情。皆得離苦。\n　　彼於爾時。若心散亂。馳流余境不能一趣。不能守念令住一緣。而願狹小有情離苦。齊此不名狹小悲心定加行。亦未名入狹小悲心定。彼若爾時。攝錄自心。令不散亂。馳流余境。能令一趣住念一緣。思惟狹小諸有情相。而願狹小有情離苦。如是思惟。發勤精進。乃至勵意不息。是名狹小悲心定加行。亦名入狹小悲心定。\n　　彼於此道。生已修習。多修習故。便令心住等住近住安住一趣等持無二無退。願彼狹小有情離苦。齊此名為已入狹小悲心定。又此定中。諸心意識。名狹小悲俱有心。諸思等思。乃至造心意業。名狹小悲俱有意業。諸心勝解。已勝解。當勝解。名狹小悲俱有勝解。\n　　又此定中。若受若想。乃至若慧等。名狹小悲俱有諸法。如是諸法。亦得名狹小悲心定加行。亦名入狹小悲心定。云何無量悲心定加行？修何加行。入無量悲心定。謂即於狹小悲心定。數數修習。令心隨順調伏寂靜。數復調練。令其質直柔軟堪能。與後勝定作所依止。然後漸令勝解徧滿。於東方等無量有情。皆願離苦。彼於爾時。若心散亂。馳流余境。不能一趣。不能守念。令住一緣。而願無量有情離苦。齊此未名無量悲心定加行。亦未名入無量悲心定。\n　　彼若爾時。攝錄自心。令不散亂。馳流余境。能令一趣。住念一緣。思惟無量諸有情相。而願無量有情離苦。如是思惟。發勤精進。乃至勵意不息。是名無量悲心定加行。亦名入無量悲心定。\n　　彼於此道。生已修習。多修習故。便令心住等住近住安住一趣等持無二無退。願彼無量有情離苦。齊此名為已入無量悲心定。又此定中。諸心意識。名無量悲俱有心。諸思等思。乃至造心意業。名無量悲俱有意業。諸心勝解。已勝解。當勝解。名無量悲俱有勝解。又此定中。若受若想。乃至若慧等。名無量悲俱有諸法。如是諸法亦得名無量悲心定加行。亦名入無量悲心定。",
    "惛沈": "　　謂身重性。心重性。乃至憕瞢憒悶。總名惛沈。",
    "惛沉睡眠蓋": "　　云何惛沉睡眠蓋？謂身重性。心重性。身無堪任性。心無堪任性。身惛沈性。心惛沈性。憕瞢憒悶。總名惛沈。染污心品。所有眠夢。不能任持。心昧略性。總名睡眠。如是所說。惛沉睡眠。覆心蔽心。乃至裡心蓋心。故名為蓋。蓋即惛沉睡眠。故名惛沉睡眠蓋。",
    "惡不善法": "　　云何惡不善法？謂五蓋。即貪慾蓋。瞋恚蓋。惛沉睡眠蓋。掉舉惡作蓋。疑蓋。\n　　云何貪慾蓋？謂於諸欲諸貪。等貪執藏。防護堅著。愛樂迷悶。耽嗜遍耽嗜。內縛悕求。耽湎苦集。貪類貪生。總名貪慾。如是貪慾。覆心蔽心。障心纏心。隱心映心。裡心蓋心。故名為蓋。蓋即貪慾。故名貪慾蓋。\n　　云何瞋恚蓋？謂於有情。欲為損害內懷栽杌。欲為擾惱。已瞋恚。當瞋恚。現瞋恚。樂為過患。極為過患。意極憤恚。於諸有情。各相違戾。欲為過患。已為過患。當為過患。現為過患。總名瞋恚。如是瞋恚。覆心蔽心。乃至裡心蓋心。故名為蓋。蓋即瞋恚。故名瞋恚蓋。\n　　云何惛沉睡眠蓋？謂身重性。心重性。身無堪任性。心無堪任性。身惛沈性。心惛沈性。憕瞢憒悶。總名惛沈。染污心品。所有眠夢。不能任持。心昧略性。總名睡眠。如是所說。惛沉睡眠。覆心蔽心。乃至裡心蓋心。故名為蓋。蓋即惛沉睡眠。故名惛沉睡眠蓋。\n　　云何掉舉惡作蓋？謂心不寂靜掉舉等掉舉心掉舉性。總名掉舉。染污心品所有心變心懊心悔我惡作惡作性。總名惡作。如是所說掉舉惡作。覆心蔽心。乃至裡心蓋心。總名為蓋。蓋即掉舉惡作故。名掉舉惡作蓋。云何疑蓋？謂於佛法僧。及苦集滅道。生起疑惑。二分二路。猶豫疑箭。不決定。不究竟。不審決。非已一趣。非當一趣。非現一趣。總說為疑。如是疑性。覆心蔽心。乃至裡心蓋心。故名為蓋。蓋即是疑。故名疑蓋。云何離惡不善法？謂於如是惡不善法。遠離極遠離。空不可得。故名離惡不善法。\n　　云何離惡不善法？謂於如是惡不善法。遠離極遠離。空不可得。故名離惡不善法。",
    "惡作": "　　惡作者，依樂作不樂作應作不應作，是愚癡分心追悔為體，或善或不善或無記，或時或非時，或應爾或不應爾。能障心住為業樂作者，樂欲為先造善惡行。不樂作者，由他勢力及諸煩惱之所驅逼，令有所作如其所應，愚癡分者隨煩惱所攝。時者，乃至未出離，非時者，出離已後，應爾者，於是處，不應爾者，於非處。",
    "惡欲": "　　謂有一類。實不誦持經律對法。廣說乃至。實非證得八解脫者。而欲令他知已實是誦持經律對法等者。因斯而得供養恭敬尊重讚歎。為作依怙。又自實無出家遠離所生善法。而為他人。宣說開示顯己證得。如斯等類。總名惡欲。",
    "惡行": "　　惡行有三，謂貪、瞋、癡。由依止貪瞋癡故，恒行身語意惡行，故名惡行。由貪瞋癡能引殺生等諸不善行故，又即依此貪瞋癡門，廣生無量惡不善行故，建立三不善根，所以者何？以諸有情愛味世間，所有為因行諸惡行貪求財利，行惡行故分別世間，怨相為因行諸惡行，由懷瞋恚不忍他過多行惡故執著世間，邪法為因行諸惡行，由懷愚癡起顛倒見，因祠祀等行諸惡故，是故此貪瞋癡亦名惡行，亦名不善根。",
    "惡貪": "　　謂於他財物及所攝受。起貪等貪。執藏防護。堅著愛染。是名惡貪。復有惡貪規他生命。貪皮角等。飲血啖肉。如是二種。總名惡貪。",
    "惱": "　　謂有一類。於僧等中。因法非法。而興斗訟。諸苾芻等為和息故。勸諫教誨。而固不受。此不受勸諫性。不受教誨性。極執性。極取性。左取性。不右取性。難勸捨性。拙應對性。師子執性。心蛆螫性。心佷戾性。總名為惱。",
    "想受滅": "　　想受滅者，謂已離無所有處欲，止息想作意為先故，諸不恒行心心法，及恒行一分心心法滅。無為。\n　　當知。此中有二種應斷法，謂諸煩惱及此所依受，受有二種，謂變異及不變異，如其次第苦樂非苦樂當知煩惱斷故，建立擇滅二受斷故，如其次第建立不動及受想滅。煩惱斷者。謂除此品麤重所得轉依。受斷者，謂除此能治定障所得轉依，是故得第二靜慮時，雖證苦滅而不建立無為，以變異受未盡斷故，又若五種色若受想行蘊，及此所說八無為法，如是十六總名法界。",
    "想受滅解脫": "　　云何想受滅解脫？謂依止非想非非想處解脫，超過諸餘寂靜解脫，住於似真解脫具足住中心心法滅，為解脫想受滅障。此顯想受滅解脫，以非想非非想處為所依，無境界行相助伴，心心法無故，以心心法滅為自體。又此解脫似真解脫，圓滿為性，以聖弟子由出世間道已得轉依，諸心心法暫不現起，於此位中極寂靜故，染污意不現行故。",
    "想界": "　　謂六想身。即眼觸所生想。乃至意觸所生想。是名想界。",
    "想蘊": "　　問想蘊何相？答搆了相是想相，由此想故搆畫種種諸法像類，隨所見聞覺知之義起諸言說，見聞覺知義者，眼所受是見義，耳所受是聞義。自然思搆應如是，如是是覺義，自內所受是知義，諸言說者，謂詮辯義。",
    "愁": "　　謂有一類。或因父母兄弟姊妹師友死故。或因親族滅亡都盡。或因財位一切喪失。便發自身猛利剛獷切心奪命辛楚苦受彼於爾時。心熱等熱。內熱遍熱。便發於愁。已愁當愁。心中愁箭。總名為愁。",
    "意": "　　意者，謂一切時緣阿賴耶識，思度為性，與四煩惱恒相應，謂我見我愛我慢無明。又此意遍行，一切善不善無記位，唯除聖道現前若處滅盡定及在無學地。又復六識以無間滅識為意，當知此中由所緣故，釋義故相應故生起時故。顯了於意，何故聖道現前無染污意耶？由勝義智與我見現行極相違故，出聖道後，從阿賴耶識復更現起，以有學位未永斷故。又滅盡定望無想定，極寂靜故，此染污意不得現行。無間滅意者，由隨覺故，無間覺義是意義，當知此中隨顯相說。",
    "意根": "　　謂意於法。已正當知。及彼同分。是名意根。又意增上發意識。於法已正當了別。及彼同分。是名意根。又意於法。已正當礙。及彼同分。是名意根。又意於法。已正當行。及彼同分。是名意根。如是過去未來現在諸所有意。名為意根。亦名所知。乃至等所證。\n　　此復云何？謂心意識。或地獄。乃至或中有。或修所成。所有名號。異語增語。想等想。施設言說。謂名意。名意處。名意界。名意根。名知名道路。乃至名此岸。如是意根是內處攝。",
    "意處": "　　謂如意根。應說其相。",
    "愚癡離欲": "　　何等愚癡離欲？謂諸愚夫於涅槃界生厭背性。",
    "愛": "　　愛有二種業，一引諸有情流轉生死，二與取作緣。",
    "愛別離苦": "　　云何愛別離苦？愛別離。謂諸有情等。可愛可樂。可喜可意。不與彼俱。不同一處。不為伴侶。別異離散。不聚集。不和合。總名愛別離。何因緣故。說愛別離為苦。謂諸有情。愛別離時。領納攝受種種身苦事故。廣說乃至。領納攝受種種身心燒然事故。說彼為苦。復次愛別離時。受三種苦。一者苦苦。二者行苦。三者壞苦。故名愛別離苦。",
    "愛結": "　　愛結者，謂三界貪愛，結所繫故不厭三界由不厭故廣行不善不行諸善由此能招未來世苦與苦相應，當知此中宣說諸結若相若用若位辯結差別。且如愛結，何等是結？謂三界貪是結自性。云何為結？謂有此者不厭三界，由此展轉不善現行善不現行。於何位結？謂於後世苦果生位，如是恚結等並如理應知。",
    "愛緣取": "　　謂彼初生。說名為愛。愛增盛位。轉名為取。此復如何。謂如有一。於諸欲境。繫心觀察。起欲貪纏。彼從此纏復起余纏。增上轉增上。猛利轉猛利。圓滿轉圓滿。前所起纏。說名為愛。後所起纏。轉名為取。是名愛緣取。\n　　復如有一。於諸色境。或無色境。繫心觀察。起色貪纏。或無色貪纏。彼從此纏。復起余纏增上轉增上。猛利轉猛利。圓滿轉圓滿。前所起纏。說名為愛。後所起纏。轉名為取。是名愛緣取。\n　　復次險坑經中。佛作是說。吾為汝等諸苾芻眾。宣說簡擇諸蘊法要。謂四念住。四正勝。四神足。五根五力。七等覺支。八支聖道。如是宣說簡擇諸蘊正法要時。而有一類懷愚癡者。於我所說。不住猛利信愛恭敬。彼遲證得無上漏盡。\n　　復有一類懷聰睿者。於我所說。能住猛利信愛恭敬。彼速證得無上漏盡。復有一類。於我所說色蘊法中等隨觀我。此能觀行。以誰為緣。用誰為集。是誰種類。從誰而生。謂無明觸所生諸受。為緣生愛。此所生行。以彼為緣。用彼為集。是彼種類。從彼而生。此能生愛。以誰為緣。用誰為集。是誰種類。從誰而生。謂無明觸所生諸受。此所生愛。以受為緣。用受為集。是受種類。從受而生。此能生受。以誰為緣。用誰為集。是誰種類。從誰而生。謂無明觸。此所生受。以觸為緣。用觸為集。是觸種類。從觸而生。此能生觸。以誰為緣。用誰為集。是誰種類。從誰而生。謂六處。此所生觸。以六處為緣。用六處為集。是六處種類。從六處而生。如是六處。無常有為。是所造作。從眾緣生。如是觸受。愛能觀行。亦無常有為。是所造作。從眾緣生。此等隨觀。色為我者。是有身見。現所起纏。彼從此纏。復起余纏。增上轉增上。猛利轉猛利。圓滿轉圓滿。前所起纏。說名為愛。後所起纏。轉名為取。是名愛緣取。有不於色等隨觀我而等隨觀。我有諸色有不等隨觀。我有諸色而等隨觀。色是我所有不等隨觀。色是我所而等隨觀。我在色中有不等隨觀。我在色中而等隨觀。受想行識為我有不等隨觀。受想行識為我而等隨觀。我有受想行識有不等隨觀。我有受想行識而等隨觀。受想行識是我所有不等隨觀。受想行識是我所而等隨觀。我在受想行識中有不等隨觀。我在受想行識中而起疑惑。有不起疑惑。而起有見無有見。有不起有見無有見。而不離我慢。故由等隨觀。我及我所。而起我慢。此我慢行。以誰為緣。用誰為集。是誰種類。從誰而生。謂無明觸所生。諸受為緣生愛。此所生行。以彼為緣。用彼為集。是彼種類。從彼而生。廣說乃至。如是六處。無常有為。是所造作。從眾緣生。如是觸受愛我慢行。亦無常有為。是所造作。從眾緣生。如是我慢。是有身見。所起慢纏。彼從此纏。復起余纏。增上轉增上。猛利轉猛利。圓滿轉圓滿。前所起纏。說名為愛。後所起纏。轉名為取。是名愛緣取。\n　　復次有執世間常。或無常。或亦常亦無常。或非常非無常。執世間有邊。或無邊。或亦有邊亦無邊。或非有邊非無邊。執命者即身。執命者異身。執如來死後是有。或非有。或亦有亦非有。或非有非非有。皆是邊執見。現所起纏。彼從此纏。復起余纏。增上轉增上。猛利轉猛利。圓滿轉圓滿。前所起纏。說名為愛。後所起纏。轉名為取。是名愛緣取。\n　　復次有執世尊非如來應正等覺乃至非天人師。執佛正法非善說現見乃至非智者內證。執佛弟子非具足妙行乃至非隨法行。或執無苦無集無滅無道。或執無一切行無常。無一切法無我。無涅槃寂靜。皆是邪見。現所起纏。彼從此纏。復起余纏。增上轉增上。猛利轉猛利。圓滿轉圓滿。前所起纏。說名為愛。後所起纏。轉名為取。是名愛緣取。\n　　復次有執世間是常。此實余迷謬。或是無常。乃至如來死後非有非非有。此實余迷謬。皆是見取。現所起纏。彼從此纏。復起余纏。增上轉增上。猛利轉猛利。圓滿轉圓滿。前所起纏。說名為愛。後所起纏。轉名為取。是名愛緣取。\n　　復次有起戒取。或起禁取。或起戒禁取。謂此戒此禁此戒禁。能淸淨。能解脫。能出離。能超苦樂。至超苦樂處。皆是戒禁取。現所起纏。彼從此纏。復起余纏。增上轉增上。猛利轉猛利。圓滿轉圓滿。前所起纏。說名為愛。後所起纏。轉名為取。是名愛緣取。\n　　復次有於世尊而起猶預。為是如來應正等覺。為非如來應正等覺。乃至為是天人師。為非天人師。於佛正法。而起猶預。為是善說現見。為非善說現見。乃至為是智者內證。為非智者內證。於佛弟子。而起猶預。為是具足妙行。為非具足妙行。乃至為是隨法行。為非隨法行。於四聖諦。而起猶預。為是苦。為非苦。乃至為是道。為非道。於三法印。而起猶預。為一切行無常。為非一切行無常。為一切法無我。為非一切法無我。為涅槃寂靜。為非涅槃寂靜。此皆是疑。現所起纏。彼從此纏。復起余纏。增上轉增上。猛利轉猛利。圓滿轉圓滿。前所起纏。說名為愛。後所起纏。轉名為取。是名愛緣取。\n　　復次一切四取。皆以愛為緣。用愛為集。是愛種類。從愛而生。何等四取？一欲取。二見取。三戒禁取。四我語取。云何欲取？謂欲界系。除諸見余結縛隨眠隨煩惱纏。是名欲取。云何見取？謂有身見。邊執見。邪見。見取。如是四見。是名見取。云何戒禁取？謂有一類。取戒取禁取戒禁。為能淸淨能解脫能出離能超苦樂至超苦樂處。是名戒禁取。云何我語取？謂色無色界系。除諸見余結縛隨眠隨煩惱纏。是名我語取。復次大因緣經中。尊者慶喜問佛。諸取為有緣不。佛言有緣。此緣謂愛。廣說乃至。若全無愛為可施設。有諸取不。不也世尊。是故慶喜。諸取皆以愛為其緣。是名愛緣取。如是諸取。愛為緣。愛為依。愛為建立。故起等起生等生。聚集出現。故名愛緣取。",
    "愧": "　　愧者，於諸過惡羞他為體，業如慚說。",
    "慈": "　　云何為慈？謂有一類。作是思惟。願諸有情。皆得勝樂。彼依出家。或依遠離。由思擇力。內所發起。色界定善諸慈性。名哀憐哀憐性。名愍念愍念性。總名為慈。復次與慈相應受想行識。及所等起身語二業。不相應行。亦名為慈。\n　　云何慈心定加行？修何加行。入慈心定。謂有一類。起如是心。願諸有情。皆得勝樂。雖有此心。而無勝解。願諸有情。皆得如是如是勝樂。彼心雖善淨妙隨順磨瑩增長嚴飾應供。常委助伴資糧。而未名慈心定加行。亦未名入慈心定。\n　　復有一類。發如是言。願諸有情。皆得勝樂。雖有此言。而無勝解。願諸有情。皆得如是如是勝樂。彼言雖善淨妙乃至資糧。而未名慈。心定加行。亦未名入慈心定。\n　　復有一類。起如是心。發如是言。願諸有情。皆得勝樂。雖有此心及有此言。而無勝解。願諸有情。皆得如是如是勝樂。彼心及言。雖皆是善淨妙乃至資糧。而未名慈心定加行。亦未名入慈心定。\n　　復有一類。起如是心。發如是言。及有勝解。願諸有情。皆得如是如是勝樂。彼心言及勝解。雖皆是善淨妙乃至資糧。而未名慈心定加行。亦未名入慈心定。其事如何。如有一類。寒苦所逼。得暖生樂。取此樂相。起如是心。發如是言。願諸有情。皆得如是如是勝樂。彼心言及勝解。雖皆是善淨妙乃至資糧。而未名慈心定加行。亦未名入慈心定。\n　　復有一類。熱苦所逼。得冷生樂。取此樂相。起如是心。發如是言。願諸有情。皆得如是如是勝樂。彼心言及勝解。雖皆是善淨妙乃至資糧。而未名慈心定加行。亦未名入慈心定。復有一類。饑苦所逼。得食生樂。取此樂相。起如是心。發如是言。願諸有情。皆得如是如是勝樂。彼心言及勝解。雖皆是善淨妙乃至資糧。而未名慈心定加行。亦未名入慈心定。\n　　復有一類。渴苦所逼。得飲生樂。取此樂相。起如是心。發如是言。願諸有情。皆得如是如是勝樂。彼心言及勝解。雖皆是善淨妙乃至資糧。而未名慈心定加行。亦未名入慈心定。\n　　復有一類。身體垢穢。支節勞倦乏諸資具。親友乖離。遇得沐浴案摩資具。親友和合。發生諸樂。取此樂相。起如是心。發如是言。願諸有情。皆得如是如是勝樂。彼心言及勝解。雖皆是善淨妙乃至資糧。而未名慈心定加行。亦未名入慈心定。\n　　復有一類。盛夏熱時。炎熾日光所逼切故。熱渴迷悶。身心燋惱。遇淸涼池。投身沐浴。飲用生樂。取此樂相。起如是心。發如是言。願諸有情。皆得如是如是勝樂。彼心言及勝解。雖皆是善淨妙乃至資糧。而未名慈心定加行。亦未名入慈心定。如是所受欲界樂具。及三靜慮所受勝樂。取彼樂相。起心發言。願諸有情。皆得如是如是勝樂。彼心言及勝解。雖皆是善淨妙乃至資糧。而未名慈心定加行。亦未名入慈心定。若有此生。近曾現入。第三靜慮。取彼樂相。起如是心。發如是言。願諸有情。皆得如是如是勝樂。彼心言及勝解。皆是勝善淨妙隨順。乃至資糧。乃可名慈心定加行。亦名入慈心定。又此定中。諸心意識。名慈俱有心。諸思等思。現前等思。已思當思。造心意業。名慈俱有意業。諸心勝解。已勝解。當勝解。名慈俱有勝解。又此定中。若受若想。若欲若作意。若念若定。若慧等。名慈俱有諸法。如是諸法。亦得名慈心定加行。亦名入慈心定。\n　　復次慈心定有二種。一狹小。二無量。云何狹小慈心定加行？修何加行。入狹小慈心定。謂有一類。於諸可愛可樂可喜可意有情。謂父母兄弟姊妹。及余隨一親屬朋友。彼於如是狹小有情。令狹小慈俱心住等住近住安住調伏寂靜最極寂靜。一趣等持。願彼有情。皆得勝樂。彼於爾時。若心散亂。馳流余境。不能一趣。不能守念。令住一緣。而願狹小有情得樂。齊此未名狹小慈心定加行。亦未名入狹小慈心定。\n　　彼若爾時。攝錄自心。令不散亂。馳流余境。能令一趣住念一緣。思惟狹小諸有情相。而願狹小有情得樂。如是思惟。發勤精進。勇健勢猛。熾盛難制。勵意不息。是名狹小慈心定加行。亦名入狹小慈心定。彼於此道。生已修習。多修習故。便令心住等住近住安住一趣等持無二無退。願彼狹小有情得樂。齊此名為已入狹小慈心定。又此定中。諸心意識。名狹小慈俱有心。諸思等思。乃至造心意業。名狹小慈俱有意業。諸心勝解。已勝解。當勝解。名狹小慈俱有勝解。又此定中。若受若想。乃至若慧等。名狹小慈俱有諸法。如是諸法。亦得名狹小慈心定加行。亦名入狹小慈心定。云何無量慈心定加行？修何加行。入無量慈心定。謂即於狹小慈心定。數數修習。令心隨順調伏寂靜。數復調練。令其質直柔軟堪能。與後勝定作所依止。然後漸令勝解徧滿。於東方等無量有情。皆願得樂。\n　　彼於爾時。若心散亂。馳流余境。不能一趣。不能守念。令住一緣。而願無量有情得樂。齊此未名無量慈心定加行。亦未名入無量慈心定。彼若爾時。攝錄自心。令不散亂。馳流余境。能令一趣住念一緣。思惟無量諸有情相。而願無量有情得樂。如是思惟。發勤精進。乃至勵意不息。是名無量慈心定加行。亦名入無量慈心定。\n　　彼於此道。生已修習。多修習故。便令心住等住近住安住一趣等持無二無退。願彼無量有情得樂。齊此名為已入無量慈心定。又此定中。諸心意識。名無量慈俱有心。諸思等思。乃至造心意業。名無量慈俱有意業。諸心勝解。已勝解。當勝解。名無量慈俱有勝解。又此定中。若受若想。乃至若慧等。名無量慈俱有諸法。如是諸法。亦得名無量慈心定加行。亦名入無量慈心定。",
    "慚": "　　慚者，於諸過惡自羞為體，惡行止息所依為業。",
    "慢": "　　慢者，依止薩迦耶見心高舉為體，不敬苦生所依為業。不敬者，謂於師長及有德所而生憍傲。苦生者，謂生後有故。",
    "慢結者": "　　慢結者，即七慢，謂慢、過慢、慢過慢、我慢、增上慢、下劣慢、邪慢。慢者，謂於下劣計己為勝，或於相似計己相似，心舉為性。過慢者，謂於相似計己為勝，或復於勝計己相似，心舉為性。慢過慢者，謂於勝己計己為勝，心舉為性。我慢者，於五取蘊觀我我所，心舉為性。增上慢者，謂於未得上勝證法計己已得上勝證法，心舉為性。下劣慢者，謂於多分勝計己少分劣，心舉為性。邪慢者，謂實無德計己有德，心舉為性，慢結所繫故，於我我所不能了知，不了知故執我我所，廣行不善不行諸善，由此能招未來世苦與苦相應。",
    "慧": "　　慧者，於所觀事擇法為體，斷疑為業，斷疑者，謂由慧擇法得決定故。",
    "慧根": "　　謂依出家遠離所生善法。所起於法簡擇。極簡擇。最極簡擇。解了等了近了。機黠通達。審察聰睿。覺明慧行。毘缽舍那。是名慧根。復次學慧無學慧。及一切善非學非無學慧。皆名慧根。",
    "慧波羅蜜多相": "　　云何慧波羅蜜多相？謂諸菩薩安住，菩薩法性菩提心為依止，以悲導心起一切種身語意業自在用時，所有一切諸法簡擇復次若所行施依止薩伐若性，能感薩伐若性，攝受薩伐若性，能為一切薩伐若事，是名施波羅蜜多相。如是四句隨其次第，由發起故習氣故自體故等流故，顯波羅蜜多相。發起者，謂依止一切智性，凡所生起一切施行，皆迴向薩伐若性故。習氣者，謂能感一切智性，即所行施熏修相續，於當來世能感薩伐若性故。自體者，謂攝受一切智性，即所行施究竟圓滿，爾時能辦佛法身故。等流者，謂能為一切一切智事，從此後時由受用變化身等流門，發起一切薩伐若事故，如施波羅蜜多相乃至慧波羅蜜多相，皆應如是說。",
    "慧解脫補特伽羅": "　　慧解脫補特伽羅者，謂已盡諸漏而未具證八解脫定，唯究竟斷慧，所對治煩惱障故。",
    "慳": "　　慳者，耽著利養，於資生具貪之一分心吝為體。不捨所依為業。不捨者，由慳吝故，非所用具亦恒聚積。",
    "慳結": "　　慳結者，耽著利養於資生具其心吝惜，慳結所繫故，愛重畜積不尊遠離，重畜積故廣行不善不行諸善，由此能招未來世苦與苦相應。",
    "慳結者": "　　慳結者，謂耽著利養於資生具其心吝惜，慳結所繫故，愛重畜積不尊遠離重畜積故，廣行不善不行諸善，由此能招未來世苦，與苦相應。",
    "憂": "　　謂意識相應不平等受。總名為憂。",
    "憂根": "　　謂順憂觸所生心憂。不平等受。受所攝。是名憂根。",
    "憂界": "　　謂順憂觸所起心憂不平等受。受所攝。是名憂界。",
    "憍": "　　謂有一類。作是思惟。我之種姓。家族色力。工巧事業。若財若位。戒定慧等。隨一殊勝。由此起憍極憍醉極醉悶極悶。心傲逸。心自取。起等起。生等生。高等高。舉等舉。心瀰漫性。總名為憍。",
    "憤發": "　　謂身擒害性。心擒害性。身戰怒性。心戰怒性。身憤發心憤發。已憤發。當憤發。總名憤發。",
    "懈怠": "　　懈怠者，謂愚癡分，依著睡眠倚臥為樂心不策勵為體，障修方便善品為業。",
    "應時": "　　言應時者。謂八支聖道。名為應時。所以者何。由正修習世尊所說苦集滅道現觀道時。即入苦集滅道現觀。故名應時。\n　　若正修習世尊所說苦集滅道現觀道。後方入苦集滅道現。觀世尊正法可非應時。以正修習世尊所說苦集滅道現觀道時。即入苦集滅道現觀。故佛正法名為應時。\n　　又正修習世尊所說。能斷見苦見集見滅見道所斷及修所斷隨眠道時。即斷見苦見集見滅見道所斷及修所斷一切隨眠。故名應時。\n　　若正修習世尊所說。能斷見苦見集見滅見道所斷及修所說隨眠道。後方斷見苦見集見滅見道所斷及修所斷一切隨眠。世尊正法。可非應時。以正修習世尊所說。能斷見苦見集見滅見道所斷及修所斷隨眠道時。即斷見苦見集見滅見道所斷及修所斷一切隨眠。故佛正法名為應時。\n　　又正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道時。即證見苦見集見滅見道所斷及修所斷諸隨眠滅。故名應時。\n　　若正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道。後方證見苦見集見滅見道所斷及修所斷諸隨眠滅。世尊正法。可非應時。以正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道時。即證見苦見集見滅見道所斷及修所斷諸隨眠滅。故佛正法名為應時。",
    "應知施物圓滿": "　　云何應知施物圓滿？謂所施財物非誑詐得故，所施財物非侵他得故，所施財物非穢離垢故，所施財物清淨故，所施財物如法所引故，如是應知施物圓滿。",
    "應頌": "　　應頌者，即諸經或中或後以頌重頌，又不了義經應更頌釋，故名應頌。",
    "成就": "　　復次成就相如前已說謂於善不善無記法，若增若減假立獲得成就，此差別有三種，謂種子成就、自在成就、現行成就。",
    "成就三十法": "　　成就三十法。身壞命終。墮險惡趣。生地獄中。何等三十？謂自不離殺。勸他令殺。見不離殺。歡喜慰喻。廣說乃至自起邪見。亦復勸他令起邪見。見起邪見。歡喜慰喻。若有成就此三十法。身壞命終。墮險惡趣。生地獄中。\n　　成就三十法。身壞命終。升安善趣。生於天中。何等三十？謂自離殺生。勸他離殺。見余離殺。歡喜慰喻。廣說乃至自起正見。亦復勸他令起正見。見起正見。歡喜慰喻。若有成就此三十法。身壞命終。升安善趣。生於天中。",
    "成就二十四法鄔波索迦": "　　能利自他。亦能廣利。何等名為二十四法？謂前所說鄔波索迦。自具淨信。亦能勸他令具淨信。廣說乃至自思擇已。為證法義。能正勤修法隨法行成和敬行隨法行者。亦能勸他令正勤修法隨法行成和敬行隨法行者。及能見余具淨信等。歡喜慶慰。如是名為成就二十四法鄔波索迦。",
    "成就二十法": "　　成就二十法。身壞命終。墮險惡趣。生地獄中。何等二十？謂自殺生。亦勸他殺。廣說乃至自起邪見。亦復勸他令起邪見。若有成就此二十法。身壞命終。墮諸惡趣。生地獄中。\n　　成就二十法。身壞命終。升安善趣。生於天中。何等二十？謂自離殺。亦能勸他。令其離殺。廣說乃至自起正見。亦能勸他令起正見。若有成就此二十法。身壞命終。升安善趣。生於天中。",
    "成就五法鄔波索迦": "　　唯能自利不能利他。何等為五？謂前所說鄔波索迦。自離殺生乃至飲酒諸放逸處。不能勸他令離殺生乃至飲酒諸放逸處。如是名為成就五法鄔波索迦。",
    "成就八法鄔波索迦": "　　唯能自利。不能利他。何等為八？謂前所說鄔波索迦。自具淨信。不能勸他令具淨信。自具淨戒。不能勸他令具淨戒。自具惠捨。不能勸他令具惠捨。自能策勵。數往伽藍。禮覲有德諸苾芻眾。不能勸他令其策勵數往伽藍。禮覲有德諸苾芻眾。自能至誠聽聞正法。不能勸他令其至誠聽聞正法。自聞法已能持不忘。不能勸他令持不忘。自持法已能思擇義。不能勸他令思擇義。自思擇已為證法義。能正勤修法隨法行。成和敬。行隨法行者。不能勸他令正勤修。法隨法行。成和敬行隨法行者。如是名為。成就八法。",
    "成就十五法鄔波索迦": "　　能利自他。亦能廣利。何等十五？謂前所說鄔波索迦。自離殺生乃至飲酒諸放逸處。亦能勸他令離殺生乃至飲酒諸放逸處。及能見余離殺生等。歡喜慶慰。如是名為成就十五法鄔波索迦。",
    "成就十六法鄔波索迦": "　　能利自他不能廣利。何等十六？謂前所說鄔波索迦。自具淨信。亦能勸他令具淨信。廣說乃至自思擇已。為證法義。能正勤修法隨法行成和敬行隨法行者。亦能勸他令正勤修法隨法行成和敬行隨法行者。不能見余具淨信等歡喜慶慰。如是名為成就十六法鄔波索迦。",
    "成就十法": "　　成就十法。身壞命終。墮險惡趣。生地獄中。何等為十？一殺生。二不與取。三欲邪行。四虛誑語。五離間語。六粗惡語。七雜穢語。八貪慾。九瞋恚。十邪見。若有成就如是十法。身壞命終。墮險惡趣。生地獄中。\n　　成就十法。身壞命終。升安善趣。生於天中。何等為十？一離殺生。二離不與取。三離欲邪行。四離虛誑語。五離離間語。六離粗惡語。七離雜穢語。八無貪。九無嗔。十正見。若有成就如是十法。身壞命終。升安善趣。生於天中。",
    "成就十法鄔波索迦": "　　能利自他不能廣利。何等為十？謂前所說鄔波索迦。自離殺生乃至飲酒諸放逸處。亦能勸他令離殺生乃至飲酒諸放逸處。不能見余能離殺等歡喜慶慰。如是名為成就十法鄔波索迦。",
    "成就四十法": "　　成就四十法。身壞命終。墮險惡趣。生地獄中。何等四十？謂自不離殺。勸他令殺。見不離殺。歡喜慰喻。稱揚讚歎殺生者事。廣說乃至自起邪見。亦復勸他令起邪見。見起邪見。歡喜慰喻。稱揚讚歎邪見者事。若有成就此四十法。身壞命終。墮險惡趣。生地獄中。\n　　成就四十法。身壞命終。升安善趣。生於天中。何等四十？謂自離殺生。勸他離殺。見余離殺。歡喜慰喻。稱揚讚歎離殺者事。廣說乃至自起正見亦復勸他令起正見。見起正見。歡喜慰喻。稱揚讚歎正見者事。若有成就此四十法。身壞命終。升安善趣。生於天中。",
    "成就尸羅": "　　復次如經中說，成就尸羅善能防護別解脫律儀，軌則所行皆悉圓滿，見微細罪生大怖畏，於諸學處善能受學。云何成就尸羅，能受能護淨尸羅故？謂受持淨戒相應無缺，故名成就尸羅。云何善能防護別解脫律儀，能善護持出離尸羅故？謂為求解脫別別防護所有律儀，故名別解脫律儀，由此律儀能速出離生死苦故。云何軌則所行皆悉圓滿？具淨尸羅難為毀責故。軌則圓滿者，諸威儀等，非聰慧人所呵責故。所行圓滿者，遠離五種諸比丘眾所不行處故。何等為五？謂唱令家、婬女家、酤酒家、王家、旃荼羅羯恥那家。云何見微細罪生大怖畏？勇猛恭敬所學尸羅故，於遮罪中勇猛恭敬，修學護持猶如性罪，是故名為見微細罪生大怖畏。云何於諸學處善能受學，圓滿受學所學尸羅故？謂具足圓滿受學學處，是故名為於諸學處善能受學，從是已後依止尸羅，釋佛經中護身等義。云何名為防護身語，由彼正解所攝持故？謂如佛所聽，往來等事必先覺察方正行故。云何身語具足圓滿，終不毀犯所毀犯故？謂不違損清淨尸羅。云何身語清淨現行，由無悔等漸次修行久至得定為依止故？謂依定力令犯戒垢極遠離故。云何身語極善現行，染污尋思所不雜故？謂染污尋思所不能雜，一向淨故。云何身語無罪現行，遠離邪願修梵行故？謂不迴向有及資財修行梵行，為諸聖賢所稱讚故。云何身語無害現行，不輕陵他易共住故？謂不由自高陵蔑於人，難共住等為損害故。云何身語隨順現行，由能隨順涅槃得故？謂能隨順得涅槃得能引聖道故。云何身語隨隱顯現行，隱善顯惡故？謂隱自功德顯自過失。云何身語親善現行，同梵行者攝受尸羅故？謂同梵行攝受尸羅應歸趣故。云何身語應儀現行，於尊尊位離憍慢故？謂於尊長及等尊長所，摧伏憍慢如應供事故。云何身語敬順現行，於尊教誨敬順受故？謂於尊語言敬順而受，離自見取故。云何身語無熱現行，遠離苦行熱惱下劣欲解故？謂離外道下劣欲解行諸苦行，不自燒然故。云何身語不惱現行，棄捨財業無悔惱故？謂由棄捨財業無有追悔，彼於後時無熱惱故。云何身語無悔現行，雖得少分不以為喜，無悔恨故？謂修善品雖獲少分不生喜足，離諸悔恨盡其所能而修習故。如世尊說，如是有情皆由自業，業所乖諍，從業所生，依業出離，業能分判一切有情高下勝劣。云何有情皆由自業，由自造業而受異熟故？謂諸有情由其自業故名自業，自者不與他共，受自業異熟故名自業。云何業所乖諍於受自業所得異熟時，善不善業互違諍故？謂諸有情由業乖諍故，名業所乖諍，隨善惡業力自所受異熟愛不愛別故。問是諸有情受自作業愛不愛異熟時，初從何生？為無因耶？為因世性自在等耶？答從業所生。云何從業所生？是諸有情遠離無因惡因，唯從業所生故？謂諸有情遠離無因惡因，唯由業等因緣所生，如是已說依業流轉，為明歸滅亦依諸業，是故經言，依業出離。云何依業出離，依對治業解業縛故？謂依無漏業能斷有漏業故，唯依業而得出離。云何有情高下？謂由業故，於善惡趣得自體差別。云何勝劣？謂諸有情成就功德過失差別。",
    "我慢": "　　謂於五取蘊等。隨觀見我或我所。由此起慢。乃至心自取。總名我慢。",
    "我語取": "　　謂色無色界系。除諸見余結縛隨眠隨煩惱纏。是名我語取。",
    "戒波羅蜜多相": "　　云何戒波羅蜜多相？謂諸菩薩安住菩薩法性菩提心為依止，以悲導心受持一切菩薩戒時所有身語意業。",
    "戒禁": "　　戒禁者，謂惡見為先。勞無果者，由此不能得出離故。",
    "戒禁取": "　　謂有一類。取戒取禁取戒禁。為能淸淨能解脫能出離能超苦樂至超苦樂處。是名戒禁取。",
    "或為名利": "　　謂有一類。多有所欲。多有所思。多有所願。作是思惟。我當施設如是如是虛誑方便。必當獲得可意色聲香味觸等。既思惟已。方便追求。故以正知。說虛誑語。如是名為或為名利。",
    "所分別相差別": "　　何等所分別相差別？謂即蘊界處法。",
    "所取": "　　云何所取？幾是所取？為何義故觀所取耶？謂諸能取亦是所取，以眼根等意識所取故。或有所取非能取，謂唯是取所行義，唯者決定義，此言為簡心所有法，一切皆是所取，為捨執著境界我故，觀察所取。",
    "所有": "　　所有有三，謂貪、瞋、癡。由依止貪瞋癡故，積畜財物有怖有怨，多住散亂故名所有，由多積集所有資具恒與怖等共相應故。",
    "所治": "　　所治者，謂施等六如其次第，以慳吝犯戒忿恚懈怠散亂惡慧為所治，復次乃至一切波羅蜜多所攝善法彼所對治及所知障，皆是波羅蜜多所治。",
    "所知": "　　云何所知？幾是所知？為何義故觀所知耶？謂所知有五種色，心心所有法心不相應行無為，色謂色蘊，十色界十色處及法界法處所攝諸色，心謂識蘊，七識界及意處，心所有法，謂受蘊想蘊相應行蘊及法界法處一分，心不相應行謂不相應行，蘊及法界法處一分，無為謂法界法處一分，若依是處雜染清淨，若所雜染及所清淨，若能雜染及能清淨，若於此分位，若此清淨性，由依此故，一切皆是所知。處者謂色法，所染淨者，謂心法，能染淨者，謂貪等信等心所有法如其次第，分位者，謂於色心及心法分位，假立心不相應行法，清淨性者，謂清淨無為法，如其所應非一切。所以者何？唯法界及擇滅，是清淨性故。又所知法者，謂信解智所行故，道理智所行故，不散智所行故，內證智所行故，他性智所行故下智所行故，上智所行故，厭患智所行故，不起智所行故，無生智所行故，智智所行故，究竟智所行故，大義智所行故，當知此中以十三種智所緣境界，顯示所知義。十三智者，謂聞所生智，思所生智，世間修所生智，勝義智，他心智法智種類智，苦智集智滅智道智，盡無生智，大乘智，如是諸智隨其次第是信解等智他心智名他性智者，謂緣他心為境故，法智名下智者，謂於諸諦最初生故，種類智名上智者，謂從法智後所生故為厭患故名厭患智，為不起故名不起智，緣無生故名無生智，緣智故名智智，緣究竟故名究竟智，緣大義故名大義智，自利利他名為大義，為捨執著知者見者我故，觀察所知。",
    "所知境": "　　所知境者略有六種，一迷亂、二迷亂所依、三不迷亂所依、四迷亂不迷亂、五不迷亂、六不迷亂等流。迷亂者，謂能取所取執。迷亂所依者，謂聖智所行唯有行相，虛妄分別為體。由有此故一切愚夫迷亂執轉。不迷亂所依者，謂真如是無分別智所依處故。迷亂不迷亂者，謂隨順出世智所有聞慧等諸善法分別所知境故，隨順無分別智故。不迷亂者，謂無分別智。不迷亂等流者，謂聖道後所得善法。",
    "所緣": "　　復次因此所緣相，依心心法建立有緣等義，如經中說，諸心心法有緣有行有依相應彼於此法為何所緣？謂契經等此顯名身句身文身，所攝契經等教法為所緣境。作何等行？謂蘊等相應義，此顯依蘊等義所起言教法，彼心心法作此行相，何所依止？謂他表了憶念習氣，此顯正說法時用他表了為所依止，如說從他言音故，次此後時憶念為所依止，如所聞已隨念數習故。復此後時習氣為所依止，由後串習習氣力強，雖離憶念而似彼顯現故，何等相應？謂互為助伴於所緣行平等解了，由心心法互為助伴，於契經等所緣境界，以蘊等相應義行平等解了故。",
    "所緣差別": "　　云何於法所緣差別？若略說有四種，謂遍滿所緣，治行所緣，善巧所緣，淨惑所緣。遍滿所緣復有四種，謂有分別影像所緣，無分別影像所緣，事邊際所緣，所作成就所緣。有分別影像所緣者，謂由勝解作意，所有奢摩他毘鉢舍那所緣境。勝解作意者，一向世間作意。無分別影像所緣者，謂由真實作意，所有止觀所緣境。真實作意者，一向出世間，及此後所得作意。事邊際所緣者，謂一切法盡所有性如所有性。盡所有性者，謂蘊界處，為顯所知諸法體事唯有爾所分量邊際，是故建立蘊界處三。如所有性者，謂四聖諦十六行真如，一切行無常，一切行苦，一切法無我，涅槃寂靜空無願無相，由如是等義差別門了所知境故，名如所有性。或以諦門了所知境，謂即前所說諸蘊界處，隨其所應了知是苦乃至是道，或以行門了所知境，謂一一諦各由四行及一切法無有差別皆真如行，或以諸法鄔柁南門了所知境，謂諸行無常乃至涅槃寂靜，或以解脫門了所知境，謂空無願無相如是等所作成就所緣者，謂轉依，已得轉依者無有顛倒，所緣顯現故，如是轉依不可思議。前說如所有性中有十六行及三解脫門，如是二種更互相攝，問空攝幾行？答二，謂空行無我行，問無願攝幾行？答六，謂無常行苦行因行集行生行緣行，由彼於三界無所願求故，問無相攝幾行？答八，謂滅道八行，由彼不能行諸相故。治行所緣者，略說有五種，謂多貪行者緣不淨境，多瞋行者緣修慈境，多癡行者緣眾緣性諸緣起境，憍慢行者緣界差別境，尋思行者緣入出息念境。何故多貪行者等緣不淨等，修治行所緣境耶？由此能息除增上貪等故。善巧所緣者，略有五種，謂蘊善巧、界善巧、處善巧、緣起善巧、處非處善巧。處非處善巧應云何觀？應如緣起善巧觀。問緣起善巧處非處善巧有何差別？答若以諸法流潤諸法，令離無因不平等因生故，是緣起善巧，謂以無明等諸法流潤行等諸法，非彼諸法無因而生，亦非自在天等不平等因生，如是觀智名緣起善巧，因果相稱攝受生起故，是處非處善巧，謂雖唯有法為因，然由攝受相稱因，方能生起相稱果，如善行感可愛異熟惡行感不可愛異熟，如是比如是觀智，名處非處善巧。淨惑所緣者，謂下地麤性上地靜性，真如及四聖諦。下地麤性上地靜性者，依世間道說，由此制伏諸纏故，真如及四聖諦者，依出世道說，略故真如，廣故四聖諦，由此永害諸隨眠故。",
    "所緣緣": "　　所緣緣者，謂有分齊境所緣故，無分齊境所緣故，無異行相境所緣故，有異行相境所緣故，有事境所緣故，無事境所緣故，事所緣故，分別所緣故，有顛倒所緣故，無顛倒所緣故，有礙所緣故，無礙所緣故，是所緣緣義。有分齊境所緣者，謂五識身所緣境界，由五識身各別境界故，無分齊境所緣者，謂意識所緣境界，以意識身緣一切法為境界故。\n　　無異行相境所緣者，謂不能了別名想眾生意識所緣境界，由彼於境不能作名字故，有異行相境所緣者，謂與此相違。\n　　有事境所緣者，謂除見慢及此相應法，餘所緣境界，無事境所緣者，謂前所除所緣境界，由彼於我處起故。事所緣者，謂除無漏緣不同分界地遍行於事不決了及未來所緣，餘所緣境界。分別所緣者，謂前所除所緣境界，由彼唯緣自所分別為境界故。有顛倒所緣者，謂常等行所緣境界。無顛倒所緣者，謂無常等行所緣境界。有礙所緣者，謂未斷所知障者所緣境界。無礙所緣者，謂已斷所知障者所緣境界，復次若欲決擇所緣緣義，應以相故差別故安立故遍知故斷故。建立所緣相者，謂若義是似此顯現心心法生因，彼既生已還能執著，顯了內證此義，是所緣相。",
    "所觸一分": "　　所觸一分者，四大種所造身根所取義。謂滑、澀、輕、重、軟、緩、急、冷、飢、渴、飽、力、劣、悶、癢、黏、病、老、死、疲、息、勇。此所觸一分由八因建立，謂相故，摩故，稱故，觸故，執故，雜故，界不平等故，界平等故。水風雜故冷，地水雜故黏，界平等故息力勇，勇者無畏飽，由二種界不平等故有飢等，餘觸。",
    "所識": "　　云何所識？幾是所識？為何義故觀所識耶？謂無分別故，有分別故，因故轉故相故，相所生故，能治所治故，微細差別故，當知是所識義，無分別者，謂五識身，有分別者，謂意識身，因者，謂阿賴耶識，轉者，謂所餘識，相者，謂根及義，相所生者，謂根義所生諸識，能治所治者，謂有貪離貪，有瞋離瞋，有癡離癡，如是等，微細差別者，謂七種難識了別差別，故七種難識了別者，一不可知了別器了別，謂一切時無分別行相故，二種種行相了別，謂一法一行有種種相，此難建立是故微細，三俱有了別，謂一時間諸識俱起。云何各別了自境界？此難建立是故微細，當知此微細言通一切處，四能治所治速疾迴轉了別，謂具縛者。云何有貪等心？須臾轉變起離貪等心，五習氣了別，謂諸業現行熏習於心。云何非離心外別有習氣亦非即心？又與果時次第而轉，六相續了別，謂無量種感自身業熏習在識。云何於餘明了將命終位暫起覺悟？餘業熏習轉於異趣令生相續。七解脫了別，謂阿羅漢心證得第一無戲論法性，超過生死曾所積習一切種有漏行。云何此心行相流轉？此難建立是故微細，如是當知，一切皆是所識，為捨執著能見者等我故，觀察所識，見者等言當知，為顯見者聞者嗅者嘗者觸者識者。",
    "所通達": "　　云何所通達？幾是所通達？為何義故觀所通達耶？謂轉變故，隨聞故，入行故，來故，往故，出離故，是所通達義言。所通達者，謂六神通所有境界，以如意通運轉差別所顯故，說此所通達境界名為轉變，以天耳通了達種種異趣音聲故名隨聞，以他心通了有貪等種種心行，故名入行，以宿住通了過去生展轉來事，故名來，以天眼通了達未來所往生事故名往，以漏盡通了知解脫三界方便故名出離，如是一切皆是所通達，後以三通遍緣一切境界故，為捨執著自威德我故，觀察所通達。",
    "所造色": "　　云何所造色？謂眼根耳根鼻根舌根身根。色聲香味所觸一分，及法處所攝色。",
    "抵突": "　　謂有一類。於授食時。索熟與生。索生與熟。索粗與細。索細與粗。與不平等。與不如法。於識不識。而與不與。於中數起相違語言。是名抵突。\n　　復有一類。若親教親教類。軌範軌範類。及余隨一尊重可信。往還朋友。告言。具壽。汝於如是如是事業。應次第作。彼作是念。何事眾業。令我如是次第而作。於中數起相違語言。是名抵突。\n　　復有一類。或自來謝過。或他教謝過。或自有啟請。或他教啟請。於中數起相違語言。是名抵突。如是或因料理衣服。營造事業。於中數起相違語言。總名抵突。",
    "拘礙": "　　拘礙有三，謂貪、瞋、癡。由依止貪瞋癡故，顧戀身財無所覺了樂處憒鬧，得少善法便生厭足，由此不能修諸善法故名拘礙。依貪瞋癡顧身財等，拘礙有情不得自在修諸善故，又此顧戀身等，即依五種心拘礙說。何等為五？謂顧戀身顧戀諸欲樂相雜住，闕於隨順教誡教授，於諸善品得少為足，拘礙心故名心拘礙，諸如是等煩惱義門差別無量。",
    "持任鏡明依": "　　復次依法修三摩地者瑜伽地，云何當知？此地略有五種，謂持、任、鏡、明、依。持者，謂已積集菩提資糧，於煖等位依諸聖諦所有多聞，如所多聞安立止觀所緣境故，說名為持。又已積集菩提資糧者，為求諦現觀聽受契經等法，故名多聞。任者，謂緣此境如理作意，由此作意，依所多聞無倒思惟，所聞義相任持心故。鏡者，謂緣此境有相三摩地，此三摩地即緣多聞，為境與定相俱故名有相，由此三摩地猶帶所知事同分影像相故。又此三摩地能審照察所知事質，故譬於鏡。明者，謂能取所取無所得智，由此智見道所攝現觀轉故。云何菩薩依瑜伽地方便修學證無所得？謂諸菩薩已善積集福德智慧二種資糧已，過第一無數大劫已，聞隨順通達真如，契經等法如理作意，發三摩地依止定心，思惟定中所知影像，觀此影像不異定心，依此影像捨外境想，唯定觀察自想影像。爾時菩薩了知諸法唯自心故，內住其心知一切種所取境界皆無所有，所取無故，一切能取亦非真實，故次了知能取非有。次復於內捨離所得二種自性證無所得，依此道理佛薄伽梵妙善宣說，菩薩於定位觀影唯是心，義想既滅除，審觀唯自想，知所住內心知所取非有，次能取亦無，後觸無所得。依者，謂轉依，捨離一切麤重得清淨轉依故，當知此中以因果兩位釋瑜伽地，由持等四種釋此地因，最後一種釋此地果。",
    "持心者": "　　謂為斷已生貪慾蓋故。持心修習八支聖道。",
    "捨": "　　云何為捨？謂有一類。作是思惟。應於有情。住平等捨。彼依出家。或依遠離。由思擇力。內所發起色界定善心平等性。心正直性。心無警覺寂靜住性。總名為捨。\n　　復次與捨相應受想行識。及所等起身語二業。不相應行。亦名為捨。云何捨心定加行？修何加行。入舍心定。謂有一類。雖見可愛可樂可喜可意等有情。而不起分別。此是我母。此是我父。乃至此是我朋友等。唯起平等有情勝解。如無求士遇入一林。雖見娑羅樹。或多羅樹。或夜鬘樹。或馬相樹。或鄔曇跋羅樹。或諾瞿陀樹等。而不起分別。此是娑羅樹。此是多羅樹。乃至此是諾瞿陀樹等。唯起平等樹林勝解。修捨行者。於諸有情。不起分別。應知亦爾。是名捨心定加行。亦名入舍心定。\n　　復次捨心定。有二種。一狹小。二無量。云何狹小舍心定加行？修何加行。入狹小舍心定。謂有一類。於諸可愛可樂可喜可意等有情。謂父母兄弟姊妹。及余隨一親屬朋友等。彼於如是狹小有情。令狹小舍俱心住等住近住安住調伏寂靜最極寂靜一趣等持。於彼有情。住平等捨。彼於爾時。若心散亂。馳流余境。不能一趣。不能守念。令住一緣。於彼有情。住平等捨。齊此未名狹小舍心定加行。亦未名入狹小舍心定。\n　　彼若爾時。攝錄自心。令不散亂。馳流余境。能令一趣。住念一緣。思惟狹小諸有情相。於彼有情。住平等捨。如是思惟。發勤精進。乃至勵意不息。是名狹小舍心定加行。亦名入狹小舍心定。\n　　彼於此道。生已修習。多修習故。便令心住等住近住安住一趣等持無二無退。於彼有情。住平等捨。齊此名為已入狹小舍心定。又此定中。諸心意識。名狹小舍俱有心。諸思等思。乃至造心意業。名狹小舍俱有意業。諸心勝解已勝解。當勝解。名狹小舍俱有勝解。又此定中。若受若想。乃至若慧等。名狹小舍俱有諸法。如是諸法。亦得名狹小舍心定加行。亦名入狹小舍心定。云何無量捨心定加行？修何加行。入無量捨心定。謂即於狹小舍心定。數數修習。令心隨順調伏寂靜。數復調練。令其質直柔軟堪能。與後勝定作所依止。然後漸令勝解徧滿。於東方等無量有情。住平等捨。彼於爾時。若心散亂。馳流余境。不能一趣。不能守念。令住一緣。於彼有情。住平等捨。齊此未名無量捨心定加行。亦未名入無量捨心定。彼若爾時。攝錄自心。令不散亂。馳流余境。能令一趣。住念一緣思惟無量諸有情相於彼有情。住平等捨。如是思惟。發勤精進。乃至勵意不息。是名無量捨心定加行。亦名入無量捨心定。\n　　彼於此道。生已修習多修習故。便令心住等住近住安住一趣等持無二無退。於彼有情。住平等捨。齊此名為已入無量捨心定。又此定中。諸心意識。名無量捨俱有心。諸思等思。乃至造心意業。名無量捨俱有意業。諸心勝解。已勝解。當勝解。名無量捨俱有勝解。又此定中。若受若想。乃至若慧等。名無量捨俱有諸法。如是諸法。亦得名無量捨心定加行亦名入無量捨心定。",
    "捨根": "　　謂順捨觸所生身捨心捨。非平等非不平等受。受所攝。是名捨根。復次修未至定靜慮中間第四靜慮。及無色定。順不苦不樂觸所生心捨。非平等非不平等受。受所攝。是名捨根。",
    "捨界": "　　謂順捨觸所起身捨心捨非平等非不平等受。受所攝。是名捨界。復次修未至定靜慮中間第四靜慮。及無色定。順不苦不樂觸所起心捨非平等非不平等受。受所攝。是名捨界。",
    "捨覺支": "　　謂有苾芻。思惟斷界離界滅界。由此發起心平等性。心正直性。心無警覺寂靜住性。彼作是念。我今應於順貪順嗔順癡諸法。離貪瞋癡。由此發起心平等性心正直性心無警覺寂靜住性。復作是念。我今應於貪瞋癡法。心不攝受。由此發起心平等性心正直性心無警覺寂靜住性。彼審思惟六順捨法所有無漏作意相應。心平等性。心正直性。心無警覺寂靜住性。總名為捨。亦名捨覺支。是聖出世無漏無取道隨行道俱有道隨轉。能正盡苦。作苦邊際。諸有學者如所見諸行。思惟觀察。令至究竟。於諸行中。深見過患。於永涅槃。深見功德。若阿羅漢。如解脫心。思惟觀察。令至究竟。所有無漏作意相應。心平等性。心正直性。心無警覺寂靜住性。是名捨覺支。",
    "掉舉": "　　謂心不寂靜。掉舉等掉舉。心掉舉性。總名掉舉。",
    "掉舉惡作蓋": "　　云何掉舉惡作蓋？謂心不寂靜掉舉等掉舉心掉舉性。總名掉舉。染污心品所有心變心懊心悔我惡作惡作性。總名惡作。如是所說掉舉惡作。覆心蔽心。乃至裡心蓋心。總名為蓋。蓋即掉舉惡作故。名掉舉惡作蓋。",
    "損害離欲": "　　何等損害離欲？謂習欲者暢熱惱已生厭背性。",
    "擇法覺支": "　　謂世尊說。若聖弟子。能如實知善不善法。有罪無罪法。應修不應修法。下劣勝妙法。黑白法。有敵對法。緣生法。\n　　能如實知善不善法者。云何善法？謂善身語業。善心心所法。善心不相應行。及擇滅是名善法。云何不善法？謂不善身語業。不善心心所法。不善心不相應行。是名不善法。彼於如是善不善法。以如實正慧。簡擇極簡擇。遍尋思。遍伺察。審諦伺察。是名能如實知善不善法。\n　　能如實知有罪無罪法者。云何有罪法？謂三惡行。三不善根。十不善業道。是名有罪法。云何無罪法？謂三妙行。三善根。十善業道。是名無罪法。彼於如是有罪無罪法。以如實正慧。簡擇極簡擇。遍尋思。遍伺察。審諦伺察。是名能如實知有罪無罪法。\n　　能如實知應修不應修法者。云何應修法？謂三妙行。三善根。十善業道。親近善士。聽聞正法。如理作意。法隨法行。恭敬聽聞。密護根門。飲食知量。初夜後夜。曾不睡眠。勤修諸善。是名應修法。復次四念住。四正勝。四神足。五根五力。七等覺支。八支聖道。四正行。四法跡。奢摩他毘缽舍那。亦名應修法。云何不應修法？謂三惡行。三不善根十不善業道。親近不善士。聽聞不正法。不如理作意。行非法行。不恭敬聽。不恭敬問。不密護根門。飲食不知量初夜後夜。常習睡眠。不勤修善。是名不應修法。彼於如是應修不應修法。以如實正慧。簡擇極簡擇。遍尋思。遍伺察。審諦伺察。是名能如實知應修不應修法。\n　　能如實知下劣勝妙法者。云何下劣法？謂不善法。及有覆無記。是名下劣法云何勝妙法？謂諸善法。及無覆無記。是名勝妙法。彼於如是下劣勝妙法。以如實正慧。簡擇極簡擇。遍尋思。遍伺察。審諦伺察。是名能如實知下劣勝妙法。\n　　能如實知黑白法者。云何黑白法？謂不善法名黑。善法名白。有罪法名黑。無罪法名白。不應修法名黑。應修法名白。下劣法名黑勝妙法名白。是名黑白法。彼於如是黑白法。以如實正慧。簡擇極簡擇。遍尋思。遍伺察。審諦伺察。是名能如實知黑白法。\n　　能如實知有敵對法者。云何有敵對法？謂貪無貪互相敵對。嗔無嗔互相敵對。癡無癡互相敵對。是名有敵對法。彼於如是有敵對法。以如實正慧。簡擇極簡擇。遍尋思。遍伺察。審諦伺察。是名能如實知有敵對法。\n　　能如實知緣生法者。云何緣生法？謂緣起法。及緣已生法。總名緣生法。彼於如是緣生法。以如實正慧。簡擇極簡擇。遍尋思。遍伺察。審諦伺察。是名能如實知緣生法。\n　　彼如實知善不善法。廣說乃至緣生法時。所有無漏作意相應。於法簡擇極簡擇。最極簡擇。解了等了近了。機黠通達。審察聰睿。覺明慧行。毘缽舍那。總名為慧。亦名慧根。亦名慧力。亦名擇法覺支。亦名正見。是聖出世無漏無取道隨行道俱有道隨轉。能正盡苦。作苦邊際。諸有學者如所見諸行。思惟觀察。令至究竟。於諸行中深見過患。於永涅槃深見功德。若阿羅漢。如解脫心。思惟觀察。令至究竟。所有無漏作意相應。於法簡擇。乃至毘缽舍那。是名擇法覺支。",
    "擇滅": "　　擇滅者，謂是滅是離繫，永害隨眠故。",
    "擾惱": "　　謂心擾惱。已擾惱。當擾惱。擾惱性。擾惱類。總名擾惱。",
    "攝": "　　界攝者，謂諸界種子，由此能攝種所生法。相攝者，謂諸法自相還能自攝。種類攝者，謂約色種類有十色處色蘊所攝，如是等。分位攝者，謂順樂受等分位所攝。助伴攝者，謂色五蘊所攝，彼眷屬故，如是等。時攝者，謂過去等攝過去等。方攝者，謂於此方所有蘊等即此方攝。具分攝者，謂欲色無色無漏諸色攝一切色。一分攝者，謂眼根攝色蘊，如是等。更互攝者，謂蘊界處更互相攝。勝義攝者，謂諸法無常苦不淨空無我真如所攝。",
    "攝事門": "　　攝事門者，謂若於是處約學事聖諦事等辯釋諸經，如說諸惡者莫作諸善者奉行善調伏自心是諸佛聖教，此伽他中依三學說如是等。",
    "攝受": "　　攝受者，謂不善及善有漏法能攝受自體故，即是異熟因，由此能引攝當來一向不相似，無覆無記自體所攝，異熟果故即攝受義。建立異熟因，善有漏言為簡無漏，由違生死故不能感異熟果。",
    "攝受差別": "　　攝受差別者，謂無住涅槃所攝受故。",
    "攝決擇": "　　攝決擇者，謂由十處攝諸決擇。何等十處？謂成所作決擇、趣入決擇、勝解決擇、道理決擇、論決擇、通達決擇、清淨決擇、引發決擇、句差別決擇、不由功用暫作意時一切義成決擇。成所作決擇者，謂能決擇成辦世間種種養命方便等。趣入決擇者，謂能觀察我於三乘當入何乘，云何令他亦得趣入。勝解決擇者，謂由聞慧如所聞教起勝信解。道理決擇者，謂由思慧稱量前後所說意趣。論決擇者，謂如所聞思建立問論道理，為令展轉受用法樂。通達決擇者，謂見道能通達諦理故。清淨決擇者，謂修道以能無餘淨諸煩惱故。引發決擇者，謂勝進道以能引發勝功德故。句差別決擇者，謂以二三四句等差別引發門，演說無邊法義差別故。不由功用暫作意時一切義成決擇者，謂如來智離先功用，於一切義暫作意時，無著無礙智見轉故。",
    "攝益差別": "　　云何攝益差別？謂後所說三句，於劣等勝三種菩薩所如其次第，又諸菩薩成就四法，能無染心廣開法施，一者善達障難，二者善能除遣愚癡沈沒，三者歡喜攝受，四者愛樂為依怙法，如是四法顯示所依及廣開法施差別。何等為依？謂善通達利養恭敬是障難法。云何廣開法施差別？謂示現教導讚勵慶喜，示現者於愚癡沈沒，教導讚勵者於著放逸自輕下劣，慶喜者於正行圓滿，由性愛樂法故，如是前四句中，一一句復引發四句差別，如是等名引發門。",
    "攝釋門": "　　攝釋門者，謂若於是處宣說諸經緣起，所以句義次第意趣釋難。",
    "支分建立": "　　支分建立者，謂初靜慮有五支，何等為五？一尋、二伺、三喜、四樂、五心一境性。第二靜慮有四支，何等為四？一內等淨、二喜、三樂、四心一境性。第三靜慮有五支，何等為五？一捨、二念、三正智、四樂、五心一境性。第四靜慮有四支，何等為四？一捨清淨、二念清淨、三不苦不樂受、四心一境性。問法有無量，何故唯立尋等為支？答對治支故，利益支故，彼二所依自性支故，由此三種支分滿足不待餘故。初靜慮中尋伺二種是對治支，能斷欲界欲恚害等尋伺故，喜樂二種是利益支，由尋伺支治所治已得離生喜樂故。心一境性是彼二所依自性支，依止定力尋等轉故。第二靜慮中內等淨是對治支，由此能治尋伺故，喜樂是利益支，心一境性是彼二所依，自性支義如前說。第三靜慮中捨念正知是對治支，由此三能治喜故，樂是利益支，心一境性是彼二所依，自性支義如前說。第四靜慮中捨清淨念清淨是對治支，由此二能治樂故，不苦不樂受是利益支，心一境性是彼二所依，自性支諸無色中不立支分，以奢摩他一味性故。",
    "支雜染攝": "　　支雜染攝者，若無明若愛若取，是煩惱雜染所攝。若行若識若有，是業雜染所攝，餘是生雜染所攝。問何故識支業雜染攝耶？答諸行習氣所顯故。義者，謂無作者義，有因義，離有情義，依他起義，無作用義，無常義，有剎那義，因果相續不斷義，因果相似攝受義，因果差別義，因果決定義，是緣起義，謂離自在天等作者故，是無作者義。以無明等為因故，是有因義。無自然我故，是離有情義。託眾緣生故，是依他起義。眾緣作用空故，是無作用義。以非恒故是無常義，生時過已無暫住故，是有剎那義。因剎那滅果剎那生時分等故，是因果相續不斷義。不從一切一切生故，是因果相似攝受義。從非一一類因一非一類果生故，是因果差別義。於餘相續不受果故，是因果決定義。甚深者，因甚深故，相甚深故，生甚深故，住甚深故，轉甚深故，是甚深義，謂即由此無作者等義顯緣起法五種甚深。由二種義顯因甚深，對治不平等因無因論故，由一種義顯相甚深，是無我相故，由二種義顯生甚深，雖從眾緣果法得生，然非彼所作故。由二種義顯住甚深，實無安立顯現似住故，由四種義顯轉甚深，因果流轉難了知故。又諸緣起法雖剎那滅而住可得，雖無作用緣而有功能緣可得，雖離有情而有情可得，雖無作者而諸業果不壞可得，是故甚深，業果不壞者雖內無作者而有作業受彼果報又諸法不從自生，不從他生，不從共生。非不自作他作因生，是故甚深。不從自生者，謂一切法非自所作，彼未生時無自性故。不從他生者，謂彼諸緣非作者故。不從共生者，謂即由此二種因故，非不自作他作因生者，緣望果生有功能故。又有差別，謂待眾緣生故非自作，雖有眾緣無種子不生故非他作，彼俱無作用故非共作，種子及眾緣皆有功能故非無因生，是故如是說，自種有故不從他，待眾緣故非自作，無作用故非共生，有功能故非無因，若緣起理非自非他，遣雙句者猶為甚深，況總忘四句，是故緣起最極甚深。",
    "放逸": "　　謂於斷不善法集善法中。不修不習。不恆作。不常作。捨加行。總名放逸。",
    "放逸處": "　　謂上諸酒。飲已能令心生憍傲。惛醉狂亂。不識尊卑。重惑惡業。皆因此起。放逸所依。名放逸處。",
    "故以正知說虛誑語": "　　謂自隱藏想忍見樂故思明瞭。數數宣說施設摽示違想等事。如是名為故以正知說虛誑語。",
    "故思造業": "　　如契經言故思造業，云何名為故思造業？謂他所教敕故思造業，他所勸請故思造業，無所了知故思造業，根本執著故思造業，顛倒分別故思造業，此中根本執著故思造業，顛倒分別故思造業，若作若增長非不受異熟，作者，謂起造諸業令其現行，增長者，謂令習氣增益。",
    "散亂": "　　散亂者，謂貪瞋癡分心流散為體，此復六種，謂自性散亂、外散亂、內散亂、相散亂、麤重散亂、作意散亂。自性散亂者，謂五識身由彼自性於內靜定無功能故。外散亂者，正修善時於五妙欲其心馳散，謂方便修聞等善法，捨彼所緣心外馳散處妙欲中。內散亂者，正修善時沈掉味著，謂修定者發起沈掉及味著故退失靜定。相散亂者，為他歸信矯示修善，謂欲令他信己有德故現此相，由此因緣所修善法漸更退失。麤重散亂者，依我我所執及我慢品麤重力故，修善法時於已生起所有諸受，起我我所及與我慢，執受間雜取相，謂由我執等麤重力故於已生起樂等受中，或執為我，或執我所，或起我慢，由此所修善品永不清淨。執受者，謂初執著，間雜者，從此已後由此間雜諸心相續，取相者，謂即於此受數執異相。作意散亂者，謂於餘乘餘定若依若入所有流散，謂依餘乘或入餘定，捨先所習發起散亂，當知能障離欲為業，謂依隨煩惱性散亂說。",
    "數": "　　數者，謂或六或十，六謂貪瞋慢無明疑見，十謂前五見，又分五謂薩迦耶見，邊執見邪見見取戒禁取。",
    "文善巧": "　　云何文善巧？謂善知訓釋文詞故。云何詞善巧？謂能善知我我所等世俗言詞不深執著隨順說故。云何前際後際密意善巧？謂能善知於前際領受於後際，出離故。",
    "斷": "　　斷云何？謂如此差別斷，由此作意斷從此而得斷。如此差別斷者，謂遍知故遠離故得對治故。遍知者，謂彼因緣事遍智自體遍智過患遍智。彼因緣事遍智者，謂知煩惱隨眠未永斷故，如是等如前說。自體遍智者，謂知此煩惱生已極惱亂心性。過患遍智者，謂知此煩惱能引自害，能引害他，能引俱害，能生現法過，能生後法過，能生現法後法過，能令有情受此所生身心憂苦。遠離者，雖彼暫生而不堅執，由彼因緣事遍智等三種遍智，於彼已生一切煩惱，心不堅執方便遠離。得對治者，謂未生者令不生故，已生者令斷故得對治道，為令未生已生煩惱不生永斷，修治道故。問何等作意能斷耶？答總緣作意觀一切法，皆無我性能斷煩惱。總緣作意者，謂合緣一切法共相行作意。問若唯總緣諸法無我智能斷煩惱者，何故顯示無常等行？答非為斷煩惱故修習彼行，但為修治無我行故，由依無常行引得苦行，依止苦行引無我行。如經言，無常故苦，苦故無我，是故建立此無我行為無上。無上有三種，謂智無上、行無上、解脫無上。智無上者，謂無我智，得此智已更無所求故。行無上者，謂樂，速通行一切，行中最第一故。解脫無上者，謂無，學不動解脫，於一切解脫最為勝故。此三無上如其次第，依止見修無學道說。問從何而得斷耶？答不從過去已滅故，不從未來未生故，不從現在道不俱故，然從諸煩惱麤重而得斷為，斷如是如是品麤重，生如是如是品對治，若此品對治生，即此品麤重滅，平等平等猶如世間明生暗滅，由此品離繫故，令未來煩惱住不生法中，是名為斷。",
    "斷樂者，第四靜慮": "　　斷樂者。云何樂？謂順樂觸所起身樂心樂。平等受受所攝。總名為樂。復次修第三靜慮時。順樂受觸所起心樂。平等受受所攝。是名樂。\n　　斷苦者。云何苦？謂順苦觸所起身苦。不平等受受所攝。是名苦。此苦及樂。爾時俱得。斷徧知。遠離極遠離。調伏極調伏。隱沒除滅。是故說為斷樂斷苦。\n　　先喜憂沒者。云何喜？謂順喜觸所起心喜。平等受受所攝。是名喜。復次修第二靜慮時。順喜受觸所起心喜平等受受所攝。是名喜。\n　　云何憂？謂順憂觸所起心憂。平等受受所攝。是名憂。\n　　此及前喜。爾時俱得斷徧知。乃至隱沒除滅。是故說為先喜憂沒。\n　　復次入初靜慮時。憂得斷徧知。入第二靜慮時。苦得斷徧知。入第三靜慮時。喜得斷徧知。入第四靜慮時。若樂若苦。若喜若憂。皆得斷徧知。遠離極遠離。調伏極調伏。隱沒除滅。是故說為斷樂斷苦。先喜憂沒不苦不樂者。顯此中無苦樂二受。唯有第三非苦非樂受捨念淸淨者。\n　　云何捨？謂彼爾時心平等性。心正直性。心無警覺寂靜住性總名為捨。\n　　云何念？謂彼爾時諸念隨念。廣說乃至。心明記性。總名為念。彼於爾時。若捨若念。俱得淸淨樂苦喜憂。尋伺二息。皆遠離故。說名淸淨。第四者。謂此靜慮。順次數中。居第四故。復次此於九種次第定中。在第四故。靜慮者。謂在此定中。不苦不樂。受捨念。心一境性。總此四支。名第四靜慮。如有頌言。\n　　樂苦等已滅　　心堅住不動\n　　得淸淨天眼　　能廣見眾色\n　　不苦不樂受　　淨捨念及定\n　　名第四靜慮　　諸佛所稱譽\n　　在此定中。諸心意識。名第四靜慮。俱有之心。諸思等思。乃至造心意業。名第四靜慮。俱有意業。諸心勝解。已勝解。當勝解。名第四靜慮。俱有勝解。在此定中。若受若想。乃至若慧等。名第四靜慮。俱有諸法。如是諸法。亦得名為第四靜慮。此靜慮名。所依之義。具足及住。皆如前說。",
    "方": "　　方者，謂即於東西南北四維上下因果差別假立為方。何以故？即於十方因果遍滿假說方故，當知此中唯說色法所攝因果，無色之法遍布處所無功能故。",
    "方便": "　　任持方便者，謂於資糧所有方便。瑜伽方便者，謂奢摩他毘鉢舍那。相方便者，謂於止舉捨相中所有方便。決擇方便者，謂於順決擇分中所有方便。隔越方便者，謂即任持方便。鄰次方便者，謂即決擇方便。鄰次隔越方便者，謂即瑜伽及相二種方便。於順決擇分中名鄰次，於任持方便中名隔越，去聖道遠故，通達修圓證，餘處已說故不重釋。智究竟者，謂盡無生智。斷究竟者，謂一切煩惱無餘永斷。畢竟究竟者，謂由出世間道。不畢竟究竟者，謂由世間道。下劣究竟者，謂聲聞獨覺。廣大究竟者，謂諸佛菩薩。菩薩究竟者，謂於最後位。諸佛究竟者，謂無障智生時，猶如百千俱胝等日一時出現，二十種引發前已廣說。",
    "方便善巧": "　　方便善巧者略有四種，一成熟有情善巧，二圓滿佛法善巧，三速證神通善巧，四道無斷善巧。成熟有情善巧者，謂四攝事，由攝受彼令處善法故。圓滿佛法善巧者，謂慧波羅蜜多，如經言，若菩薩摩訶薩欲得圓滿施波羅蜜多乃至一切種妙智性，當學般若波羅蜜多故。速證神通善巧者，謂日夜六時發露諸惡，隨喜功德，勸請諸佛，迴向善根等。廣說如聖者彌勒所問經道無斷善巧者，謂無住處涅槃，由此數數究竟無斷，周遍十方一切世界，隨所應化，示現一切佛菩薩行。",
    "方便差別": "　　云何方便差別？此有二種，謂隨信行、隨法行，補特伽羅差別故。",
    "方便示現成等正覺入般涅槃差別": "　　方便示現成等正覺入般涅槃差別者，謂於十方一切世界，隨其所應，乃至後際數數示現成正覺等，令一切所化眾生成熟解脫故。",
    "方便道": "　　方便道者，謂由此道能捨煩惱。所以者何？由正修如是道時，能漸捨離各別上品等煩惱所生品類麤重，一分漸得轉依，是名修道中方便道。",
    "方廣": "　　方廣者，謂菩薩藏相應言說，如名方廣，亦名廣破，亦名無比。為何義故名為方廣？一切有情利益安樂所依處故，宣說廣大甚深法故。為何義故名為廣破？以能廣破一切障故。為何義故名為無比？無有諸法能比類故，此方廣等皆是大乘義差別名，由與七種大性相應故名大乘。何等名為七種大性？一境大性，以菩薩道緣百千等無量諸經，廣大教法為境界故。二行大性，正行一切自利利他廣大行故。三智大性，了知廣大補特伽羅法無我故。四精進大性，於三大劫阿僧企耶，方便勤修無量百千難行行故。五方便善巧大性，不住生死及涅槃故。六證得大性，證得如來諸力無畏不共佛法等無量無數大功德故。七業大性，窮生死際示現一切成菩提等，建立廣大諸佛事故。",
    "方廣一分": "　　何因緣故唯方廣一分名為菩薩波羅蜜多藏？由此分中廣說一切波羅蜜多數故，相故、次第故、釋詞故、修故、差別故、攝故、所治故、功德故、更互決擇故。",
    "方廣分": "　　復次何緣說方廣分為廣大甚深耶？由一切種智性廣大甚深故，謂此所得一切種智性果最廣大甚深故，因受果名，是故別說方廣分為廣大甚深。\n　　復次如方廣分說，一切諸法皆無自性，此言依何密意說，謂無自然性故，無自體性故，無住自體故，無如愚夫所取相性故。無自然性者，由無自然性故說無自性，不遮待緣性故說無自性。無自體性者，由此自體曾所經有，即此自體不可復有故，說為無性。無住自體者，體雖現在未至壞相次必當滅，體無住義故說無性。無如愚夫所取相性者，如諸愚夫未見諦者，依止名言戲論熏習門，妄取諸法性相遠離，如是所取自性故說無性。",
    "方所示現": "　　方所示現。謂由方所可相，示現如此如此色，如是如是色或由定心，或由不定尋思相應種種搆畫。",
    "方攝": "　　方攝者，謂依東方諸蘊界處還自相攝餘方，蘊界處亦爾。",
    "於欲身心俱不離": "　　可愛妙境。皆非真欲。於彼所起分別貪愛。乃是真欲。是故此中應作四句。\n　　一有一類補特伽羅。於諸欲境。身離非心。謂如有一剃除鬚髮。披服袈裟。正信出家。身參法侶。心猶顧戀所受諸欲。數復發起猛利貪愛。彼身出家。心猶未出。是名於欲身離非心。\n　　二有一類補特伽羅。於諸欲境。心離非身。謂如有一。雖有妻子。受用上妙田宅臥具香鬘瓔珞衣服飲食受畜種種金銀珍寶驅役奴婢僮僕作使。或時發起打罵等業。而於諸欲。不生耽染。不數發起猛利貪愛。彼身在家。其心已出。是名於欲心離非身。\n　　三有一類補特伽羅。於諸欲境。身心俱離。謂如有一剃除鬚髮披服袈裟正信出家身參法侶。於諸欲境。心無顧戀。不數發起緣彼貪愛。失念暫起。深生悔愧。彼身出家。其心亦出。是名於欲身心俱離。\n　　四有一類補特伽羅。於諸欲境。身心俱不離。謂如有一畜妻養子。受用上妙田宅臥具香鬘瓔珞衣服飲食受畜種種金銀珍寶驅役奴婢僮僕作使。發起種種打罵等業。復於諸欲。深生耽染。數數發起猛利貪愛。彼身心二種。俱不出家。是名於欲身心俱不離。",
    "於諸有情眾生勝類無羞無愍": "　　若諸異生。說名眾生。世尊弟子。說名勝類。於此有情眾生勝類。應羞應愍。而於其中。無慚無羞。無愧無恥。無哀無愍。無傷無念。如是名為於諸有情眾生勝類無羞無愍。",
    "施業": "　　復次總約一切無漏業無有差別所有障礙隨順體性，如其次第建立曲穢濁等諸染污業，淨牟尼等諸清淨業。曲業者，若身語意業能障正直八聖道支令不生長。穢業者，若身等業能污相續，依此發生如是障業。濁業者，若身等業依止外道顛倒見生，一切如來清淨聖教之所對治不信，混濁之所攝故。復有差別墮在斷常，邊違處中行義名曲，損減見所攝增惡清淨所立法義名穢，薩迦耶見所攝，障真無我見義名濁。淨業者，與如是等諸雜染業相違類解。三淨業者，謂善淨尸羅，正直見所攝，身語意業遠離毀犯戒見垢故。三牟尼業者，謂學無學所有無漏身語意業，唯諸牟尼有此業故，又有施等諸清淨業。施業云何？謂因緣故、等起故、處所故、自體故。分別施業因緣者，謂無貪無瞋無癡善根。等起者，謂彼俱行思。處所者，謂所施物。自體者，謂正行施時身語意業。云何施圓滿？謂數數施故無偏黨施故，隨其所欲圓滿施故，施得圓滿。依此義故經作是說，為大施主者，此顯數數施義。由彼串習成性數數能施故，一切沙門婆羅門等者，此顯無偏黨施義。無有差別一切施故，若食若飲等者，此顯隨其所欲圓滿施義如所意願一切資財皆施與故復次無所依施故。廣清淨施故極歡喜施故，數數施故，田器施故，善分布新舊施故，施得圓滿。依此義故經作是說，解脫捨舒手施樂，遠離常祠祀捨具足，於正施時樂等分布，如是諸句隨其次第，顯示無所依施等。無所依施者，謂不迴向有及資財而行惠施。田器者，謂貧苦田功德田。舒手者，廣行惠施手不潛縮故。常祠祀者，串習祠祀以成性故。捨具足者，慧為先故。於正施時樂等分布者，於來求者以所施物等分布故。",
    "施波羅蜜多相": "　　云何施波羅蜜多相？謂諸菩薩安住菩薩法性菩提心為依止，以悲導心捨一切時所有身語意業，如是由種性故願故意樂故事故自體故，顯施波羅蜜多相。種性者，謂菩薩法性。願者，謂菩提心。意樂者，謂悲導心。事者，謂捨諸所有。自體者，謂身語意業。",
    "施物圓滿": "　　云何應知施物圓滿？謂所施財物非誑詐得故，所施財物非侵他得故，所施財物非穢離垢故，所施財物清淨故，所施財物如法所引故，是名施物圓滿。依此義故經作是說發起正勤所得，財物者此顯施物非，誑詐得誑詐得者謂不起正勤，而得財物於自住處他所寄物，謀詐得故運手臂力所得財物者，此顯施物非侵他得。侵他得者，非自運動手力而得，他所勤，苦種種方便獲得財物，侵陵取故離污垢物者，此顯施物非穢離垢，由所施物遠離污垢染污故，如法財者，此顯施物清淨。遠離刀毒酒等非淨施物，故如法所得者，此顯施物如法所引，遠離偽斗稱等邪命財故。",
    "明行圓滿": "　　何等為明？謂佛所有無學三明。一者無學宿住隨念智作證明。二者無學死生智作證明。三者無學漏盡智作證明。是謂為明。何等為行？謂佛所有無學身律儀。語律儀。命淸淨。是謂為行。又佛所有上妙威儀。往來顧視。屈伸俯仰。服僧伽胝。執持衣缽。悉皆嚴整。是謂為行。此行前明。總謂明行。如來具足圓滿成就如是明行。一向鮮白。一向微妙。一向無罪。是故名為明行圓滿。",
    "時": "　　時者，謂於因果相續流轉，假立為時。何以故？由有因果相續轉故，若此因果已生已滅立，過去時，此若未生立未來時，已生未滅立現在時。",
    "時攝": "　　時攝者，謂過去世諸蘊界處還自相攝，未來現在諸蘊界處亦爾。",
    "智者內證": "　　智者內證者。佛及佛弟子。名為智者。世尊所說苦集滅道。智者自內知見解了正等覺為苦集滅道。故佛正法。名智者內證。",
    "智者於界善巧": "　　云何智者於界善巧？佛言。智者於十八界。如實知見。是界善巧。謂如實知見。眼界色界眼識界。耳界聲界耳識界。鼻界香界鼻識界。舌界味界舌識界。身界觸界身識界。意界法界意識界。\n　　復於六界。如實知見。是界善巧。謂如實知見地界水界火界風界空界識界。\n　　復於六界。如實知見。是界善巧。謂如實知見欲界恚界害界無慾界無恚界無害界。\n　　復於六界。如實知見。是界善巧。謂如實知見樂界苦界。喜界憂界捨界無明界。\n　　復於四界。如實知見。是界善巧。謂如實知見受界想界行界識界。\n　　復於三界。如實知見。是界善巧。謂如實知見欲界色界無色界。\n　　復於三界。如實知見。是界善巧。謂如實知見色界無色界滅界。\n　　復於三界。如實知見。是界善巧。謂如實知見過去界未來界現在界。\n　　復於三界。如實知見。是界善巧。謂如實知見劣界中界妙界。\n　　復於三界。如實知見是界善巧。謂如實知見善界不善界無記界。\n　　復於三界。如實知見。是界善巧。謂如實知見學界無學界非學非無學界。\n　　復於二界。如實知見。是界善巧。謂如實知見有漏界無漏界。\n　　復於二界。如實知見。是界善巧。謂如實知見有為界無為界。是名智者於界善巧。",
    "智者於緣起善巧": "　　阿難陀言。云何智者於緣起善巧？佛言。智者於十二支緣起順逆。如實知見。是緣起善巧。謂如實知見依此有彼有。此生故彼生。謂無明緣行，行緣識，識緣名色，名色緣六處，六處緣觸，觸緣受，受緣愛，愛緣取，取緣有，有緣生，生緣老死。發生愁嘆苦憂擾惱。如是便集純大苦蘊。及如實知依此無彼無。此滅故彼滅。謂無明滅故行滅，行滅故識滅，識滅故名色滅，名色滅故六處滅，六處滅故觸滅，觸滅故受滅，受滅故愛滅，愛滅故取滅，取滅故有滅，有滅故生滅，生滅故老死愁嘆苦憂擾惱滅。如是便滅純大苦蘊。是名智者於緣起善巧。",
    "智者於蘊善巧": "　　阿難陀言。云何智者於蘊善巧？佛言。智者於五蘊。如實知見。是蘊善巧。謂如實知見色蘊、受蘊、想蘊、行蘊、識蘊。是名智者於蘊善巧。",
    "智者於處善巧": "　　阿難陀言。云何智者於處善巧？佛言。智者於十二處。如實知見。是處善巧。謂如實知見眼處、色處、耳處、聲處、鼻處、香處、舌處、味處、身處、觸處、意處、法處。是名智者於處善巧。",
    "智者於處非處善巧": "　　云何智者於處非處善巧？佛言。智者於處非處。如實知見是處非處善巧。謂如實知。無處無容身語意惡行。感可愛可樂可欣可意異熟。有處有容身語意惡行。感不可愛不可樂不可欣不可意異熟。無處無容身語意妙行。感不可愛不可樂不可欣不可意異熟。有處有容身語意妙行。感可愛可樂可欣可意異熟。無處無容行身語意惡行已。由此因緣。身壞命終。生諸善趣。有處有容行身語意惡行已。由此因緣。身壞命終。墮諸惡趣。無處無容行身語意妙行已。由此因緣。身壞命終。墮諸惡趣。有處有容行身語意妙行已。由此因緣。身壞命終。生諸善趣。是處非處善巧。\n　　復如實知見無處無容非前非後。有二輪王生一世界。有處有容。非前非後。有一輪王。生一世界。無處無容。非前非後。有二如來。生一世界。有處有容。非前非後。有一如來。生一世界。是處非處善巧。\n　　復如實知見無處無容女作輪王帝釋魔王梵王。及證獨覺菩提。或證無上正等菩提。有處有容男作輪王帝釋魔王梵王。及證獨覺菩提。或證無上正等菩提。是處非處善巧。\n　　復如實知見無處無容具聖見者故思害母害父。害阿羅漢。破和合僧。及起噁心。出佛身血。有處有容諸異生者。作五無間。無處無容具聖見者。故思斷眾生命。有處有容諸異生者。故思斷眾生命。無處無容具聖見者。故思越諸學處。有處有容諸異生者。故思越諸學處。無處無容具聖見者。捨勝學處趣劣學處。或求外道為師。或求外道為福田。或瞻仰外道沙門婆羅門面。或種種占卜諸吉祥事。執為淸淨。或受第八有。有處有容諸異生者。有如是事。是處非處善巧。\n　　復如實知見無處無容。未斷五蓋。令心染污。令慧力羸。障礙道品。違涅槃者。心善安住四念住中。有處有容已斷五蓋。令心染污令慧力羸。障礙道品。違涅槃者。心善安住四念住中。無處無容未斷五蓋。廣說乃至違涅槃者。心未善住四念住中。而能修習七等覺支。有處有容已斷五蓋。廣說乃至違涅槃者。心已善住四念住中。乃能修習七等覺支。無處無容未斷五蓋。廣說乃至違涅槃者。心未善住四念住中。而能修習七等覺支。而證聲聞獨覺無上菩提。有處有容已斷五蓋。廣說乃至違涅槃者。心已善住四念住中已。能修習七等覺支。乃能證得聲聞獨覺無上菩提。是名智者於處非處善巧。",
    "智見無著無礙": "　　又阿羅漢比丘於三世所知事，不能起心即解故智見有著不能一切悉解，故智見有礙，如來於三世境暫起心時即遍知一切，是故智見無著無礙。十八中前六於不共身語意業清淨具足中，所有三摩地等為體，無有誤失依身清淨說，無卒暴音依語業清淨說，無忘失念無不定心，無種種想無不擇捨，此四依意業清淨說，志欲無退乃至解脫無退，此六於所依及果根未得不退具足中，所有三摩地等為體，所依謂志欲，果謂解脫，根謂精進等，一切身語意業智為前導隨智而轉，此三於不共業現行具足中，所有三摩地等為體，知去來今無著無礙，此三於不共智住具足中，所有三摩地等為體。",
    "暫時差別": "　　何等暫時差別？謂諸無學最後剎那蘊界處。",
    "暴流": "　　暴流有四，謂欲暴流、有暴流、見暴流、無明暴流。隨流漂鼓是暴流義，隨順雜染故，初是習欲求者，第二是習有求者，後二是習邪梵行求者，能依所依相應道理故。見暴流是能依，無明暴流為所依，由有愚癡顛倒推求解脫及方便故。",
    "更互攝": "　　更互攝者，色蘊攝幾界幾處，十全一少分，受蘊攝幾界幾處，一少分，如受蘊想行蘊亦爾。識蘊攝幾界幾處，七界一處，眼界攝幾蘊幾處，色蘊少分一處全，如眼界耳鼻舌身色聲香味觸界亦爾。意界攝幾蘊幾處，一蘊一處，法界攝幾蘊幾處，三蘊全色蘊少分一處全，眼識界攝幾蘊幾處，識蘊意處少分，如眼識耳鼻舌身意識界亦爾。眼處攝幾蘊幾界，色蘊少分一界全，如眼處耳鼻舌身色聲香味觸處亦爾。意處攝幾蘊幾界，一蘊七界，法處攝幾蘊幾界，三蘊全一少分一界全，如是諸餘法以蘊界處名說，及餘非蘊界處名說。如實有假有世俗有勝義有所知所識所達有色無色有見無見，如是等如前所顯，隨其所應，與蘊界處更互相攝盡當知，隨其所應者，如蘊一一攝諸界處，界一一攝諸蘊處，處一一攝諸蘊界，如是廣說當思了知。勝義攝者，謂蘊界處真如所攝。\n　　如是攝相，隨諸世間共所成立，相攝道理復有六種，一依處攝，如世間說，贍部洲攝於人，阿練若攝於鹿，當知此中眼等諸根攝眼等識亦爾。二任持攝，如世間說，繩等攝薪束等，當知此中身根攝眼等根亦爾。三同事攝，如世間說，眾人同事共相保信更互相攝，當知此中同一緣轉，諸相應法更互相攝亦爾。四攝受攝，如世間說，主能攝錄自僕使等，當知此中阿賴耶識攝受自身亦爾。五不流散攝，如世間說，瓶攝持水，當知此中，諸三摩地攝餘心心法亦爾。六略集攝，如世間說，海攝眾流，當知此中色受蘊等攝眼耳等亦爾，如前所說十一種攝，皆依此中略集攝說\n　　問於攝善巧得何勝利？答得於所緣略集勝利隨彼彼境略聚其心，如是如是善根增勝。",
    "曾習同行相應": "　　復有曾習同行相應，謂諸異生所有心心所，及有學者一分心心所。",
    "最勝": "　　最勝者，謂佛菩薩無住涅槃攝所有滅，以常安住一切有情利樂事故。",
    "有": "　　有有二種業，一令諸有情後有現前，二與生作緣。",
    "有上": "　　云何有上？幾是有上？為何義故觀有上耶？謂一切有為故，無為一分故，是有上義。除法界法處一分，一切是有上，以一切法中涅槃及清淨真如是最勝相故，為捨執著下劣事我故，觀察有上。",
    "有上離欲": "　　何等有上離欲？謂世間聲聞獨覺所有離欲。",
    "有四聖種是最勝者": "　　謂四聖種。是一切佛。及諸弟子。共所施設。為最勝故。是種姓者。謂四聖種。是一切佛。及諸弟子古昔不共家種姓故。是可樂者。謂四聖種。是一切佛。及諸弟子。久遠已來。晝夜等時。可樂法故。現無雜穢者。謂四聖種不為現在惡不善法。親近塗染。性不雜彼。能遠離故。曾無雜穢者。謂四聖種。不為過去。惡不善法。親近塗染性不雜彼。能遠離故。當無雜穢者。謂四聖種。不為未來惡不善法。親近塗染。性不雜彼。能遠離故諸沙門等。無能以法而譏毀者。謂四聖種。非一切佛及諸弟子。或諸賢貴。或諸善士。而能譏毀。",
    "有學": "　　云何有學？幾是有學？為何義故觀有學耶？謂求解脫者所有善法，是有學義。從積集資糧位已去名求解脫者，當知求證解脫分位，名積集資糧位。十界四處諸蘊一分是有學。十界者，謂七識色聲法界。四處者，謂色聲意法處，為捨執著求解脫我故，觀察有學。",
    "有尋有伺": "　　云何有尋有伺？謂離欲惡不善法者。心相應品。具有尋伺。離生喜樂者。",
    "有對": "　　云何有對？幾是有對？為何義故觀有對耶？謂諸有見者皆是有對，又三因故說名有對，謂種類故，積集故，不修治故。種類者，謂諸色法互為能礙，互為所礙，能礙往來是有對義，此唯應言互為能礙。所以復言互為所礙者，為建立光明等色是有對故，以彼唯是所礙非能礙性性自爾故，種類是自性義。積集者，謂極微已上，以一極微無對礙故。不修治者，謂非三摩地自在轉色，定自在力所轉諸色無對礙故，如平等心，諸天又損害依處，是有對義謂若依若緣能生瞋恚名為有對，即以如是有對義故，一切皆是有對，或隨所應，謂所餘義為捨執著不遍行我故，觀察有對。",
    "有染": "　　云何有染？幾是有染？為何義故觀有染耶？謂若依如是貪瞋癡故，染著後有自身，彼自性故，彼相屬故，彼所縛故，彼隨逐故，彼隨順故，彼種類故，是有染義。染著後有者，謂貪瞋癡是染著，後有因故名染。云何瞋恚是染著後有因？謂由憎嫉諸清淨法染著後有故，如是乃至有諍有爾所量，有染亦爾，為捨執著染合我故，觀察有染。",
    "有欲邪行者": "　　謂於欲邪行。不深厭患。不遠不離。安住成就。如是名為有欲邪行者。",
    "有漏": "　　云何有漏？幾是有漏？為何義故觀有漏耶？謂漏自性故，漏相屬故，漏所縛故，漏所隨故，漏隨順故，漏種類故，是有漏義。漏自性者，謂諸漏自性漏性合故名為有漏，漏相屬者，謂漏共有心心法，及眼等漏相應故，漏所依故，如其次第名有漏。漏所縛者謂有漏善法，由漏勢力招後有故，漏所隨者，謂餘地法，亦為餘地諸漏麤重所隨逐故，漏隨順者，為順決擇分，雖為煩惱麤重所隨，然得建立為無漏性，以背一切有順彼對治故。漏種類者，謂阿羅漢有漏諸蘊，前生煩惱所起故，五取蘊十五界十處全及三界二處少分是有漏，謂除最後三界二處少分聖道眷屬及諸無為，非有漏故，為捨執著漏合我故，觀察有漏。",
    "有漏界": "　　謂有漏五蘊。是名有漏界。",
    "有為": "　　云何有為？幾是有為？為何義故觀有為耶？謂若法有生滅住異，當知是有為義，一切皆是有為，唯除法界法處一分，為捨執著無常我故，觀察有為。",
    "有為界": "　　謂五蘊。是名有為界。",
    "有異熟": "　　云何有異熟？幾是有異熟？為何義故觀有異熟耶？謂不善及善有漏，是有異熟，由不善及有漏善法，能有當來阿賴耶識及相應異熟，由彼異熟故此二種名有異熟。十界四處諸蘊一分，是有異熟。十界者，謂七識色聲法界。四處者，謂色聲意法處。一分者，謂除無記無漏。為捨執著能捨能續諸蘊我故，觀察有異熟。又異熟者，唯阿賴耶識及相應法，餘但異熟生非異熟餘者謂眼耳等及苦樂等，是阿賴耶識餘，此唯得名異熟生，從異熟生故。。",
    "有相行菩薩": "　　有相行菩薩者，謂住極喜離垢發光焰慧極難勝現前地中所有菩薩，由此六地雖不喜樂而為諸相所間雜故。",
    "有相行菩薩補特伽羅": "　　何等有相行菩薩補特伽羅？謂住極喜離垢發光焰慧極難勝現前地中所有菩薩。",
    "有緣生": "　　謂有一類。由貪瞋癡纏縛心故。造身語意三種惡行。此三惡行。說名業有。由此因緣。身壞命終。墮於地獄。於彼諸生等生。趣入出現。蘊得界得處得諸蘊生命根起。說名生。此生緣有故起。是名有緣生。\n　　如說地獄。傍生鬼界。應知亦爾。復有一類。於人趣樂。繫心希求。彼作是念。願我當生人趣同分。與諸人眾。同受快樂。因此希求。造能感人趣身語意妙行。此三妙行。說名業有。由此因緣。身壞命終。生於人趣眾同分中。於彼諸生等生。乃至命根起說名生。此生緣有故起。是名有緣生。如說人趣。四大王眾天。乃至他化自在天。應知亦爾。\n　　復有一類。於梵眾天。繫心希求。彼作是念。願我當生梵眾天眾同分中。因此希求。勤修加行。離欲惡不善法。有尋有伺。離生喜樂。初靜慮具足住。於此定中。諸身律儀。語律儀。命淸淨。說名業有。由此因緣。身壞命終。生梵眾天眾同分中。於彼諸生等生。乃至命根起。說名生。此生緣有故起。是名有緣生。如說梵眾天。梵輔天乃至廣果天。應知亦爾。\n　　復有一類。於無想天。繫心希求。彼作是念。願我當生無想天眾同分中。因此希求。勤修加行。思惟諸想。是粗苦障。思惟無想是靜妙離。由此思惟。能滅諸想。安住無想。彼諸想滅。住無想時。名無想定。入此定時。諸身律儀。語律儀。命淸淨。說名業有。由此因緣。身壞命終。生無想天眾同分中。於彼諸生等生。乃至命根起。說名生。此生緣有故起。是名有緣生。\n　　復有一類。於空無邊處天。繫心希求。彼作是念。願我當生空無邊處天眾同分中。因此希求。勤修加行。超諸色想。滅有對想。不思惟種種想。入無邊空空無邊處具足住。於此定中。諸思等思。現前等思。已思當思。思性思類。造心意業。說名業有。由此因緣。身壞命終。生空無邊處眾同分中。於彼諸生等生。乃至命根起。說名生。此生緣有故起。是名有緣生。如說空無邊處。乃至非想非非想處。應知亦爾。\n　　復次大因緣經中。尊者慶喜問佛。諸生為有緣不。佛言有緣。此緣謂有。廣說乃至。若無業有。魚鳥蛇蠍。那伽藥叉部多。食香諸天人等。無足二足。多足異類。彼彼有情。於彼彼聚生等生等。為得有不。不也世尊。若全無有為可施設。有諸生不。不也世尊。是故慶喜。諸生皆以有為其緣。是名有緣生。如是諸生。有為緣。有為依。有為建立。故起等起生等生。聚集出現。故名有緣生。",
    "有色": "　　云何有色？幾是有色？為何義故觀有色耶？謂色自性故、依大種故、喜集故、有方所故、處遍滿故、方所可說故、方處所行故、二同所行故、相屬故、隨逐故、顯了故、變壞故、顯示故、積集建立故、外門故、內門故、長遠故、分限故、暫時故、示現故、是有色義。色自性者，謂即用色法為自性故名為有色，非與餘色合故名為有色，是故最初說色自性，依大種者，此顯與餘色合故名有色，諸所造色與大種色合故名有色，諸大種色展轉合故名有色。喜集者，即有色法以喜為集名為喜集，非如現在喜愛以先觸受等為集名為喜集。有方所者，有分量故。處遍滿者，形量遍十方故。方所可說者，可說在此在彼方故。方處所行者，謂隨所住方所緣性故。二同所行者，謂二有情共所緣性故，非如無色法，如自所受他不能取故。相屬者，謂眼識等亦名有色繫，屬有色根故。隨逐者，謂生無色界異生諸色種子所隨逐故，顯了者謂諸尋思由能顯了所緣境故。變壞者，謂五蘊，由手等所觸受等所切，隨其所應即便變壞以變壞是色義故。顯示者，謂諸言說顯示義故。積集建立者，謂極微已上色。有微細分可建立故外門者，謂欲界色，妙欲愛所生故。內門者，謂色界色，定心愛所生故，由此道理說彼諸色，名意生身。長遠者，謂異生色不可建立，前後兩際有邊量故。分限者，謂有學色，已作生死分限故。暫時者，謂無學色，唯餘現在一有身故。示現者，謂如來等所現諸色，唯是示現非真實故，一切皆是有色，或隨所應。一切是有色者，謂變壞色等。隨所應者，謂餘色外門等六，色差別當知與受等共，為捨執著有色我故，觀察有色。",
    "有莊嚴": "　　有莊嚴者，謂俱分解脫三明六通阿羅漢等所有滅，有無量種種量勝功德所莊嚴故。",
    "有虛誑語者": "　　謂於虛誑語。不深厭患。不遠不離。安住成就。如是名為有虛誑語者。",
    "有行般涅槃補特伽羅": "　　有行般涅槃補特伽羅者，謂生彼已由加行力，聖道現前得盡苦際，由加行者，與上相違故。",
    "有見": "　　謂於我及世間。起常恆想。由此生忍樂慧觀見。是名有見。",
    "有諍": "　　云何有諍？幾是有諍？為何義故觀有諍耶？謂以依如是貪瞋癡故，執持刀杖發起一切鬥訟違諍，執持刀杖等是諍因貪等是諍自性，如是彼自性故，彼相屬故，彼所縛故，彼所隨故，彼隨順故，彼種類故，是有諍義。乃至有漏有爾所量，有諍亦爾，彼所隨義故，為捨執著諍合我故，觀察有諍。",
    "有身見": "　　謂於五取蘊。起我我所想。由此生忍樂惠觀見。名有身見。",
    "有間同行相應": "　　復有有間同行相應，謂無心定所間。",
    "有餘": "　　有餘者，謂有餘事滅。",
    "未來": "　　云何未來？幾是未來？為何義故觀未來耶？謂有因非已生故，未得自相故，因果未受用故，雜染清淨性未現前故，因果自相有非有故，希為雜染相故，不希為清淨相故，是未來義。有因非已生者，為簡無為，彼雖非已生而無因故。未得自相者，自體未生故。因果未受用者，謂彼種子未作所作故，彼性未生故，一切一分是未來。為捨執著流轉我故，觀察未來。",
    "未來界": "　　謂未來五蘊。是名未來界。",
    "未具資糧": "　　又未具資糧者，謂緣諦增上法為境，於諸諦中成就下品諦察法忍，成就下品順決擇分，未定生時。",
    "未具資糧補特伽羅": "　　未具資糧補特伽羅者，謂緣諦增上法為境，發起軟品清信勝解，成就軟品順解脫分，未定生時。",
    "未曾習同行相應": "　　復有未曾習同行相應，謂出世間諸心心所，及初後時出世後所得諸心心所，於相應善巧得何勝利，能善了悟唯依止心，有受想等染淨諸法相應不相應義。由此了悟，即能捨離計我能受能想能思能念染淨執著，又能善巧速入無我。",
    "未知當知根": "　　謂已入正性離生者。所有學慧慧根。及隨信隨法行。於四聖諦。未現觀。為現觀故諸根轉。是名未知當知根。",
    "本事": "　　本事者，所謂宣說聖弟子等前世相應事。",
    "本生": "　　本生者，所謂宣說諸菩薩行本相應事。",
    "果差別": "　　果差別者，復有十種，謂轉依差別、功德圓滿差別、五相差別、三身差別、涅槃差別、證得和合智用差別、障清淨差別、和合作業差別、方便示現成等正覺入般涅槃差別、五種拔濟差別。",
    "染污": "　　云何染污？幾是染污？為何義故觀染污耶？謂不善及有覆無記法，是染污義。有覆無記者，謂遍行意相應煩惱等，及色無色界繫諸煩惱等，諸蘊十界四處一分是染污。十界者，謂七識色聲法界。四處者，謂色聲意法處。為捨執著煩惱合我故，觀察染污。",
    "染污遍行同行相應": "　　復有染污遍行同行相應，謂於染污意四種煩惱。",
    "染貪": "　　謂於諸欲諸貪等貪。乃至貪類貪生。總名染貪。",
    "株杌": "　　株杌有三，謂貪、瞋、癡。由依止貪瞋癡先所串習為方便故，成貪等行心不調順，無所堪能難可解脫，令諸眾生難斷此行故名株杌。所以者何？對治道犁難可破壞，約此義故立為株杌，於無量生串習貪等以成其行，堅固難拔猶株杌故。",
    "根": "　　云何根？幾是根？為何義故觀根耶？謂取境增上故，種族不斷增上故，眾同分住增上故，受用淨不淨業果增上故，世間離欲增上故，出世離欲增上故，是根義。取境增上者，謂眼等六由此增上力，於色等境心心法轉故。種族不斷增上者，謂男女根由此增上力，子孫等胤流轉不絕故，餘如增上緣中說，受識蘊全。色行蘊一分，十二界六處全，法界法處一分是根，色蘊一分者，謂眼耳鼻舌身男女根。行蘊一分者，謂命信勤念定慧根。十二界全者，謂六根六識界。六處全者，謂內六處。法界法處一分者，謂命及樂等信等五根。為捨執著增上我故，觀察根。",
    "根上下智力": "　　如是根上下智力者，謂於一切種根上下智無著無礙現行中，所有三摩地等。",
    "業差別": "　　又業差別有三種，謂順樂受業、順苦受業、順不苦不樂受業。順樂受業者，謂從欲界乃至第三靜慮所有善業。順苦受業者，謂不善業。順不苦不樂受業者，謂第四靜慮已上所有善業等\n　　復次業差別有三種，謂順現法受業、順生受業、順後受業。順現法受業者，若業於現法中異熟成熟，謂從慈定起已，於彼造作若損若益必得現異熟，如從慈定起，從無諍定滅盡定預流果阿羅漢果起亦爾。又於佛為上首僧中，造善惡業必得現異熟又有餘猛利意樂方便，所行善不善業亦得現異熟所以名為現法受業，若業於此生作即於此生熟故。順生受業者，若業於無間生中異熟成熟，無間生者即次此生，謂五無間業等能得生異熟問若造一無間者，於無間生中可受其異熟若造多無間業者，於無間生中云何得受其異熟？答於一生中頓受一切所得異熟無有過失。所以者何？若造眾多無間業者，所感身形最極柔軟，所感苦具眾多猛利，由此頓受種種大苦。復有所餘善不善業，於無間生異熟熟者，一切皆名順生受業。順後受業者，若業於無間生後異熟成熟，於此業中從初熟位建立順現法受等名，不唯受此一位異熟，若業於此生造即從此生已去異熟成熟，說名順現法受業。若業於此生造從無間生已去異熟成熟，說名順生受業若業於此生造度無間生已去異熟成熟，說名順後受業若作是說即為善順訶怨心經。如彼經言，由無間業於那落迦中數數死生受大苦異熟。復次有四種諸業差別，謂黑黑異熟業、白白異熟業、黑白黑白異熟業、非黑白無異熟業能盡諸業。黑黑異熟業者，謂不善業，由染污故，不可愛異熟故。白白異熟業者，謂三界善業，不染污故，可愛異熟故。黑白黑白異熟業者，謂欲界繫雜業，善不善雜故。云何一業亦善不善？此中不約生剎那相說一種業亦善不善，然約意樂及方便總說一業，是此經意約此二種，若黑若白互不相似，建立一種黑白業故，或有業意樂故黑，方便故白，或有業方便故黑，意樂故白，意樂故黑，方便故白者，猶如有一，為欲誑他先現其相，令信己故行於惠施，乃至出家方便故黑。意樂故白者，猶如有一，欲令子及門徒遠危處安，由憐愍心現發種種身語麤惡，遂於此時發生雜染非黑白無異熟業。能盡諸業者，謂於方便無間道中諸無漏業，以方便無間道是彼諸業斷對治故，非黑者離煩惱垢故，白者一向清淨故，無異熟者生死相違故。能盡諸業者，由無漏業力永拔黑等三有漏業與異熟習氣故。",
    "業所乖諍": "　　云何業所乖諍？於受自業所得異熟時，善不善業互違諍故。云何從業所生？是諸有情遠離無因惡因，。唯從業所生故。云何依業出離？依對治業解業縛故。云何由業有情高下？謂猶業故於善惡趣得自體差別。云何勝劣？謂諸有情成就功德過失差別。",
    "業相": "　　復次煩惱增上所生業云何？謂若思業若思已業，總名業相。又業有五種，謂取受業、作用業、加行業、轉變業、證得業。取受業者，謂眼等能見色等。作用業者，謂地等能任持等，或復諸法自相所作，謂所有色質礙變壞如是等。加行業者，謂意解為先起身業等。轉變業者，謂金師等造莊嚴具等。證得業者，謂聖道等證涅槃等。今此義中意多分別加行業，頗亦兼有證得作用二業。思業云何？謂福業非福業不動業。思已業云何？謂身業、語業、意業。又此身語意三業或善或不善，不善者即十不善業道，謂殺生不與取欲邪行，妄語離間語麤惡語綺語，貪欲瞋恚邪見。善者即十善業道，謂離殺生乃至離雜穢語無貪無瞋正見，今於此中唯以業道顯身等業者，為隨順經就勝而說，彼方便等亦身等業所攝故，前三中四後三業道，隨其次第是身語意業相。又殺生等應以五門分別其相，謂事故、意樂故、方便故、煩惱故、究竟故殺生。等事者，謂有情數非有情數，如其所應依此處所起殺生等。意樂者，謂於此事起此想意樂，及起當作此業道意樂。方便者，謂此作用或自或他發身語意。煩惱者，謂貪瞋癡，如其所應或總或別。究竟者，由彼彼方便如是如是業道圓滿，或於爾時或於後時，於此義中殺生事者，謂有情數。意樂者，謂此想及必害意。方便者，謂為害故如刀杖等。煩惱者，謂貪等。究竟者，謂彼眾生由方便故，或無間死或後時死，不與取等事及究竟當廣分別，餘如理應思。不與取事者，謂他所攝若有情數非有情數。究竟者，謂取為己有。欲邪行事者，謂非所行女，或雖所行非分非處非時非量，及不應理一切男及不男究竟者，謂兩兩交會虛，誑語事者謂，見聞覺知不見不聞不覺不知意樂者謂，別異想欲別異說究竟者，謂時眾及對言者領解，離間語事者，謂諸有情若和合若不和合。意樂者，謂即於彼起乖離及不和合意。究竟者，謂所破領解，麤惡語事者，謂諸有情能為損害。究竟者，謂發麤惡言。綺語事者，謂能引攝不饒益義。究竟者，謂正發此言。貪欲事者。謂他所攝資財。意樂者，謂起此想及愛樂。方便者，謂思量籌度欲為己有。究竟者，決定執為己有。瞋恚事者，謂諸有情能為損害，究竟者謂決定加害等。邪見事者，謂實有義。意樂者，謂於實有起非有想，及彼欲樂。究竟者，謂決定誹謗，如經言故思造業。云何名為故思造業？略有五種，謂他所教敕故思造業，他所勸請故思造業，無所了知故思造業，根本執著故思造業，顛倒分別故思造業。他所教敕故思造業者，猶如有一，雖不欲樂因他強力之所教敕發起故思行不善業，他所勸請故思造業者，猶如有一，雖不欲樂因他勸請因他引導，執為利益發起故思行不善業，無所了知故思造業者猶如有一，不了德失無所執著，隨欲所作發起故思行不善業。根本執著故思造業者，猶如有一，為貪瞋等諸不善根纏蔽其心，猛利執著發起故思行不善業。顛倒分別故思造業者，猶如有一，依不平等因見愛樂邪法，為求當來可愛異熟發起故思行不善業。於此五中根本執著故思造業，顛倒分別故思造業，此二種若作若增長非不受異熟。所以者何？前三故思作業雖作不增長，輕故不必受異熟，後二故思作業若作若增長，重故必定受異熟。作者，謂起造諸業令其現行。增長者，謂令習氣增益，於阿賴耶識中長養異熟種子故。如經言，決定受業者云何決定？謂作業決定，受異熟決定，分位決定。作業決定者，由宿業力感得決定異熟相續，於此生中必造此業。何以故？應造此業期限決定故，終不越限必造此業，乃至諸佛世尊大神通力，亦不能為障令其不造，隨因決定力果相續轉變故。受異熟決定者，如先所說故思造業。分位決定者，謂現法受等分位決定業，如由此業於現法中必定受異熟，由此業必受。生異熟由此業必受後異熟又十不善業，道異熟果者於三惡趣，中隨下中上品受傍，生餓鬼那落迦異熟。等流果者，各隨其相於人趣中感得自身眾具衰損，謂從惡趣沒後生人中，由殺盜等各隨其相，感得自身眾具衰損，所謂壽命短促常貧窮等如其所應。增上果者，各隨其相感得所有外事衰損，謂殺生等各隨其相，感稼穡等外事衰損所謂外具乏少光澤，是殺生增上果如是等。如經言，於一切十不善業道修習，多修習故生於那落迦傍生餓鬼，是彼異熟果若得來此人同分中，由殺生故今得短壽，不與取故乏少財物，欲邪行故妻不貞良，由虛誑語故多被誹謗，離間語故親友乖離，麤惡語故恒聞不如意聲，由綺語故言不威肅，由貪欲故貪轉猛盛，由瞋恚故瞋轉猛盛，由邪見故癡轉猛盛，諸邪見者癡增上故，是彼等流果。由極修習殺生業故，一切外事乏少光澤，不與取故多遭霜雹，欲邪行故多諸塵坌，妄語故多諸臭穢，離間語故高下險阻，麤惡語故其地鹹鹵磽确穢惡，綺語故時候乖變，貪欲故果實尟少，瞋恚故果味辛苦，邪見故果味辛苦，或全無果，是彼增上果。又十善業道異熟果者，謂於人天趣中受人天異熟。等流果者，謂即於彼處各隨其相感得自身眾具興盛。增上果者，謂即於彼處各隨其相感得外事興盛，如不善業道建立異熟果等三種差別，如是有漏善業道，於人天中三果差別，如其所應亦當建立。又善不善業於善趣惡趣中感生異熟時，有二種差別，謂招引業圓滿業。招引業者，謂由此業能牽異熟果。圓滿業者，謂由此業生已領受愛不愛果。復次或有業，由一業力牽得一身，謂由一業力長養一生異熟種子故，或有業由一業力牽得多身，謂由一業力長養多生異熟種子故，或有業由多業力牽得一身，謂由多業剎那數數長養一生異熟種子故，或有業由多業力牽得多身，謂多剎那業更相資待，展轉長養多生異熟種子故。問若一有情成就多業，云何次第受異熟果耶？答於彼身中重者先熟，或將死時現在前者，或先所數習者，或最初所行者，彼異熟先熟。如經言有三種業，謂福業非福業不動業，福業者，謂欲界繫善業。非福業者，謂不善業。不動業者，謂色無色界繫善業。問何故色無色繫善業名不動耶？答如欲界中餘趣圓滿善不善業，遇緣轉得餘趣異熟，非色無色繫業，有如是事，所受異熟界地決定故，是故約與異熟不可移轉，名為不動。又定地攝故說為不動，問如經中說，無明緣行，若福非福及與不動，云何福及不動行緣無明生耶？答有二種愚，一異熟愚，二真實義愚，由異熟愚故發非福行，由真實義愚故發福及不動行，由異熟愚發非福行者，由彼一向是染污性，無明合時必不容受信解異熟行相正見故，由真實義愚發福不動行者，真實義即四聖諦，於彼愚癡名真實義愚，未見諦者雖起善心，由彼隨眠所隨縛故，亦名愚癡。由彼勢力於三界苦不如實知，便能發起後有因性福不動行，非已見諦者能發此業，無真實義愚故，是故彼業說因此生。復次殺生業道貪瞋癡為方便，由瞋究竟，如殺生麤惡語瞋恚業道亦爾，殺生貪為方便者，為皮肉等故。瞋為方便者，為除怨等故。癡為方便者，為祠祀等故。由瞋究竟者，離無慈悲必不殺害他有情故，麤惡語等如理應知，不與取業道貪瞋癡為方便，由貪究竟，如不與取欲邪行貪欲亦爾。問貪欲等云何用貪等為方便？答前說貪欲業道於他資財決定執為己有為性，若即於此資財先起餘貪，加行追求欲為己有，即立此為貪方便，若先起瞋餘勿有，此是瞋方便。若先起癡，謂於他物取為己有無有過失，是癡方便。如是所餘如理應知，虛誑語業道貪瞋癡為方便，於三種中隨由一究竟，如妄語離間語綺語亦爾，邪見業道貪瞋癡為方便，由癡究竟。",
    "極七返有補特伽羅": "　　極七返有補特伽羅者謂即豫流，於人天生往來雜受，極至七返得盡苦際。",
    "極微薄寂靜苦": "　　云何極微薄寂靜苦？謂諸無學命根住緣六處。",
    "極煩惱所惱　　得最上菩提": "　　此如前說，然其體性，謂諸菩薩依三摩地，由見修二道證大菩提。",
    "樂": "　　云何樂？謂離欲惡不善法者。已斷身重性心重性。身不堪任性。心不堪任性。所得身滑性。心滑性。身軟性。心軟性。身堪任性。心堪任性。身離蓋性。心離蓋性。身輕安性。心輕安性。身無燋惱性。心無燋惱性。身調柔性。心調柔性。總名為樂。",
    "樂惡友": "　　謂有一類。好近惡友。言惡友者。謂諸屠羊屠雞屠豬。捕鳥捕魚。獵獸劫盜。魁膾典獄。縛龍煮狗。及罝弶等。是名惡友。復有一類。毀犯尸羅。習行惡法。內懷腐敗。外現堅貞。類穢蝸牛。螺音狗行。實非沙門。自稱沙門。實非梵行。自稱梵行。亦名惡友。於如是等諸惡友所。親近承事。隨順愛樂。名樂惡友。",
    "樂根": "　　謂順樂觸所生身樂心樂。平等受。受所攝。是名樂根。復次修第三靜慮。順樂觸所生心樂。平等受。受所攝。是名樂根。",
    "樂界": "　　謂順樂觸所起身樂心樂平等受。受所攝。是名樂界。復次修第三靜慮順樂受觸所起心樂平等受。受所攝。是名樂界。",
    "樂速通行": "　　如世尊說。諸有苾芻。離欲惡不善法。廣說乃至於第四靜慮。具足安住。彼於爾時。非思自害。非思害他。非思俱害。能思自利。能思利他。能利多生。能樂多生。能愍世間。能義利樂。諸天人眾。諸無害等。此中名樂。由此便起。明利強盛信等五根。如是五根。明故利故。強故盛故。能速證得無上漏盡。\n　　此言速者。能急能疾。能駛能易。能速證得。\n　　言無上者。如世尊說。於諸有為無為法中。我說離染。最為第一。最尊最勝。最上無上。於無上法。能得隨得。能觸等觸。能證作證。故名證得。\n　　言漏盡者。漏謂三漏。於此三漏。能盡等盡遍盡永盡。滅盡圓盡。言通行者。謂即此行。超越勇猛。精進策勵。生欲翹勤。於四聖諦。修現觀行。於不還果阿羅漢果。修作證行。於神境智作證通。及天耳智作證通。心差別智作證通。宿住隨念智作證通。死生智作證通。漏盡智作證通。修作證行。於貪瞋癡慢憍垢等。修永盡行。以極恭敬安住殷重思惟。遍攝諸心所已。因故門故。理故相故。修通達行。是故名為樂速通行。又如是行。於所求義。由修習多修習。能得隨得。能觸等觸。能證作證。是故名為樂速通行。又如是行。由語增語。由想等想。施設言說。為樂速通行。是故名為樂速通行。",
    "樂遲通行": "　　如世尊說。諸有苾芻。離欲惡不善法。有尋有伺。離生喜樂。於初靜慮。具足安住。尋伺止息。內等淨心一趣。無尋無伺。定生喜樂。於第二靜慮。具足安住。離喜住捨。正念正知。身受樂聖所說。具捨念安樂住。於第三靜慮。具足安住。斷樂斷苦。先喜憂沒。不苦不樂。捨念淸淨。於第四靜慮。具足安住。彼於爾時。非思自害。非思害他。非思俱害。能思自利。能思利他。能利多生。能樂多生。能愍世間。能義利樂。諸天人眾。諸無害等。此中名樂。由此便起昧鈍羸劣信等五根。如是五根。昧故鈍故羸故劣故。能遲證得無上漏盡。\n　　此言遲者。非急非疾。非駛非易。非速證得。\n　　言無上者。如世尊說。於諸有為無為法中。我說離染。最為第一最尊最勝最上無上。於無上法。能得隨得。能觸等觸。能證作證。故名證得。\n　　言漏盡者。漏謂三漏。於此三漏。能盡等盡。遍盡永盡。滅盡圓盡。故名漏盡。言通行者。謂即此行。超越勇猛。精進策勵。生欲翹勤。於四聖諦。修現觀行。於不還果阿羅漢果。修作證行。於神境智作證通。及天耳智作證通。心差別智作證通。宿住隨念智作證通。死生智作證通。漏盡智作證通修作證行。於貪瞋癡慢憍垢等。修永盡行。以極恭敬安住殷重思惟。遍攝諸心所已。因故門故。理故相故。修通達行。是故名為樂遲通行。又如是行。於所求義。由修習多修習。能得隨得。能觸等觸。能證作證。是故名為樂遲通行。又如是行。由語增語。由想等想。施設言說。為樂遲通行。是故名為樂遲通行。",
    "次第": "　　次第者，謂前前波羅蜜多能為後後所依止故，所以者何？菩薩摩訶薩由施波羅蜜多串習捨施內外事故，不顧身命棄大寶藏受持禁戒由護戒故，他所毀罵終不反報，由如是等遂能堪忍，以能堪忍寒熱等苦，雖遭此緣加行不息發勤精進，精進方便證究竟果成滿靜慮。靜慮滿已，由淨定心如實知故，證得出世究竟大慧。復次前前波羅蜜多後後所持故，謂戒能持施，乃至慧能持靜慮，由具尸羅施得清淨，何以故？由行布施攝益有情，由具尸羅不為惱害，是故菩薩於受施者，以離惱害善能施與清淨樂具故。由淨戒力施得清淨，如是由忍力故戒得清淨，何以故？由能忍受他不饒益，終不毀犯所學處故，由精進故忍得清淨，何以故？由勇猛力故久處生死不以為難，能受眾生違逆等苦，由靜慮故精進清淨，何以故？由喜樂俱能勤修習一切善法無休息故，由具慧故靜慮清淨，何以故？若由無量門數數觀諸法，能證內寂靜，增長三摩地。又伽他說，無有靜慮而不因慧。復次由麤細故，波羅蜜多前後次第，所以者何？於諸行中施行最麤故先建立，於忍等行戒復為麤故次建立，乃至於慧靜慮為麤，一切行中慧為最細故最後立。",
    "欲": "　　謂是婬貪。或所貪境。",
    "欲三摩地勝行成就神足者": "　　云何欲？云何三摩地？云何勝？云何勝行而名欲三摩地勝行成就神足耶？此中欲者。謂依出家遠離所生善法所起。欲樂欣喜。求趣悕望。是名欲。三摩地者。謂欲增上所起。心住等住。近住安住。不散不亂。攝止等持心一境性。是名三摩地。勝者。謂欲增上所起八支聖道。是名勝。勝行者。謂有苾芻。依過去欲得三摩地。是謂欲三摩地。彼成就欲三摩地已。為令已生惡不善法斷故。起欲發勤精進。策心持心。為令未生惡不善法不生故。起欲發勤精進。策心持心。為令未生善法生故。起欲發勤精進。策心持心。為令已生善法堅住不忘修滿倍增廣大智作證故。起欲發勤精進。策心持心。彼所有欲若勤若信若輕安若念若正知若思若捨。是名勝行。即此勝行。及前所說欲三摩地。總名欲三摩地勝行成就神足。\n　　復有苾芻。於諸善法。住不樂欲。彼作是念。我今不應於諸善法住不樂欲。然我理應於諸善法安住樂欲。彼由此欲增上力故。得三摩地。是謂欲三摩地。彼成就欲三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信乃至若捨是名勝行。即此勝行。及前所說欲三摩地。總名欲三摩地勝行成就神足。\n　　復有苾芻。生起惡欲。彼作是念。我今不應生起惡欲。然我理應斷除惡欲修集善欲彼由此欲增上力故。得三摩地。是謂欲三摩地。彼成就欲三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信乃至若捨。是名勝行。即此勝行。及前所說欲三摩地。總名欲三摩地勝行成就神足。\n　　復有苾芻。生起貪瞋癡俱行惡欲。彼作是念。我今不應生起貪瞋癡俱行惡欲。然我理應斷除貪瞋癡俱行惡欲。修集無貪無嗔無癡俱行善欲。彼由此欲增上力故。得三摩地。是謂欲三摩地。彼成就欲三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信乃至若捨。是名勝行。即此勝行。及前所說欲三摩地。總名欲三摩地勝行成就神足。\n　　復有苾芻。生起貪瞋癡俱行惡欲。彼作是念。我今不應生起貪瞋癡俱行惡欲。然我理應斷除貪瞋癡俱行惡欲。修集無貪無嗔無癡俱行善欲。彼由此欲增上力故。得三摩地。是謂欲三摩地。彼成就欲三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信乃至若捨。是名勝行。即此勝行。及前所說欲三摩地。總名欲三摩地勝行成就神足。\n　　復有苾芻。於諸善法安住樂欲。彼作是念。我於善法安住樂欲。甚為應理。彼由此欲增上力故。得三摩地。是謂欲三摩地。彼成就欲三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信乃至若捨。是名勝行。即此勝行。及前所說欲三摩地。總名欲三摩地勝行成就神足。\n　　復有苾芻。生起善欲。彼作是念。我今生起如是善欲。甚為應理。彼由此欲增上力故。得三摩地。是謂欲三摩地。彼成就欲三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信乃至若捨。是名勝行。即此勝行。及前所說欲三摩地。總名欲三摩地勝行成就神足。\n　　復有苾芻。生起無貪無嗔無癡俱行善欲。彼作是念。我今生起無貪無嗔無癡俱行善欲。甚為應理。彼由此欲增上力故。得三摩地。是謂欲三摩地。彼成就欲三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心彼所有欲若勤若信乃至若捨。是名勝行。即此勝行。及前所說欲三摩地。總名欲三摩地勝行成就神足。\n　　復有苾芻。生起離貪瞋癡善欲。彼作是念。我今生起離貪瞋癡善欲。甚為應理。彼由此欲增上力故。得三摩地。是謂欲三摩地。彼成就欲三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信乃至若捨。是名勝行。即此勝行。及前所說欲三摩地。總名欲三摩地勝行成就神足。一切欲三摩地。皆從欲起。是欲所集。是欲種類。是欲所生。故名欲三摩地勝行成就神足。",
    "欲取": "　　謂欲界系。除諸見余結縛隨眠隨煩惱纏。",
    "欲尋": "　　謂欲貪相應諸心尋求。遍尋求。近尋求。心顯了。極顯了。現前顯了。推度構畫。思惟分別。總名欲尋。",
    "欲界": "　　謂於欲境諸貪等貪。乃至貪類貪生。總名欲界。復次欲貪及欲貪相應受想行識。並所等起身業語業。不相應行。總名欲界。",
    "欲界": "　　謂有諸法。欲貪隨增。是名欲界。復次欲界系。十八界十二處五蘊。是名欲界。復次下從無間地獄。上至他化自在天。於中所有色受想行識。是名欲界。",
    "欲界有學補特伽羅": "　　欲界有學補特伽羅者，謂於欲界若生若長，已得聖法猶有餘結。",
    "欲界無學補特伽羅": "　　欲界無學補特伽羅者，謂於欲界若生若長，已得聖法無有餘結，如欲界有三，如是色無色界各有三種隨相應知。",
    "欲界獨覺": "　　欲界獨覺者謂無佛出世時生於欲界，自然證得獨覺菩提。",
    "欲界獨覺補特伽羅": "　　何等欲界獨覺補特伽羅？謂無佛出世時生於欲界，自然證得獨覺菩提",
    "欲界異生補特伽羅": "　　欲界異生補特伽羅者，謂於欲界若生若長，不得聖法。",
    "欲界繫": "　　云何欲界繫？幾是欲界繫？為何義故觀欲界繫耶？謂未離欲者所有善不善無記法，是欲界繫義。未離欲言顯猶未離少分欲界欲，是未證得三摩地義，若異此者非至定法，亦應是欲界繫。所以者何？由彼已得三摩地故，愛樂斷滅，以所治麤重少分斷故，亦得說有一分離欲，外諸色等是未離欲，業增上力所生故，亦名欲界繫。經言，一切有情共有業增上力所生者，為顯生色無色界者亦有未離欲，業種隨逐故，四界二處全，及餘蘊界處一分，是欲界繫。四界者，謂香味鼻舌識界，二處者，謂香味處，餘一分者，謂除色無色界繫及無漏法，為捨執著欲增上我故，觀察欲界繫。",
    "欲色界菩薩補特伽羅": "　　欲色界菩薩者，謂與滅離無色界生靜慮相應住靜慮樂，而生欲界或生色界。問何緣菩薩不生無色界？答若已證得最勝威德菩薩凡所受生，皆欲利益安樂眾生，以無色界非成熟眾生處故。滅離無色界生靜慮者，謂能除遣無色界生所有勝定。住靜慮樂者，謂不退靜慮，由此菩薩善巧迴轉故，為欲成熟所化有情，或生欲界或生色界。",
    "欲邪行者": "　　而暫交會。下至自妻。非分非禮。及非時處。皆名欲邪行。",
    "正勤": "　　云何正勤？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應所有勤精進。勇健勢猛。熾盛難制。勵意不息。是名正勤。",
    "正命": "　　云何正命？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應思擇力故。於趣邪命身語惡行所得無漏。遠離乃至身語無表業。是名正命。",
    "正定": "　　云何正定？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應所有心住。等住。近住安住。不散不亂。攝止等持。心一境性。是名正定。",
    "正念": "　　云何正念？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應所有念。隨念專念憶念。不忘不失。不遺不漏。不失法性。心明記性。是名正念。",
    "正思惟": "　　云何正思惟？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應所有思惟。等思惟近思惟。尋求。等尋求。近尋求。推覓。等推覓。近推覓。令心於法粗動而轉。是名正思惟。",
    "正業": "　　云何正業？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應思擇力故。除趣邪命身三惡行。於余身惡行所得無漏。遠離乃至無表身業。是名正業。",
    "正等覺": "　　如世尊言。諸所有法。一切正性。如來一切知見解了正等覺。故名正等覺。又等法者。謂四念住。四正勝。四神足。五根五力。七等覺支。八聖道支。如來一切知見解了正等覺。故名正等覺。又於一切苦集滅道。能現觀道。能證預流果一來果不還果阿羅漢果道。能證神境智作。證通天耳智作。證通他心智作。證通宿住隨念智作。證通死生智作。證通漏盡智作。證通道能盡貪瞋癡慢憍垢道。如來一切皆正等覺。至誠堅住。殷重作意。以因以門。以理以相正等覺故。名正等覺。",
    "正等覺無畏": "　　正等覺無畏者，謂依止靜慮由自利門，於一切種所知境界正等覺自稱德號建立具足中，若定若慧及彼相應諸心心法。如經言，我是正等覺者，設有世間沙門婆羅門若天魔梵，依法立難，或令憶念言，於是法非正等覺，我於是事正見無緣，以於此事正見無由故，得安隱住無怖無畏，自稱我處大仙尊位，於大眾中正師子吼轉大梵輪，一切世間沙門婆羅門若天魔梵所不能轉。",
    "正行": "　　四種正行者，謂苦遲通行、苦速通行、樂遲通行、樂速通行。初謂鈍根未得根本靜慮，第二謂利根未得根本靜慮，第三謂鈍根已得根本靜慮，第四謂利根已得根本靜慮。四種法迹者，謂無貪、無瞋、正念、正定。無貪無瞋能令增上戒學清淨，正念能令增上心學清淨，正定能令增上慧學清淨。奢摩他者，謂於內攝心令住等住安住近住，調順寂靜最極寂靜，專注一趣平等攝持。毘鉢舍那者，謂簡擇諸法，最極簡擇，普遍尋思，周審觀察，為欲對治麤重相結故，為欲制伏諸顛倒故，令無倒心善安住故。",
    "正見": "　　云何正見？謂聖弟子。於苦思惟苦。於集思惟集。於滅思惟滅。於道思惟道。無漏作意相應。所有於法簡擇。極簡擇。最極簡擇。解了等了近了。機黠通達。審察聰睿。覺明慧行。毘缽舍那。是名正見。",
    "正語": "　　云何正語？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應思擇力故。除趣邪命語四惡行。於余語惡行所得無漏。遠離。勝遠離。近遠離。極遠離。寂靜律儀。無作無造。棄捨防護。船筏橋樑。堤塘牆塹。於所制約。不逾不逾性。不越不越性。無表語業。是名正語。",
    "死生智力": "　　死生智力者，謂於一切種死生智無著無礙現行中，所有三摩地等。",
    "死生通": "　　死生通者，謂依止靜慮於觀有情死生差別威德具足中，若定若慧，餘如前說。觀諸有情死生差別者，謂以天眼觀諸有情死時生時好色惡色，當往善趣當往惡趣後際差別。",
    "死苦": "　　復次前說死苦，死有三種，謂或善心死、或不善心死、或無記心死。善心死者，謂於明利心現行位，或由自善根力所持故，或由他所引攝故，發起善心趣命終位。不善心死者，謂亦於明利心現行位，或由自不善根力所持故，或由他所引攝故，起不善心趣命終位。無記心死者，謂若於明利心現行位，若於不明利心現行位，或由闕二緣故，或由加行無功能故，起無記心趣命終位。此中所言善等心死者，當知依我愛相應將命終心位前說，修淨行者臨命終位，於身下分，先起冷觸，不淨行者臨命終位，於身上分先起冷觸。又不淨行者中有生時，其相顯現如黑羊羔光，或如陰闇夜分，修淨行者中有生時，其相顯現如白練光，或如晴明夜分。又此中有在欲色界正受生位，亦從無色界命終後位，亦名意生健達縛等，極住七日，或有中夭，或時移轉。言意生者，謂受化生身，唯心為因故，香所引故，名健達縛，是隨逐於香往受生處，義極住七日，或有中夭者。此約速得生緣者說，若過七日不得生緣，必定命終還生中有，如是展轉乃至七返更不得過。或時移轉者，謂於此位往餘生處，強緣現前，如得第四靜慮起阿羅漢增上慢比丘，彼地中有生時，由謗解脫邪見故，轉生地獄中有。又住中有中亦能集諸業，先串習力所引善等思現行故。又能睹見同類有情，謂先所共行善不善者，如於夢中見已與彼現同遊戲。又中有形似當生處如當生處，前時有形而起故。又此中有所趣無礙，如具神通往來迅速，仍於生處有所拘礙。又此中有於所生處，如稱兩頭低昂道理，終沒結生時分亦爾。又住中有中於所生處發起貪愛，亦用餘煩惱為緣助，此中有身與貪俱滅，羯邏藍身與識俱生此唯是異熟，自此已後根漸生長，如緣起中說，於四生類，或受卵生，或受胎生，或受濕生，或受化生，如緣起中說者，謂名色等前後次第如說。",
    "比量": "　　比量者，謂現餘信解，此云何？謂除現量所得餘不現事決定俱轉，先見成就今現見彼一分時，於所餘分正信解生，謂彼於此決定當有由俱轉故，如遠見煙知彼有火，是名現量為先比量。",
    "水界": "　　謂水界有二種。一內。二外。云何內水界？謂此身內所有各別濕性濕類有執有受。此復云何？謂諸淚汗。乃至小便。復有所餘身內各別濕性濕類有執有受。是名內水界。云何外水界？謂此身外諸外所攝濕性濕類無執無受。此復云何？謂根莖枝葉花果等汁露。酒乳酪酥油蜜糖。池沼陂湖殑伽河。鹽母那河。薩剌渝河。頞氏羅筏底河。莫呬河。東海西海南海北海。四大海水。或復有水依風輪住。復有所餘在此外濕性濕類無執無受。是名外水界。前內此外。總名水界。",
    "永斷習氣": "　　永斷習氣者，謂一切智者，於非一切智所作不現行具足中，若定若慧乃至廣說，此中顯示一切智者於所有能表有餘煩惱所知障身語所作不現行具足中所有三摩地等，是永斷習氣。\n　　永斷習氣作何業？謂離諸煩惱亦不顯現似諸煩惱所作事業，非如阿羅漢比丘猶現誤失等事。",
    "永斷離欲": "　　何等永斷離欲？謂永斷地地諸煩惱已生厭背性。",
    "求不得苦": "　　云何求不得苦？求不得。謂悕求可意色聲香味觸衣服飲食臥具醫藥。諸資身具。不得不獲。不會不遇。不成就。不和合。總名求不得。何因緣故。說求不得為苦。謂諸有情。求不得時。領納攝受種種身苦事故。廣說乃至領納攝受種種身心燒然事故。說彼為苦。復次求不得時。受二種苦。一者苦苦。二者行苦。故名求不得苦。",
    "決定受業": "　　如契經言決定受業，云何名為決定受業？謂作業決定，受異熟決定分位決定。",
    "決擇": "　　復次略說決擇有四種，謂諦決擇、法決擇、得決擇、論議決擇。諦決擇復有四種，謂依苦集滅道四聖諦說。",
    "法念住": "　　云何於此內法？住循法觀。若具正勤正知正念。除世貪憂。內法者。謂自想蘊行蘊。若在現相續中。已得不失。於此內法。循法觀者。謂有苾芻。於內五蓋法。觀察思惟內法諸相。於有內貪慾蓋。如實知我有內貪慾蓋。於無內貪慾蓋。如實知我無內貪慾蓋。復如實知內貪慾蓋。未生者生。已生者斷。斷已於後不復更生。如是思惟此內法時。所起於法簡擇。乃至毘缽舍那。是循內法觀。亦名法念住。\n　　復有苾芻。於內六結法。觀察思惟內法諸相。於有內眼結如實知我有內眼結。於無內眼結。如實知我無內眼結。復如實知此內眼結。未生者生。已生者斷。斷已於後不復更生。如是思惟此內法時。所起於法簡擇。乃至毘缽舍那。是循內法觀。亦名法念住。住具正勤正知正念。除世貪憂。皆如前說。如說內眼結。說內耳鼻舌身意結亦爾。\n　　復有苾芻。於內七覺支法。觀察思惟內法諸相。於有內念覺支。如實知我有內念覺支。於無內念覺支。如實知我無內念覺支。復如實知內念覺支。未生者生。生已堅住不忘。修滿倍增廣大智作證故。如是思惟此內法時。所起於法簡擇。乃至毘缽舍那。是循內法觀。亦名法念住。住具正勤正知正念。除世貪憂。亦如前說。如說內念覺支。說余內六覺支等亦爾。\n　　復有苾芻。於所說內想蘊行蘊。觀察思惟多諸過患。謂此法者。如病如癰。廣說乃至是變壞法。如是思惟法過患時。所起於法簡擇。乃至毘缽舍那。是循內法觀。亦名法念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　云何於彼外法？住循法觀。若具正勤正知正念。除世貪憂。外法者。謂自想蘊行蘊。若在現相續中。未得已失。及他有情想蘊行蘊。於彼外法。循法觀者。謂有苾芻。於他五蓋法。觀察思惟外法諸相。於有外貪慾蓋。如實知彼有外貪慾蓋。於無外貪慾蓋。如實知彼無外貪慾蓋。復如實知外貪慾蓋。未生者生。已生者斷。斷已於後不復更生。如是思惟此外法時。所起於法簡擇。乃至毘缽舍那。是循外法觀。亦名法念住。住具正勤正知正念。除世貪憂。亦如前說。如說外貪慾蓋。說余外四蓋亦爾。\n　　復有苾芻。於他六結法。觀察思惟外法諸相。於有外眼結。如實知彼有外眼結。於無外眼結。如實知彼無外眼結。復如實知彼外眼結。未生者生。已生者斷。斷已於後不復更生。如是思惟彼外法時。所起於法簡擇。乃至毘缽舍那。是循外法觀。亦名法念住。住具正勤正知正念。除世貪憂。亦如前說。如說外眼結。說余外五結亦爾。\n　　復有苾芻。於他七覺支法。觀察思惟外法諸相。於有外念覺支。如實知彼有外念覺支。於無外念覺支。如實知彼無外念覺支。復如實知外念覺支。未生者生。生已堅住。廣說乃至智作證故。如是思惟彼外法時。所起於法簡擇。乃至毘缽舍那。是循外法觀。亦名法念住。住具正勤正知正念。除世貪憂。亦如前說。如說外念覺支。說余外六覺支等亦爾。\n　　復有苾芻。於所說外想蘊行蘊。觀察思惟多諸過患。謂彼法者。如病如癰。廣說乃至是變壞法。如是思惟法過患時。所起於法簡擇。乃至毘缽舍那。是循外法觀。亦名法念住。住具正勤正知正念。除世貪憂。亦如前說。云何於內外法？住循法觀。若具正勤正知正念。除世貪憂。內法者。謂自想蘊行蘊。若在現相續中。已得不失。外法者。謂自想蘊行蘊。若在現相續中。未得已失。及他有情想蘊行蘊。合此二種。名內外法。於內外法。循法觀者。謂有苾芻。合前自他想蘊行蘊。總為一聚。觀察思惟自他法相。謂前所說內外五蓋。六結七覺支等。此彼有無未生生斷不復生相。如是思惟內外法時。所起於法簡擇。乃至毘缽舍那。是循內外法觀。亦名法念住。住具正勤正知正念。除世貪憂。亦如前說。\n　　復有苾芻。合前自他想蘊行蘊。總為一聚。觀察思惟多諸過患。謂此彼法。如病如癰。廣說乃至是變壞法。如是思惟法過患時。所起於法簡擇。乃至毘缽舍那。是循內外法觀。亦名法念住。住具正勤正知正念。除世貪憂。亦如前說。",
    "法性相差別": "　　何等法性相差別？謂即於蘊界處中我等無性無我。",
    "法決擇": "　　云何法決擇？法者，謂十二分聖教。何者十二？一契經、二應頌、三記莂、四諷頌、五自說、六緣起、七譬喻、八本事、九本生、十方廣、十一希法、十二論議。",
    "法無礙解": "　　法無礙解者，謂依止靜慮於一切法名差別無礙具足中，若定若慧，餘如前說。名差別者，謂依無明等於無智無見不現觀等差別名中，無礙具足若定若慧乃至廣說，名法無礙解。",
    "法爾相": "　　何等法爾相？謂當來無常由因隨逐定當受故",
    "法現觀": "　　法現觀者，謂於諸諦增上法中已得上品清信勝解隨信而行，所以者何？由於諸諦增上契經等法中從聞他音增上緣力，已得最後順解脫分善根所攝上品清信勝解由得如是清信勝解故，說名以法現觀現觀諸諦。",
    "法蘊足論": "　　蓋阿毗達磨之權輿。一切有部之洪源也。無上等覺入室之神足。摩訶目乾連之所制矣。鏡六通之妙慧。晢三達之智明。桴金鼓於大千。聲玉螺於百億。摘藏海之奇玩。鳩教山之勝珍。欲使天鏡常懸。法幢永樹。眾邪息蕃蘺之望。諸子騁遊戲之歡。而為此論也。是以佛泥越後。百有餘年。疊啟五分之殊。解開二九之異。雖各擅連城之貴。俱稱照乘之珍。唯一切有部。卓乎迥秀。若妙高之處宏海。猶朗月之冠眾星者。豈不以本弘基永者歟。至如八種揵度鶩徽於發智之場。五百應真馳譽於廣說之苑。斯皆挹此涓波。分斯片玉。遂得駕群部而高蹈。接天衢而布武。是知登昆閬者。必培塿於眾山。游溟渤者。亦㘭塘於群澍。諒其然矣。矧乎順正理以析疑。顯真宗以副惑。莫不鏡此彞倫。鑒斯洪範。故使耆德婆藪屈我眾賢上坐幽宗見負弘致者也。題稱阿毗達磨者。形二藏以簡殊也。一切有部者。對十七以標異也。法蘊足者。顯此論之勝名也。能持自性。軌範稱法。法有積集。崇聚為蘊。此論攸宗。法聚三七。皆與對法為依。故目之為足。三藏玄奘法師。以　皇唐顯慶四年九月十四日。奉　詔於大慈恩寺弘法苑譯訖。大慈恩寺沙門。釋光筆受靖邁飾文。",
    "法處": "　　謂法為意。已正當知。是名法處。又法為意增上發意識已正當了別。是名法處。又法於意。已正當礙。是名法處。又法為意。已正當行。是名法處。如是過去未來現在諸所有法。名為法處。亦名所知。乃至所等證。\n　　此復云何？謂受想思觸作意欲勝解。信精進念定慧。尋伺放逸不放逸。善根不善根無記根。一切結縛隨眠隨煩惱纏。諸所有智見現觀。得無想定滅定無想事。命根眾同分住。得事得處得生老住無常。名身句身文身。虛空擇滅非擇滅。及余所有意根所知意識所了。所有名號。異語增語。想等想。施設言說。謂名法。名法界。名法處。名彼岸。如是法處。是外處攝。",
    "法處所攝色": "　　法處所攝色者，略有五種，謂極略色，極迥色，受所引色，遍計所起色，自在所生色。極略色者，謂極微色。極迥色者，謂即此離餘礙觸色。受所引色者，謂無表色。遍計所起色者，謂影像色。自在所生色者，謂解脫靜慮所行境色。",
    "法證淨": "　　法證淨。如世尊言。此聖弟子。以如是相。隨念正法。謂佛正法善說現見無熱應時引導近觀智者內證。所言此者。謂此欲界或此世界此贍部洲。又言此者。謂即此身持等持軀等軀聚得自體。又言此者。謂此處生。佛及弟子。諸僊牟尼。諸聰睿者。善調伏者。善調順者。又言此者。謂即於此教授教誡善說法中。是故言此。言聖弟子者。聖謂佛法僧。歸依佛法僧。故名聖弟子。以如是相隨念法者。謂以此相此門此理。於正法所。起念隨念。專念憶念。不忘不失。不遺不漏。不失法性。心明記性。是故名為以如是相隨念正法。言善說者。謂佛所說。苦真是苦。集真是集。滅真是滅。道真是道。故名善說。若佛世尊。非苦說苦。非集說集。非滅說滅。非道說道。可非善說。以佛世尊。苦說為苦。集說為集。滅說為滅。道說為道。故佛正法名為善說。言現見者。謂正修習世尊所說苦集滅道。現觀道時。於現法中。即入苦集滅道。現觀故名現見。若正修習世尊所說苦集滅道。現觀道時。非現法中。即入苦集滅道。現觀世尊正法可非現見。以正修習世尊所說苦集滅道。現觀道時。於現法中。即入苦集滅道現觀。故佛正法名為現見。又正修習世尊所說。能斷見苦見集見滅見道所斷及修所斷隨眠道時。於現法中。即斷見苦見集見滅見道所斷及修所斷一切隨眠。故名現見。若正修習世尊所說。能斷見苦見集見滅見道所斷及修所斷隨眠道時。非現法中。即斷見苦見集見滅見道所斷及修所斷一切隨眠。世尊正法。可非現見。以正修習世尊所說。能斷見苦見集見滅見道所斷及修所斷隨眠道時。於現法中。即斷見苦見集見滅見道所斷及修所斷一切隨眠故佛正法名為現見。又正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道時於現法中。即證見苦見集見滅見道所斷及修所斷諸隨眠滅。故名現見。若正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道時。非現法中。即證見苦見集見滅見道所斷及修所斷諸隨眠滅。世尊正法。可非現見以正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道時。即證見苦見集見滅見道所斷及修所斷諸隨眠滅。故佛正法名為現見。言無熱者。謂八支聖道。名為無熱。所以者何。熱謂煩惱。八支聖道中。一切煩惱。無得無近得無有無等有。故佛正法名為無熱。言應時者。謂八支聖道。名為應時。所以者何。由正修習世尊所說苦集滅道現觀道時。即入苦集滅道現觀。故名應時。若正修習世尊所說苦集滅道現觀道。後方入苦集滅道現。觀世尊正法可非應時。以正修習世尊所說苦集滅道現觀道時。即入苦集滅道現觀。故佛正法名為應時。又正修習世尊所說。能斷見苦見集見滅見道所斷及修所斷隨眠道時。即斷見苦見集見滅見道所斷及修所斷一切隨眠。故名應時。若正修習世尊所說。能斷見苦見集見滅見道所斷及修所說隨眠道。後方斷見苦見集見滅見道所斷及修所斷一切隨眠。世尊正法。可非應時。以正修習世尊所說。能斷見苦見集見滅見道所斷及修所斷隨眠道時。即斷見苦見集見滅見道所斷及修所斷一切隨眠。故佛正法名為應時。又正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道時。即證見苦見集見滅見道所斷及修所斷諸隨眠滅。故名應時。若正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道。後方證見苦見集見滅見道所斷及修所斷諸隨眠滅。世尊正法。可非應時。以正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道時。即證見苦見集見滅見道所斷及修所斷諸隨眠滅。故佛正法名為應時。言引導者。謂八支聖道。名為引導所以者何。以八支聖道習修多修習。能於苦集滅道。現觀能引能導能隨能逐。故佛正法名為引導。言近觀者。謂八支聖道。名為近觀。所以者何。以八支聖道修習多修習。能於苦集滅道。如實知見苦集滅道。故佛正法名為近觀。智者內證者。佛及佛弟子。名為智者。世尊所說苦集滅道。智者自內知見解了正等覺為苦集滅道。故佛正法。名智者內證。若聖弟子。以如是相隨念正法見為根本證智相應諸信信性現前信性隨順印可愛慕愛慕性心證心淨。是名法證淨。若能於此勸勵安立。當知是名方便勸勵安立令住法證淨中。",
    "法隨法行": "　　謂彼旋環如理作意。審正觀察深妙義已。便生出離遠離所生五勝善法。謂信精進。及念定慧。彼於自內所生出離遠離所生五勝善法。修習堅住。無間修習。增上加行。如是名為法隨法行。精進修行。法隨法行。便得趣入正性離生。",
    "波羅蜜多數相次第": "　　云何宣說波羅蜜多數相次第，乃至更互決擇？數有二種，一計算數，二決定數。計算數者，謂六波羅蜜多。決定數者，謂波羅蜜多數唯有六不增不減。何以故？一切菩薩道略有二種，一增上生道，二決定勝道，如其次第三三攝故，所以者何？增上生有三種，一大資財，二大自體，三大眷屬。施波羅蜜多感大資財果，戒波羅蜜多感大自體果，由持淨戒生善趣中得尊貴身故忍波羅蜜多感大眷屬果，能行忍者一切眾生咸所歸附故。決定勝道有三種，一伏諸煩惱修習善品方便，二成熟有情方便，三成熟佛法方便。如是三中隨闕一種，菩薩決定勝道必不成就，成熟有情方便者，謂靜慮波羅蜜多，依此發神通成熟有情故。復次波羅蜜多是無住處涅槃方便故，其數唯六，所以者何？由諸菩薩為翻住涅槃故，於生死中攝增上生，為翻住生死故，即於生死而不染污，是故前三是得增上生方便，後三是不染污方便，隨其所應如前應知。不染污方便者，由精進故修習對治，由靜慮故伏諸煩惱，由智慧故永害一切煩惱隨眠。復次為攝益一切有情故，對治一切煩惱故，波羅蜜多唯有六種，所以者何？菩薩摩訶薩由布施故引攝資財，方便攝益一切有情，由持戒故不起侵損逼迫惱亂。方便攝益一切有情，如其次第不毀壞他財身心故，由忍辱故堪受侵損逼迫惱亂。方便攝益一切有情，由堪忍他侵損己財等故。由此三種善能攝益一切有情，由精進故雖未永伏一切煩惱，而依善品修彼對治，由靜慮故永伏煩惱，由智慧故永害隨眠，由此三種善能對治一切煩惱。相者，謂諸菩薩波羅蜜多相。",
    "流轉": "　　流轉者，謂於因果相續不斷，假立流轉。所以唯於相續不斷立流轉者，於一剎那或於間斷，無此言故。",
    "涅槃差別": "　　涅槃差別者，謂於無餘涅槃界為欲利樂一切有情，一切功德無斷絕故。",
    "淨惑所緣": "　　淨惑所緣者，謂下地麤性上地靜性，真如及四聖諦，是名淨惑所緣。",
    "淨行所緣": "　　淨行所緣復有五種，謂多貪行者緣不淨境、多瞋行者緣修慈境、多癡行者緣眾緣性諸緣起境、憍慢行者緣界差別境、尋思行者緣入出息念境。善巧所緣亦有五種，謂蘊善巧、界善巧、處善巧、緣起善巧、處非處善巧。處非處善巧應云何觀？應如緣起善巧觀。處非處善巧緣起善巧有何差別？若以諸法流潤諸法，令離無因不平等因生故，是緣起善巧因果相稱，攝受生故，是處非處善巧。",
    "淨解脫身作證具足住": "　　云何淨解脫身作證具足住？謂於內淨不淨諸色，已得展轉相待想展轉相入想展轉一味想故，於彼已得具足中若定若慧，餘如前說，乃至為解脫淨不淨變化煩惱生起障。此中顯示於淨不淨諸色，依展轉相待想展轉相入想，得展轉一味想，所以者何？待諸淨色於餘色中謂為不淨，待不淨色於餘色中謂為清淨，非不相待，何以故？唯見一類時淨不淨覺無故。又於淨中不淨性所隨入，於不淨中淨性所隨入，何以故？於薄皮所覆共謂為淨，中現有髮毛等三十六種不淨物故，如是展轉總一切色合為一味清淨想，解如是已得隨所樂色，解脫自在者能斷淨不淨色變化障及於此中煩惱生起障。何等名於變化煩惱？謂於淨色變化加行功用，與不淨色變化相違故。",
    "清淨": "　　清淨者，謂初靜慮中邊際定，乃至非想非非想處邊際定，是名清淨靜慮無色邊際定者，為欲引發勝品功德得自在等，修堪任定到究竟處故。",
    "清淨世界": "　　復有清淨世界，非苦諦攝，非業煩惱力所生故，非業煩惱增上所起故，然由大願清淨善根增上所引，此所生處不可思議，唯佛所覺，尚非得靜慮者靜慮境界，況尋思者。",
    "清白": "　　清白者，謂淨靜慮無色，由性善故說名清白，雖是世間離纏垢故亦名為淨。",
    "滅界": "　　謂擇滅非擇滅。是名滅界。復次諸有色法。總名色界。除擇滅非擇滅。余無色法。是名無色界。擇滅非擇滅。是名滅界。",
    "滅盡定": "　　滅盡定者，謂已離無所有處欲，超過有頂，暫息想作意為先故，於不恒行諸心心法及恒行一分心心法滅。假立滅盡定，此中所以不言未離上欲者，為顯離有頂欲，阿羅漢等亦得此定故。一分恒行者，謂染污意所攝。",
    "滅諦": "　　云何滅諦？謂相故、甚深故、世俗故，勝義故、不圓滿故、圓滿故、無莊嚴故、有莊嚴故、有餘故、無餘故、最勝故、差別故，分別滅諦。",
    "滅諦相": "　　復次依滅諦辯無生等名義差別，與苦諦相義相違故，苦諦相者於彼彼處有情類中相續而生，為翻彼相。是故問言，何故此滅復名無生？離相續故，苦諦相者續生已後自身眾分漸次圓滿，為翻彼相。是故問言，何故此滅復名無起？永離此後漸生起故。苦諦相者宿業煩惱勢力所造，為翻彼相。是故問言，何故此滅復名無造永離前際諸業煩惱勢力所引故？又現在苦是能造作，餘有異熟諸業煩惱所依止處，為翻彼相。是故問言，何故此滅復名無作？不作現在諸業煩惱所依處故。又苦相者後有異熟相續生起無有間斷，為翻彼相。是故問言，何故此滅復名不生？永離未來相續生故。\n　　復次滅諦有四種相，謂滅相、靜相、妙相、離相。何故名滅相？煩惱離繫故，謂流轉因煩惱離繫故名滅。何故名靜相？苦離繫故，行苦所攝，不寂靜相取蘊離繫故名靜。何故名妙相？樂淨事故，諸煩惱苦究竟離繫，自然樂淨以為自體故名妙。何故名離相？常利益事故，不復退還最極安隱，如其次第名常利益安隱利益，最勝善性是滅諦相。",
    "漏": "　　漏有三種，謂欲漏、有漏、無明漏。令心連注流散不絕故名為漏，此復云何？依外門流注故立欲漏，依內門流注故立有漏，依彼二所依門流注，故立無明漏，令心連注流散不絕是漏義。",
    "漏盡智力": "　　漏盡智力者，謂於一切種漏盡智無著無礙現行中，所有三摩地等。",
    "漏盡無畏": "　　漏盡無畏者，謂依止靜慮由自利門，於一切種漏盡自稱德號建立具足中，若定若慧，餘如前說，如經言，我諸漏永盡，如是等，廣說如前。",
    "漏盡通": "　　漏盡通者，謂依止靜慮於漏盡智威德具足中，若定若慧及彼相應諸心心法。漏盡智者，謂由此智通達一切漏盡方便，及諸漏盡威德具足者此智成滿故。",
    "激磨": "　　謂多貪者。為得如前供養等故。往至他家。作如是語。汝父母等。具足淨信戒聞捨惠。乘斯善業。已生人天。及得解脫。而汝無信戒聞捨慧。既無善業。後若命終。定生惡趣。其如之何。如是讚毀以求利者。總名激磨。",
    "火界": "　　謂火界有二種。一內。二外。云何內火界？謂此身內所有各別暖性暖類有執有受。此復云何？謂此身中諸所有熱等熱遍熱。由此所食所啖所飲。正易消化。若此增盛。令身燋熱。復有所餘身內各別暖性暖類有執有受。是名內火界。云何外火界？謂此身外諸外所攝暖性暖類無執無受。此復云何？謂地暖火日藥末尼宮殿星宿火聚燈焰燒村燒城燒川燒野燒。十二十三十四十五十百千。或無量擔。薪草等火熾盛烔然。或在山澤河池岩窟房舍殿堂樓觀。草木根莖枝葉花果等暖。復有所餘熱性熱類無執無受。是名外火界。前內此外。總名火界。",
    "為他": "　　謂有一類親族知友。行於劫盜。王等為證。執問彼言。汝知此人行劫盜不。彼得問已。竊自思惟。若實答者。我諸親友。必為王等。或殺或縛。或復驅擯。或奪資財。我今宜應隱覆藏彼。故以正知。說虛誑語。既思惟已。答王等言。我知親友。決定不為不與取事。是名為他。",
    "為令未生善法生": "　　起欲發勤精進策心持心者。云何未生善法？謂未來四靜慮三無色。及余隨一種類出家遠離所生善法。云何為令未生善法生故正勝？謂有苾芻。為生未生初靜慮故。如理思惟。生初靜慮。諸行相狀。如是思惟。發勤精進。勇健勢猛。熾盛難制。勵意不息。此道名為能生未生初靜慮正勝。彼於此道。生已修習多修習故。便令未生初靜慮生。\n　　起欲者。謂為生未生初靜慮故。便起等起。及生等生。聚集出現欲。樂欣喜。求趣悕望。彼由生起此諸欲故。便令未生初靜慮生。發勤精進者。謂為生未生初靜慮故。發勤精進。廣說乃至。勵意不息。彼由此故。便令未生初靜慮生。\n　　策心者。謂為生未生初靜慮故。精勤修習喜俱行心。欣俱行心。策勵俱行心。不下劣俱行心。不闇昧俱行心。捨俱行心。定俱行心。彼由修習如是心故。便令未生初靜慮生。持心者。謂為生未生初靜慮故。持心修習八支聖道。彼於此道。持心修習多修習故。便令未生初靜慮生。如初靜慮第二靜慮亦爾。有差別者。應說自名。\n　　復有苾芻。為生未生第三靜慮故。如理思惟。生第三靜慮。諸行相狀。如是思惟。發勤精進。廣說乃至。勵意不息。此道名為能生未生第三靜慮正勝。彼於此道。生已修習多修習故。便生未生第三靜慮。\n　　起欲者。謂為生未生第三靜慮故。便起等起。廣說乃至。求趣悕望。彼由生起此諸欲故。便生未生第三靜慮。發勤精進者。謂為生未生第三靜慮故。發勤精進廣說乃至。勵意不息。彼由此故。便生未生第三靜慮。\n　　策心者。謂為生未生第三靜慮故。精勤修習。喜俱行心。廣說乃至。定俱行心。彼由修習如是心故。便生未生第三靜慮。持心者。謂為生未生第三靜慮故。持心修習八支聖道。彼於此道。持心修習多修習故。便生未生第三靜慮。如第三靜慮。乃至無所有處。廣說亦爾。有差別者。應說自名。\n　　復有苾芻。為生未生隨一種類出家遠離所生善法故。如理思惟。生彼善法諸行相狀。如是思惟。發勤精進。廣說乃至。勵意不息。此道名為能生未生隨一種類出家遠離所生善法正勝。彼於此道。生已修習多修習故。便生未生隨一種類出家遠離所生善法。起欲者。謂為生未生隨一種類出家遠離所生善法故。便起等起。廣說乃至。求趣悕望。彼由生起此諸欲故。便生未生隨一種類出家遠離所生善法。\n　　發勤精進者。謂為生未生隨一種類出家遠離所生善法故。發勤精進。廣說乃至。勵意不息。彼由此故。便生未生隨一種類出家遠離所生善法。策心者。謂為生未生隨一種類出家遠離所生善法故。精勤修習。喜俱行心廣說乃至。定俱行心。彼由修習如是心故。便生未生隨一種類出家遠離所生善法。\n　　持心者。謂為生未生隨一種類出家遠離所生善法故。持心修習八支聖道。彼於此道。持心修習多修習故。便生未生隨一種類出家遠離所生善法。為令已生善法堅住不忘修。滿倍增廣。大智作證故。起欲發勤精進策心持心者。云何已生善法？謂過去現在。四靜慮三無色。及余隨一種類出家遠離所生善法。云何為令已生善法堅住不忘修滿倍增廣大？智作證故正勝。\n　　謂有苾芻。為令已生初靜慮堅住乃至智作證故。如理思惟。能令已生初靜慮堅住乃至智作證諸行相狀。如是思惟。發勤精進。勇健勢猛。熾盛難制。勵意不息。此道名為能令已生初靜慮堅住乃至智作證正勝。彼於此道。生已修習多修習故。便令已生初靜慮堅住乃至智作證。\n　　起欲者。謂為令已生初靜慮堅住乃至智作證故。便起等起。及生等生。聚集出現。欲樂欣喜。求趣悕望。彼由生起此諸欲故。便令已生初靜慮堅住乃至智作證。發勤精進者。謂為令已生初靜慮堅住乃至智作證故。發勤精進。廣說乃至。勵意不息。彼由此故便令已生初靜慮堅住乃至智作證策心者。謂為令已生初靜慮堅住乃至智作證故。精勤修習。喜俱行心。欣俱行心。策勵俱行心。不下劣俱行心。不闇昧俱行心。捨俱行心。定俱行心。彼由修習如是心故。便令已生初靜慮堅住乃至智作證。\n　　持心者。謂為令已生初靜慮堅住乃至智作證故。持心修習八支聖道。彼於此道。持心修習多修習故。便令已生初靜慮堅住乃至智作證。如初靜慮。第二靜慮亦爾。有差別者。應說自名。\n　　復有苾芻。為令已生第三靜慮堅住乃至智作證故。如理思惟。能令已生第三靜慮堅住乃至智作證諸行相狀。如是思惟發勤精進。廣說乃至。勵意不息此道名為能令已生第三靜慮堅住乃至智作證正勝。彼於此道。生已修習多修習故。便令已生第三靜慮堅住乃至智作證。\n　　起欲者。謂為令已生第三靜慮堅住乃至智作證故。便起等起。廣說乃至。求趣悕望。彼由生起此諸欲故。便令已生第三靜慮堅住乃至智作證。發勤精進者。謂為令已生第三靜慮堅住乃至智作證故。發勤精進。廣說乃至。勵意不息。彼由此故。便令已生第三靜慮堅住乃至智作證。\n　　策心者。謂為令已生第三靜慮堅住乃至智作證故。精勤修習。喜俱行心。廣說乃至。定俱行心。彼由修習如是心故。便令已生第三靜慮堅住乃至智作證。\n　　持心者。謂為令已生第三靜慮堅住乃至智作證故。持心修習八支聖道。彼於此道。持心修習多修習故。便令已生第三靜慮堅住乃至智作證。如第三靜慮。乃至無所有處。廣說亦爾。有差別者。應說自名。\n　　復有苾芻。為令已生隨一種類出家遠離所生善法堅住不忘修滿倍增廣大智作證故。如理思惟。能令已生隨一種類出家遠離所生善法堅住乃至智作證諸行相狀。如是思惟。發勤精進。廣說乃至。勵意不息。此道名為能令已生隨一種類出家遠離所生善法堅住乃至智作證正勝。彼於此道。生已修習多修習故。便令已生隨一種類出家遠離所生善法堅住乃至智作證。\n　　起欲者。謂為令已生隨一種類出家遠離所生善法堅住乃至智作證故。便起等起。廣說乃至。求趣悕望。彼由生起此諸欲故。便令已生隨一種類出家遠離所生善法堅住乃至智作證。\n　　發勤精進者。謂為令已生隨一種類出家遠離所生善法堅住乃至智作證故。發勤精進。廣說乃至。勵意不息。彼由此故。便令已生隨一種類出家遠離所生善法堅住乃至智作證。\n　　策心者。謂為令已生隨一種類出家遠離所生善法堅住乃至智作證故。精勤修習。喜俱行心。廣說乃至。定俱行心。彼由修習如是心故。便令已生隨一種類出家遠離所生善法堅住乃至智作證。\n　　持心者。謂為令已生隨一種類出家遠離所生善法堅住乃至智作證故。持心修習八支聖道。彼於此道持心修習多修習故。便令已生隨一種類出家遠離所生善法堅住乃至智作證。云何此四名為正勝？謂此四種。無顛倒故。說名為正。有增上力。斷惡修善。故名為勝。復次此四。平等非不平等。實故諦故。如正理故。無顛倒故。說名為正。增故上故。最故妙故。具大功能。故名為勝。復次四正勝者。是假建立名想言說。謂為正勝過殑伽沙佛及弟子。皆共施設如是名故。復次四正勝者。為斷已生惡不善法。生起諸欲。發勤精進。策心持心。為令未生惡不善法得不生故。生起諸欲。發勤精進。策心持心。為生未生諸善法故。生起諸欲。發勤精進。策心持心。為令已生善法堅住不忘修滿倍增廣大智作證故。生起諸欲。發勤精進。策心持心。具如是能。故名正勝。亦名正斷。斷懈怠故。",
    "無上": "　　云何無上？幾是無上？為何義故觀無上耶？謂無為一分故，是無上義。法界法處一分，如前所說是無上，為捨執著最勝事我故，觀察無上。",
    "無上丈夫": "　　如世尊言。所有有情。無足二足。四足多足。有色無色。有想無想。非想非非想。如來於中。最稱第一。最勝最尊。最上無上。由此故說無上丈夫。",
    "無上離欲": "　　何等無上離欲？謂佛菩薩所有離欲。為欲利樂諸有情故",
    "無分別": "　　無分別者略有三種，一知足無分別，二無顛倒無分別，三無戲論無分別，如此三種異生聲聞菩薩如次第應知。由諸異生隨於一無常等法性，究竟思已便生喜足，謂是事必然更無異望，是名知足無分別。爾時一切尋思分別皆止息故，由諸聲聞於諸蘊中為對治常等顛倒故，如理觀察唯有色等法時，便得出世間智通達無我性，是名無顛倒無分別。由諸菩薩知色等法唯戲論已，遂能除泯一切法相，得最極寂靜出世間智，通達遍滿真如，是名無戲論無分別。此無分別智復離五相，謂非無作意故，非超過故，非寂止故，非自性故，非於所緣作加行故，名無分別，所以者何？若無作意故名無分別，熟眠醉等應是無分別智，由彼不思惟諸法相故。若超過故名無分別，從第二靜慮已上一切地，應是無分別智，由彼超過尋伺故。若爾三界心心法是分別體，言即為相違，若寂止故名無分別。滅受想定應是無分別智。分別心心法於彼寂止故。若爾智亦應無。若自性故名無分別。色等應是無分別智。彼非分別自性故，若於所緣作加行故名無分別，即分別性應是無分別智。若謂此是無分別，此加行相即分別相故，是故無分別智非彼五相。若爾當云何觀無戲論無分別相，謂於所緣不起加行。此復云何？若諸菩薩過隨順教觀察諸法，若性若相皆不真實，由此觀察串習力所持故，不由加行於如實無戲論界一切法真如中內心寂定，如是乃名無戲論無分別智。",
    "無功用行菩薩": "　　無功用行菩薩者，謂住不動善慧法雲地中所有菩薩，由此菩薩已得純熟無分別智故。",
    "無功用行菩薩補特伽羅": "　　何等無功用行菩薩補特伽羅？謂住不動善慧法雲地中所有菩薩。",
    "無卒暴音": "　　無卒暴音者，謂阿羅漢或於一時遊行林野迷失道路，或入空宅揚聲叫喚發大暴音，因不染污習氣過失聚，露脣齒而現大笑，如是等卒暴音阿羅漢猶有，如來永無。",
    "無學": "　　云何無學？幾是無學？為何義故觀無學耶？謂於諸學處已得究竟者所有善法，是無學義。以阿羅漢等於增上戒心慧學處已得究竟故名無學，十界四處諸蘊一分是無學，為捨執著已脫我故，觀察無學。",
    "無學界": "　　謂無學五蘊。是名無學界。",
    "無害界": "　　謂於害界。思惟過患。如是害界。是不善法。乃至不證涅槃。如是思惟。發勤精進。乃至勵意不息。是名無害界。復次為斷害界。於無害界。思惟功德。如是不害界。是善法。乃至能證涅槃。如是思惟。發勤精進。乃至勵意不息。是名無害界。復次思惟害界。如病如癰。乃至是變壞法。如是思惟。發勤精進。是名無害界。復次為斷害界。思惟彼滅是滅是離。思惟彼道是道是出。如是思惟。發勤精進。乃至勵意不息。是名無害界。復次若思惟。悲心定及道。悲心定相應。如是思惟。發勤精進。乃至勵意不息。是名無害界。復次無害及無害相應受想行識。並所等起身業語業。不相應行。總名無害界。",
    "無對": "　　云何無對？幾是無對？為何義故觀無對耶？謂有對相違是無對義，一切皆是無對，或隨所應，為捨執著，遍行我故，觀察無對。",
    "無常": "　　無常者，謂於眾同分諸行相續變壞性，假立無常相續。",
    "無常相": "　　復次諸觀行者，於苦聖諦以四種行觀察共相，謂無常相苦相空相無我相\n　　無常相者略有十二，謂非有相壞滅相變異相別離相現前相法爾相剎那相相續相病等相種種心行轉相資產興衰相器世成壞相，非有相者，謂蘊界處於一切時我我所性常非有故，言無常者是非有義，由苦聖諦恒無有我我所自性，無者是除遣義，常者是一切時義，以常無故名曰無常。壞滅相者，謂諸行生已即滅，暫有還無故。變異相者，謂諸行異異生，由不相似相續轉故。別離相者，謂於諸行失增上力，或他所攝執為己有，以於資具等事，或時自在失壞，或他陵奪為己有故。現前相者，謂正處無常，由因隨逐今受無常故。法爾相者，謂當來無常，由因隨逐定當受故，死無常性決定當受。剎那相者，謂諸行剎那後必不住，諸行念念劣得自體，無間必壞故。相續相者，謂無始時來諸行生滅相續不斷，由無始生死展轉相乘輪迴不絕故。病等相者，謂四大時分壽命變異，由四大乖違齒髮疏落等住時勢盡故。種種心行轉相者，謂於一時起有貪心，或於一時起離貪心，如是有瞋離瞋有癡離癡，若合若散若下若舉，若掉離掉，若不寂靜若寂靜，若定不定，如是等心行流轉，由住能治所治位差別故。資產興衰相者，謂諸興盛終歸衰變，由諸世間富貴榮盛不可愛樂非究竟故。器世成壞相者，謂火水風三種成壞，由火水風災令大地等數成壞故，能燒浸燥如其次第。又有三災頂，謂第二第三第四靜慮，由火水風能壞世界安立處所乃至第一第二第三靜慮邊際，次上所餘名三災頂，如其次第第二第三第四靜慮處所差別，第四靜慮外宮殿等，雖無外災成壞，然彼諸天與宮殿等俱生俱滅，說有成壞，由彼有情初生時與宮殿等俱生，終沒時與彼俱滅，即說此為成壞故。又有三種中劫所謂飢饉疫病刀兵，此小三災劫究竟滿方乃出現，謂世界成已一中劫初唯減，一中劫後唯增，十八中劫亦增亦減，一中劫初唯減者，謂劫成時第二十一劫。一中劫後唯增者，謂最後劫，十八中劫亦增亦減者，謂於中間十八，二十中劫世界正壞，二十中劫世界壞已住，二十中劫世界正成，二十中劫世界成已住，合此八十中劫為一大劫。由此劫數顯色無色界諸天壽量，如說以壽盡故福盡故業盡故，彼彼有情從彼彼處沒。云何壽盡？謂時死此約時沒說，由所引壽時分究竟應時死故，云何福盡？謂非時死即非福死，此約非時沒說，以彼有情貪著定味，福力減盡因此命終，由愛定味損害所修引壽業力非時死故。云何業盡？謂順生受業順後受業俱盡故死，此約相續沒說，由於此處順生後受業受用斯盡，以無業故不復生此。",
    "無忘失念": "　　無忘失念者，謂阿羅漢猶有不染污，久遠所作久遠所說忘失憶念，如來永無。無不定心者，謂阿羅漢斂心方定，出即不定，如來於一切位無不定。心無種種想者，謂阿羅漢於有餘生死起違逆想，於無餘涅槃起寂靜想，如來於生死涅槃無差別想，由住第一大捨故。無不擇捨者，謂阿羅漢不以智慧簡擇，棄捨有情利益事，如來無此等事故無不擇捨。又阿羅漢於所知障淨有未得退，謂志欲退精進退念退定退慧退解脫退，如是六退如來永無。",
    "無忘失法": "　　無忘失法者，謂於一切種隨其所作所說明記具足中，若定若慧，乃至廣說。此中顯示依化事門，於隨所作等念具足中，所有三摩地等，是無忘失法。\n　　無忘失法作何業？謂能不捨離一切佛事，所以者何？由此於諸有情現前應利益事，能無放逸不越一剎那故。",
    "無恚界": "　　謂於恚界。思惟過患。如是恚界。是不善法。乃至不證涅槃。如是思惟。發勤精進。乃至勵意不息。是名無恚界。復次為斷恚界。於無恚界。思惟功德。如是無恚界。是善法。乃至能證涅槃。如是思惟。發勤精進。乃至勵意不息。是名無恚界。復次思惟恚界。如病如癰。乃至是變壞法。如是思惟。發勤精進。是名無恚界。復次為斷恚界。思惟彼滅是滅是離。思惟彼道是道是出。如是思惟。發勤精進。乃至勵意不息。是名無恚界。復次若思惟。慈心定及道。慈心定相應。如是思惟。發勤精進。乃至勵意不息。是名無恚界。復次無恚及無恚相應受想行識。並所等起身業語業。不相應行總名無恚界。",
    "無想定": "　　無想定者，謂已離遍淨欲，未離上欲，出離想作意為先故，於不恒行心心法滅。假立無想定，已離遍淨欲者，已離第三靜慮貪。未離上欲者，未離第四靜慮已上貪，出離想作意為先者，解脫想作意為前方便。不恒行者，轉識所攝。滅者，謂定心所引不恒現行，諸心心法暫時間滅所依位差別，以能滅故名滅。",
    "無想異熟": "　　無想異熟者，謂已生無想有情天，於不恒行心心法滅，假立無想異熟。",
    "無愧": "　　謂無愧無所愧無別愧。無恥無所恥無別恥。於諸罪中。不怖不畏。不見怖畏。總名無愧。",
    "無慚": "　　無慚者，貪瞋癡分，於諸過惡不自恥為體，一切煩惱及隨煩惱助伴為業。",
    "無慾界": "　　謂於欲界。思惟過患。如是欲界。是不善法。是下賤者。信解受持。佛及弟子。賢貴善士。共所呵厭。能為自害。能為他害。能為俱害。能滅智慧。能礙彼類。能障涅槃。受持此法。不生通慧。不引菩提。不證涅槃。如是思惟。發勤精進。乃至勵意不息。是名無慾界。復次為斷欲界。於無慾界。思惟功德。如是無慾界。是善法。是尊勝者。信解受持。佛及弟子。賢貴善士。共所欣讚。不為自害。不為他害。不為俱害。增長智慧。不礙彼類。不障涅槃。受持此法。能生通慧。能引菩提。能證涅槃。如是思惟。發勤精進。乃至勵意不息。是名無慾界。復次思惟欲界。如病如癰。如箭惱害。無常苦空非我轉動。勞倦羸篤。是失壞法。迅速不停。衰朽非恆。不可保信。是變壞法。如是思惟。發勤精進。是名無慾界。復次為斷欲界。思惟彼滅是滅是離。思惟彼道是道是出。如是思惟。發勤精進。乃至勵意不息。是名無慾界。復次若思惟。捨心定及道。捨心定相應。並無想定。滅定擇滅。如是思惟。發勤精進。乃至勵意不息。是名無慾界。復次無慾及無慾相應受想行識。並所發起身業語業。不相應行。總名無慾界。",
    "無我相": "　　無我相者，謂如我論者，所立我相蘊界處非此相，由蘊界處我相無故，名無我相我論外道計度諸行為我，彼諸行非此相故名無我。故薄伽梵密意說言，一切法皆無我，如世尊說，此一切非我所，此非我處此非我我，於如是義應以正慧如實觀察。此言何義？謂於外事密意說此一切非我所，於內事密意說此非我處此非我我所。所以者何？以於外事唯計我所相，是故但遣我所，於內事通計我我所相，是故雙遣我我所。\n　　問前說無常皆剎那相。此云何知。答如心心法是剎那相。當知色等亦剎那相。由心執受故。等心安危故。隨心轉變故。是心所依故。心增上生故。心自在轉故。又於最後位變壞可得故。生已不待緣自然壞滅故。當觀色等亦念念滅。諸無常行壞滅等相。心心法剎那相。世間共了。更不重辯。諸色等法剎那滅相。世不共了故今成立。由心執受者。謂色等身。由剎那心念念執受故剎那滅。等心安危者。謂色等身恒與識俱。識若捨離即便爛壞。由身與心安危等故。決定如心念念生滅。隨心轉變者。謂世間現見心。在苦樂貪瞋等位身隨轉變。隨剎那心而轉變故身念念滅。是心所依者。謂世間共知心依止有根身。若法依此生非此自無壞。能依有可見。如火芽等依薪種等。是故此身是剎那心所依止故。亦剎那滅。心增上生者。謂一切內外色皆心增上所生。能生因剎那滅故。所生果亦剎那滅。如世尊說。諸因諸緣能生於色。彼亦無常。無常因緣力所生故。色云何常。隨此經句義。身定剎那滅。心自在轉者。謂若證得勝威德心。於一切色如其所欲自在轉變。由隨剎那能變勝解轉變生故。色等剎那道理成就。於最後位變壞可得者。謂諸色等初離自性念念變壞。於最後位欻爾變壞。不應道理然此可得。故知色等從初已來念念變壞。自類相續漸增為因。能引最後麤相變壞。是故色等念念生滅。生已不待緣自然壞滅者。謂一切法從緣生已。不待壞緣自然壞滅。以不待餘緣自然壞滅故。最初生已決定壞滅。若言生已初無滅壞。後方有者不然。無差別故。故知一切可滅壞法。初纔生已即便壞滅。是故諸法剎那義成\n　　問如世尊說。諸所有色彼一切若四大種若四大種所造。此依何意說。答依容有意說同在一處。依此而有是造義。由所造色離大種處別自建立無功能故。若於此聚此大種可得。當知此聚唯有此大種非餘。或有聚唯一大種。如乾泥團等。或有二大種。謂即此濕。或有三大種。謂即此煖。或有一切大種。謂即此濕煖泥團等。於移轉位所造色亦爾。若於此聚此所造色可得。當知此聚唯此非餘。或有聚唯一所造色如光等。或有二所造色如有聲香風等。或有三所造色如香煙等。由此香煙有色香觸差別所顯故。觸差別者。謂此中輕性。或有四所造色。如沙糖團等。或有五所造色。謂即此有聲時。又若於此聚大種造色隨分可得。當知此中有此非餘。此依麤物說非種子。一一聚中有一切種子故\n　　又說麤聚色極微集所成者。當知此中極微無體無實無性。唯假建立。展轉分析無限量故。但由覺慧漸漸分析。細分損減乃至可析邊際。即約此際建立極微。問若諸極微無實體性何故建立。答為遣一合想故。若以覺慧分分分析所有諸色。爾時妄執一切諸色為一合想即便捨離。由此順入數取趣無我性故。又為悟入諸所有色非真實故。若以覺慧如是分析所有諸色至無所有。爾時便能悟入諸色皆非真實。因此悟入唯識道理。由此順入諸法無我性故",
    "無明": "　　謂於前際無知。後際無知。前後際無知。於內無知。外無知。內外無知。於業無知。異熟無知。業異熟無知。於善作業無知。惡作業無知。善惡作業無知。於因無知。因所生法無知。於佛法僧無知。於苦集滅道無知。於善不善法無知。於有罪無罪法無知。於應修不應修法無知。於下劣勝妙法無知。於黑白法無知。於有敵對法無知。於緣生無知。於六觸處如實無知。如是無知無見非現觀。黑闇愚癡。無明盲冥。罩網纏裡。頑騃渾濁。障蓋發盲。發無明。發無智。發劣慧。障礙善品。令不涅槃。無明漏。無明瀑流。無明軛。無明毒根。無明毒莖。無明毒枝。無明毒葉。無明毒花。無明毒果。癡等癡極癡。欣等欣極欣。癡類癡生。總名無明。",
    "無明為緣造不動行": "　　謂有一類。於空無邊處天。繫心悕求。彼作是念。願我當生空無邊處天眾同分中。因此悕求。勤修加行。超諸色想。滅有對想。不思惟種種想。入無邊空。空無邊處具足住。於此定中。諸思等思現前。等思已思當思。思性思類。造心意業。名不動行。由此因緣。身壞命終。生空無邊處天眾同分中。於彼復能造不動行。是名無明為緣造不動行。有不繫心悕求生彼。但由無明蔽動心故。勤修加行。超諸色想。滅有對想。不思惟種種想。入無邊空。空無邊處具足住。於此定中。諸思等思現前。等思已思當思。思性思類。造心意業。名不動行。由此因緣。身壞命終。生空無邊處天眾同分中。於彼復能造不動行。是名無明為緣造不動行。",
    "無明為緣造福行": "　　謂有一類。於人趣樂。繫心悕求。彼作是念。願我當生人趣同分。與諸人眾。同受快樂。因此悕求。造能感人趣身語意妙行。此三妙行。名為福行。由此因緣。身壞命終。生於人趣。與諸人眾。同受快樂。於彼復造諸福行等。是名無明為緣造福行。有不繫心悕求人樂。但由無明蔽動心故。造身語意三種妙行。此三妙行。名為福行。由此因緣。身壞命終。生於人趣。於彼復造諸福行等。是名無明為緣造福行。如說人趣。四大王眾天。三十三天。夜摩天。睹史多天。樂變化天。他化自在天。應知亦爾。\n　　復有一類。於梵眾天。繫心悕求。彼作是念。願我當生梵眾天眾同分中。因此悕求。勤修加行。離欲惡不善法。有尋有伺離生喜樂。初靜慮具足住。於此定中。諸身律儀。語律儀。命淸淨。名為福行。由此因緣。身壞命終。生梵眾天眾同分中。於彼復造諸福行等。是名無明為緣造福行。有不繫心悕求生彼。但由無明蔽動心故。勤修加行。離欲惡不善法。有尋有伺。離生喜樂。初靜慮具足住。於此定中。諸身律儀。語律儀。命淸淨。名為福行。由此因緣。身壞命終。生梵眾天眾同分中。於彼復造諸福行等。是名無明為緣造福行。如說梵眾天。梵輔天。大梵天。少光天。無量光天。極光淨天。少淨天。無量淨天。徧淨天。無雲天。福生天。廣果天。隨其所應。廣說亦爾。\n　　復有一類。於無想天。繫心悕求。彼作是念。願我當生無想天眾同分中。因此悕求。勤修加行。思惟諸想。是粗苦障。思惟無想是靜妙離。由此思惟。能滅諸想。安住無想。彼諸想滅。住無想時。名無想定。入此定時。諸身律儀。語律儀。命淸淨。名為福行。由此因緣。身壞命終。生無想天眾同分中。於彼亦能造少福行。是名無明為緣造福行。有不繫心悕求生彼。但由無明蔽動心故。勤修加行。思惟諸想是粗苦障。思惟無想是靜妙離。由此思惟。能滅諸想。安住無想。彼諸想滅。住無想時。名無想定。入此定時。諸身律儀。語律儀。命淸淨。名為福行。由此因緣。身壞命終。生無想天眾同分中。於彼亦能造少福行。是名無明為緣造福行。",
    "無明為緣造非福行": "　　謂有一類。由貪瞋癡纏縛心故。造身語意三種惡行。此三惡行。名非福行。由此因緣。身壞命終。墮於地獄。於彼復造非福行等。是名無明為緣造非福行。如說地獄。傍生鬼界。應知亦爾。",
    "無明界": "　　謂三界無知。是名無明界。",
    "無明結": "　　無明結者，謂三界無智，無明結所繫故，於苦法集法不能解了，不解了故廣行不善不行諸善，由此能招未來世苦與苦相應，於苦集法不解了者，謂於果性因性有漏諸行，所有過患不了知故。",
    "無明結者": "　　無明結者，謂三界無智無明結所繫故，於苦法集法不能解了，不解了故廣行不善不行諸善，由此能招未來世苦，與苦相應。",
    "無明緣行": "　　謂世尊說。苾芻當知。無明為因。無明為緣。故貪瞋癡起。此貪瞋癡性。是名無明緣。行復次如世尊說。苾芻當知。無明為前行。無明為幖幟。故起無量種惡不善法。謂無慚無愧等。由無慚無愧故起諸邪見。由邪見故起邪思惟。由邪思惟故起邪語。由邪語故起邪業。由邪業故起邪命。由邪命故起邪勤。由邪勤故起邪念。由邪念故起邪定。此邪見邪思惟邪語邪業邪命邪勤邪念邪定。是名無明緣行。\n　　復次如世尊說。苾芻當知。起無量種惡不善法。一切皆以無明為根。無明為集。是無明類。從無明生。墮無明趣者。不如實知善不善法。有罪無罪法。應修不應修法。下劣勝妙法。黑白法。有敵對法。緣生諸法。不如實知此諸法故。便起邪見邪思惟。乃至邪念邪定。是名無明緣行。",
    "無有無記": "　　又阿羅漢或於一時善身業轉，或於一時無記身業轉，語業意業亦爾，如來三業智為前導故隨智而轉，故無有無記，智為前導者，智所等起故，隨智而轉者與智俱行故。",
    "無有見": "　　謂於我及世間。起非常非恆想。由此生忍樂慧觀見。名無有見。",
    "無染": "　　云何無染？幾是無染？為何義故觀無染耶？謂有染相違是無染義，乃至無諍有爾所量，無染亦爾，為捨執著離染我故，觀察無染。",
    "無漏": "　　云何無漏？幾是無漏？為何義故觀無漏耶？謂有漏相違是無漏義，五無取蘊全及三界二處少分，是無漏。為捨執著離漏我故，觀察無漏。",
    "無漏律儀所攝業": "　　無漏律儀所攝業者，謂已見諦者由無漏作意力所得無漏遠離戒性。",
    "無漏界": "　　謂無漏五蘊。及虛空擇滅非擇滅。是名無漏界。",
    "無為": "　　云何無為？幾是無為？為何義故觀無為耶？謂有為相違是無為義，法界法處一分是無為為捨執著常住我故，觀察無為。問無取五蘊當言有為，當言無為？答彼不應言有為無為，何以故？諸業煩惱所不為故，不應言有為，隨欲限前不限前故，不應言無為。所以者何？無取諸蘊隨所欲樂，若現前若不現前無為不爾，以常住故問如薄伽梵說，一切法有二種，謂有為無為。云何今說此法非有為非無為耶？答此亦不離二種故。所以者何？若由此義說名有為，不以此義說名無為，若由此義說名無為，不以此義說名有為，依此道理唯說二種。何以故？隨欲現前不現前義故，說名有為，諸業煩惱所不為義故，說名無為，是故此亦不離二種。",
    "無為界": "　　謂虛空及二滅。是名無為界。",
    "無熱者": "　　言無熱者。謂八支聖道。名為無熱。所以者何。熱謂煩惱。八支聖道中。一切煩惱。無得無近得無有無等有。故佛正法名為無熱。",
    "無生智": "　　無生智者，謂由果斷所得智，或緣果不生為境，所以者何？由有無生故所得智名無生智，或緣無生為境名無生智。此義意言，由有當來一切苦果畢竟不生法性故，而得此智，雖緣餘諦為境亦名無生智，或緣苦諦無生為境，故名無生智。\n　　又十無學法，當知依止無學戒蘊、定蘊、慧蘊、解脫蘊、解脫智見蘊說，何以故？無學正語正業正命，是無學戒蘊。無學正念正定，是無學定蘊。無學正見正思惟正精進，是無學慧蘊。無學正解脫，是無學解脫蘊。無學正智，是無學解脫智見蘊。",
    "無畏": "　　無畏者，謂四無畏，一正等覺無畏、二漏盡無畏、三障法無畏、四出苦道無畏。\n　　無畏作何業？謂處大眾中自正建立我為大師，摧伏一切邪難外道。大師者，自利利他眾德圓滿故摧伏邪難外道者，謂能摧伏於如來所說成等正覺永斷諸漏障道法中邪難外道故。",
    "無癡": "　　無癡者，由報教證智決擇為體，惡行不轉所依為業，慚等易了故不再釋；報教證智者，謂生得聞思修所生慧，如次應知；決擇者，謂慧勇勤俱。",
    "無相行菩薩": "　　無相行菩薩者，謂住遠行地中所有菩薩，由此菩薩若作功用乃至隨其欲樂，能令諸相不現行故。",
    "無相行菩薩補特伽羅": "　　何等無相行菩薩補特伽羅？謂住遠行地中所有菩薩。",
    "無瞋": "　　無瞋者，於諸有情苦及苦具無恚為體，惡行不轉所依為業。",
    "無礙解": "　　無礙解者，謂四無礙，一法無礙解、二義無礙解、三訓詞無礙解、四辯才無礙解。\n　　無礙解作何業？謂善說法要悅眾生心，能絕一切諸疑網故。",
    "無自性": "　　如方廣分說。一切諸法皆無自性。依何密意說？謂無自然性故，無自體性故，無住自體故，無如愚夫所取相性故，復次於遍計所執自性，由相無性故，於依他起自性，由生無性故，於圓成實自性，由勝義無性故。",
    "無色": "　　云何無色？幾是無色？為何義故觀無色耶？謂有色相違是無色義，一切皆是無色，或隨所應，為捨執著無色我故，觀察無色，一切是無色者，謂與無色相繫屬故。",
    "無色界": "　　謂四無色。是名無色界。",
    "無色界繫": "　　云何無色界繫？幾是無色界繫？為何義故觀無色界繫耶？謂已離色界欲，未離無色界欲者，所有善無記法，是無色界繫義。三界二處四蘊一分，是無色界繫。三界者，謂意界法界意識界。二處者，謂意處法處。四蘊者，謂受等，亦有三摩地所生色，少故不說。一分者，謂除欲色界繫及無漏法，為捨執著離色界欲我故，觀察無色界繫。",
    "無莊嚴": "　　何等無莊嚴故？謂慧解脫阿羅漢所有滅。何等有莊嚴故？謂俱分解脫三明六通阿羅漢等所有滅。",
    "無行般涅槃": "　　無行般涅槃補特伽羅者，謂生彼已不由加行，聖道現前得盡苦際，不由加行者，由宿串習力，無漏聖道任運現前，無功用故。",
    "無見": "　　云何無見？幾是無見？為何義故觀無見耶？謂有見相違是無見義，一切皆是無見，或隨所應，為捨執著非眼境我故，觀察無見",
    "無記": "　　云何無記？幾是無記？為何義故觀無記耶？謂自性故、相屬故、隨逐故、發起故、勝義故、生得故、加行故、現前供養故、饒益故、受用故、引攝故、對治故、寂靜故、等流故，是無記義。八界八處全及餘蘊界處一分是無記，為捨執著離法非法我故。觀察無記。云何無記？幾是無記？為何義故觀無記耶？謂自性故、相屬故、隨逐故、發起故、第一義故、生得故、方便故、現前供養故、饒益故、受用故、引攝故、對治故、寂靜故、等流故，是無記義。八界八處全及餘蘊界處一分，是無記。八界者，謂五色根香味觸界，八處亦爾，為捨執著離法非法我故，觀察無記。自性無記者，謂八色界處意相應品，命根眾同分，名句文身，相屬無記者，謂懷非穢非淨心者，所有由名句文身所攝受心及心法，非穢非淨心者，顯善不善相違心，由名句文身所攝受者，顯彼行相義，以彼意言門轉故。隨逐無記者，謂即彼戲論習氣，以名身等熏習心故，由此習氣後戲論生。發起無記者，謂彼所攝諸心心法所發身業語業，此所攝者，謂懷非穢非淨心者，所有名身等戲論行相所攝心心法。第一義無記者，謂虛空非擇滅。生得無記者，謂諸不善有漏善法報。方便無記者，謂非染非善心者。所有威儀路工巧處法，非染非善心者，此顯若非染非善心所發威儀路等，是無記性，所餘隨其所應或善或不善。現前供養無記者，謂如有一想對歸依隨一天眾，遠離殺害意邪惡見，而建立祠廟興供養業，令無量眾於如是處不生長福非福。饒益無記者，謂如有一於自僕使妻子等所，以非穢非淨心而行惠施。受用無記者，謂如有一以無簡擇無染污心受用資具，無簡擇心者為別善性，無染污心者為別不善性。引攝無記者，謂如有一於工巧處串習故，於當來世復引攝如是相身，由此身故，習工巧處速疾究竟。對治無記者，謂如有一為治疾病得安樂故。以簡擇心好服醫藥。寂靜無記者，謂色無色界諸煩惱等，由奢摩他所藏伏故。等流無記者，謂變化心俱生品，是證等流故名等流無記，變化心相應共有等法名俱生品，此心心法謂嬉戲故發起變化是無記性，若為利益安樂有情，當知是善，復有示現善不善無記法。此復云何？謂佛及得第一究竟菩薩摩訶薩，為欲饒益諸有情故有所示現，當知此中無有一法真實可得，有所示現者，謂佛菩薩由所化有情力故，示現種種善不善等，示現不善者，謂化作賊等示現斷其首足等事，怖餘有情令調伏故。",
    "無記事": "　　復次何故建立諸無記事？由彼所問不如理故。何故所問不如理耶？遠離因果染淨所應思處故。此中顯示如來於諸外道所問世間常無常等事中建立十四不可記事，由彼所問不如正理能引無義利故。何等問論能引義利？謂依四聖諦所有問論，由此問論因果染淨應思處所攝故。",
    "無記界": "　　謂無記色心心所法不相應行。及虛空非擇滅。是名無記界。",
    "無諍": "　　云何無諍？幾是無諍？為何義故觀無諍耶？謂有諍相違是無諍義，乃至無漏有爾所量，無諍亦爾，為捨執著離諍我故，觀察無諍。",
    "無貪": "　　無貪者，於有有具無著為體，惡行不轉所依為業。",
    "無邊虛空處解脫": "　　云何無邊虛空處解脫？謂於隨順解脫無邊虛空處，住具足中若定若慧，餘如前說。如無邊虛空處解脫，無邊識處無所有處非想非非想處解脫亦爾，乃至為解脫寂靜解脫無滯礙障，如是四種若聖弟子所得能順無漏，是清淨性方名解脫，解脫愛味故。寂靜解脫者，謂超色無色於中清淨，名無滯礙，味著無色是此障。",
    "無量": "　　無量者，謂四無量，一慈無量、二悲無量、三喜無量、四捨無量。慈云何？謂依止靜慮於諸有情與樂相應意樂，住具足中若定若慧，及彼相應諸心心法。此中顯慈無量，以靜慮為所依，有情為境界，願彼與樂相應為行相，定慧為自體，一切功德皆奢摩他毘鉢舍那所攝故，諸心心法為助伴，當知悲等一切功德隨其所應亦爾。悲云何？謂於諸有情離苦意樂，住具足中若定若慧，餘如前說所依自體助伴與慈相似故。喜云何？謂於諸有情不離樂意樂，住具足中若定若慧，餘如前說。捨云何？謂依止靜慮於諸有情利益意樂，住具足中若定若慧，餘如前說。利益意樂者，謂於與樂相應等有情所棄捨愛等，作是思惟，當令彼解脫煩惱，如是意樂名捨行相，利益意樂行相圓滿，名住具足。\n　　復次無量作何業？謂捨所治障哀愍住故，能速圓滿福德資糧，成熟有情心無懈倦。捨所治障者，謂如其次第四無量，能捨瞋害不樂愛恚故。哀愍住者，謂四無量，於利益有情事隨順轉住，由於一切有情哀愍住故能速圓滿福德資糧。成熟有情心無懈倦者，由愍諸有情不顧自身故。",
    "無量門正為開示滅真是滅": "　　云何名為以無量門正為開示滅真是滅？謂正開示。即上所說。愛後有愛。喜俱行愛。彼彼喜愛。無餘永斷。棄捨變吐。盡離染滅。寂靜永沒。名為舍宅。亦名洲渚。亦名救護。亦名歸依。亦名所趣。亦名無憂。亦名無病。亦名無動。亦名無沒。亦名無熾。亦名無熱。亦名安隱。亦名惔怕。亦名善事。亦名吉祥。亦名涅槃。如有頌言。\n　　究竟沙門果　　調伏所稱讚\n　　我慢滅無餘　　永證甘露跡\n　　所歸住趣宅　　勝宮佛所讚\n　　惔怕滅無邊　　彼岸常安隱\n　　所依盡苦滅　　脫無窟究竟\n　　勝義旨應供　　智所習聖欣\n　　都無老病死　　無愁嘆苦憂\n　　微難見無邊　　滅諦無同類",
    "無量門正為開示集真是集": "　　云何名為以無量門正為開示集真是集？謂正開示。愛後有愛。喜俱行愛。彼彼喜愛。為去來今。眾苦因本。道路由緒。能作生緣。起集等起。能起集等。起現法中諸苦身壞。後苦由是出生。如有頌言。\n　　因愛棄良醫　　癰本榛藤渴\n　　未調伏一切　　數數感眾苦\n　　如樹根未拔　　雖斫斫還生\n　　未拔愛隨眠　　數數感眾苦\n　　如毒箭在身　　損壞色力等\n　　眾生內有愛　　損壞諸善根",
    "無間": "　　復更起餘隨守護行，自類等無間者，謂貪無間還復生貪，瞋等亦爾，各別種類等無間生故。異類等無間者，謂貪無間瞋等生，欲界無間色界生，色界無間無色界生，如是等。三摩鉢底等無間者，謂三摩鉢底無間相生，如欲界善無間入初靜慮，初靜慮無間還生欲界，如是於第二靜慮等及無色定如理應知。退等無間者，謂從靜慮等退時無間所生起。生等無間者，謂受生時無間所生，如從欲界無間生色界等。鄰次等無間者，謂諸心心法無間次第生，於其中間心無斷絕故。隔越等無間者，謂起滅定等時，前生心心法望後生心心法，中間隔越故。起等無間者，謂若此法無間彼法次第生。滅等無間者，謂此法無間彼法次第滅，如心心法無間滅已，或入滅盡定，或入無想定等，或入無餘涅槃界。",
    "無間同行相應": "　　復有無間同行相應，謂在有心位。",
    "無間道": "　　無間道者，謂由此道無間，永斷煩惱令無所餘。所以者何？由此道無間，能永除遣此品煩惱所生品類麤重令無有餘，又轉麤重依得無麤重，是名修道中無間道。",
    "無餘": "　　無餘者，謂無餘事滅。",
    "煩惱": "　　煩惱者，謂由數故、相故、緣起故、境界故、相應故、差別故、邪行故、界故、眾故、斷故，觀諸煩惱。",
    "煩惱增上所生諸業": "　　云何煩惱增上所生諸業？謂若思業若思已業，總名業相。又有五種業，一取受業，二作用業，三加行業，四轉變業，五證得業，今此義中意多分別加行業。\n　　何等思業？謂福業非福業不動業。\n　　何等思已業？謂身業語業意業。\n　　又此身語意三業，或善或不善，不善者即十不善業道，謂殺生、不與取、欲邪行、虛誑語、離間語、麤惡語、雜穢語、貪欲、瞋恚、邪見。善者即十善業道，謂離殺生、離不與取、離欲邪行、離虛誑語、離離間語、離麤惡語、離雜穢語、無貪、無瞋、正見。\n　　又殺生等應以五門分別其相，謂事故、意樂故、方便故、煩惱故、究竟故。",
    "熱": "　　熱有三種，謂貪、瞋、癡。由依止貪瞋癡故，不如正理執著諸相執著隨好，由執著相及隨好故，燒惱身心，故名為熱，不如正理妄執相好燒身心故。",
    "熾然": "　　熾然有三，謂貪、瞋、癡。由依止貪瞋癡故，為非法貪大火所燒，非法貪者，謂隨貪著不善業道。又為不平等貪大火所燒，不平等貪者，謂非法非理貪求境界。又為邪法大火所燒，邪法者，謂諸外道惡說法律，以非法貪等能發身心熾然大火，如火熾然故名熾然。",
    "燒害": "　　燒害有三，謂貪、瞋、癡。由依止貪瞋癡故，長時數受生死燒惱，故名燒害，由於無始生死流轉因貪瞋癡數被生死苦燒害故。",
    "獨覺乘補特伽羅": "　　獨覺乘補特伽羅者，謂住獨覺法性若定不定性是中根自求解脫發弘正願，修厭離貪解脫意樂，及修獨證菩提，意樂即聲聞藏為所緣境，精進修行法隨法行，或先未起順決擇分，或先已起順決擇分，或先未得果，或先已得果，出無佛世，唯內思惟聖道現前，或如麟角獨住，或復獨勝部行得盡苦際，若先未起順決擇分亦不得果，如是方成麟角獨住，所餘當成獨勝部行。",
    "獨覺現觀": "　　獨覺現觀者，謂前所說七種現觀，不由他音而證得故，名獨覺現觀。",
    "現前供養善": "　　何等現前供養善？謂想對如來。建立靈廟圖寫尊容，或想對正法，書治法藏興供養業。",
    "現前供養無記": "　　何等現前供養無記？謂如有一想對歸依隨一天眾，遠離殺害意邪惡見，建立祠廟興供養業，令無量眾於如是處不生長福非福。",
    "現前相": "　　何等現前相？謂正處無常由因隨逐今受無常故。",
    "現在": "　　云何現在？幾是現在？為何義故觀現在耶？謂自相已生未滅故，因果受用未受用故，染淨現前故，能顯過去未來相故，作用現前故，是現在義。因果受用未受用者，謂因已滅故，果猶有故。能顯過去未來相者，謂現在世是能施設去來世相。所以者何？依止現在假立去來故，約當得位假立未來，約曾得位假立過去。作用現前者，謂眼等法正為識等所依等事故，一切一分是現在，為捨執著流轉我故，觀察現在。問何故過去未來現在，說名言事非涅槃等耶？答內自所證不可說故，唯曾當現是言說所依處故。所以者何？因說過去等事，遂顯經中三種言事，謂依三世建立非涅槃等，由彼內自所證離名言故，不可宣說，又唯去來今，是見聞覺知言說所依處故。",
    "現在界": "　　謂現在五蘊。是名現在界。",
    "現相": "　　謂多貪者。為得如前供養等故。往至他家作如是語。賢士賢女。此衣此缽。此坐臥具。此衫裙等。我若得之。甚為濟要。當常寶護。以福於汝。除汝能捨。誰當見惠。作此方便而獲利者。總名現相。",
    "現行成就": "　　現行成就者，謂諸蘊界處法，隨所現前若善若不善若無記，彼由現行成就故成就。若已斷善根者所有善法，由種子成就故成就，亦名不成就。若非涅槃法，一闡底迦究竟成就雜染諸法，由闕解脫因，亦名阿顛底迦，以彼解脫得因畢竟不成就故\n　　問何等名為解脫得因？答若於真如先以集起煩惱麤重，若遇隨順得對治緣，便能永害此堪任性，名解脫得因，若與此相違名無解脫因。\n　　問於成就善巧得何勝利？答能善了知諸法增減，知增減故，於世興衰離決定想，乃至能斷若愛若恚。",
    "現見": "　　言現見者。謂正修習世尊所說苦集滅道。現觀道時。於現法中。即入苦集滅道。現觀故名現見。\n　　若正修習世尊所說苦集滅道。現觀道時。非現法中。即入苦集滅道。現觀世尊正法可非現見。以正修習世尊所說苦集滅道。現觀道時。於現法中。即入苦集滅道現觀。故佛正法名為現見。\n　　又正修習世尊所說。能斷見苦見集見滅見道所斷及修所斷隨眠道時。於現法中。即斷見苦見集見滅見道所斷及修所斷一切隨眠。故名現見。\n　　若正修習世尊所說。能斷見苦見集見滅見道所斷及修所斷隨眠道時。非現法中。即斷見苦見集見滅見道所斷及修所斷一切隨眠。世尊正法。可非現見。以正修習世尊所說。能斷見苦見集見滅見道所斷及修所斷隨眠道時。於現法中。即斷見苦見集見滅見道所斷及修所斷一切隨眠故佛正法名為現見。\n　　又正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道時於現法中。即證見苦見集見滅見道所斷及修所斷諸隨眠滅。故名現見。\n　　若正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道時。非現法中。即證見苦見集見滅見道所斷及修所斷諸隨眠滅。世尊正法。可非現見以正修習世尊所說。能證見苦見集見滅見道所斷及修所斷隨眠滅道時。即證見苦見集見滅見道所斷及修所斷諸隨眠滅。故佛正法名為現見。",
    "現觀": "　　問：如經說，四無量等最勝功德何現觀所攝耶？答：後現觀、究竟現觀所攝，所以者何？如是最勝功德，諸聖弟子等或於修道或究竟道之所發起，是故二現觀所攝。\n　　彼復云何？謂無量解脫勝處遍處無諍願智無礙解神通相隨顯清淨力無畏念住不護無忘失法永斷習氣大悲十八不共佛法一切種妙智，如是等功德如來於諸經中，或依聲聞乘說，或依大乘說，此諸功德隨其所應，略以五門顯示其相，謂所依境界行相自體助伴。",
    "現量": "　　現量者，謂自正明了無迷亂義，自正義言顯自正取義，如由眼正取色等，此言為簡世間現所得瓶等事共許為現量所得性，由彼是假故非現量所得，明了言為簡由有障等不可得因故，不現前境，無迷亂言為簡旋火為輪幻陽焰等。",
    "理趣門": "　　理趣門者，謂若處顯示六理趣義，何等為六？一真義理趣，二證得理趣，三教導理趣，四離二邊理趣，五不思議理趣，六意樂理趣，如是六種。前三如其次第應隨後三決了，如愛味經中。佛告諸比丘，於色有味乃至廣說此中顯示，由遠離增益損減二邊理趣，決了真義理趣有味有患有出離者，顯離損減邊，於色乃至於識者顯離增益邊由顯示染污清淨唯依諸蘊不依我故，乃至告諸比丘。我自證知由此故，乃至已證覺無上正等菩提者，顯由不思議理趣決了證得理趣，此顯真證內自所受故。如是一切經皆是教導理趣，應隨意樂理趣決了，謂依所遍知事，所遍知義，遍知，遍知果，彼證受，意樂說此經。所遍知事者，謂色等。所遍知義者，謂有味等，由此差別義遍知色等事故。遍知者，謂於五取蘊由如是三轉如實遍知。遍知果者，謂從此諸天世間乃至并天人皆得解脫乃至極解脫。彼證受者，謂自證知我已證覺無上正等菩提。",
    "甚深": "　　何等甚深故？謂因甚深故、相甚深故、生甚深故、住甚深故、轉甚深故，是甚深義。又諸緣起法雖剎那滅而住可得，雖無作用緣而有功能緣可得，雖離有情而有情可得，雖無作者而諸業果不壞可得，是故甚深。又諸緣起法，不從自生，不從他生，不從共生，非不自作他作因生，是故甚深",
    "生": "　　生者，謂於眾同分諸行本，無今有性，假立為生。問外諸色等亦有生相，何故唯舉眾同分耶？答為於有情相續建立有為相故，所以者何？外諸色等有為相成壞所顯，內諸行有為相生老等所顯故。老者，謂於眾同分諸行相續變異性，假立為老。",
    "生差別": "　　生差別者，謂於如來大集會中生故。",
    "生得善": "　　何等生得善？謂即彼諸善法。",
    "生得無記": "　　何等生得無記？謂諸不善有漏善法異熟。",
    "生緣老死": "　　謂彼彼有情。即於彼彼有情聚中。諸生等生。趣入出現。蘊得界得處得諸蘊生命根起。說名生。發落髮白。皮緩面皺。身曲背僂。喘息逾急。扶杖而行。肢體斑黑。衰退闇鈍。根熟變壞。諸行故敗。朽壞羸損。說名老。彼彼有情。即於彼彼諸有情聚。移轉壞沒。退失別離。壽暖識滅。命根不轉。諸蘊破壞。夭喪殞逝。說名死。如是老死。緣生故起。是名生緣老死。\n　　復次大因緣經中。尊者慶喜問佛。老死為有緣不。佛言有緣。此緣謂生。廣說乃至。若無有生。魚鳥蛇蠍。那伽藥叉部多。食香諸天人等。無足二足。多足異類。彼彼有情。於彼彼聚。所有老死。為得有不。不也世尊。若全無生。為可施設有老死不。不也世尊。是故慶喜。老死皆以生為其緣。是名生緣老死。如是老死。生為緣。生為依。生為建立。故起等起生等生。聚集出現。故名生緣老死。",
    "生般涅槃補特伽羅": "　　生般涅槃補特伽羅者，謂二結俱未斷纔生色界已，即便聖道現前得盡苦際。",
    "生苦": "　　云何生苦？生謂彼彼諸有情類。即於彼彼有情聚中。諸生等生趣入出現蘊得界得處得諸蘊生命根起。總名為生。何因緣故。說生為苦。有情生時。領納攝受種種身苦事故。領納攝受種種心苦事故。領納攝受種種身心苦事故。領納攝受種種身熱惱事故。領納攝受種種心熱惱事故。領納攝受種種身心熱惱事故。領納攝受種種身燒然事故。領納攝受種種心燒然事故。領納攝受種種身心燒然事故。說生為苦。復次生時。受二種苦。一者苦苦。二者行苦。故名生苦。",
    "男根": "　　謂男男體男性。男勢分。男作用。此復云何？謂臍輪下。膝輪上。所有肉身。筋脈流注。若於是處。與女交會。發生平等領納樂受。是名男根。",
    "界": "　　界有十八，謂眼界、色界、眼識界、耳界、聲界、耳識界、鼻界、香界、鼻識界、舌界、味界、舌識界、身界、觸界、身識界、意界、法界、意識界。\n　　問何因界唯十八？答由身具等能持過現六行受用性故。身者，謂眼等六根。具者，謂色等六境。過現六行受用者，謂六識。能持者，謂六根六境能持六識。所依所緣故。過現六識能持受用者，不捨自相故，當知十八以能持義故說名界。",
    "界差別": "　　云何界差別？謂欲界異生有學無學，如欲界有三色無色界亦爾，又有欲色界菩薩，又有欲界獨覺及不可思議如來，補特伽羅差別故。",
    "界攝": "　　界攝者，謂蘊界處所有種子阿賴耶識能攝彼界，由彼種子此中有故。",
    "界次第": "　　何故諸界如是次第？由隨世事差別轉故。云何世事差別而轉？謂諸世間最初相見，既相見已更相問訊，既問訊已即受沐浴塗香花鬘，次受種種上妙飲食，次受種種臥具侍女，然後意界處處分別，以內界次第故建立外界，隨此次第建立識界，如界次第處亦如是。問蘊義云何？答諸所有色若過去若未來若現在，若內若外若麤若細，若劣若勝若遠若近，彼一切略說一色蘊，積聚義故，如財貨蘊，如是乃至識蘊當知依止十一種，愛所依處故，於色等法建立過去等差別。十一種愛者，謂顧戀愛、希望愛、執著愛、內我愛、境界愛、欲愛、定愛、惡行苦愛、妙行樂愛、遠愛、近愛。由如是愛所緣境故，如其次第立過去等種種差別。又有差別，謂已生未生差別故能取所取差別故，外門內門差別故，染不染差別故，近遠差別故，如其所應於色等諸法建立過去等差別。已生者，謂過去現在，未生者，謂未來，外門者，謂不定地內門者，謂諸定地，餘句易了不復分別。又苦相廣大故名為蘊，如大材蘊，依止色等發起生等廣大苦故，如經言，如是純大眾苦蘊集，又荷雜染擔故名為蘊如肩荷擔，荷雜染擔者，謂煩惱等諸雜染法依色等故，譬如世間身之一分能荷於擔，即此一分名肩名蘊，色等亦爾，能荷雜染擔故，名之為蘊。\n　　問界義云何。答一切法種子義。謂依阿賴耶識中諸法種子說名為界。界是因義故。又能持自相義是界義。又能持因果性義是界義。能持因果性者。謂於十八界中根境諸界及六識界。如其次第又攝持一切。法差別義是界義。攝持一切法差別者。謂諸經說地等諸界及所餘界。隨其所應皆十八界攝\n　　問處義云何？答識生長門義是處義，當知種子義，攝一切法差別義，亦是處義。\n　　復次如佛所說，色如聚沫，受如浮泡，想如陽焰，行如芭蕉，識如幻化。問以何義故色如聚沫，乃至識如幻化？答以無我故，離淨故，少味故，不堅實故，謂非有遠離虛妄不堅實義，是經所說諸句義，又為對治我淨樂常四顛倒故，如其次第說無我等諸句差別。\n　　本事分中三法品第一之二",
    "界法蘊不攝耶": "　　何等界法蘊不攝耶？法界中無為法蘊所不攝，此無為法，復有八種，謂善法真如，不善法真如，無記法真如，虛空，非擇滅，擇滅，不動及想受滅。",
    "略二種如是等功德": "　　又如是等功德略有二種，一現前發起自所作用，二安住自性。若現前發起自所作用，以出世間後所得世俗智為體。若安住自性，用出世間智為體。又現前發起自所作用者，謂諸聖者隨其所應發起斷所治障等種種作業。安住自性者，謂最勝寂靜無分別智所攝，無緣無量等現法樂住。",
    "略攝支": "　　略攝支者，謂前所分別無明等十二支，今復略攝為四，謂能引支、所引支、能生支、所生支，唯由如是四種支故，略攝一切因果生起法盡，謂於因時有能引所引，於果時有能生所生。能引支者，謂無明行識，為起未來生故，於諸諦境無智為先，造諸行業熏習在心故。所引支者，謂名色六處觸受，由心習氣力能令當來名色等前後相依次第生起種子得增長故。能生支者，謂愛取有，由未永斷欲等愛力，於欲等中愛樂，妙行惡行差別為先發起貪欲，以有有取識故，於命終位將與異熟隨順貪欲，隨一業習氣現前有故。所生支者，謂生老死，由如是業差別習氣現前有故，隨於一趣一生等差別眾同分中，如先所引名色等異熟生起故，生老死言為顯依三有為相故，所以老死合立一支者，為顯離老得有死故，非於胎生身中離名色等得有六處等法，是故於彼各別立支。",
    "異熟不可思議": "　　如世尊說，有情業異熟不可思議，如是經意非一切種皆不可思議。云何業異熟不可思議？云何可思議？謂諸善業於人天趣得可愛異熟，是可思議，諸不善業墮三惡趣得不愛異熟，是可思議，由善惡業往善惡趣，感得可愛不可愛異熟，世間智者能思議故。由此能引發正見等功德故，即由此業感諸有情自身異熟等種種差別不可思議，謂內身等異熟有形色等，無量差別難可思議，除一切智不能思議，強思議者發狂等過故。",
    "異生性": "　　異生性者，謂於聖法不得假立異生性。",
    "當知五各六　　觀所知諸法": "　　自性等六者，一自性，二因，三境界，四行相，五等無間，六增上。所依等六者，一所依，二依，三攝，四相應，五成就，六雜染。識等六者，一識，二受，三想，四作意，五智，六遍知。清淨等六者，一清淨，二詞，三出離，四甚深，五解脫門，六入一切法。方便等六者，一方便，二通達，三修，四圓證，五究竟，六引發。",
    "疑": "　　疑者，於諦猶豫為體，善品不生依止為業。於諦猶豫者，亦攝於實猶豫，如其所應滅道諦攝故。善品不生者，謂由不決不造修故。",
    "疑結": "　　疑結者，謂於諦猶豫，疑結所繫故，於佛法僧寶妄生疑惑，以疑惑故於三寶所不修正行，以於三寶所不修正行故，廣行不善不行諸善，由此能招未來世苦與苦相應應。",
    "疑結者": "　　疑結者，謂於諦猶豫，疑結所繫故，於佛法僧寶妄生疑惑，以疑惑故於三寶所不修正行，以於三寶所不修正行故，廣行不善不行諸善，由此能招未來世苦，與苦相應。",
    "疑蓋": "　　云何疑蓋？謂於佛法僧。及苦集滅道。生起疑惑。二分二路。猶豫疑箭。不決定。不究竟。不審決。非已一趣。非當一趣。非現一趣。總說為疑。如是疑性。覆心蔽心。乃至裡心蓋心。故名為蓋。蓋即是疑。故名疑蓋。",
    "病等相": "　　何等病等相？謂四大時分受命變異故。",
    "病苦": "　　云何病苦？病謂頭痛。眼痛耳痛。鼻痛舌痛。面痛唇痛。齒痛腭痛。喉痛心痛。風病嗽病。氣病噫病。癩病痔病。痢病麻病。寒病熱病。瘨病癇病。歐逆瘡腫。癬疥㾽癭。㿃下漏泄。痃癖枯痟。及余種種依身心起。身心疹疾。總名為病。何因緣故。說病為苦。有情病時。領納攝受種種身苦事故廣說乃至領納攝受。種種身心燒然事故。說病為苦。\n　　復次病時。受二種苦。一者苦苦。二者行苦。故名病苦。",
    "病行差別": "　　云何病行差別？此有七種，謂貪行、瞋行、癡行、慢行、尋思行、等分別薄塵行，補特伽羅差別故。",
    "癡": "　　謂於前際無知。後際無知。前後際無知。於內無知。外無知內外無知。於業無知。異熟無知。業異熟無知。於善作業無知。惡作業無知。善惡作業無知。於因無知。因所生法無知。於佛無知。法無知。僧無知。於苦無知。集無知。滅無知。道無知。於善法無知。不善法無知。於有罪法無知。無罪法無知。於應修法無知。不應修法無知。於下劣法無知。勝妙法無知。於黑法無知。白法無知。於有敵對法無知。於緣生法無知。於六觸處如實無知。如是無知無見。非現觀黑闇愚癡。無明盲冥。罩網纏裡。頑騃渾濁。障蓋發盲。發無眼。發無智。發劣慧。障礙善品。令不涅槃。無明漏。無明瀑流。無明軛。無明毒根。無明毒莖。無明毒枝。無明毒葉。無明毒花。無明毒果。癡等癡極癡。欣等欣極欣。癡類癡生。總名為癡。",
    "發生愁嘆苦憂擾惱": "　　謂有一類。或因父母兄弟姊妹師友死故。或因親族滅亡都盡。或因財位一切喪失。便發自身猛利剛獷切心奪命辛楚苦受。彼於爾時。心熱等熱。內熱遍熱。便發於愁。已愁當愁。心中愁箭。說名愁。復有一類。或因父母兄弟姊妹師友死等。便發自身猛利剛獷切心奪命辛楚苦受。彼於爾時。心熱等熱。內熱遍熱。便發於愁。已愁當愁。心中愁箭。由此緣故。而傷嘆言。苦哉苦哉。我父我母。廣說乃至。我財我位。如何一旦忽至於此。其中所有傷怨言詞。種種語業。說名嘆。五識相應不平等受。說名苦。意識相應不平等受。說名憂。諸心擾惱。已擾惱。當擾惱。擾惱性。擾惱類。說名擾惱。於老死位。發生如是種種愁嘆苦憂擾惱。",
    "發起善": "　　何等發起善？謂彼所發身業語業。",
    "發起無記": "　　何等發起無記？謂彼所攝受諸心心所法。所發身業語業。",
    "盡智": "　　盡智者，謂由因盡所得智，或緣盡為境，所以者何？由有盡故而起此智，名為盡智，或緣盡為境故名盡智。此義意言，於此位中由永斷集令無有餘，所得智名盡智，或緣因盡為境故名盡智。",
    "相": "　　相者，謂無作緣生故、無常緣生故、勢用緣生故，是緣生相。由此相故薄伽梵說，此有故彼有，此生故彼生，謂無明緣行乃至廣說。此有故彼有者，顯無作緣生義，唯由有緣故果法得有，非緣有實作用能生果法。此生故彼生者，顯無常緣生義，非無生法為因故，少所生法而得成立。無明緣行等者。顯勢用緣生義，雖復諸法無作無常，然不隨一法為緣故一切果生。所以者何？以諸法功能差別故，如從無明力故諸行得生，乃至生力故得有老死。",
    "相屬善": "　　何等相屬善？謂彼相應法。",
    "相屬無記": "　　何等相屬無記？謂懷非穢非淨心者，所有由名句文身所攝受心心所法。",
    "相差別": "　　何等相差別？謂蘊界處一一自相差別。",
    "相應": "　　何等相應故？謂貪不與瞋相應，如瞋疑亦爾，餘皆得相應。如貪瞋亦爾，謂瞋不與貪慢見相應，慢不與瞋疑相應。無明有二種。一一切煩惱相應無明，二不共無明。不共無明者，謂於諦無智，見不與瞋疑相應，疑不與貪慢見相應，忿等隨煩惱更互不相應，無慚無愧於一切不善品中恒共相應，惛沈、掉舉、不信、懈怠、放逸。於一切染污品中恒共相應。",
    "相攝": "　　相攝者，謂蘊界處一一自相即體自攝，如色蘊攝色蘊，廣說乃至法處攝法處。",
    "相續力": "　　相續力者有九種，命終心與自體愛相應，於三界中各令欲色無色界生相續，謂從欲界沒還生欲界者，即以欲界自體愛相應命終心結生相續。若生色無色界者，即以色無色界自體愛相應命終心結生相續，如是從色無色界沒。若即生彼若生餘處，有六種心，如其所應盡當知。又此自體愛唯是俱生，不了所緣境，有覆無記性攝，而能分別我自體，生差別境界，由此勢力諸異生輩，令無間中有相續，未離欲聖者亦爾，臨命終時乃至未至不明了想位，其中能起此愛現行，然能了別，以對治力之所攝伏。已離欲聖者，對治力強故，雖未永斷然此愛不復現行，彼由隨眠勢力令生相續中有，初相續剎那唯無覆無記，以是異熟攝故。從此已後或善或不善或無記，隨其所應除彼沒心，以中有沒心常是染污，猶如死有生有相續心剎那，亦唯無覆無記。若諸菩薩願力受生者，命終等心當知一切一向是善，已說因論生論等無間緣義。",
    "相續差別": "　　何等相續差別？謂一一剎那蘊界處轉，於相差別善巧為何所了知？謂了知我執過患。於分別差別善巧為何所了知？謂了知聚想過患。於依止差別善巧為何所了知？謂了知不作而得，雖作而失想過患。於相續差別善巧為何所了知？謂了知安住想過患",
    "相續相": "　　何等相續相？謂無始時來諸行生滅相續不斷故。",
    "相隨好": "　　相隨好者，謂依止靜慮於相隨好莊嚴所依示現具足中，若定若慧及彼相應諸心心法，并彼所起異熟果，所以者何？謂佛世尊由定慧增上力，為欲化度諸有情故，示現三十二大丈夫相，及八十種隨好相莊嚴色身。然佛世尊非彼自體，以法身所顯故。若諸菩薩能如是示現者，當知定慧為其自性，若所餘於大集會中生者用彼所起異熟果為自性。",
    "真如名為勝義": "　　何故真如名為勝義？最勝聖智所行處故。",
    "真如名為實際": "　　何故真如名為實際？以無顛倒所緣性故。",
    "真如名為法界": "　　何故真如名為法界？一切聲聞獨覺諸佛妙法所依相故，如善法真如，當知不善法真如、無記法真如亦爾。",
    "真如名為無相": "　　何故真如名為無相？以一切相皆寂靜故",
    "真如名為空性": "　　何故真如名為空性？一切雜染所不行故。",
    "真如名無我性": "　　何故真如名無我性？離二我故。",
    "真如說名真如": "　　何故真如說名真如？謂彼自性無變異故。",
    "真現觀": "　　真現觀者，謂已得見道十六心剎那位所有聖道，又於見道中得現觀邊安立諦世俗智，由出世智增上緣力長養彼種子故，名得此智而不現前。以見道十六心剎那無有間斷，不容現起世間心故，於修道位此世俗智方現在前。",
    "眷屬差別": "　　眷屬差別者，謂攝受一切所化眾生為眷屬故。",
    "眼及眼界": "　　問如經中說眼及眼界，若眼亦眼界耶？設眼界亦眼耶？答或有眼非眼界，謂阿羅漢最後眼，或有眼界非眼，謂處卵㲉羯邏藍時，頞部陀時，閉尸時，在母腹中若不得眼。設得已失，若生無色，異生所有眼因或有眼亦眼界謂於餘位，或有無眼無眼界，謂已入無餘涅槃界，及諸聖者生無色界，如眼與眼界，如是耳鼻舌身與耳等界，隨其所應盡當知。阿羅漢最後眼者，謂入涅槃時最後剎那，爾時眼非眼界，非餘眼因故，無色界異生有眼因者，謂從彼退墮當生有色界，以阿賴耶識持眼種子定當生眼故，生彼眾聖不退還故。無有眼界，有身界無身者，謂唯生無色界異生，彼唯有身因故，非處卵㲉等，彼必有身故，若身壞滅壽命亦無。問若有意亦意界耶？設有意界亦意耶？答或有意非意界，謂阿羅漢最後意，或有意界非意，謂處滅定者所有意因，或有意亦意界，謂於所餘位，或有無意無意界，謂已入無，餘涅槃界，唯有意界非意，中所以不取入無想定者，以彼有染污意故。問若生長彼地即，用彼地眼還見彼地色耶？答或有即用彼地眼還見彼地色，或復餘地，謂生長欲界用欲行眼還見欲行色，或用色行眼見色行色，或用上地眼見下地色，如以眼對色，如是以耳對聲，如生長欲界，如是生長色界。生者，謂初受生時，長者，謂後增長，若生長欲界即以欲行鼻舌身，還嗅嘗覺欲行香味觸，若生長色界即以色行身，還覺自地觸，彼界自性定無香味，離段食貪故。由此道理亦無鼻舌兩識若生長欲界即以欲行意了三界法及無漏法。如生長欲界，如是生長色界，若生長無色界，以無色行意了無色行自地法及無漏法，若以無漏意了三界法及無漏法，無色行意了無色行自地法及無漏法者，謂依聖弟子說，若外異生唯了自地法若住此法者，或有由先聞熏習力，亦緣上地為起彼故。",
    "眼根": "　　謂眼於色。已正當見。及彼同分。是名眼根。又眼增上發眼識。於色已正當了別及彼同分。是名眼根。又眼於色。已正當礙。及彼同分。是名眼根。又眼於色。已正當行。及彼同分。是名眼根。如是過去未來現在諸所有眼。名為眼根。亦名所知。所識。所通達。所徧知。所斷所解。所見所得。所覺所現等覺。所了所等了。所觀所等觀。所審察。所抉擇。所觸所等觸。所證所等證。\n　　此復云何？謂四大種所造淨色。或地獄。或傍生。或鬼界。或天或人或中有。及修所成。所有名號。異語增語。想等想。施設言說。謂名眼。名眼處。名眼界。名眼根。名見名道路。名引導。名白名淨。名藏名門。名田名事。名流名池。名海名瘡。名瘡門。名此岸。如是眼根。是內處攝。",
    "眼界": "　　謂如眼根。云何色界？謂如色處。云何眼識界？謂眼色為緣所生眼識。此中眼為增上。色為所緣。於眼所識色。諸了別異了別各別了別色。是名眼識界。余五三界。隨其所應。廣說亦爾。",
    "眼處": "　　謂如眼根。應說其相。",
    "眼識界": "　　問眼識界何相？答謂依眼緣色似色了別，及此種子積集異熟阿賴耶識是眼識界相，如眼識界耳鼻舌身意識界相亦爾。",
    "眾": "　　眾云何？謂二眾煩惱，見道所斷眾，修道所斷眾，欲界見苦所斷具十煩惱，如見苦所斷見集滅道所斷亦爾。若迷此起邪行即見此所斷。問若緣此為境即迷此起邪行耶？答不必爾。緣無漏為境，煩惱唯於有漏事隨增故，若是處是彼因緣及所依處，彼迷此起邪行，是見苦所斷如見苦所斷見集滅道所斷亦爾。隨其所應色界見四種所斷，各有九煩惱除瞋，如色界無色界亦爾。如是見道所斷煩惱眾，總有一百一十二。欲界修所斷有六煩惱，謂俱生薩迦耶見邊執見，及貪瞋慢無明。何等名為修所斷？俱生薩迦耶見，謂聖弟子雖見道已生，而依止此故我慢現行。如經言，長老駄索迦當知，我於五取蘊不見我我所，然於五取蘊有我慢我欲我隨眠，未永斷未遍知未滅未吐，猶如乳母有垢膩衣，雖以鹵土等水浣濯極令離垢，若未香熏臭氣隨轉。復以種種香物熏坌臭氣方盡，如是佛聖弟子，雖以見道永斷分別身見之垢，若未以修道熏習相續，無始串習虛妄執著習氣所引不分別事我見隨轉。復以隨道熏習相續彼方永滅，俱生邊執見者，謂斷見所攝，由此見故於涅槃界其心退轉生大怖畏，謂我我今者何所在耶，貪等煩惱修道所斷者，謂除見品所攝，色界修道所斷有五除瞋，如色界無色界亦爾，如是修道所斷煩惱總有十六。",
    "眾同分": "　　眾同分者，謂如是如是有情於種種類自體相似假立眾同分，於種種類者，於人天等種類差別，於自體相似者，於一種類性。",
    "睡眠": "　　睡眠者，依睡因緣，是愚癡分心略為體，或善或不善或無記，或時或非時，或應爾，或不應爾，越失所作依止為業。睡因緣者，謂羸瘦疲倦身分沈重，思惟闇相捨諸所作曾數此時串習睡眠，或他咒術神力所引，或因動扇涼風吹等，愚癡分言為別於定。又善等言為顯此睡非定癡分，時者，謂夜中分，非時者，謂所餘分，應爾者，謂所許時設復非時，或因病患或為調適，不應爾者，謂所餘分，越失所作依止為業者，謂依隨煩惱性睡眠說。",
    "瞋": "　　瞋者，於諸有情苦及苦具心憎恚為體，不安隱住惡行所依為業，不安隱住者，謂心懷憎恚多住苦故。",
    "瞋恚": "　　謂於諸有情。欲為損害。內懷栽杌。乃至現為過患。總名瞋恚。",
    "瞋恚蓋": "　　云何瞋恚蓋？謂於有情。欲為損害內懷栽杌。欲為擾惱。已瞋恚。當瞋恚。現瞋恚。樂為過患。極為過患。意極憤恚。於諸有情。各相違戾。欲為過患。已為過患。當為過患。現為過患。總名瞋恚。如是瞋恚。覆心蔽心。乃至裡心蓋心。故名為蓋。蓋即瞋恚。故名瞋恚蓋。",
    "瞢憒": "　　謂身重性。心重性。身無堪任性。心無堪任性。身瞢憒性。心瞢憒性。已瞢憒。當瞢憒。現瞢憒。總名瞢憒。",
    "知言不知": "　　謂為耳識曾受曾了。名為已聞。彼有耳識曾受曾了。隱藏如是想忍見樂。言我不聞。如是名為知言不知。",
    "矯妄": "　　謂多貪者。為供養故。為資具故。為恭敬故。為名譽故。拔發燂髭。臥灰露體。徐行低視。高聲現威。顯自伎能。苦行等事。總名矯妄。",
    "祕密決擇": "　　祕密決擇者，謂說餘義名句文身，隱密轉變更顯餘義，如經言：\n　　逆害於父母　　王及二多聞",
    "神通": "　　神通者，謂六神通，一神境通、二天耳通、三心差別通、四宿住隨念通、五死生通、六漏盡通。神境通者，謂依止靜慮於種種神變威德具足中，若定若慧及彼相應諸心心法，種種神變威德具足者，謂變一為多等種種神變自在具足。\n　　神通作何業？謂以身業語業記心，化導有情令入聖教，善知有情一切心行及過未已，如應教授令永出離，此中顯示神境天耳乃至漏盡通，如其次第能起身業化導等用，由天耳通解了一切言音差別能引語業故。相及隨好作何業？謂能令暫見謂大丈夫心生淨信。",
    "福行": "　　謂有漏善身業語業。心心所法。不相應行。如是諸行。長夜能招可愛可樂可欣可意諸異熟果此果名福亦名福果。以是福業。異熟果故是名福行。",
    "福非福及與不動": "　　如契經說，無明緣行，若福非福及與不動。云何福及不動行緣無明生？有二種愚，一異熟果愚，二真實義愚，由異熟果愚故發非福行，由真實義愚故發福及不動行。",
    "稠林": "　　稠林有三，謂貪、瞋、癡。由依止貪瞋癡故，於諸生死根本行中廣興染著，令諸有情感種種身流轉五趣，令諸有情處生死本行大樹稠林難可出離，是故貪等說名稠林。",
    "種子成就": "　　種子成就者，謂若生欲界，欲色無色界繫煩惱隨煩惱由種子成就故成就，及生得善生欲界，三界煩惱隨煩惱成就者依未離欲異生說。若已離欲，或生上地隨所離欲地，即此地煩惱隨煩惱亦成就，亦不成就。未永害隨眠故，對治道所損故。如其次第，及生得善者，隨所生地即此地成就。若生色界欲界繫煩惱隨煩惱由種子成就故成就，亦名不成就，色無色界繫煩惱隨煩惱，由種子成就故成就，及生得善。若生無色界，欲色界繫煩惱隨煩惱由種子成就故成就，亦名不成就。無色界繫煩惱隨煩惱，由種子成就故成就，及生得善。若已得三界對治道，隨如是如是品類對治已生，如此如此品類種子成就，得不成就。隨如是如是品類對治未生，如此如此品類由種子成就故成就，已得三界對治道者，謂已得出世聖道，隨如是如是品類對治已生者，謂修道所斷，上品等煩惱對治已生，如此如此種類種子成就得不成就者，謂已永害隨眠故。",
    "種種勝解智力": "　　種種勝解智力者，謂於一切種差別勝解智無著無礙現行中，所有三摩地等。",
    "種種心行轉相": "　　何等種種心行轉相？謂於一時起有貪心，或於一時起離貪心，如是有瞋離瞋有癡離癡，若合若散若下若舉，若掉離掉，若不寂靜若寂靜，若定不定，如是等心行流轉故。",
    "種種想": "　　謂有蓋纏者。所有染污。色聲香味觸想。不善想。非理所引想。障礙定想。總名種種想。",
    "種種界智力": "　　種種界智力者，謂於一切種差別界智無著無礙現行中，所有三摩地等。",
    "種類攝": "　　種類攝者，謂蘊界處其相雖異，蘊義界義處義等故展轉相攝。蘊義等者，謂色受等皆有聚義，雖相各異一切相攝更互相望同一類故。界義等者，謂眼耳等皆有能持受用義故一切相攝。處義等者，謂眼耳等皆生長門義相應故一切相攝。",
    "究竟現觀": "　　究竟現觀者，如道諦中究竟道說，謂已息一切麤重已，得一切離繫得，如是等。",
    "究竟道": "　　究竟道者，謂依金剛喻定一切麤重永已息故，一切繫得永已斷故，永證一切離繫得故，從此次第無間轉依，證得盡智及無生智十無學法，何等為十？所謂無學正見乃至無學正定無學正解脫無學正智，如是等法名究竟道。",
    "空界": "　　謂空界有二種。一內。二外。云何內空界？謂此身內所有各別空性空類有執有受。此復云何？謂此身中隨皮肉血骨髓等空眼穴耳穴鼻穴面門咽喉心腸腸肚等穴。由此通貯所飲所食。及令下棄。復有所餘身內各別空性空類。是名內空界。云何外空界？謂此身外諸外所攝空性空類無執無受。此復云何？謂外空迥鄰呵伽色。是名外空界。前內此外。總名空界。",
    "空相": "　　空相者，謂若於是處此非有，由此理正觀為空，若於是處餘是有，由此理如實知有，是名善入空性，如實知者不顛倒義。問於何處誰非有？答於蘊界處常恒凝住，不變壞法我我所等非有，由此理彼皆是空。問於是處誰餘有？答即此處無我性，此我無性無我有性，是謂空性，由彼諸行常等相我此中無故，諸行恒時離我性相，無我真性此中有故，非一向無此俱名空性，故薄伽梵密意說言，有如實知有無如實知無。又有三種空性，謂自性空性，如性空性，真性空性，初依遍計所執自性觀，由此自相定非有故，第二依依他起自性觀，由此如所計度皆非有故，第三依圓成實自性觀，由此即空真性故。",
    "立喻": "　　立喻者，謂以所見邊與未所見邊和會正說。所見邊者，謂已顯了分。未所見邊者，謂未顯了分，以顯了分顯未了分令義平等，所有正說名立喻。",
    "立因": "　　立因者，謂即於所成未顯了義，正說現量可得不可得等信解之相。信解相者，是信解因義。所以者何？由正宣說現量可得不可得等相故，於所應成未顯了義信解得生，是故正說彼相名立因，現量可得不可得者，謂依自體及相貌說。",
    "立宗": "　　立宗者，謂以所應成自所許義，宣示於他令彼解了。所以者何？若不言以所應成者，自宗已成而說示他應名立宗，若不言自所許義者，說示他宗所應成義應名立宗。若不言他者，獨唱此言應名立宗。若不言宣示者，以身表示此義應名立宗。若不言令他解了者，聽者未解此義應名立宗，若如所安立無一切過量故，建立我法自性若有若無，我法差別遍不遍等具足前相，是名立宗。",
    "等分行補特伽羅": "　　等分行補特伽羅者，謂住自性位煩惱，遠離猛劣住平等位諸煩惱故，隨境界勢力煩惱現行故。",
    "等心不相應行法": "　　如是等心不相應行法，唯依分位差別而建立故，當知皆是假有，謂於善不善等增減，分位差別建立一種，於心心法分位差別建立三種，於住分位差別建立一種，於相似分位差別建立一種，於相分位差別建立四種，於言說分位差別建立三種，於不得分位差別建立一種，於因果分位差別建立餘種。因果者，謂一切有為法能生餘故名因，從餘生故名果。\n　　云何建立識蘊？謂心意識差別。",
    "等流善": "　　何等等流善？謂已得寂靜者，由此增上力故，發起勝品神通等世出世共不共功德。",
    "等流無記": "　　何等等流無記？謂變化心俱生品",
    "等無間緣": "　　等無間緣者？謂中無間隔，等無間故，同分異分心心法生，等無間故，是等無間緣義。中無間隔等無間者，不必剎那中無間隔，雖隔剎那，但於中間無異心隔，亦名中無間隔。若不爾入無心定心望出定心，應非等無間緣，然是彼緣，是故於一相續中前心望後心，中間無餘心隔故，是等無間緣。如心望心當知心法亦爾，同分異分心心法生等無間者，謂善心心法望同分善異分不善無記無間，生心心法為等無間緣，如是不善無記心心法望同分異分無間，生心心法亦爾。又欲界心心法望欲色無色界及無漏無間，生心心法為等無間緣，如是色界等心心法各各別望色界等及欲界等無間，生心心法如其所應盡當知。",
    "等至建立": "　　云何等至建立者？謂由七種作意證入初靜慮，如是乃至非想非非想處。何等名為七種作意？謂了相作意、勝解作意、遠離作意、攝樂作意、觀察作意、方便究竟作意、方便究竟果作意，此廣分別如聲聞地後瑜伽處。云何證入初靜慮時由七作意？謂由定地作意見欲界中過患等故，了達麤相，初靜慮中此相無故名為靜相，是名了相作意。如是作意猶為聞思之所間雜，從此已上超越聞思，一向修相緣麤靜相以為境界，修奢摩他毘鉢舍那，數數思惟如所尋思麤靜性相，是名勝解作意。由修習此故，最初斷道生彼俱行作意，名遠離作意。由此能斷上品煩惱故，及能遠離彼品麤重故，此觀行者復欣樂上斷見上斷功德，已觸少分遠離喜樂，為欲除去惛沈睡眠，時時修習淨妙作意以悅其心，是名攝樂作意。如是正修行者方便善品所資持故，令欲界繫煩惱纏垢不復現行，因此為欲審察煩惱斷與未斷，復更作意觀察彼生隨順淨相，是名觀察作意。如是行者數數觀察進修對治，為令欲界一切煩惱於暫時間得離繫故，此對治道相應作意，是初靜慮最後方便故，名方便究竟作意。從此無間證得根本最初靜慮俱行作意，是名方便究竟果作意。又由了相作意發希願心，為正了知所應斷所應得，為斷故為得故，由勝解作意為所求義發正方便，由遠離作意捨上品惑，由攝樂作意捨中品惑，由觀察作意安心於所證遠離增上慢，由方便究竟。作意捨下品惑由方便究竟果作意領彼所修作意修果，如為證入初靜慮定修七作意，如是乃至為證入非想非非想處定，如應當知又麤相者，謂於一切下地從欲界乃至無所有處，如是麤相略有二種，一住於重苦，不寂靜住故，二命行微少，壽命短促故。靜相者，謂於一切上地從初靜慮乃至非想非非想處，與麤相相違故。",
    "等行": "　　等行者，謂諸法共有等行所緣必無缺減，如心心法前約助伴，決定建立俱有因中，唯說大種及所造色者，此但略摽綱目，以心心法互不相離性，決定故，亦助伴攝。若爾不應別立相應因諸心心法亦共有因所攝故，雖爾然義有異，謂諸法共有等行所緣互不相離，此等行故立相應因，非唯共有義，如心心法。",
    "等論決擇": "　　復有五種等論決擇道理。謂如頌言\n　　自性所依識　　清淨方便等",
    "策心者": "　　謂為斷已生貪慾蓋故。精勤修習。喜俱行心。欣俱行心。策勵俱行心。不下劣俱行心。不闇昧俱行心。捨俱行心。定俱行心。彼由修習如是心故。便斷已生諸貪慾蓋。",
    "箭": "　　箭有三種，謂貪、瞋、癡。由依止貪瞋癡故，於有有具深起追求相續不絕，於佛法僧苦集滅道常生疑惑，故名為箭，於諸有財三寶四諦，隨愛疑門能射傷故。",
    "粗重": "　　謂身重性。心重性。身無堪任性。心無堪任性。身剛強性。心剛強性。身不調柔性。心不調柔性。總名粗重。",
    "精進根": "　　謂依出家遠離所生善法。所起勤精進。勇健勢猛。熾盛難制。勵意不息。是名精進根。復次學精進無學精進。及一切非學非無學精進。皆名精進根。",
    "精進波羅蜜多相": "　　云何精進波羅蜜多相？謂諸菩薩安住菩薩法性菩提心為依止，以悲導心引發一切勝善法時所有身語意業。",
    "精進覺支": "　　謂世尊說。若聖弟子。為令已生惡不善法斷故。起欲發勤精進策心持心。\n　　為令未生惡不善法不生故。起欲發勤精進策心持心。\n　　為令未生善法生故。起欲發勤精進策心持心。\n　　為令已生善法堅住不忘修滿倍增廣大智作證故。起欲發勤精進策心持心。\n　　彼修如是四正勝時。所有無漏作意相應。諸勤精進。勇健勢猛。熾盛難制。勵意不息。總名精進。亦名精進根。亦名精進力。亦名精進覺支。亦名正勤。是聖出世無漏無取道隨行道俱有道隨轉。能正盡苦。作苦邊際。諸有學者如所見諸行。思惟觀察。令至究竟。於諸行中深見過患。於永涅槃深見功德。若阿羅漢。如解脫心。思惟觀察。令至究竟。所有無漏作意相應。諸勤精進。乃至勵意不息。是名精進覺支。",
    "結": "　　問結有幾種？云何結？何處結耶？答結有九種，謂愛結、恚結、慢結、無明結、見結、取結、疑結、嫉結、慳結。",
    "緣": "　　云何緣？幾是緣？為何義故觀緣耶？謂因故等無間故所緣故增上故，是緣義，一切是緣，為捨執著，我為因法故，觀察緣。因緣者，謂阿賴耶識及善習氣與有漏無漏諸法，如其次第為因緣故。阿賴耶識復有二種，謂成熟及加行。成熟者，是諸生得法因緣。加行者，是諸方便法及當來世餘阿賴耶識因緣。又加行阿賴耶識者，謂於此生中現行轉識等之所熏集，善習氣者，謂順解脫分習氣。由此習氣用出世間證等流法為緣生故，能與出世法作因緣。又自性故、差別故、助伴故、等行故、增益故、障礙故、攝受故，是因緣相，當知此中以自性等六種因相顯因緣義，謂自性差別兩句建立能作因，餘句如其次第建立俱有相應同類遍行異熟因。",
    "緣已生法": "　　謂無明行識名色六處觸受愛取有生老死。如是名為緣已生法。",
    "緣生": "　　云何緣生？幾是緣生？為何義故觀緣生耶？謂相故、分別支故、略攝支故、建立支緣故、建立支業故、支雜染攝故、義故、甚深故、差別故、順逆故，是緣生義。",
    "緣起": "　　緣起者，謂因請而說，隨依如是補特伽羅，起如是說故。又有因緣制立學處，亦名緣起，謂依如是因緣，依如是事乃至廣說。",
    "緣起緣已生法": "　　苾芻當知。老死是無常。是有為是所造作。是緣已生。盡法沒法。離法滅法。生有取愛受觸六處名色識行無明亦爾。苾芻當知。我諸多聞賢聖弟子。於此緣起緣已生法。能以正慧。如實善見善知善了。善思惟。善通達。不依前際而起愚惑謂。我於過去世。為曾有非有。何等我曾有？云何我曾有？不依後際而起愚惑謂。我於未來世。為當有非有。何等我當有？云何我當有？亦不依內而起愚惑謂。何等是我此我？云何我誰所有？我當有誰。今此有情。從何而來。於此處沒。當往何所。彼如是知如是見故。所有世間。各別見趣。謂我論相應有情論相應命者論相應吉凶論相應瑩飾防護。執為己有。有苦有礙。有災有熱。彼於爾時。得斷徧知。如斷樹根及多羅頂。無復勢力。後永不生。所以者何。謂我多聞賢聖弟子。於此緣起緣已生法。\n　　此中緣起緣已生法。其體雖一。而義有異。謂或有緣起非緣已生法。或有緣已生法非緣起。或有緣起亦緣已生法。或有非緣起亦非緣已生法。或有緣起非緣已生法者無也。或有緣已生法非緣起者。謂無明行識名色六處觸受愛取有生老死。或有緣起亦緣已生法者。謂生定能生於老死。如是生支。定能為緣。是緣起性。及緣已生法性。如是有取愛受觸六處名色識行無明。應知亦爾。非緣起非緣已生法者。謂除前相。又生緣老死者。謂此生支。雖異生異滅。而緣起理。恆時決定。若過去生非老死緣者。應未來生亦非老死緣。若未來生非老死緣者。應過去生亦非老死緣。若過去生非老死緣者。應現在生亦非老死緣。若現在生非老死緣者。應過去生亦非老死緣。若未來生非老死緣者。應現在生亦非老死緣。若現在生非老死緣者。應未來生亦非老死緣。若佛出世時生非老死緣者。應佛不出世時生亦非老死緣。若佛不出世時生非老緣者。應佛出世時生亦非老緣。若緣起理。有顛倒者。應成二分。不決定故。應可破壞。理雜亂故。若爾不應施設緣起佛不應說生緣老死。然佛所說生緣老死。理趣決定。去來今世。有佛無佛。曾無改轉。法性恆然。不隱不沒。不傾不動。其理湛然。前聖後聖。同所游履。是真是實。是諦是如。非妄非虛。非倒非異。是故佛說生緣老死。如是有取愛受觸六處名色識行無明緣行亦爾。",
    "縛": "　　縛有三種，謂貪縛、瞋縛、癡縛。由貪縛故縛諸眾生令處壞苦，由瞋縛故縛諸眾生令處苦苦，由癡縛故縛諸眾生令處行苦，由貪等縛縛處壞苦等者，以貪瞋癡於樂等受常隨眠故，又依貪瞋癡故，於善方便不得自在故名為縛，猶如外縛縛諸眾生，令於二事不得自在，一者不得隨意遊行，二者於所住處不得隨意所作，當知內法貪瞋癡縛亦復如是。",
    "總別分門": "　　總別分門者，謂若處顯示先以一句總，標後以餘句別釋，如十二暇總集經中先說。，自圓淨他圓淨，二句後如其次第五句五句別釋，如是等。",
    "繫": "　　繫有四種，謂貪欲身繫、瞋恚身繫、戒禁取身繫、此實執取身繫。以能障礙定意性身故名為繫，所以者何？由此能障定心自性之身故名繫，非障色身，何以故？能為四種心亂因故，謂由貪愛財物等因令心散亂，於鬥諍事不正行，為因令心散亂，於難行戒禁苦惱為因令心散亂，不如正理推求境界為因令心散亂，由彼依止各別見故。於所知境不如正理種種推度妄生執著，謂唯此真餘並愚妄，由此為因令心散動，於何散動，謂於定心如實智見。",
    "繫得": "　　繫得者，謂於麤重積集，假立繫得性。",
    "纏": "　　纏有八種，謂惛沈、睡眠、掉舉、惡作、嫉、慳、無慚、無愧，數數增盛。纏繞於心故名纏，由此諸纏數數增盛纏繞一切觀行者心於修善品為障礙故。修善品者，謂隨修習止舉捨相及彼所依梵行等所攝淨尸羅時。此復云何？謂修止時惛沈睡眠為障，於內引沈沒故，修舉時掉舉惡作為障，於外引散亂故，修捨時嫉慳為障，由成就此於自他利吝妒門中數數搖動心故，修淨尸羅時無慚無愧為障，由具此二犯諸學處無羞恥故。",
    "義": "　　何等義故？謂無作者義。有因義、離有情義、依他起義、無作用義、無常義、有剎那義、因果相續不斷義、因果相似攝受義、因果差別義、因果決定義，是緣起義",
    "義決擇": "　　義決擇者，謂依六義而起決擇，何等六義？謂自性義、因義、果義、業義、相應義、轉義。\n　　自性義者，謂遍計所執等三自性。\n　　因義者謂三因，一生因、二轉因、三成因。生因者，謂因等四緣由此能生諸有為故，轉因者謂由此次第彼法轉如無明緣行等，乃至集滅，由此次第染淨轉故。成因者，謂現量可得，不可得等正說所攝，由此能成立先所未了所成義故。果義者，謂五果，何等為五？一異熟果、二等流果、三增上果、四上用果、五離繫果。異熟果者，謂阿賴耶識等。等流果者，謂前生諸善法所起自相續後諸善法。增上果者，謂一切有情共業增上力所感器世間。士用果者，謂稼穡等。離繫果者，謂由聖道隨眠永滅。業義者，謂五種業，一取受業，二作用業，三加行業，四轉變業，五證得業，此五業義如前業染中釋。相應義者，謂五種相應，何等為五？一聚結相應，二隨逐相應，三連綴相應，四分位相應，五轉變相應。聚結相應者，謂於舍等有木石等。隨逐相應者，謂隨眠等因，由有此故，雖煩惱等不現行，而說與彼相應。連綴相應者，謂親屬等展轉相應。分位相應者，謂攝受益等相續分位，由此分位現前說名與樂相應，乃至與不苦不樂相應故。轉變相應者，謂客塵煩惱等現前由有此故，說與貪等信等相應。轉義者，謂五種轉，一相轉，二安住轉，三顛倒轉，四不顛倒轉，五差別轉。相轉者，謂生等三有為相，由彼三相差別轉故。安住轉者，謂所持法住能持中而轉故。顛倒轉者，謂雜染法不如實轉故。不顛倒轉者，謂清淨法如實轉故。差別轉者，謂一切行過去未來現在內外等差別轉故。",
    "義無礙解": "　　義無礙解者，謂於諸相及意趣無礙具足中，若定若慧，餘如前說。相者，謂諸法自相共相。意趣者，謂別義等，若於此中通達無礙具足，名義無礙解。",
    "義現觀": "　　義現觀者，謂即於諸諦增上法中已得上品，於諸諦境諦察法忍，此忍居順決擇分位，所以者何？由即於如上所說法中如理作意，增上緣力於苦等諦境，已得最後順決擇分善根所攝上品諦察法忍，此諦察法忍由三種如理作意所顯發故。復成三品謂上軟、上中、上上。上軟者，謂即此生時軟位。上中者，謂頂忍位。上上者，謂世第一法位。",
    "老死": "　　老死有二種業，一數令有情時分變異，二數令有情壽命變異。",
    "老苦": "　　云何老苦？老謂老時。發落髮白。皮緩面皺。身曲背僂。喘息逾急。扶杖而行。支體斑黑。衰退暗鈍。根熟變壞。諸行故敗。朽壞羸損。總名為老。何因緣故。說老為苦。有情老時。領納攝受種種身苦事故。廣說乃至。領納攝受種種身心燒然事故。說老為苦。復次老時。受三種苦。一者苦苦。二者行苦。三者壞苦。故名老苦。",
    "耳根": "　　何等耳根？謂四大種所造耳識所依清淨色。",
    "耳處": "　　謂如耳根。應說其相。",
    "耽嗜遍耽嗜": "　　謂下品貪瞋癡纏。名耽嗜。即此中品。名遍耽嗜。復次中品貪瞋癡纏。名耽嗜。即此上品。名遍耽嗜。",
    "聖所愛戒": "　　謂無漏身律儀語律儀命淸淨。是名聖所愛戒。何故名為聖所愛戒。謂諸佛及弟子名為聖。彼於此戒。愛慕欣喜。忍順不逆。是故名為聖所愛戒。若能於此。勸勵安立。當知是名方便勸勵安立令住聖所愛戒中。",
    "聖教量": "　　聖教量者，謂不違二量之教，此云何？謂所有教現量比量皆不相違決無移轉定可信受，故名聖教量。",
    "聖正定資具": "　　何等為七？謂初正見。乃至正念。以聖正定。由七道支。引導修治。方得成滿。故說名聖正定資具。",
    "聚集相應": "　　何等聚集相應？謂方分聚色展轉集會。",
    "聲": "　　聲者，四大種所造耳根所取義。若可意，若不可意，若俱相違，若因受大種，若因不受大種，若因俱大種，若世所共成，若成所引，若遍計所執，若聖言所攝，若非聖言所攝，如是十一種聲。由五種因所建立，謂相故，損益故，因差別故，說差別故，言差別故。相者，謂耳根所取義。說差別者，謂世所共成等三，餘如其所應。因受大種者，謂語等聲；因不受大種者，謂樹等聲；因俱者，謂手鼓等聲；世所共成者，謂世俗語所攝；成所引者，謂諸聖所說；遍計所執者，謂外道所說；聖非聖言所攝者，謂依見等八種言說。",
    "聲聞乘補特伽羅": "　　聲聞乘補特伽羅者，謂住聲聞法性若定不定性是鈍根，自求解脫發弘正願，修厭離貪解脫意樂，以聲聞藏為所緣境，精進修行法隨法行得盡苦際，當知此中以種性根願意樂境界行果差別說聲聞乘，對獨覺菩薩根性，說此為鈍，若不爾即與隨法行等利根言相違。",
    "聲聞現觀": "　　聲聞現觀者，謂前所說七種現觀，從聞他音而證得故，名聲聞現觀。",
    "聲聞現觀菩薩現觀差別": "　　問聲聞菩薩現觀有何差別？答略說有十一種，謂境界差別、任持差別、通達差別、誓願差別、出離差別、攝受差別、建立差別、眷屬差別、勝生差別、生差別、果差別。",
    "聲處": "　　謂聲為耳。已正當聞。及彼同分。是名聲處。又聲為耳增上發耳識。已正當了別。及彼同分。是名聲處。又聲於耳。已正當礙。及彼同分。是名聲處。又聲為耳。已正當行。及彼同分。是名聲處。如是過去未來現在諸所有聲。名為聲處。亦名所知。乃至所等證。\n　　此復云何？謂四大種所造。象聲馬聲。車聲步聲。蠡聲鈴聲。大小鼓聲。歌聲詠聲。讚聲梵聲。及四大種互相觸聲。於晝夜分。語言音聲。及余所有耳根所聞。耳識所了。所有名號。異語增語。想等想。施設言說。謂名聲。名聲界。名聲處。名彼岸。如是聲處。是外處攝。",
    "聽聞正法": "　　云何名為聽聞正法？謂所親近供養善士。未顯了處為正顯了。未開悟處為正開悟。以慧通達深妙句義。方便為其宣說施設安立開示。以無量門。正為開示。苦真是苦。集真是集。滅真是滅。道真是道。\n　　云何名為以無量門正為開示苦真是苦？謂正開示生苦、老苦、病苦、死苦、怨憎會苦、愛別離苦、求不得苦、略說一切五取蘊苦。如有頌言。\n　　諸蘊起為苦　　生及出亦苦\n　　生已有老苦　　病苦與死苦\n　　煩惱生為苦　　生已住亦苦\n　　非聰敏悔苦　　不調伏死苦\n　　無智有情苦　　增羯吒私苦\n　　愚夫生死苦　　多劫馳流苦\n　　此等名為以無量門正為開示苦真是苦。\n　　云何名為以無量門正為開示集真是集？謂正開示。愛後有愛。喜俱行愛。彼彼喜愛。為去來今。眾苦因本。道路由緒。能作生緣。起集等起。能起集等。起現法中諸苦身壞。後苦由是出生。如有頌言。\n　　因愛棄良醫　　癰本榛藤渴\n　　未調伏一切　　數數感眾苦\n　　如樹根未拔　　雖斫斫還生\n　　未拔愛隨眠　　數數感眾苦\n　　如毒箭在身　　損壞色力等\n　　眾生內有愛　　損壞諸善根\n　　此等名為以無量門正為開示集真是集。\n　　云何名為以無量門正為開示滅真是滅？謂正開示。即上所說。愛後有愛。喜俱行愛。彼彼喜愛。無餘永斷。棄捨變吐。盡離染滅。寂靜永沒。名為舍宅。亦名洲渚。亦名救護。亦名歸依。亦名所趣。亦名無憂。亦名無病。亦名無動。亦名無沒。亦名無熾。亦名無熱。亦名安隱。亦名惔怕。亦名善事。亦名吉祥。亦名涅槃。如有頌言。\n　　究竟沙門果　　調伏所稱讚\n　　我慢滅無餘　　永證甘露跡\n　　所歸住趣宅　　勝宮佛所讚\n　　惔怕滅無邊　　彼岸常安隱\n　　所依盡苦滅　　脫無窟究竟\n　　勝義旨應供　　智所習聖欣\n　　都無老病死　　無愁嘆苦憂\n　　微難見無邊　　滅諦無同類\n　　此等名為以無量門正為開示滅真是滅。\n　　云何名為以無量門正為開示道真是道？謂正開示。此道此行。於去來今眾苦。能斷能棄。能吐能盡。能離染。能滅能寂靜。能令永滅沒。此復云何？謂八支聖道。正見正思惟正語正業正命正精進正念正定。如有頌言。\n　　此威猛一趣　　如鳥路淸虛\n　　牟尼定所行　　為眾數宣說\n　　哀愍說一趣　　見道盡生邊\n　　此道於瀑流　　去來今能度\n　　能究竟調靜　　能盡生死流\n　　能通達多界　　能開明眼道\n　　如殑伽駛流　　速趣於大海\n　　開示廣慧道　　速證於涅槃\n　　哀愍一切眾　　轉未聞法輪\n　　教導諸天人　　稽首度有海\n　　此等名為以無量門正為開示道真是道。\n　　若於此等所說正法。樂聽樂聞。樂受持。樂究竟。樂解了。樂觀察。樂尋思。樂推究。樂通達。樂觸。樂證。樂作證。為聞法故。履艱險徑。涉邊表路。游平坦道。皆無忌難。為受持故。數以耳根。對說法音。發勝耳識。如是名為聽聞正法。",
    "能取": "　　云何能取？幾是能取？為何義故觀能取耶？謂諸色根及心心法，是能取義。三蘊全色行蘊一分，根相及相應相，如其次第十二界六處全及法界法處一分相應自體，是能取。為捨執著能受用我故，觀察能取。受用我者，計我能得愛不愛境。又能取有四種，謂不至能取、至能取、自相現在各別境界能取、自相共相一切時一切境界能取。不至能取者，謂眼耳意根。至能取者，謂餘根。自相現在各別境界能取者，謂五根所生。自相共相一切時一切境界能取者，謂第六根所生又由和合識等生故。假立能取性，所以者何？以依眾緣和合所生識等，假說能取，不由真實義諸法無作用故。",
    "能學一分": "　　鄔波索迦。歸佛法僧。發誠言已。唯能離殺。不離餘四。",
    "能學多分": "　　鄔波索迦。歸佛法僧。發誠言已。離殺盜婬。不離余二。",
    "能學少分": "　　鄔波索迦。歸佛法僧。發誠言已。能離殺盜。不離余三。如是名為能學少分。",
    "能學滿分": "　　鄔波索迦。歸佛法僧。發誠言已。具能離五。如是名為能學滿分。",
    "能殺生者": "　　如世尊說。有殺生者。暴惡血手。耽著殺害。於諸有情眾生勝類。無羞無愍。下至捃多比畢洛迦。皆不離殺。如是名為能殺生者。何等名為有殺生者？謂於殺生。不深厭患。不遠不離。安住成就。如是名為有殺生者。何名暴惡。謂集種種弓刀杖等諸殺害具。是名暴惡。何名血手。謂諸屠羊屠雞屠豬捕鳥捕魚獵師劫盜魁膾縛龍守獄煮狗施罝弶等。是名血手。何故此等名為血手。謂彼雖數沐浴塗香服鮮淨衣首冠花鬘身飾嚴具。而名血手。所以者何。彼於惡事。不深厭患。不遠不離。令有情血起等起生等生積集流出。故名血手。何等名為耽著殺害？謂於眾生。有害非殺。有害亦殺。害非殺者。謂以種種弓刀杖等諸殺害具。逼惱眾生。未全斷命。如是名為有害非殺。害亦殺者。謂以種種弓刀杖等諸殺害具。逼惱眾生。亦全斷命。如是名為有害亦殺。於殺害事。耽樂執著。如是名為耽著殺害。",
    "自在成就": "　　自在成就者，謂諸方便善法，若世出世靜慮解脫三摩地三摩鉢底等功德，及一分無記法，由自在成就故成就方便善法者，謂聞所生慧等，雖先有種子，若離今生數習增長，終不能起現前故，一分無記法者，謂工巧處變化心等。",
    "自性": "　　實自性者，謂諸法實有性。假自性者，謂諸法假有性。世俗自性者，謂諸法世俗有性。勝義自性者，謂諸法勝義有性。",
    "自性善": "　　何等自性善？謂信等十一心所有法。",
    "自性無記": "　　何等自性無記？謂八色界處意相應品命根眾同分名句文身等。",
    "自性離欲": "　　何等自性離欲？謂於苦受及順苦受處法生厭背性。",
    "自業智力": "　　自業智力者，謂於一切種自業智具足中，若定若慧，餘如前說。以於一切種自業智無著無礙現行中，所有三摩地等，如是餘力隨其所應當正建立。",
    "自說": "　　自說者，謂諸經中或時如來悅意自說如伽他曰，若於如是法發勇猛精進靜慮諦思惟，爾時名梵志。",
    "舌根": "　　何等舌根？謂四大種所造舌識所依清淨色。",
    "舌處": "　　謂如舌根。應說其相。",
    "色": "　　色者，四大種所造眼根所行義，謂青黃赤白長短方圓，麤細高下若正不正，光影明闇雲煙塵霧，迥色表色空一顯色。此復三種，謂妙不妙俱相違色，此青等二十五色建立。由六種因，謂相故安立故損益故作所依故作相故莊嚴故，如其次第四十八一一一。迥色者，謂離餘礙觸方所可得，空一顯色者，謂上所見青等顯色。",
    "色界": "　　謂欲色界。總名色界。",
    "色界繫": "　　云何色界繫？幾是色界繫？為何義故觀色界繫耶？謂已離欲界欲，未離色界欲者，所有善無記法，是色界繫義，除前所說四界二處，餘蘊界處一分，是色界繫，一分者，謂除欲無色界繫及無漏法，為捨執著離欲界欲我故，觀察色界繫。",
    "色蘊": "　　謂諸所有色。一切皆是四大種。及四大種所造。是名色蘊。",
    "色處": "　　謂色為眼。已正當見。及彼同分。是名色處。又色為眼增上發眼識。已正當了別。及彼同分。是名色處。又色於眼。已正當礙。及彼同分。是名色處。又色為眼。已正當行。及彼同分。是名色處。如是過去未來現在諸所有色名為色處。亦名所知。乃至所等證。\n　　此復云何？謂四大種所造。青黃赤白雲煙塵霧長短方圓高下。正不正影光明暗空一顯色。相雜紅紫。碧綠皂褐。及余所有。眼根所見。眼識所了。所有名號。異語增語。想等想。施設言說。謂名色。名色界。名色處。名彼岸。如是色處。是外處攝。",
    "苦": "　　云何苦？謂苦諦。云何苦法？謂苦諦增上所起教法。云何法智？謂於加行道中觀察諦增上法智。云何智忍？謂先觀察增上力故。於各別苦諦中起現證無漏慧。由此慧故永捨見苦所斷一切煩惱，是故名為苦法智忍。云何苦法智？謂忍無間由此智故。於前所說煩惱解脫而得作證，是名苦法智。云何苦類智忍？謂苦法智無間無漏慧生，於苦法智忍及苦法智各別內證，言後諸聖法皆是此種類，是故名為苦類智忍。云何苦類智？謂此無間無漏智生，審定印可，苦類智忍，是名苦類智，如是於餘諦中隨其所應，諸忍諸智盡當知。",
    "苦根": "　　謂順苦觸所生身苦。不平等受。受所攝。是名苦根。",
    "苦法": "　　復次苦法略有八種差別，謂有廣大不寂靜苦、有寂靜苦、有寂靜不寂靜苦、有中不寂靜苦、有微薄不寂靜苦、有微薄寂靜苦、有極微薄寂靜苦、有非苦似苦住大寂靜。云何廣大不寂靜苦？謂生欲界未曾積集諸善根者，由欲界一切生趣苦具足所顯故，未集善根不能遮止往諸趣故，如其次第名廣大不寂靜苦。云何寂靜苦？謂即此已生順解脫分善根者，決定趣向般涅槃故。云何寂靜不寂靜苦？謂即此為世間道離欲已種善根者，由即此欲界苦為世間道離欲已種善根者決定超越苦苦等故，然非畢竟故，如其次第，如是中不寂靜苦等隨所應當釋。云何中不寂靜苦？謂生色界遠離順解脫分者。云何微薄不寂靜苦？謂生無色界遠離順解脫分者。云何微薄寂靜苦？謂諸有學。云何極微薄寂靜苦？謂諸無學命根住緣六處。云何非苦似苦住大寂靜？謂已得究竟菩薩摩訶薩等，乘大悲願力故生諸有中，由能除滅無量眾生相續大苦故，名住大寂靜。",
    "苦法智": "　　苦法智者，謂忍無間，由此智故於前所斷煩惱解脫而得作證。所以者何？先由忍故永斷一切見苦所斷煩惱，令所依轉從此無間，由如是智生證得轉依，是名苦法智。",
    "苦法智忍": "　　苦者，謂苦諦。苦法者，謂苦諦增上所起教法。法智者，謂於方便道中觀察諦增上法智。智忍者，謂先觀察增上力故，於各別苦諦中起現證無漏慧，由此慧故永捨見苦所斷一切煩惱。今於此中所說義者，謂於方便道中觀察依止苦諦所起契經等法，如理作意所攝智增上力故，於自相續苦諦中現證彼真如，出世間慧正見體生，由此慧故永捨一切見苦所斷三界所繫二十八隨眠，是故名為苦法智忍。",
    "苦界": "　　謂順苦觸所起身苦不平等受。受所攝。是名苦界。",
    "苦相": "　　苦相者，或三或八或六廣說如前。何故經說若無常者即是苦耶？由三分無常為緣苦相可了知故，謂生分無常、滅分無常、俱分無常、生分無常，為緣故苦苦性可了知。生分無常者，謂本無今有，苦品諸行體是逼迫，由此無常為緣苦苦性可了知，滅分無常為緣壞苦性可了知。滅分無常者，謂已有還無，樂品諸行不可愛樂，由此無常為緣壞苦性可了知。俱分無常為緣行苦性可了知俱分無常者，謂麤重諸行相續流轉，若生若滅俱不可樂，由此俱分無常為緣行苦性可了知，即依此義薄伽梵說，諸行無常諸行變壞。又依此義言諸所有受我說皆苦，當知此中於不苦不樂受及樂受，密意故說苦苦，受苦性世間共了故不復密意說。又於生滅二法所隨諸行中有生等八苦，性可了知故，佛說言若無常者即是苦。又於無常諸行中有生等苦可了者，如來依此密意說言，由無常故苦非一切行，若不爾聖道無常故亦應是苦。",
    "苦聖諦": "　　云何苦聖諦？謂生苦老苦病苦死苦。怨憎會苦。愛別離苦。求不得苦。略說一切五取蘊苦。",
    "苦苦性": "　　云何苦苦性？幾是苦苦性？為何義故觀苦苦性耶？謂苦受自相故，隨順苦受法自相故，是苦苦性義。苦受自相者，謂苦受即用苦體為自相故，名苦苦性。隨順苦受法自相者，謂能生此受根境及相應法隨順苦受故，名苦苦性，一切一分是苦苦性，為捨執著有苦我故。觀察苦苦性。",
    "苦諦": "　　苦諦云何？謂有情生及生所依處，即有情世間器世間，如其次第若生若生處。俱說名苦諦。有情生者，謂諸有情生在地獄畜生餓鬼人天趣中，人謂東毘提訶西瞿，陀尼南贍部洲北俱盧洲。天謂四大王眾天三十三天夜摩天睹史多天樂變化天他化自在天，梵眾天梵輔天大梵天少光天無量光天極光淨天少淨天無量淨天遍淨天無雲天福生天廣果天無想有情天無煩天無熱天善現天善見天色究竟天，無邊空處天無邊識處天無所有處天非想非非想處天，生所依處即器世界，謂水輪依風輪，地輪依水輪，依此地輪有蘇迷盧山七金山四大洲八小洲內海外海，蘇迷盧山四外層級四大王眾天，三十三天所居處別，外輪圍山，虛空宮殿，若夜摩天睹史多天樂變化天他化自在天，及色界天所居處別，諸阿素洛所居處別，及諸那落迦所居處別，謂熱那落迦，寒那落迦，孤獨那落迦，及一分傍生餓鬼所居處別，乃至一日一月周遍流光，所照方處名一世界。如是千世界中有千日千月千蘇迷盧山王千四大洲千四大王眾天千三十三天千夜摩天千睹史多天千樂變化天千他化自在天千梵世天，如是總名小千世界，千小千界總名第二中千世界，千中千世界總名第三大千世界，如此三千大千世界總有大輪圍山周匝圍繞。又此三千大千世界同壞同成，譬如天雨滴如車軸無間無斷從空下注，如是東方無間無斷，無量世界或有將壞，或有將成，或有正壞，或壞已住，或有正成，或成已住，如於東方乃至一切十方亦爾。如是若有情世間若器世間，業煩惱力所生故，業煩惱增上所起故，總名苦諦。業煩惱力所生，業煩惱增上所起者，此二句如其次第顯有情世間及器世間俱是苦性，復有清淨世界非苦諦攝，非業煩惱力所生故，非業煩惱增上所起故，然由大願清淨善根增上所引，此所生處不可思議，唯佛所覺，尚非得靜慮者靜慮境界，況尋思者。\n　　復次已略辯苦諦相，今當廣顯諸經所說苦相差別，所謂生苦老苦病苦死苦怨憎會苦愛別離苦求不得苦，略攝一切五取蘊苦。生何因苦？眾苦所逼故，餘苦所依故，眾苦所逼者，謂曾於母胎生熟藏間，具受種種極不淨物所逼迫苦，正出胎時復受支體逼切大苦，餘苦所依者，謂有生故老病死等眾苦隨逐。老何因苦？時分變壞苦故，病何因苦，大種變異苦故。死何因苦？壽命變壞苦故，怨憎會何因苦，合會生苦故。愛別離何因苦？別離生苦故，求不得何因苦？所希不果生苦故，略攝一切。五取蘊何因苦？麤重苦故，如是八種略攝為六，謂逼迫苦、轉變苦、合會苦、別離苦、所希不果苦、麤重苦。如是六種廣開為八，轉變苦中分三種故，若六若八平等平等，問如說三苦。此中八苦為三攝八八攝三耶？答展轉相攝，所謂生苦乃至怨憎會苦能顯苦苦，順苦受法苦自相義故，愛別離苦求不得苦能顯壞苦，已得未得順樂受法壞自相義故，略攝一切五取蘊苦能顯行苦，不解脫二無常所隨不安隱義故。問如說二苦？謂世俗諦苦，勝義諦苦。何者世俗苦？何者勝義苦？答生苦乃至求不得苦，是世俗諦苦，世間智境界故，略攝一切五取蘊苦，是勝義諦苦，由安立真如門出世智境界故。",
    "苦諦共相": "　　云何苦諦共相？謂無常相、苦相、空相、無我相。何等無常相？略有十二，謂非有相、壞滅相、變異相、別離相、現前相、法爾相、剎那相、相續相、病等相、種種心行轉相、資產興衰相、器世成壞相。",
    "苦速通行": "　　云何名為苦速通行？如世尊說。諸有苾芻。由五取蘊。陵辱傷毀。彼因如是五種取蘊逼切拘執。如扼重擔。乃至命終。恆常隨逐。便於如是五取蘊中。深生厭賤。呵毀拒逆。即於如是五取蘊中。所生厭賤。呵毀拒逆。此中名苦。由此便起明利強盛信等五根。如是五根。明故利故強故盛故。能速證得無上漏盡。\n　　此言速者。能急能疾能駛能易能速證得。\n　　言無上者。如世尊說。於諸有為無為法中。我說離染。最為第一。最尊最勝。最上無上。於無上法能得隨得。能觸等觸。能證作證。故名證得。\n　　言漏盡者。漏謂三漏。於此三漏。能盡等盡遍盡永盡滅盡圓盡故名漏盡。言通行者。謂即此行。超越勇猛。精進策勵。生欲翹勤。於四聖諦。修現觀行。於預流果一來不還阿羅漢果。修作證行。於貪瞋癡慢憍垢等。修永盡行。以極恭敬安住殷重思惟。遍攝諸心所已。因故門故理故相故。修通達行。是故名為苦速通行。又如是行。於所求義由修習多修習。能得隨得。能觸等觸。能證作證。是故名為苦速通行。又如是行。由語增語。由想等想施設言說。為苦速通行。是故名為苦速通行。",
    "苦遲通行": "　　如世尊說。諸有苾芻。由五取蘊。陵辱傷毀。彼因如是五種取蘊。逼切拘執。如扼重擔。乃至命終。恆常隨逐。便於如是五取蘊中。深生厭賤。呵毀拒逆。即於如是五取蘊中。所生厭賤。呵毀拒逆。此中名苦。由此便起昧鈍羸劣信等五根。如是五根。昧故鈍故。羸故劣故。能遲證得無上漏盡。\n　　此言遲者。非急非疾。非駛非易。非速證得。言無上者。如世尊說。於諸有為無為法中。我說離染。最為第一。最尊最勝。最上無上。於無上法。能得隨得。能觸等觸。能證作證。故名證得。\n　　言漏盡者。漏謂三漏。欲有無明。於此三漏。能盡等盡。遍盡永盡。滅盡圓盡。故名漏盡。\n　　言通行者。謂即此行。超越勇猛。精進策勵。生欲翹勤。於四聖諦。修現觀行。於預流果一來不還阿羅漢果。修作證行。於貪瞋癡慢憍垢等。修永盡行。以極恭敬安住殷重思惟。遍攝諸心所已。因故門故。理故相故。修通達行。是故名為苦遲通行。又如是行。於所求義。由修習多修習。能得隨得。能觸等觸。能證作證。是故名為苦遲通行。又如是行。由語增語。由想等想。施設言說。為苦遲通行。是故名為苦遲通行。",
    "苦集聖諦": "　　云何苦集聖諦？謂所有諸愛。後有愛喜俱行愛。彼彼喜愛。如是略說苦集聖諦。若廣說者。則二愛三愛。復有三愛四愛五愛六愛。及一切不善法。一切有漏善法。一切結縛隨眠隨煩惱纏等。皆名苦集聖諦。何因緣故。所有諸愛。後有愛喜俱行愛彼彼喜愛。皆名苦集聖諦。謂此四愛。皆是過去未來現在。苦因根本道路緣起。廣說乃至。此身壞後由此為因。苦果生起。故說此名苦集聖諦。何因緣故。二愛三愛。復有三愛四愛五愛六愛。及一切不善法。一切有漏善法。一切結縛隨眠隨煩惱纏等。皆名苦集聖諦。何因緣故。所有諸愛。後有愛喜俱行愛彼彼喜愛。皆名苦集聖諦。謂此四愛。皆是過去未來現在。苦因根本道路緣起。廣說乃至。此身壞後由此為因。苦果生起。故說此名苦集聖諦。何因緣故。二愛三愛。復有三愛四愛五愛六愛。及一切不善法。一切有漏善法。一切結縛隨眠隨煩惱纏等。皆名苦集聖諦。謂此諸法。皆是過去未來現在。苦因根本道路緣起。廣說乃至。此身壞後。由此為因。苦果生起。如說愛等。皆是苦因。能為根本。引眾苦故。如是愛等。名集諦者。謂此名愛等真實。是愛等此名為集。真實是集。若佛出世。若不出世。如是集法。法住法界一切如來。自然通達。等覺宣說。施設建立。分別開示。令其顯了。謂此是愛等。此是集。此是愛等性。此是集性。是真是實。是諦是如。非妄非虛。非倒非異。故名集諦。名聖諦者。聖謂諸佛及佛弟子。此是彼諦。謂彼於此。知見解了。正覺為諦。由是因緣。名苦集聖諦。\n　　復次苦集聖諦者。是假建立名想言說。謂苦集聖諦。過殑伽沙佛及弟子。皆共施設如是名故。云何苦滅聖諦？謂即諸愛。後有愛喜俱行愛。彼彼喜愛無餘永斷。棄捨變吐。盡離染滅。寂靜隱沒。如是略說苦滅聖諦。若廣說者。則二愛三愛。復有三愛四愛五愛六愛。及一切不善法。一切有漏善法。一切結縛隨眠隨煩惱纏等。無餘永斷。棄捨變吐。盡離染滅。寂靜隱沒。皆名苦滅聖諦。何因緣故。即諸愛後有愛喜俱行愛。彼彼喜愛。無餘永斷。棄捨變吐。盡離染滅。寂靜隱沒。皆名苦滅聖諦。謂此四愛。若未斷。未徧知。未滅未吐。後有苦果。相續生起。若已斷。已徧知。已滅已吐。後有苦果。不復生起。故此永斷等。名苦滅聖諦。何因緣故。即二愛三愛。復有三愛四愛五愛六愛及一切不善法。一切有漏善法。一切結縛隨眠隨煩惱纏等。無餘永斷。棄捨變吐。盡離染滅。寂靜隱沒。皆名苦滅聖諦。謂此諸法。若未斷未徧知。未滅未吐。後有苦果。相續生起。若已斷已徧知。已滅已吐。後有苦果。不復生起。故此永斷等。名苦滅聖諦。即此苦滅聖諦。亦名室宅。亦名洲渚。亦名救護。亦名歸依。亦名應趣。亦名無憂。亦名無病。亦名不死。亦名無熾然。亦名無熱惱。亦名安隱。亦名淸涼。亦名寂靜。亦名善事。亦名吉祥。亦名安樂。亦名不動。亦名涅槃。如說涅槃是真苦滅。是諸沙門究竟果故。如是斷等。名滅諦者。謂此名涅槃真實。是涅槃此名為滅。真實是滅。若佛出世。若不出世。如是滅法。法住法界。一切如來。自然通達。等覺宣說。施設建立。分別開示。令其顯了。謂此是涅槃。此是滅。此是涅槃性。此是滅性。是真是實。是諦是如。非妄非虛。非倒非異。故名滅諦。名聖諦者。聖謂諸佛及佛弟子。此是彼諦。謂彼於此。知見解了。正覺為諦。由是因緣。名苦滅聖諦。\n　　復次苦滅聖諦者。是假建立名想言說。謂苦滅聖諦。過殑伽沙佛及弟子。皆共施設如是名故。",
    "苦類智": "　　苦類智者，謂此無間無漏智生，審定印可苦類智忍。所以者何？由苦類智忍無間無漏智生，於苦類智忍內證印可，故名苦類智。\n　　如是於餘諦中隨其所應，諸忍諸智盡當知，於此位中由法忍法智覺悟所取，由類忍類智覺悟能取。所以者何？出世間道有二境界，謂真如及正智，法智品道真如為境，類智品道正智為境，由此諸忍智如實了知故。又於此一切忍智位中，說名安住無相觀者，如薄伽梵說第六無相住補特伽羅者，即現住此忍智位中者是也，於此位中一切相皆不可得故。又無相住有六種，謂空、無相、無願、滅定、有頂、見道，如是十六心剎那說名見道。所以者何？由如是忍智所攝十六心剎那，於曾所未見四聖諦境，各以四剎那見故，名為見道。又心剎那者，謂於所知境智生究竟名一剎那，非唯於本無今有生時名心剎那。何以故？乃至於所知境能知智生所作究竟名一剎那故，如說苦應遍知是一心剎那，如是集應永斷等亦爾。又如上說，見道差別皆假建立非真實爾。何以故？出世位中各別內證絕戲論故。",
    "苦類智忍": "　　苦類智忍者，謂苦法智無間無漏慧生，於苦法智忍及苦法智各別內證，言後諸聖法皆是此種類。所以者何？由初二種若忍若智，是後一切學與無學聖法種類，從此彼得生故，是故無漏慧生各別內證緣此為境，言後諸聖法皆是此種類，是故名為苦類智忍。",
    "菩薩摩訶薩成就五法": "　　又餘經說，菩薩摩訶薩成就五法施波羅蜜多速得圓滿，何等為五？一者增益慳吝法性，二者於施有倦，三者憎惡乞求，四者無暫少施，五者遠離於施。增益慳吝法性者，謂由永斷慳吝隨眠并彼習氣，證得彼法性真如轉依故。於施有倦者，謂為修施誓受長時難行苦行故。憎惡乞求者，謂欲其自取，厭彼乞求故。無暫少施者，謂一切時一切物施故。遠離於施者，謂常遠離期報施等故。\n　　又餘經說，菩薩摩訶薩成就五法名梵行者，成就第一清淨梵行。何等為五？一者常求以欲離欲，二者捨斷欲法，三者欲貪已生即便堅執，四者怖治欲法，五者二二數會。成就第一清淨梵行者，謂出世間道。常求以欲離欲者，謂即以此如實遍智永斷彼故。此如實遍智者，謂能通達此真如智。捨斷欲法者，謂恒觀察捨斷非梵行方便，欲貪已生。即便堅執者，謂於內欲貪已生，即便堅執擯出於外。怖治欲法者，謂說欲過患怖諸有情，立對治道拔濟一切。二二數會者，謂於染淨因果差別四真諦中，以世出世二道及奢摩他毘鉢舍那二道，數數證會故。",
    "菩薩波羅蜜多藏": "　　復次何因緣故，十二分聖教中方廣分名菩薩波羅蜜多藏耶？由此分中廣說一切波羅蜜多數故，相故、次第故、釋詞故、修故、差別故、攝故、所治故、功德故、更互決擇故。問於何處說？答如經中說，大乘者即是菩薩波羅蜜多藏。",
    "菩薩現觀": "　　菩薩現觀者，謂諸菩薩於前所說七現觀中，起修集忍而不作證，為於聲聞獨覺調伏方便中得善巧故，哀戀眾生，不於下乘而出離故，然於菩薩極喜地中入諸菩薩正性決定，是名菩薩現觀。",
    "菩薩藏法": "　　聲聞藏法菩薩藏法等，從如來法身所流。何因緣故以香鬘等供養恭敬菩薩藏法，便生廣大無邊福聚，非聲聞藏法。以菩薩藏法是一切眾生利益安樂所依處故，能建大義故，無上無量大功德聚所生處故。",
    "著貪": "　　於自財物。及所攝受。起貪等貪。執藏防護。堅著愛染。是名著貪。",
    "蓋": "　　蓋有五種，謂貪欲蓋、瞋恚蓋、惛沈睡眠蓋、掉舉惡作蓋、疑蓋。能令善品不得顯了是蓋義，覆蔽其心障諸善品令不轉故。問於何等位障諸善法？答於樂出家位覺正行位止舉捨位，於樂出家時貪欲蓋為障，希求受用外境界門。於彼不欣樂故，於覺正行時瞋恚蓋為障，於所犯學處同梵行者正發覺時，由心瞋恚不正學故，於止舉兩位惛沈睡眠掉舉惡作蓋為障。如前所說，能引沈沒及散亂故，於捨位疑蓋為障，遠離決定不能捨故。",
    "薄伽梵": "　　謂有善法。名薄伽梵。成就無上諸善法故。或修善法。名薄伽梵。已修無上諸善法故。又佛世尊。圓滿修習身戒心慧。成就大悲。我無限無量。成無量法。名薄伽梵。又佛世尊。具大威德。能往能至。能壞能成。能自在轉。名薄伽梵。又佛世尊。永破一切貪瞋癡等惡不善法。永破雜染後有熾然苦異熟果。永破當來生老病死。名薄伽梵。如有頌言。\n　　永破貪瞋癡　　惡不善法等\n　　具勝無漏法　　故名薄伽梵\n　　又佛世尊。於未聞法。能自通達。得最上覺。成現法智。無障礙智。善解當來。修梵行果。為諸弟子。分別解說。設大法會。普施有情。名薄伽梵。如有頌言。\n　　如來設法會　　普哀愍無依\n　　如是天人師　　稽首度有海\n　　又佛世尊。為諸弟子。隨宜說法皆令歡喜。恭敬信受。如教修行。名稱普聞。遍諸方域。無不讚禮。名薄伽梵。",
    "薄伽梵觀過失": "　　問薄伽梵觀何過失故，於蘊界處以五種相誹毀計我？答觀彼攝受薩迦耶見者，有五種過失故，謂異相過失、無常過失、不自在過失、無身過失、不由功用解脫過失。異相過失者，謂色蘊等非我體性，異我相故。無常過失者，謂非我處色蘊等中，我應無常故，所以者何？非所依無能依有故。不自在過失者，謂不應觀我有色等，我應不自在故，所以者何？我於色等不能自在轉故。無身過失者，謂非離色等異處有我，我應無身故，所以者何？離身計我不可得故。不由功用解脫過失者，設有如是分別我相亦不應理，無色等我不由功用應解脫故，所以者何？身縛若無我應任運解脫。",
    "薄塵行補特伽羅": "　　薄塵行補特伽羅者，謂住自性位微薄煩惱，如前所說自性位煩惱相，今此煩惱望彼是微薄故，雖於增上所緣境界，而微薄性煩惱現行，昔所修習勝對治力所摧伏故。",
    "薩迦耶見": "　　薩迦耶見者，於五取蘊等隨觀執我及我所，諸忍欲覺觀見為體，一切見趣所依為業。",
    "蘊": "　　蘊界處各有幾？蘊有五，謂色蘊、受蘊、想蘊、行蘊、識蘊。\n　　問何因蘊唯有五？答為顯五種我事故，謂為顯身具我事。受用我事，言說我事，造作一切法非法我事，彼所依止我自體事。於此五中，前四是我所事，第五即我相事。言身具者，謂內外色蘊所攝。受等諸蘊受用等義，相中當說。彼所依止我自體事者，謂識蘊是身具等所依我相事義。所以者何？世間有情多於識蘊計執為我，於餘蘊計執我所。",
    "蘊次第": "　　問何故諸蘊如是次第？答由識住故，謂四識住及識，又前為後依故，如其色相而領受故，如所領受而了知故，如所了知而思作故，如所思作隨彼彼處而了別故，如其色相而領受者，謂由隨順樂受等根境二力故，樂受等生，如所領受而了知者，謂隨所受取諸相故，如所了知而思作者，謂隨所想造諸業故，如所思作隨彼彼處而了別者，謂隨所作業於諸境界及異趣中識轉變故。又由染污清淨故，謂若依是處而起染淨，若由領受取相造作故，染污清淨，若所染污及所清淨，由此理故說蘊次第。若依是處起染淨者，謂依有根身，若由領受者，謂由有染無染等受，如其次第染污清淨，若由取相造作者，謂由如理不如理轉故，如其次第染污清淨，若所染污及所清淨者，謂心有麤重無麤重生故。",
    "蘊界處": "　　云何建立處？謂十色界即十色處，七識界即意處，法界即法處。\n　　由此道理諸蘊界處三法所攝，謂色蘊法界及與意處，由色蘊攝十色界，法界即攝法界，意處攝七識界，是故三法攝一切法。\n　　如是建立蘊界處已，今乘此義應更分別。問眼耳與鼻各有二種，云何不立二十一界？答彼雖有二然界不別。所以者何？其相相似俱眼相故，所作相似俱於眼境，眼識一所作故，如是耳鼻隨理應知，為身端嚴各生二種。何以故？如是分布一界二所身得端嚴，不由餘故。問為常依一一眼故眼識得生，為亦依二耶？答亦得依二，明了取故。所以者何？若俱開二眼取色明了非如開一譬如一室俱然二燈，同發一光照極明了，如是一光依二燈轉當知此中道理亦爾。問於一一根門種種境界俱現在前，於此多境為有多識次第而起，為俱起耶？答唯有一識種種行相俱時而起，若諸段食與舌根合，當知身舌二識恒俱時起，又聲間斷故，不從異處展轉生起相續往趣餘方。然譬於燈置在自處，能於一時隨其勢力遍發光明，聲頓遍發理亦如是。問何故於近障聲聞不明了？答聲有對故，於障細隙微少而生故不明了。問於六識中幾有分別？答唯一意識由三分別故有分別，三分別者，謂自性分別、隨念分別、計度分別。自性分別者，謂於現在所受諸行自相行分別。隨念分別者，謂於昔曾所受諸行追念行分別。計度分別者，謂於去來今不現見事思搆行分別。復有七種分別，謂於所緣任運分別、有相分別、無相分別、尋求分別、伺察分別、染污分別、不染污分別。初分別者，謂五識身如所緣相無異分別，於自境界任運轉故。有相分別者，謂自性隨念二種分別，取過現境種種相故。無相分別者，謂希求未來境行分別，所餘分別皆用計度分別以為自性。所以者何？以思度故，或時尋求，或時伺察，或時染污，或不染污，種種分別。問若了別色等故名為識，何故但名眼等識，不名色等識耶？答以依眼等五種解釋道理成就，非於色等。何以故？眼中之識故名眼識，依眼處所識得生故，又由有眼識得有故。所以者何？若有眼根眼識定生，不盲瞑者乃至闇中亦能見故，不由有色眼識定生，以盲瞑者不能見故，又眼所發識故名眼識，由眼變異識亦變異，色雖無變識有變故，如迦末羅病損壞眼根，於青等色皆見為黃，又屬眼之識故名眼識，由識種子隨逐於眼而得生故，又助眼之識故名眼識，作彼損益故。所以者何？由根合識有所領受令根損益，非境界故。又如眼之識故名眼識，俱有情數之所攝故，色則不爾，不決定故，眼識既然餘識亦爾。問為眼見色，為識等耶？答非眼見色亦非識等，以一切法無作用故，由有和合假立為見。又由六相，眼於見色中最勝非識等，是故說眼能見諸色何等為六？一由生因，眼能生彼故。二由依處，見依眼故。三由無動轉，眼常一類故。四由自在轉，不待緣合念念生故。五由端嚴，轉由此莊嚴所依身故。六由聖教，如經中說。眼能見色故，如是所說六種相貌，於識等中皆不可得。識動轉者，當知多種差別生起。何故無為立在界處不在蘊耶？無蘊義故，所以者何？色等諸法有去來等種種差別總略積聚說名為蘊，聚積義是蘊義常住之法無有此義，是故無為非蘊所攝。何故即如是法以蘊界處門差別說耶？欲令所化有情於廣略門生善巧故。所以者何？於蘊門中略說色識，於界處門隨其所應廣說十七，又於蘊門廣說受等，於界處門略說為一法界法處，又蘊門中唯說建立有為法相，界門廣說建立能取所取及取體性處門唯說建立能取所取，由此唯顯取生門故，已辯傍乘義，今當釋本文。",
    "蘊界處差別": "　　由此所說差別道理，餘無量門可類觀察。復次蘊界處差別略有三種，謂遍計所執相差別，所分別相差別，法性相差別。遍計所執相差別者，謂於蘊界處中遍計所執，我有情命者生者養者數取趣者意生者摩納婆等，於蘊等中實無我等自性，但是遍計所執相故。所分別相差別者，謂即蘊界處法，由於此處我有情等虛妄分別轉故。法性相差別者，謂即於蘊界處中我等無性無我有性，由離有無相真如用蘊等中我等無性無我有性為相故，當知此中依三自性及多分依數取趣無我理說三種相。",
    "處": "　　處有十二，謂眼處、色處、耳處、聲處、鼻處、香處、舌處、味處、身處、觸處、意處、法處。\n　　問何因處唯十二？答唯身及具能與未來六行受用為生長門故，謂如過現六行受用相為眼等所持。未來六行受用相，以根及義為生長門亦爾。所言唯者，謂唯依根境立十二處，不依六種受用相識。",
    "處非處智力": "　　處非處智力者，謂依止靜慮於一切種處非處智具足中，若定若慧及彼相應諸心心法，一切種處非處智具足者，謂於一切種因非因智無著無礙現行中，所有三摩地等。",
    "虛妄分別": "　　虛妄分別者略有十種，謂根本分別、相分別、相顯現分別、相變異分別、相顯現變異分別、他引分別、不如理分別、如理分別執著分別、散亂分別。根本分別者，謂阿賴耶識，是一切分別種子故。相分別者，謂身所居處所受用識，是所取相故，彼復如其次第以諸色根器世界色等境界為相。相顯現分別者，謂六識身及意，如前所說，所取相而顯現故。相變異分別者，謂如前所說，身等相變異生起。相顯現變異分別者，謂如前所說，眼識等相顯現，於苦樂等位差別生起。他引分別者，謂教法所攝名句文身相。此復二種，一惡說法律為體，二善說法律為體，由此增上力如其次第引二作意所攝，謂不如理分別如理分別執著分別者，謂不如理分別所起六十二見所攝。所有分別散亂分別者，謂如理分別所起無性等執為相所有分別。\n　　此復十種，謂無性分別、有性分別、增益分別、損減分別、一性分別、異性分別、自性分別、差別分別、隨名義分別、隨義名分別，如是十種分別依般若波羅蜜多初分宣說。如經言，舍利子，是菩薩實有菩薩正不隨觀菩薩，正不隨觀菩薩名正不隨觀般若波羅蜜多，正不隨觀菩提，正不隨觀行，正不隨觀不行，所以者何？名自性空非空性，色自性空非空性，乃至識自性空非空性。何以故？此色空性非即色亦不離色，別有空性，色即是空性，空性即是色乃至識亦爾。何以故？此唯有名，所謂此是菩薩名，此是菩薩，此是般若波羅蜜多，此是菩提，此是色乃至此是識，由彼自性無生無滅無染無淨，菩薩行般若波羅蜜多時正不隨觀生，乃至正不隨觀淨。何以故？於所計度彼彼諸法假立客名，由隨客名而起言說，隨如是如是言說，起如是如是執著，菩薩於如是一切名正不隨觀，正不隨觀故不生執著，於此經中為對治無性分別故。說如是言，是菩薩實有菩薩，如是等由實有言，是有性義故，為對治有性分別故。說如是言，正不隨觀菩薩乃至正不隨觀不行，由遣補特伽羅及法二性故，為對治增益分別故。說如是言，所以者何？名自性空，由遣不實遍計所執自性故，為對治損減分別故。說如是言，非空性，由於此名遍計所執自性遠離性一切時有故，為對治一性分別故。說如是言，此色空性非即色，乃至此識空性非即識，由自性異故。所以者何？色等是遍計所執自性，空性是圓成實自性故，為對治異性分別故。說如是言，亦不離色別有空性，乃至空性即是識，由遍計所執自性無相故，離彼彼無性不可得故為對治自性分別故。說如是言，此唯有名，所謂此是色乃至此是識等，由離能詮無有決定所詮自性故，為對治差別分別故。說如是言，由彼自性無生乃至正不隨觀淨，由遣生等差別相故，為對治隨名義分別故。說如是言，於所計度彼彼諸法假立客名，由隨客名而起言說如是等，為對治隨義名分別故。說如是言，菩薩於如是一切名正不隨觀，正不隨觀故不生執著，由隨義於名不見不執故。",
    "虛空": "　　何等虛空？謂無色性容受一切所作業故。",
    "虛誑者": "　　謂事不實。名虛想等。不實名誑。是名虛誑。",
    "虛誑語者": "　　以貪瞋癡。違事想說令他領解。名虛誑語。",
    "行": "　　行有二種業，一令諸有情於諸趣中種種差別，二與識作緣，由熏習故。",
    "行界": "　　謂六思身。即眼觸所生思。乃至意觸所生思。是名行界。",
    "行相": "　　分析行相者，謂種種品類分析諸法，如有色無色有見無見，如是等。差別行相者，謂諸法差別義，如一信相或名心淨，或名喜樂，或名忍可，如是等。正解行相者，謂以種種行相正解所緣境，如了別行相名識，取像行相名想，領納行相名受，如是等。觀察行相者，謂十六行，即無常等四因等四滅等四道等四，或世俗六行，謂麤行障行苦行靜行妙行離行。作隨作行相者，謂作所作已復更隨作，如由此行善守護已。",
    "行相差別": "　　如是滅諦總有四種行相差別，謂滅相、靜相、妙相、離相。云何滅相？煩惱離繫故。云何靜相？苦離繫故。云何妙相？樂靜事故。云何離相？常利益事故。",
    "行緣識": "　　謂有一類。貪瞋癡俱生思為緣故。起貪瞋癡俱生諸識。是名行緣識。復有一類。無貪無嗔無癡俱生思為緣故。起無貪無嗔無癡俱生諸識。是名行緣識。復次眼及色為緣生眼識。此中眼是內有為行。色為外緣生眼識。是名行緣識。乃至意及法為緣生意識。此中意是內有為行。法為外緣生意識。是名行緣識。",
    "行苦性": "　　云何行苦性？幾是行苦性？為何義故觀行苦性耶？謂不苦不樂受自相故，隨順不苦不樂受法自相故，彼二麤重所攝受故，不離二無常所隨不安隱故，是行苦性義。不苦不樂受者，謂阿賴耶識相應受。隨順不苦不樂受法者，謂順此受，諸行。彼二麤重所攝受者，謂苦壞二苦麤重所隨故。不離二無常所隨不安隱者，謂不解脫二苦故，或於一時墮在苦位，或於一時墮在樂位，非一切時唯不苦不樂位，是故無常所隨不安隱義，是行苦性。除三界二處諸蘊一分，一切是行苦性。三界者，謂意界法界意識界。二處者，謂意處法處。一分者，謂除無漏相。為捨執著有不苦不樂我故，觀察行苦性。",
    "行蘊": "　　謂行蘊有二種。一心相應行蘊。二心不相應行蘊。\n　　云何心相應行蘊？謂思觸作意。廣說乃至。諸所有智見現觀。復有所餘如是類法。與心相應。是名心相應行蘊。\n　　云何心不相應行蘊？謂得無想定。廣說乃至文身。復有所餘如是類法。不與心相應。是名心不相應行蘊。\n　　如是心相應行蘊及心不相應行蘊總名行蘊。",
    "覆": "　　覆者，於所作罪他正舉時，癡之一分隱藏為體，悔不安住所依為業，法爾覆藏所作罪者心必憂悔，由此不得安隱而住。",
    "見取": "　　見取者，謂於諸見及見所依五取蘊等，隨觀執為最為勝為上為妙，諸忍欲覺觀見為體，執不正見所依為業。戒禁取者，於諸戒禁及戒禁所依五取蘊等，隨觀執為清淨為解脫為出離，諸忍欲覺觀見為體，勞而無果所依為業。",
    "見所斷": "　　云何見所斷？幾是見所斷？為何義故觀見所斷耶？謂分別所起染污見疑，見處疑處，及於見等所起邪行煩惱隨煩惱，及見等所發身語意業，并一切惡趣等蘊界處，是見所斷義。此中分別所起染污見疑者，謂聞不正法等為先，所起五見等，分別所起言為簡，俱生薩迦耶見及邊執見。問何相邊執見，是俱生耶？答謂斷見已學現觀者起如是怖，今者我我為何所在。見處者，謂諸見相應共有法，及彼種子，疑處亦爾。於見等所起邪行煩惱隨煩惱者，謂依見等門及緣見等，所起貪等一切一分，是見所斷。一分者，除修所斷及無漏故，為捨執著見圓滿我故，觀察見所斷。",
    "見法得法極通達法究竟堅法": "　　又經言，見法得法極通達法究竟堅法，越度一切希望疑惑，不假他緣，於大師教餘不能引，於諸法中得無所畏者，此亦依見道說，於所化有情聖諦現觀無間說故。見法者，謂諸法忍，由彼通達真實法故。得法者，謂諸法智，彼於轉依能作證故。極通達法者，謂諸類忍，通達諸聖法，是此二類故。究竟堅法者，謂諸類智，於諸所知已究竟故。越度一切希望者，由諸忍智出世間道，證得長夜所希聖果，於自所證無希慮故。越度一切疑惑者，於此位中於他所證無有猶豫，謂餘亦能證此勝位故。不假他緣者，於所修道中雖無他導引自然善巧故。於大師教餘不能引者，於佛聖教已得證淨，雖轉餘生不為邪道所化引故。於諸法中得無所畏者，於依所證問記法中，如惡欲增上慢者怯劣心永無有故。",
    "見結": "　　見結者，即三見，謂薩迦耶見邊執見邪見，見結所繫故，於邪出離妄計追求，謂我當解脫我所解脫，既解脫已我當常住，或當斷滅，又謂佛法中定無解脫，如是執著邪出離已，廣行不善不行諸善，由此能招未來世苦與苦相應。",
    "見結者": "　　見結者，即三見，謂薩迦耶見、邊執見、邪見。見結所繫故，於邪出離妄計追求妄興執著，於邪出離妄執著已，廣行不善不行諸善，由此能招未來世苦，與苦相應。",
    "見至補特伽羅": "　　何等見至補特伽羅？謂隨法行已至果位。",
    "見言不見": "　　謂為眼識曾受曾了。名為已見。彼有眼識曾受曾了。隱覆如是想忍見樂。言我不見。如是名為見言不見。",
    "見道": "　　云何見道？若總說，謂世第一法無間，無所得三摩地鉢羅若，及彼相應等法，由無分別奢摩他毘鉢舍那等為體相故。\n　　又所緣能緣平等平等智為其相，由此通達所取能取無性真如故。\n　　又遣各別有情假法假，遍遣二假所緣法智為相。云何遣各別有情假所緣法智為相？由此智於自相續中不分別我相故。不分別者，是除遣義。云何遣各別法假所緣法智為相？由此智於自相續中不分別色等法相故。云何遍遣二假所緣法智為相？由此智於一切處無有差別不分別我及法相故。",
    "見道差別": "　　復次若別說見道差別，謂世第一法無間，苦法智忍苦法智，苦類智忍苦類智，集法智忍集法智，集類智忍集類智，滅法智忍滅法智，滅類智忍滅類智，道法智忍道法智，道類智忍道類智，如是十六種，於諸聖諦中法類智忍及法類智，是見道差別相。",
    "親裡尋": "　　謂於親裡。欲令安樂。得勝朋伴。無有惱害。成就一切無惱害法。王臣愛重。國人敬慕。五穀豐熟。降澤以時。緣此等故。起心尋求遍尋求。乃至思惟分別。總名親裡尋。",
    "親近善士": "　　親近承事恭敬供養。如是名為親近善士。",
    "觀三摩地勝行成就神足者": "　　云何觀？云何三摩地？云何勝？云何勝行？而名觀三摩地勝行成就神足耶。此中觀者。謂依出家遠離所生善法所起。於法簡擇。極簡擇。最極簡擇。解了等了近了。機黠通達。審察聰睿。覺明慧行。毘缽舍那。是名觀。三摩地者。謂觀增上所起。心住等住。近住安住。不散不亂。攝止等持。心一境性。是名三摩地。勝者。謂觀增上所起八支聖道。是名勝。勝行者。謂有苾芻。依過去觀。得三摩地。是謂觀三摩地。彼成就觀三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說觀三摩地。總名觀三摩地勝行成就神足。\n　　復有苾芻。於諸善法。住不審觀。彼作是念。我今不應於諸善法住不審觀。然我理應於諸善法安住審觀。彼由此觀增上力故。得三摩地。是謂觀三摩地。彼成就觀三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說觀三摩地。總名觀三摩地勝行成就神足。\n　　復有苾芻。生起惡觀。彼作是念。我今不應生起惡觀。然我理應斷除惡觀修集善觀。彼由此觀增上力故。得三摩地。是謂觀三摩地。彼成就觀三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說觀三摩地。總名觀三摩地勝行成就神足。\n　　復有苾芻。生起貪瞋癡俱行惡觀。彼作是念。我今不應生起貪瞋癡俱行惡觀。然我理應斷除貪瞋癡俱行惡觀。修集無貪無嗔無癡俱行善觀。彼由此觀增上力故。得三摩地。是謂觀三摩地。彼成就觀三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說觀三摩地。總名觀三摩地勝行成就神足。\n　　復有苾芻。生起不離貪瞋癡惡觀。彼作是念。我今不應生起不離貪瞋癡惡觀。然我理應斷除不離貪瞋癡惡觀修集離貪瞋癡善觀。彼由此觀增上力故。得三摩地。是謂觀三摩地。彼成就觀三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說觀三摩地。總名觀三摩地勝行成就神足。\n　　復有苾芻。於諸善法。安住審觀。彼作是念。我於善法。安住審觀。甚為應理。彼由此觀增上力故。得三摩地。是謂觀三摩地。彼成就觀三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說觀三摩地。總名觀三摩地勝行成就神足。\n　　復有苾芻。生起善觀。彼作是念。我今生起如是善觀。甚為應理。彼由此觀增上力故。得三摩地。是謂觀三摩地。彼成就觀三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說觀三摩地。總名觀三摩地勝行成就神足。\n　　復有苾芻。生起無貪無嗔無癡俱行善觀。彼作是念。我今生起無貪無嗔無癡俱行善觀。甚為應理。彼由此觀增上力故。得三摩地。是謂觀三摩地。彼成就觀三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住。乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說觀三摩地。總名觀三摩地勝行成就神足。\n　　復有苾芻。生起離貪瞋癡善觀。彼作是念。我今生起離貪瞋癡善觀。甚為應理。彼由此觀增上力故。得三摩地。是謂觀三摩地。彼成就觀三摩地已。為令已生惡不善法斷故。起欲廣說乃至。為令已生善法堅住乃至持心。彼所有欲若勤若信。乃至若捨。是名勝行。即此勝行。及前所說觀三摩地。總名觀三摩地勝行成就神足。一切觀三摩地。皆從觀起。是觀所集。是觀種類。是觀所生。故名觀三摩地勝行成就神足。",
    "解脫": "　　解脫者，謂八解脫，廣說如經。云何有色觀諸色解脫？謂依止靜慮於內未伏見者色想，或現安立見者色想，觀所見色，住具足中若定若慧，及彼相應諸心心法，乃至為解脫變化障。有色者，謂於內身未依無色定伏除見者色想故，或見者色想，安立現前故。觀諸色者，謂以意解觀見好惡等色故。解脫者，謂能解脫一切變化障故。\n　　此八解脫亦名聖住，諸聖所住故，然諸聖者多依二住，謂第三第八以最勝故，是故經中於此二解脫有身作證具足住言，非餘由此二種，如其次第，有色無色解脫障斷無餘故，證得圓滿轉依故，說名最勝。\n　　解脫作何業？謂引發變化事，於淨不淨變化無有艱難，於寂靜解脫無有滯礙，能住第一寂靜聖住，由勝解思惟故。此中顯初二解脫能引發變化事，由第三解脫，於淨不淨變化無有艱難，由四無色解脫，於寂靜解脫無有滯礙，由最後解脫，能住第一寂靜聖住，由勝解思惟故者，顯如是如是勝解義是解脫義。",
    "解脫道": "　　解脫道者，謂由此道證斷煩惱所得解脫。所以者何？由此道能證煩惱永斷所得轉依故。勝進道者，謂為斷餘品煩惱所有方便無間解脫道，是名勝進道。所以者何？為斷此品後餘煩惱所有方便無間解脫道，望此品是勝進故名勝進道，又復棄捨斷煩惱方便，或勤方便思惟諸法，或勤方便安住諸法，或進修餘三摩鉢底諸所有道，名勝進道。又復者為顯餘義，捨斷煩惱諸方便道，但正思惟契經等法，或復於先所思所證法中安住觀察，或復進入餘勝品定，諸如是等名勝進道。又為引發勝品功德，或復安住諸所有道，名勝進道。所以者何？若為引發神通無量等諸勝品功德，或彼生已現前安住，如是等道名勝進道，如是已廣說修道相差別，今乘義勢更辯諸道修之差別。",
    "解脫門": "　　解脫門有三種，謂空、無願、無相。",
    "觸": "　　觸者，依三和合諸根變異分別為體，受所依為業，謂識生時所依諸根隨順生起苦樂等受變異行相，隨此行相分別觸生。",
    "觸緣受": "　　謂眼及色為緣生眼識。三和合故生觸。觸為緣生受。乃至意及法為緣生意識。三和合故生觸。觸為緣故生受。是名觸緣受。\n　　復次眼及色為緣生眼識。三和合故生觸。或順樂受。或順苦受。或順不苦不樂受。順樂受觸為緣生樂受。順苦受觸為緣生苦受。順不苦不樂受觸為緣。生不苦不樂受。乃至意及法為緣生意識。三和合故生觸。或順樂受。或順苦受。或順不苦不樂受。順樂受觸為緣生樂受。順苦受觸為緣生苦受。順不苦不樂受觸為緣。生不苦不樂受。是名觸緣受。\n　　復次如契經說。尊者慶喜。告瞿史羅長者言。眼界。色界。眼識界。自體各別。順樂受二為緣生眼識。三和合故生觸。名順樂受觸。此順樂受觸為緣生樂受。順苦受二為緣生眼識。三和合故生觸。名順苦受觸。此順苦受觸為緣生苦受。順不苦不樂受二為緣生眼識。三和合故生觸。名順不苦不樂受觸。此順不苦不樂受觸為緣。生不苦不樂受。余五三界。廣說亦爾。是名觸緣受。\n　　復次大因緣經中。尊者慶喜問佛。諸受為有緣不。佛言有緣。此緣謂觸。廣說乃至。若無眼觸。為有眼觸為緣。生內樂受苦受不苦不樂受不。不也世尊。乃至若無意觸。為有意觸為緣。生內樂受苦受不苦不樂受不。不也世尊。若全無觸為可施設。有諸受不。不也世尊。是故慶喜。諸受無不以觸為緣。是名觸緣受。如是諸受。觸為緣。觸為依。觸為建立。故起等起生等生。聚集出現。故名觸緣受。",
    "觸處": "　　謂觸為身。已正當覺。及彼同分。是名觸處。又觸為身增上發身識。已正當了別。及彼同分。是名觸處。又觸於身。已正當礙。及彼同分。是名觸處。又觸為身。已正當行。及彼同分。是名觸處。如是過去未來現在。諸所有觸。名為觸處。亦名所知。乃至所等證。\n　　此復云何？謂四大種。及四大種所造。滑性。澀性。輕性。重性。冷暖飢渴。及余所有身根所覺身識所了。所有名號。異語增語。想等想。施設言說。謂名觸。名觸界。名觸處。名彼岸。如是觸處。是外所攝。",
    "訓詞無礙解": "　　訓詞無礙解者，謂於諸方言音及訓釋諸法言詞無礙具足中若定若慧，餘如前說。諸方言音者，謂無量國邑各隨自想所起種種言音差別訓釋諸法。言詞者，謂可破壞故名世間，可變壞故名色如是等，若於是中通達無礙，名訓詞無礙解。",
    "記別": "　　記別者，謂於是處聖弟子等謝往過去，記別德失生處差別，又了義經說名記別，記別開示深密意故。",
    "記莂": "　　何等記莂？謂於是處聖弟子等謝往過去，記莂得失生處差別，又了義經說明記莂，記莂開示深密意故。",
    "詞": "　　詞有八種，謂八何詞、八若詞。",
    "詭詐": "　　謂多貪者。為得如前供養等故。往至他家作如是語。汝等今者善得人身。諸有誦持經律對法。善說法要。妙閑傳記。製造疏論。樂阿練若。樂但三衣。樂常旋禮。樂糞掃衣。樂行乞食。樂一缽食。樂一受食。樂一坐食。樂居樹下。樂居露地。樂處塚間。樂坐不臥。樂隨得坐。得不淨觀。得持息念。得四靜慮。得四無量。得四無色。得四聖果。得六通慧。得八解脫。此等賢聖。但入汝家。皆得汝等供養恭敬尊重讚歎。為作依怙。我之行德未減前人。今至汝家。固望同彼。是名詭詐。\n　　復有詭詐。謂多貪者。為得如前供養等故。往至他家作如是語。汝應於我如父母想。我亦於汝如男女想。自今已後。共為親眷。憂喜榮辱咸悉是同。先來世間。泛號於我。為沙門釋子。從今向去。皆悉稱我為汝家沙門。凡我所須資身眾具。衣藥等物。汝皆見供。汝若不能。我脫別往余敬信家。汝豈不辱。如是所作。種種不實。方便語言。總名詭詐。",
    "誅國及隨行　　是人說清淨": "　　今此頌中詮表世間共可極重罪惡文字，轉變密顯餘清淨義，何等世間共可極重罪惡？謂逆害尊人及大眾，尊人有二，一別二共。共又二種，一護世間，二應供養。別亦二種，謂父及母。護世間者，謂王應供養者，謂多聞梵志世間共許最清淨故，若總殺害名逆尊人，若誅國人及隨行畜生名害大眾，顯此義者名詮表世間共可極重罪惡文字。云何轉此文字密顯淨義？謂逆害父母等言，轉變密顯永斷愛等餘義故。所以者何？若愛若業，若有取識，戒見二取，眼等六處，及所行境，如其次第名母父等，法相似故，愛為發因，業為生因，由此能殖習氣種子類世間父，由此二因令有取識流轉不絕，於流轉時雖求解脫。然由二種非方便法障解脫得，謂妄計度清淨最勝，戒見二取猶如世間多聞梵志，恒妄計著最勝清淨，此有取識所依所緣六處境界，猶如世間國及隨行，若能永斷如是等法，當知是人最為清淨，又如經說：\n　　不信不知恩　　斷密無容處",
    "誑": "　　誑者，耽著利養貪癡一分，詐現不實功德為體，邪命所依為業。",
    "誑謂": "　　於他所以。偽斗偽斛偽秤。詭言施詫誑誘。令他謂實。諸誑等誑遍誑極誑。總名為誑。",
    "誓願差別": "　　誓願差別者，謂能通達一切有情與己平等，猶如自身誓願攝益故。",
    "調御士": "　　謂佛世尊。略以三種巧調御事。調御一切所化有情。一於一類。一向柔軟。二於一類。一向粗獷。三於一類。柔軟粗獷。云何如來於彼一類一向柔軟？謂為彼說此身妙行。此身妙行所感異熟。此語妙行。此語妙行所感異熟。此意妙行。此意妙行所感異熟。此天此人。此善趣。此樂世。此涅槃。是名如來於彼一類一向柔軟。云何如來於彼一類一向粗獷？謂為彼說。此身惡行。此身惡行所感異熟。此語惡行。此語惡行。所感異熟。此意惡行。此意惡行。所感異熟此地獄。此傍生。此鬼界。此險難。此惡趣。此墮落。是名如來於彼一類一向粗獷。云何如來於彼一類柔軟粗獷？謂於時時為說。身妙行。語妙行。意妙行。或於時時為說。身妙行語妙行。意妙行。所感異熟。或於時時為說。身惡行。語惡行。意惡行。或於時時為說。身惡行。語惡行。意惡行。所感異熟。或於時時為說。天人善趣。樂世涅槃。或於時時為說。地獄傍生。鬼界險難。惡趣墮落。是名如來於彼一類柔軟粗獷。如來於彼。以此三種巧調御事。如是調伏。如是止息。如是寂靜。如是令其無餘。永捨貪瞋癡等一切煩惱。如是令其無餘。永盡貪瞋癡等一切煩惱。令永調伏。令永止息。令永寂靜。得上調御。得勝調御。得勝淸涼。永除曲穢。善滅慢覆及諂垢濁。是故如來名調御士。",
    "諂": "　　諂者，耽著利養貪癡一分，矯設方便隱實過惡為體，障正教授為業。矯設方便隱實過惡者，謂託餘事以避餘事。障正教授者，由不如實發露所犯，不任教授故。",
    "諍": "　　諍有三種，謂貪、瞋、癡。由依止貪瞋癡故，執持刀杖興諸戰諍種種鬥訟，是故貪等說名為諍。",
    "論依": "　　論依者，謂依此立論略有二種，一所成立、二能成立。所成立有二，一自性、二差別。能成立有八種，一立宗、二立因、三立喻、四合、五結、六現量、七比量、八聖教量所成立。自性者，謂我自性法自性，若有若無所成立。",
    "論出離": "　　論出離者，謂觀察德失令論出離，或復不作，恐墮負處故不興論，設復興起能善究竟，又若知敵論非法器，時眾無德自無善巧不應興論，若知敵論是法器，時眾有德自有善巧方可興論。敵論非法器者，謂彼不能出不善處安置善處。時眾無德者，謂不淳質樂僻執有偏黨等。自無善巧者，謂於論體乃至論莊嚴中不善通達，與此相違名敵論者是法器等。",
    "論多所作法": "　　論多所作法者，謂略有三種，將興論端定所須法。何等為三？一善達自他宗，由此堪能遍興談論遍於言事而興論故。二無畏，由此堪能處一切眾而興論端。三辯才，由此堪能於諸問難皆善辯答。",
    "論決擇": "　　云何論決擇？略說有七種，謂義決擇、釋決擇、分別顯示決擇、等論決擇、攝決擇、論軌決擇、祕密決擇。",
    "論莊嚴": "　　論莊嚴者，謂依論正理而發論端深為善美，名論莊嚴。此復六種，一善自他宗、二言音圓滿、三無畏、四辯才、五敦肅、六應供。善自他宗者，謂於自宗他宗若文若義前後無間淳熟明解。言音圓滿者，謂善解聲論方起論端，離當所說言音過失，所發言音無雜亂等。無畏者，謂處大眾雖為無量僻執英俊結謀圍繞，所發言詞坦然無畏，辯才者謂言詞無滯。敦肅者，謂言無卒暴。觀敵論者，言詞究竟方乃發言。應供者，謂立性賢和發言溫善方便隨順，敵論者心。",
    "論處": "　　論處者，或於王家，或於執理家，或對淳質堪為量者，或對善伴，或對善解法義沙門婆羅門等而起論端。於王家者，謂若於是處王自降臨。執理家者，謂若是處處斷王事。淳質堪為量者，謂商人等。善伴者，謂於伴侶中立論者，敵論者不越其言。善解法義沙門婆羅門等者，謂於彼彼論中善通達文義。",
    "論議": "　　論議者，若於是處無有顛倒，解釋一切深隱法相，以無顛倒一切法相論議經等深隱義故。\n　　如是契經等十二分聖教三藏所攝，何等為三？一素怛纜藏，二毘奈耶藏，三阿毘達磨藏。此復有二，一聲聞藏，二菩薩藏。契經應頌記別諷頌自說，此五聲聞藏中素怛纜藏攝，緣起譬喻本事本生，此四二藏中毘奈耶藏并眷屬攝。緣起者，宣說有因緣建立諸學處，是正毘奈耶藏攝，譬喻等三，是彼眷屬攝，方廣希法，此二菩薩藏中素怛纜藏攝。方廣者，文義廣博正菩薩藏攝，希法差別難思廣大威德最勝相應，是故亦是菩薩藏攝，論議一種，聲聞菩薩二藏中阿毘達磨藏攝。問何故如來建立三藏？答為欲對治疑隨煩惱故，建立素怛纜藏，為欲斷除所化有情於種種法發起疑惑，宣說契經應頌等故，為欲對治受用二邊隨煩惱故，建立毘柰耶藏。二邊者，謂欲樂行邊，自苦行邊，對治受用者，遮彼受用畜積等故，開彼受用百千如法衣服等故，為欲對治自見取執隨煩惱故，建立阿毘達磨藏，處處廣釋諸法差別如實相故。復次為欲開示三種學故，建立素怛纜藏，所以者何？要依此藏所化有情解了三學，由此藏中廣開三種所修學故，為欲成立增上戒學增上心學故，建立毘柰耶藏，要依此藏二增上學方得成立，所以者何？廣釋別解脫律儀學道聖教為所依止，方能修治淨尸羅故，依淨尸羅生無悔等，漸次修學心得定故，為欲成立增上慧學故，建立阿毘達磨藏，要依此藏增上慧學方得成立，所以者何？由此藏中能廣開示簡擇諸法巧方便故。復次為欲開示正法義故，建立素怛纜藏，依止此藏文義易了故，為顯法義作證安足處故，建立毘柰耶藏，依止此藏能修二種作證學行故，毘柰耶是法義作證安足處，安足處者是所依義，為令智者論議決擇受用法樂住故，建立阿毘達磨藏，依止此藏諸有智者，更相問答論議決擇受法樂住，由此藏中以無量門開示諸法自相共相等真實法性故，如是三藏具有八萬四千法蘊，謂依聲聞乘，尊者阿難常所受持。問一一法蘊其量云何？答十百之數是法蘊量，十百者千數義，若爾何故不直說是千數耶？為顯建立一一法蘊千數因故，所以者何？初一數增以成十數，十數復增以成百數千等數量，因十百數方得成立，謂十百名千，百千名百千，百百千名俱胝，如是等一切後後數位決定用此十百二數隨一為因，是故此中唯總取十百兩數，以用建立一一法蘊由此數量總計八萬四千法蘊，成八俱胝四十洛叉。問如是三藏所攝法為誰所行境耶？答是聞思，修所生諸心心法所行境界，所行者是所緣義。",
    "論議決擇": "　　云何論議決擇？略說有七種，謂義決擇、釋決擇、分別顯示決擇、等論決擇、攝決擇、論軌決擇、祕密決擇。",
    "論負": "　　論負者，謂捨言言屈言過，由此三種諸立論者墮在負處受他屈伏。捨言者，謂自發言稱己論失，稱他論德，謂我不善汝為善等。言屈者，謂假託餘事方便而退，或說外事而捨本宗，或現忿怒憍慢覆藏等。如經廣說假託餘事方便退者，謂託餘事亂所說義，如經說，長老闡鐸迦與諸外道共論，或毀已立宗，或立宗已毀。言過者，略有九種，一雜亂，二麤獷，三不辯了，四無限量，五非義相應，六不應時，七不決定，八不顯了，九不相續。雜亂者，謂捨所論事廣說異言。麤獷者，謂憤發卒暴言詞躁急。不辯了者，謂所說法義眾及敵論所不領悟。無限量者，謂言詞重疊所說義理，或增或減。非義相應者，略有五種，一無義，二違義，三損理，四與所成等，五招集過難義，不可得故，義不相應故不決定故，能成道理，復須成故，一切言論非理非諦所隨逐故。不應時者，謂所應說前後不次。不決定者，謂立已復毀，毀而復立，速疾轉換難可了知。不顯了者，謂越闡陀論相不領而答，或典或俗言詞雜亂，不相續者謂於中間言詞斷絕。",
    "論軌決擇": "　　論軌決擇者略有七種，一論體、二論處、三論依、四論莊嚴、五論負、六論出離、七論多所作法，於此七門方便善巧名論軌決擇。",
    "論體": "　　論體者復有六種，一言論、二尚論、三諍論、四毀論、五順論、六教論。言論者，謂一切世間語言。尚論者，謂諸世間所隨聞論，世智所尚故。諍論者，謂互相違反所立言論。毀論者，謂更相憤怒發麤惡言。順論者，謂隨順清淨智見所有決擇言論。教論者，謂教導有情心未定者令其心定，心已定者令得解脫，所有言論。",
    "諦決擇": "　　云何諦決擇？謂四聖諦，苦諦、集諦、滅諦、道諦。",
    "諷頌": "　　諷頌者，謂諸經中以句宣說，或以二句或三或四或五或六。",
    "證得勝分別慧": "　　善知受生。善知受住。善知受滅。盡沒者。謂審觀受生。審觀受住。審觀受滅。盡沒於此。住念非不住念者。謂審觀受生時。具念正知。審觀受住時。具念正知。審觀受滅盡沒時。具念正知。及善想善知尋者謂審觀想尋生審觀想尋住。審觀想尋滅盡沒於此。住念非不住念者。謂審觀想尋生時。具念正知。審觀想尋住時具念正知審觀想尋滅盡沒時。具念正知。是名修。\n　　定者。云何為定？謂彼爾時。作如是念。我於諸法。應正思惟。不起不善法。起諸善法。不起無記法。起有記法。令不善法不久住。令諸善法得久住令無記法不久住。令有記法得久住。彼於爾時。亦觀察心。亦觀察心所法。彼觀察心心所法時。所起心住等住。乃至心一境性。總名為定。\n　　云何為修？謂於此定。若修若習。恆作常作。加行不捨。總名為修。若習若修若多所作者。謂於此定。能得自在。能令證得勝分別慧者。謂於此定。若習若修。若多所作。能令一切不善慧。非理所引慧。所有不善障礙定慧。皆悉破壞。捨置不起此相違慧。生長堅住。由此故說。能令證得。勝分別慧。即於此慧。得獲成就親近觸證。故名證得。復次審觀受想尋俱行心一境性。說名為定。即於此定。若修若習。恆作常作。加行不捨。說名為修。若習若修。若多所作。顯彼自在。能令證得勝分別慧。義如前說。",
    "證得和合智用差別": "　　證得和合智用差別者，謂證得最極清淨法界一味故，於彼能依一切種妙智用一一佛功能等一切佛功能故。",
    "證得殊勝智見": "　　於光明想善攝受等者。云何光明定加行？修何加行。入光明定。謂於此定。初修業者。先應善取淨月輪相。或復善取淨日輪相。或復善取藥物末尼諸天宮殿星宿光明。或復善取燈燭光明。或復善取焚燒城邑川土光明。或復善取焚燒山澤曠野光明。或復善取焚燒十擔。或二十擔。或三十擔。或四十擔。或五十擔。或百擔。或千擔。或百千擔。或無量百擔。或無量千擔。或無量百千擔。薪火光明。此火光明。熾盛極熾盛。洞然遍洞然。隨取一種光明相已。審諦思惟解了觀察勝解堅住。而分別之。\n　　彼於爾時。若心散亂。馳流余境。不能一趣。不能守念。令住一緣。思惟所取諸光明相齊此未名光明定加行。亦未名入光明定。\n　　彼若爾時攝錄自心。令不散亂馳流余境。能令一趣。住念一緣。思惟如是諸光明相。如是思惟。發勤精進。乃至勵意不息。是名光明定加行。亦名入光明定。\n　　彼於此道。生已修習多修習故。便令心住等住近住安住一趣等持無二無退。思惟如是諸光明相齊此名為已入光明定。而未名為光明定想。\n　　云何名為光明定想？謂即依止前光明定。思惟如前諸光明相。諸想等想。解了取像。已想當想。名光明定想。此光明定想。名光明想。於光明想。善攝受者。謂於此想。恭敬攝受。慇勤攝受。尊重攝受。思惟彼因彼門彼理彼方便彼行相。故名善攝受。\n　　善思惟者。謂數數起光明想已。數數思惟光明相想。善修習者。謂於此想。數習數修。數多所作。故名善修習。善通達者。謂於此想。等了審了。等審觀察。故名善通達。若晝若夜。無有差別者。謂如晝分。審諦思惟解了觀察勝解堅住分別。如前諸光明相。夜分亦爾。如於夜分。審諦思惟解了觀察勝解堅住分別。如前諸光明相。晝分亦爾。故名若晝若夜無有差別。若前若後。無有差別者。謂如對面審諦思惟解了觀察勝解堅住分別。如前諸光明相。背面亦爾。如於背面。對面亦爾。\n　　復次如於前時審諦思惟解了觀察勝解堅住分別。如前諸光明相。今時亦爾。如於今時。前時亦爾故名若前若後無有差別。若下若上無有差別者。謂如於下方審諦思惟解了觀察勝解堅住分別。如前諸光明相。於上方亦爾。如於上方於下方亦爾。故名若下若上無有差別。\n　　開心者。謂發起光明照了鮮淨俱行之心。\n　　離蓋者。謂遠離惛沉睡眠纏蓋心。\n　　用明瞭修照俱心者。謂修習光明照了鮮淨俱行之心。\n　　除闇昧心者。謂此心中。不起闇昧相。唯起光明相。如燈燭光照了除闇。\n　　修無量定者。謂修無量光明相定。是名修。\n　　定者。云何為定？謂即於光明。審諦思惟解了觀察勝解堅住分別所起心住等住。乃至心一境性。總名為定。\n　　云何為修？謂於此定。若修若習。恆作常作加行不捨。總名為修。若習若修。若多所作者。顯於此定能得自在。能令證得殊勝智見者。\n　　云何名為殊勝智見？謂於此定。若習若修。若多所作。至圓滿位。於舊眼邊。發起色界大種所造淸淨天眼。依此天眼。生淨眼識。依此眼識。能徧觀察前後左右上下諸色。如如色界大種所造淸淨天眼舊眼邊起。如是如是。生淨眼識。依此眼識。領受觀察彼彼諸色。是名此中殊勝智見。有作是說。由意淨故。勝解觀見。即人肉眼。變成天眼。名勝智見。今此義中。即前所說。淸淨眼識相應勝慧。說名為智。亦名為見。謂天眼識相應勝慧。領受觀察彼彼諸色。是名此中殊勝智見。彼於此定。若習若修。若多所作。能令證得殊勝智見。得獲成就親近觸證殊勝智見。故名證得。\n　　復次光明想俱行心一境性。說名為定。即於此定。若修若習。恆作常作。加行不捨。說名為修。若習若修若多所作。顯彼自在。能令證得殊勝智見。義如前說。",
    "證得現法樂住": "　　即於自身者。謂身亦名身。根亦名身。五色根亦名身。四大種所造聚亦名身。今此義中意說四大種所造聚名身。\n　　離生喜樂者。謂初靜慮所有喜樂平等受。受所攝身輕安心輕安。是名喜樂。如是喜樂。從離欲惡不善法。起等起。生等生。聚集出現。故名離生喜樂。滋潤遍滋潤。充滿徧充滿。適悅遍適悅者。謂即於自四大種所造聚身。離生喜樂。起等起。生等生。聚集出現。滋潤遍滋潤。是一義。充滿徧充滿。是一義。適悅遍適悅。是一義。由下中上。長養差別。譬如農夫。初以少水。溉灌畦壟爾時畦壟。滋潤遍滋潤。次以中水。灌溉畦壟。爾時畦壟充滿徧充滿。後以多水。溉灌畦壟。爾時畦壟。適悅遍適悅。苾芻亦爾。\n　　初以下品離生喜樂。長養大種所造聚身。爾時自身。滋潤遍滋潤。次以中品離生喜樂。長養大種所造聚身。爾時自身。充滿徧充滿。後以上品離生喜樂。長養大種所造聚身。爾時自身。適悅遍適悅離生喜樂。於自身中。無有少分而不充滿者。謂從足至頂。離生喜樂。作長養事。無不充滿。是名修定者。\n　　云何為定？謂即於自身離生喜樂。滋潤遍滋潤。充滿徧充滿。適悅遍適悅。故心住等住近住安住不散不亂攝止等持心一境性。總名為定。\n　　云何為修？謂於此定。若修若習。恆作常作。加行不捨。總名為修。若習若修。若多所作者。顯於此定。能得自在。能令證得現法樂住者。謂於此定。若習若修。若多所作。於現法中。證得樂住。可愛可樂。可欣可意。無所悕望。無所思慕。寂靜安隱故名樂住。於此樂住。得獲成就。親近觸證。故名證得。復次初靜慮所攝離生喜樂俱行心一境性。說名為定。即於此定若修若習。恆作常作。加行不捨。說名為修。若習若修。若多所作。顯彼自在。能令證得現法樂住義如前說。",
    "證得諸漏永盡": "　　於五取蘊。數數隨觀生滅而住等者。謂如實知色生及變壞。如實知受想行識生及變壞。是名修。\n　　定者云何為定？謂於五取蘊。數數隨觀生滅。而住所起心住等住。乃至心一境性。總名為定。\n　　云何為修？謂於此定。若修若習。恆作常作。加行不捨。總名為修。\n　　若習若修。若多所作者。顯於此定能得自在。\n　　能令證得諸漏永盡者。漏謂三漏。即欲漏、有漏、無明漏。彼於此定。若習若修。若多所作。能令三漏盡、等盡、遍盡、究竟盡。故名諸漏永盡。於此永盡。得獲成就親近觸證。故名證得。\n　　復次第四靜慮所攝淸淨捨念俱行。趣阿羅漢。無間道所攝心一境性。說名為定。即於此定。若修若習恆作常作。加行不捨說名為修。若習若修。若多所作。顯彼自在。能令證得。諸漏永盡。義如前說。",
    "識": "　　識者，謂六識身眼識乃至意識眼識者，謂依眼緣色了別為性。耳識者，謂依耳緣聲了別為性。鼻識者，謂依鼻緣香了別為性。舌識者，謂依舌緣味了別為性。身識者，謂依身緣觸了別為性。意識者，謂依意緣法了別為性。當知此中由所依故，所緣故自性故，建立於識。云何建立界？謂色蘊即十界眼等五根界，色等五境界及法界一分，受想行蘊即法界一分，識蘊即七識界，謂眼等六識界及意界。何故建立界處無別相耶？建立蘊中已說眼等各別相故，是故從諸蘊中出界建立，從諸界中出處建立。",
    "識界": "　　謂五識身。及有漏意識。是名識界。",
    "識緣名色": "　　謂有一類。貪瞋癡俱生識為緣故，起貪瞋癡俱生身業語業，名為色。即彼所生受想行識，名為名。是名識緣名色。\n　　復有一類。無貪無嗔無癡俱生識為緣故。起無貪無嗔無癡俱生身業語業，名為色。即彼所生受想行識，名為名。是名識緣名色。\n　　復次教誨那地迦經中，佛作是說。若那地迦所愛親友變壞離散，便生愁嘆苦憂擾惱。此愁俱生識為緣故，起愁俱生身業語業，名為色。即彼所生受想行識，名為名。是名識緣名色。\n　　復次教誨頗勒窶那經中，佛作是說。頗勒窶那識為食故，後有生起。此識云何？謂健達縛最後心。心意識增長堅住。未斷未徧知，未滅未變吐。此識無間。於母胎中與羯剌藍自體和合。此羯剌藍自體和合，名為色。即彼所生受想行識，名為名。是名識緣名色。\n　　復次教誨莎底經中，佛作是說。三事和合，入母胎藏。云何為三？謂父母和合俱起染心。其母是時調適。及健達縛，正現在前。如是三事和合。入母胎藏。此中健達縛最後心意識。增長堅住。未斷未徧知。未滅未變吐。此識無間。入母胎藏。此所託胎，名為色。即彼所生受想行識，名為名。是名識緣名色。\n　　復次大因緣經中，尊者慶喜問佛「名色為有緣不？」佛言「有緣。此緣謂識。」\n　　佛告慶喜「識若不入母胎藏者，名色得成羯剌藍不？」阿難陀曰「不也，世尊。」\n　　「識若不入母胎藏者。名色得生此界中不？」「不也，世尊。」\n　　「識若初時已斷壞者。後時名色得增長不？」「不也，世尊。」\n　　「識若全無為可施設有名色不？」「不也，世尊。」\n　　「是故慶喜，諸識皆以名色為緣，是名名色緣識。如是諸識，名色為緣，名色為依，名色為建立，故起等起生等生。聚集出現。故名名色緣識。」",
    "識蘊": "　　問識蘊何相？答了別相是識相，由此識故了別色聲香味觸法等種種境界。",
    "譬喻": "　　譬喻者，謂諸經中有比況說，為令本義得明了故，說諸譬喻。",
    "護法阿羅漢": "　　護法阿羅漢者，謂鈍根性，若遊散便可退失現法樂住，若不遊散即能不退住。",
    "變壞": "　　變壞者，謂捨壽時當知此中依相續位建立生等，不依剎那。",
    "變異相": "　　何等變異相？謂諸行異生由不相似相續轉故。",
    "貪": "　　謂於欲境。諸貪等貪。執藏防護。堅著愛樂迷悶。耽嗜遍耽嗜。內縛悕求。耽湎苦集。貪類貪生。總名為貪。",
    "貪慾": "　　謂於諸欲境。起欲樂欣喜。求趣悕望。是名貪慾。有作是說。於諸欲境。諸貪等貪。乃至貪類貪生。總名貪慾。",
    "貪慾蓋": "　　云何貪慾蓋？謂於諸欲諸貪。等貪執藏。防護堅著。愛樂迷悶。耽嗜遍耽嗜。內縛悕求。耽湎苦集。貪類貪生。總名貪慾。如是貪慾。覆心蔽心。障心纏心。隱心映心。裡心蓋心。故名為蓋。蓋即貪慾。故名貪慾蓋。",
    "貪行補特伽羅": "　　何等貪行補特伽羅？謂有猛利長時貪欲，如是瞋行癡行慢行，及尋思行補特伽羅，皆有猛利長時差別。",
    "資產興衰相": "　　何等資產興衰相？謂諸興善終歸衰變故。",
    "資糧道": "　　資糧道者，謂諸異生所有尸羅，守護，根門飲食知量初夜後夜常不睡眠勤修止觀正知而住。復有所餘進習諸善，聞思修所生慧修習此故，得成現觀解脫所依器性，謂諸異生所有尸羅，乃至正知而住等，是資糧道體，由彼修習淨尸羅等極圓滿故。復有所餘進習諸善者，謂無悔等由聞思等所生諸慧得成煖等，次第見諦永斷諸障，相續堪任性。",
    "質直行": "　　謂八支聖道。名為質直。所以者何。以八支聖道不迂不曲不回質直平坦一趣。佛弟子眾。於此中行。名質直行。",
    "起惡言": "　　謂有一類。若親教親教類。軌範軌範類。及余隨一尊重可信。往還朋友。如法告言。汝從今去。勿壞身業。勿壞語業。勿壞意業。勿行不應行處。勿親近惡友。勿作三惡趣業。如是教誨。稱法應時。於所修道。隨順磨瑩。增長嚴飾。宜便常委。助伴資糧。而彼有情。不欣不喜。不愛不樂。於師等言。違戾左取。而不右取。毀訾非撥。及於師等。起勃詈言。諸如是等名起惡言。",
    "起欲煩惱廣說乃至不離邪行": "　　謂起欲界婬貪現前。於不應行。招誘強抑。共為邪行。不厭遠離。如是名為起欲煩惱廣說乃至不離邪行。",
    "起欲者": "　　謂為斷已生貪慾蓋故。便起等起。及生等生。聚集出現。欲樂欣喜。求趣悕望。彼由生起此諸欲故。便斷已生諸貪慾蓋。發勤精進者。謂為斷已生貪慾蓋故。發勤精進。廣說乃至。勵意不息。彼由此故。便斷已生諸貪慾蓋。",
    "超一切種無所有處": "　　超一切種無所有處者。謂彼爾時。於無所有處想超越等超越故名超一切種無所有處。入非想非非想處具足住者。云何非想非非想處定加行？修何加行。入非想非非想處定。謂於此定初修業者。先應思惟。無所有處為粗苦。障次應思惟非想非非想處。為靜妙離。余廣說如空無邊處。",
    "超一切種空無邊處": "　　超一切種空無邊處者。謂彼爾時。於空無邊處想超越等超越。故名超一切種空無邊處。入無邊識識無邊處具足住者。云何識無邊處定加行修何加行？入識無邊處定。謂於此定。初修業者。先應思惟。空無邊處。為粗苦障。次應思惟。識無邊處。為靜妙離。余廣說如空無邊處。",
    "超一切識無邊處": "　　超一切識無邊處者。謂彼爾時。於識無邊處想超越等超越。故名超一切種識無邊處。入無所有無所有處具足住者。云何無所有處定加行？修何加行。入無所有處定。謂於此定初修業者。先應思惟。識無邊處為粗苦障。次應思惟。無所有處為靜妙離。余廣說如空無邊處。",
    "超諸色想": "　　云何諸色想？謂眼識相應想。等想現前等想。解了取像已想當想。總名色想有作是說與五識。相應想等想。乃至已想當想。總名色想。今此義中。唯眼識相。應想等想。乃至已想當想。總名色想。如是色想。爾時超越等超越。故名超諸色想滅。\n　　有對想者。云何有對想？謂耳等四識相應想等想。乃至已想當想。總名有對想。有作是說。瞋恚相應想等想。乃至已想當想。總名有對想。今此義中。耳等四識相應想等想。乃至已想當想。總名有對想。如是有對想。爾時斷徧知。遠離極遠離。調伏極調伏。隱沒除滅。故名滅有對想。\n　　不思惟種種想者。云何種種想？謂有蓋纏者。所有染污色聲香味觸想。所有不善想。所有非理所引想。所有障礙定想。總名種種想。彼想爾時。不復引發。不復憶念。不復思惟。不復已思惟。不復當思惟。故名不思惟種種想。\n　　入無邊空空無邊處具足住者。云何空無邊處定加行？修何加行。入空無邊處定。謂於此定。初修業者。先應思惟。第四靜慮為粗苦障。次應思惟空無邊處。為靜妙離。彼於爾時。若心散亂。馳流余境。不能一趣。不能守念。令住一緣。修空無邊處定齊此未名空無邊處定加行。亦未名入空無邊處定。彼若爾時攝錄自心。令不散亂。馳流余境。能令一趣。住念一緣。思惟修習空無邊處定相。如是思惟發勤精進。勇健勢猛。熾盛難制。勵意不息。是名空無邊處定加行。亦名入空無邊處定。\n　　彼於此道。生已修習多修習故。便令心住等住近住安住一趣等持無二無退。齊此名為已入空無邊處定。又此定中。諸心意識。名空無邊處定俱有心。諸思等思。乃至造心意業。名空無邊處定俱有意業。諸心勝解。已勝解。當勝解。名空無邊處定俱有勝解。又此定中。若受若想。乃至若慧等。名空無邊處定俱有諸法。如是諸法。亦名空無邊處定。",
    "趣苦滅道聖諦": "　　謂若道若聖行。於過去未來現在。苦能永斷。能棄捨。能變吐。能盡。能離染。能滅。能寂靜。能隱沒。此復是何謂八支聖道。則是正見正思惟正語正業正命正勤正念正定。云何正見？謂聖弟子。於苦思惟苦。於集思惟集。於滅思惟滅。於道思惟道。無漏作意相應。所有於法簡擇。極簡擇。最極簡擇。解了等了近了。機黠通達。審察聰睿。覺明慧行。毘缽舍那。是名正見。云何正思惟？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應所有思惟。等思惟近思惟。尋求。等尋求。近尋求。推覓。等推覓。近推覓。令心於法粗動而轉。是名正思惟。云何正語？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應思擇力故。除趣邪命語四惡行。於余語惡行所得無漏。遠離。勝遠離。近遠離。極遠離。寂靜律儀。無作無造。棄捨防護。船筏橋樑。堤塘牆塹。於所制約。不逾不逾性。不越不越性。無表語業。是名正語。云何正業？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應思擇力故。除趣邪命身三惡行。於余身惡行所得無漏。遠離乃至無表身業。是名正業。云何正命？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應思擇力故。於趣邪命身語惡行所得無漏。遠離乃至身語無表業。是名正命。云何正勤？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應所有勤精進。勇健勢猛。熾盛難制。勵意不息。是名正勤。云何正念？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應所有念。隨念專念憶念。不忘不失。不遺不漏。不失法性。心明記性。是名正念。云何正定？謂聖弟子。於苦思惟苦。乃至於道思惟道。無漏作意相應所有心住。等住。近住安住。不散不亂。攝止等持。心一境性。是名正定。如是所說八支聖道。及余無漏行。名趣苦滅道。如說聖行是真實。道究竟離苦趣涅槃。故如是聖行。名道諦者。謂此名聖行真實。是聖行此名為道。真實是道。若佛出世。若不出世。如是道法。法住法界。一切如來。自然通達。等覺宣說。施設建立。分別開示。令其顯了。謂此是聖行。此是道。此是聖行性。此是道性。是真是實。是諦是如。非妄非虛。非倒非異。故名道諦。名聖諦者。聖謂諸佛及佛弟子。此是彼諦。謂彼於此知見解了。正覺為諦。由是因緣。名趣苦滅道聖諦。復次趣苦滅道聖諦者。是假建立名想言說。謂趣苦滅道聖諦。過殑伽沙佛及弟子。皆共施設如是名故。",
    "身根": "　　謂身於觸。已正當覺。及彼同分。是名身根。又身增上發身識。於觸已正當了別。及彼同分。是名身根。又身於觸已正當礙。及彼同分。是名身根。又身於觸。已正當行。及彼同分。是名身根。如是過去未來現在諸所有身。名為身根。亦名所知。乃至所等證。此復云何？謂四大種所造淨色。或地獄。乃至中有。非修所成。所有名號。異語增語。想等想。施設言說。謂名身。名身處。名身界。名身根。名覺名道路。乃至名此岸。如是身根。是內處攝。\n　　\u0004 女根 謂女女體女性。女勢分。女作用。此復云何？謂臍輪下。膝輪上。所有肉身。筋脈流注。若於是處。與男交會。發生平等領納樂受。是名女根。",
    "身處": "　　謂如身根。應說其相。",
    "身證補特伽羅": "　　身證補特伽羅者，謂諸有學已具證得八解脫定，即不還果說名身證，由身證得八解脫定，具足住故。八解脫者，謂有色觀諸色等，後當廣說。",
    "軛": "　　軛有四種，謂欲軛、有軛、見軛、無明軛。障礙離繫是軛義，違背清淨故，此亦隨其次第習三求者相應現行。",
    "軟道": "　　軟道者，謂軟軟、軟中、軟上品道，由此道故，能捨三界所繫地地中上上上中上下三品煩惱。",
    "輕安覺支": "　　謂世尊說。慶喜當知。入初靜慮時。語言靜息。由此為緣。余法亦靜息。此名第一順輕安相。\n　　入第二靜慮時。尋伺靜息。由此為緣。余法亦靜息。此名第二順輕安相。\n　　入第三靜慮時。諸喜靜息。由此為緣。余法靜息。此名第三順輕安相。\n　　入第四靜慮時。入出息靜息。由此為緣。余法亦靜息。此名第四順輕安相。\n　　入滅想受定時。想受靜息。由此為緣。余法亦靜息。此名第五順輕安相。慶喜當知。\n　　復有第六上妙輕安。是勝是最勝。是上是無上。如是輕安。最上最妙。無餘輕安能過此者。此復是何。謂心從貪離染解脫。及從嗔癡離染解脫。此名第六順輕安相。思惟此相。所有無漏作意相應。諸身輕安。心輕安。輕安性。輕安類。總名輕安。亦名輕安覺支。是聖出世無漏無取道隨行道俱有道隨轉。能正盡苦。作苦邊際。諸有學者如所見諸行。思惟觀察。令至究竟。於諸行中深見過患。於永涅槃深見功德。若阿羅漢。如解脫心。思惟觀察令至究竟。所有無漏作意相應。諸身輕安。心輕安。輕安性。輕安類。是名輕安覺支。",
    "轉依差別": "　　轉依差別者，謂染不染一切種所依麤重永斷故，一切無上功德所依永轉故。",
    "轉變字門": "　　轉變字門者，謂若處顯示轉餘顯了字義變成餘義，如不信不知恩等伽他後當說。",
    "辯才無礙解": "　　辯才無礙解者，謂於諸法差別無礙具足中，若定若慧，餘如前說。諸法差別者，謂實有假有世俗有勝義有如是等，若於此中通達無礙，名辯才無礙解。",
    "近觀": "　　言近觀者。謂八支聖道。名為近觀。所以者何。以八支聖道修習多修習。能於苦集滅道。如實知見苦集滅道。故佛正法名為近觀。",
    "述可句": "　　述可句者，謂於所問順爾而答，以如是言述可所問。如有問言，諸無常者皆是行耶，設當是行皆無常耶，應述可答所問如是。",
    "退法阿羅漢": "　　退法阿羅漢者，謂鈍根性，若遊散若不遊散，若思惟若不思惟，皆可退失現法樂住。思惟者欲害自身，不思惟者不欲害自身，退現法樂住者，謂退世間靜慮等定。",
    "通達差別": "　　通達差別者，謂由補特伽羅法無我理增上法，方便所引出世間智，俱通達二無我故。",
    "造不動行已有隨不動識": "　　謂有一類。於空無邊處天。繫心悕求彼作是念。願我當生空無邊處天眾同分中。因此欣求。勤修加行。超諸色想。滅有對想。不思惟種種想。入無邊空空無邊處具足住。於此定中。諸思等思。現前等思。已思當思。思性思類。造心意業。名不動行。由此因緣。身壞命終。生空無邊處天眾同分中。於彼起識。是名造不動行已有隨不動識。有不繫心悕求生彼。但由無明蔽動心故。勤修加行。超諸色想。乃至造心意業。名不動行。由此因緣。身壞命終。生空無邊處天眾同分中。於彼起識。是名造不動行已有隨不動識。",
    "造福行已有隨福識": "　　謂有一類。於人趣樂。繫心悕求。彼作是念。願我當生人趣同分。與諸人眾。同受快樂。因此悕求。造能感人趣身語意妙行。此三妙行。名為福行。由此因緣。身壞命終。生於人趣。於彼起識。是名造福行已有隨福識。有不繫心悕求人樂。但由無明蔽動心故。造身語意三種妙行。此三妙行。名為福行。由此因緣。身壞命終。生於人趣。於彼起識。是名造福行已有隨福識。如說人趣。四大王眾天。乃至他化自在天。應知亦爾。復有一類。於梵眾天。繫心悕求。彼作是念。願我當生梵眾天眾同分中。因此悕求。勤修加行。離欲惡不善法。有尋有伺。離生喜樂。初靜慮具足住。於此定中。諸身律儀。語律儀命淸淨。名為福行。由此因緣。身壞命終。生梵眾天眾同分中。於彼起識。是名造福行已有隨福識。有不繫心悕求生彼。但由無明蔽動心故。勤修加行。離欲惡不善法。乃至命淸淨。名為福行。由此因緣。身壞命終。生梵眾天眾同分中。於彼起識。是名造福行已有隨福識。如說梵眾天。梵輔天乃至無想天。應知亦爾。",
    "造非福行已有隨非福識": "　　謂有一類。由貪瞋癡纏縛心故。造身語意三種惡行。此三惡行。名非福行。由此因緣。身壞命終。墮於地獄。於彼起識。是名造非福行已有隨非福識。如說地獄。傍生鬼界。應知亦爾。",
    "遍滿所緣": "　　遍滿所緣復有四種，謂有分別影像所緣、無分別影像所緣、事邊際所緣、所作成就所緣。有分別影像所緣者，謂由勝解作意，所有奢摩他毘鉢舍那所緣境界。無分別影像所緣者，謂由真實作意，所有奢摩他毘鉢舍那所緣境界。事邊際所緣者，謂一切法盡所有性如所有性，盡所有性者謂蘊界處。如所有性者，謂四聖諦十六行相真如，一切行無常，一切行苦，一切法無我，涅槃寂靜空無願無相。所作成就所緣者，謂轉依，如是轉依不可思議，十六行相中空攝幾行相，謂二，無願攝幾行相，謂六，無相攝幾行相，謂八。",
    "遍知等門": "　　遍知等門者，謂若處顯示依真實相宣說遍知相義，永斷相義，作證相義，修習相義，即此真實相等品類差別相義，能依所依相屬相義，遍知等障礙法相義，遍知等隨順法相義，於不遍知等及遍知等過失功德相義，此亦如愛味經廣說。真實相者，謂取蘊所攝苦諦相。遍知相者，謂即於此有味等如實知。永斷相作證相者，謂從一切世間得解脫，由永斷諸障證得轉依故。修習相者，謂離顛倒心多修習住，品類差別相者真實相有五種差別，謂色乃至識。遍知相有三種差別，謂味由味故，乃至出離由出離故。如實知永斷相作證相，各有二種差別，謂煩惱解脫，苦解脫，從此諸天世間乃至并天人皆得解脫者，顯煩惱解脫，為顯此差別義故，次說出離言，何以故？由餘經言，出離云何？謂若於是處貪欲永滅貪欲永斷，超過貪欲故，如是由能生未來苦煩惱得離繫故，苦亦解脫，為顯此差別義故，次說離繫縛極解脫，修習相有二種差別，謂見道修道。離顛倒心者顯示見道，多修習住者顯示修道，能依所依相屬相者謂顯示真實相等，為後後所依性。遍知等障礙法相者，謂如是三轉不如實知，遍知等隨順法相者，謂觀察如所安立色等法中味等相，於不遍知等過失相者，謂不解脫乃至不證覺無上正等菩提，與此相違名於遍知等功德相。",
    "遍知離欲": "　　何等遍知離欲？謂已得見道者，於三界法生厭背性。",
    "遍處": "　　遍處者，謂於遍滿住具足中若定若慧，及彼相應心心法，是名遍處，遍滿者其量廣大周普無邊。此復十種，謂地、水、火、風、青、黃、赤、白、無邊空處、無邊識處，皆悉遍滿。問何故於遍處建立地等？答由此遍處觀所依能依色皆遍滿故，若於此中不建立地等。遍處者，即離所依大種亦不能觀青等所造色為遍滿相，是故為觀所依能依皆悉遍滿建立地等，餘隨所應如解脫中說，謂無邊空處等。\n　　當知此中依解脫故造修，由勝處故起方便，由遍處故成滿，若於彼得成滿，即於解脫究竟。\n　　遍處作何業謂善能成辦解脫所緣？遍滿流布故。",
    "遍計所執相差別": "　　何等遍計所執相差別？謂於蘊界處中，遍計所執我，有情命者、生者、養者、數取趣者、意生者、摩納婆等。",
    "遍趣行智力": "　　遍趣行智力者，謂於一切種遍趣行智無著無礙現行中，所有三摩地等。",
    "過去": "　　云何過去？幾是過去？為何義故觀過去耶？謂自相已生故滅故，因果已受用故，染淨功用已謝故，攝因已壞故，果及自相有非有故，憶念分別相故，戀為雜染相故，捨為清淨相故，是過去義。因果已受用者，謂已生故已滅故，如其次第。染淨功用已謝者，謂如現在貪等信等令心染淨，功能無故。攝因已壞者，置習氣已方滅故。果及自相有非有者，謂於今時所引習氣有故，能引實事無故。憶念分別相者，謂唯有彼所緣境相故，一切一分是過去，除未來現在及無為故，為捨執著流轉我故，觀察過去。",
    "過去界": "　　謂過去五蘊。是名過去界。",
    "過慢": "　　謂於等謂己勝。或於勝謂己等。由此起慢。乃至心自取。總名過慢。云何慢過慢？謂於勝謂己勝。由此起慢。乃至心自取。總名慢過慢。",
    "道差別": "　　復次道差別有十一種，謂觀察事道、勤功用道、修治定道、現觀方便道、親近現觀道、現觀道、清淨出離道、依根差別道、淨修三學道、發諸功德道、遍攝諸道道，當知此中由覺分等差別故。建立十一種道如其次第謂三十七，菩提分法四種正行四種法迹，奢摩他毘鉢舍那三無漏根。觀察事道者，謂四念住，由此最初以不淨等行觀察一切身受心法事故。勤功用道者，謂四正斷，由遍觀察一切事已為斷諸障發勤精進故。修治定道者，謂四神足，如是淨除一切障已，復由欲勤心觀門修三摩地，令成調順堪任性故。現觀方便道者，謂信等五根，如是修治三摩地已，為欲證得無漏聖道，勤修增上緣煖頂方便故。親近現觀道者，謂信等五力，如是已得增上緣者，為欲無間通達諦理，修習摧伏不信等障，忍第一法近方便故。現觀道者，謂七覺支，由此最初各別內證覺真理故。清淨出離道者，謂聖八支道，由從此後為令修道所斷煩惱永得清淨修出離道故，由此道理菩提分法如是次第。依根差別道者，謂四正行，由依近分根本等地差別及利鈍根差別故，苦正行者依止未至及無色定，如其次第止觀劣故，樂正行者依止根本靜慮雙道轉故。二遲通者，謂鈍根依苦樂，二速通者，謂利根依苦樂。淨修三學道者，謂四法迹，由此淨修增上戒等三學故，無貪無恚能淨修治增上戒學，終不於貪欲瞋恚門毀犯所學處故，正念能淨修治增上心學，由不忘所緣持心令定故，正定能淨修治增上慧學，由心得定能，證如實智故。發諸功德道者，謂奢摩他毘鉢舍那，由此能成辦一切功德故。攝諸道道者，謂三無漏根，由此能攝初中究竟一切道故，未知欲知根攝方便道及見道，已知根攝修道，具知根攝究竟道。",
    "道諦": "　　云何道諦？謂由此道故知苦斷集證滅修道，是略說道諦相，今於此中依四聖諦以其作用顯道體相。\n　　又道有五種，謂資糧道、方便道、見道、修道、究竟道，如是五種依道自性及眷屬，以顯道諦差別。",
    "遮止句": "　　遮止句者，謂於所問不爾而答，以不爾言遮止所問。如有問言，蘊外諸行幾諦攝耶，應遮止答蘊外無行。",
    "遮止門": "　　遮止門者，謂若處顯示依止此事遮止此事，如斤柯喻經中，依止漏盡遮止四種補特伽羅，一處正法外，二處正法中，但得聞思便生喜足，三於修慧中心生怯弱，四資糧未滿。告諸比丘，我知我見我說漏盡，如是等一段經文遮止第一，不勤精進修習觀行者遮止第二，說斤柯喻遮止第三，說船筏喻遮止第四。",
    "邊執見": "　　邊執見者，於五取蘊等隨觀執，若常若斷，諸忍欲覺觀見為體，障處中行出離為業，處中行者，謂離斷常緣起正智。",
    "邪慢": "　　謂己無德。而謂有德。由此起慢。乃至心自取。總名邪慢。",
    "邪行": "　　邪行者，謂貪瞋二煩惱，迷境界及見起邪行，修道所斷見道所斷，隨其次第，貪瞋二種緣少淨相及相違相為境界故。名迷境界雖亦緣，有情起於貪瞋，然依境界門起故，亦名迷境界。慢迷有情及見起邪行，以於下劣等起計己勝等行於有情門邪解轉故，薩迦耶見邊執見邪見，迷所知境起邪行，依增益損減門，如其所應。見取戒禁取迷諸見起邪行，由於諸見過失取為第一及戒禁清淨故。疑迷對治起邪行，於諸諦中成二解故，無明迷一切起邪行。又十煩惱皆迷苦集起諸邪行，是彼因緣所依處故，所以者何？苦集二諦皆是十種煩惱因緣，又為依處，是故一切迷此因緣依處起諸邪行，又十煩惱皆迷滅道起諸邪行，由此能生彼怖畏故，所以者何？由煩惱力樂著生死，於清淨法起懸崖想生大怖畏。又諸外道於滅道諦，妄起種種顛倒分別，是故十惑皆迷滅道起諸邪行。",
    "邪見": "　　邪見者，謗因謗果，或謗作用，或壞實事，或邪分別，諸忍欲覺觀見為體，斷善根為業，及不善根堅固所依為業，不善生起為業，善不生起為業。謗因者，謂無施與無愛樂無祠祀無妙行無惡行等。謗果者，謂無妙行及惡行業所招異熟等。謗作用者，謂無此世間無彼世間，無母無父無化生有情等，誹謗異世往來作用故，誹謗任持種子作用故，誹謗相續作用故。壞實事者，謂無世間阿羅漢等。邪分別者，謂餘一切分別倒見。斷善根者，謂由增上邪見非一切種。",
    "鄔波索迦": "　　謂諸在家白衣男子。男根成就。歸佛法僧。起殷淨心。發誠諦語。自稱我是鄔波索迦。願尊憶持慈悲護念。齊是名曰鄔波索迦。",
    "鄔波索迦五學處": "　　鄔波索迦。有五學處。何等為五？乃至命終。遠離殺生。是名第一。乃至命終。離不與取。是名第二。乃至命終。離欲邪行。是名第三。乃至命終。離虛誑語。是名第四。乃至命終。離飲諸酒諸放逸處。是名第五。",
    "釋決擇": "　　何等釋決擇？謂能解釋諸經宗要，此復云何？略有六種，一所遍知事，二所遍知義，三遍知因緣，四遍知自性，五遍知果，六彼證受。又十四門辯釋決擇，何等十四？謂攝釋門、攝事門、總別分門、後後開引門、遮止門、轉變字門、壞不壞門、安立補特伽羅門、安立差別門、理趣門、遍知等門、力無力門、別別引門、引發門。",
    "釋詞": "　　釋詞者，謂諸菩薩所行布施，所以名施波羅蜜多者，謂由大施故離過故離垢故，名施波羅蜜多。大施者，盡捨一切內外事故，長時施故。離過者，遠離不平等追求等過故。離垢者，永斷一切所治慳故，如無盡慧經施無盡中說云何離垢？永斷所治并習氣故，如是三句顯波羅蜜多三種最勝，何等為三？一自體最勝并積習，二方便最勝，三果最勝。積習者，謂長時施故，如施波羅蜜多有三種，乃至慧波羅蜜多亦爾。戒等離過者，謂遠離我增益等隨其所應，如無盡慧經廣說。復次由與十二種最勝相應故，名波羅蜜多。何等名為十二最勝？一廣大最勝，不求一切世間樂故，又最上故。二長時最勝，經三大劫阿僧企耶所積習故。三所為最勝，為利益安樂一切有情故。四無盡最勝，由迴向大菩提究竟無盡故。五無間最勝，由得自他平等勝解令諸有情於施等波羅蜜多速圓滿故。六無難最勝，唯由隨喜他所行施等令波羅蜜多速圓滿故。七大自在最勝，由得虛空藏等諸三摩地令布施等波羅蜜多速圓滿故。八攝受最勝，無分別智所攝受故。九發起最勝，謂解行地中上品忍位所行施等波羅蜜多。十證得最勝，謂初地中所得施等波羅蜜多。十一等流最勝，謂餘八地中所行施等波羅蜜多。十二圓滿最勝，謂第十地及如來地所有施等波羅蜜多，如其次第菩薩圓滿故，佛圓滿故。復次最勝所作故，最勝所至故，名波羅蜜多，一切佛菩薩所為所到故。復次到所知彼岸故，名波羅蜜多，安住佛性故。復次濟度自他最極災橫故，名波羅蜜多，能令自他越度生死大苦海故。共詞已釋，不共今當說，能捨施者當來貧苦，能捨受者現在熱惱，故名為施。能令諸根永寂靜故，能趣清淨諸善趣故，能為清涼所依處故，說名為戒。隨其次第，能引守護諸根門故，是往清淨善趣因故，能為無悔等漸次乃至涅槃所依故，遠離一切忿熱灰故，遠離不捨怨害心故，顯發損者常安隱故，說名為忍。怨害心者，謂起報怨心。不捨者，謂不棄此心。能壞怨心名為損者，顯此無畏故名顯發，損者常安隱故，損害生長作用相應故名精進。損害作用相應者，謂前二正斷，以能損害不善法故。生長作用相應者，謂後二正斷，以能生長諸善法故，能持能息能靜能調，又能引發故名靜慮。能持者，謂於境繫心。能息者，謂息諸散亂。能靜者，謂令心寂靜。能調者，謂制伏諸纏。能引發者，謂能引發自在作用。他所發智故，內證智故，種別智故，得寂靜智故，勝德智故，名為慧。他所發智者，謂從他言音所生慧，及如理作意相應慧。內證智者，謂出世間慧。種別智者，謂出世間後所得慧。得寂靜智者，謂修道中治煩惱慧。勝德智者，謂能引發勝功德慧。",
    "金剛喻定": "　　云何金剛喻定？謂居修道最後斷結道位所有三摩地，或加行道攝，或無間道攝。加行道攝者，謂從此已去非一切障所礙能破一切障。無間道攝者，謂從此無間盡智無生智生。又此三摩地無間堅固一味遍滿，為顯此義薄伽梵說，如大石山無缺無隙無穴一段，極善圓滿十方猛風所不動轉。云何名為無間轉依？謂已證得無學道者三種轉依。何等為三？謂心轉依、道轉依、麤重轉依。",
    "長時差別": "　　何等長時差別？謂諸異生。",
    "阿羅漢": "　　略有二種阿羅漢性。一者有為。二者無為。云何有為阿羅漢性？謂彼果得。及彼得得。無學根力。無學尸羅。無學善根。十無學法。及彼種類諸無學法。是名有為阿羅漢性。云何無為阿羅漢性？謂貪瞋癡。一切煩惱皆悉永斷超一切趣。斷一切道。三火永靜。焦渴永息。憍逸永離。窟宅永破。度四瀑流。無上究竟。無上寂靜。無上愛盡。離滅涅槃。是名無為阿羅漢性。如來具足圓滿成就。如是所說有為無為阿羅漢性。故名阿羅漢。又貪瞋癡。及余煩惱。皆悉應斷。如來於彼。永斷徧知。如多羅樹永斷根頂無復遺余。皆得當來永不生法。故名阿羅漢。又身語意三種惡行。皆應永斷。如來於彼。永斷徧知乃至廣說。故名阿羅漢。又過去佛。皆已遠離惡不善法。所有雜染。後有熾然。苦異熟果。皆得當來永不生法。今佛亦爾。故名阿羅漢。又佛世尊。成就最勝吉祥功德。應受上妙衣服飲食諸坐臥具醫藥資緣種種供養。故名阿羅漢。如有頌言。\n　　世所應受用　　種種上妙物\n　　如來皆應受　　故名阿羅漢",
    "阿羅漢向者": "　　已得無間道。能證阿羅漢果。謂此無間證得最上阿羅漢果。或住不還果已。能進求阿羅漢果證。名阿羅漢向。",
    "阿羅漢向補特伽羅": "　　阿羅漢果向補特伽羅者，謂已永斷有頂八品煩惱安住彼道。",
    "阿羅漢果": "　　謂阿羅漢果。略有二種。一者有為。二者無為。所言有為阿羅漢果者。謂彼果得。及彼得得。無學根力。無學尸羅。無學善根。十無學法。及彼種類諸無學法。是名有為阿羅漢果。所言無為阿羅漢果者。謂於此中。貪瞋癡等。一切煩惱。皆已永斷。超一切趣。斷一切道。三火永靜。渡四瀑流。憍逸永離。燋渴永息。窟宅永破。無上究竟。無上寂靜無上愛盡。離滅涅槃。是名無為阿羅漢果。",
    "阿羅漢果者": "　　謂現法中。貪瞋癡等。一切煩惱。皆已永斷名阿羅漢果言。",
    "阿羅漢果補特伽羅": "　　阿羅漢果補特伽羅者，謂已永斷有頂第九品煩惱安住彼究竟道。問若阿羅漢永斷三界一切煩惱，何故但言永斷一切五順上分結得阿羅漢果耶？答最勝所攝故，云何最勝？由此五結是取上分因及不捨上分因故名最勝，所以者何？由色無色愛取欲界上色無色界生故，由掉慢無明不捨此上生故，以愛慢疑上靜慮者，為彼所惱故。",
    "除世貪憂": "　　於諸欲境諸貪等貪。執藏防護堅著。愛樂迷悶。耽嗜遍耽嗜。內縛悕求。耽湎苦集。貪類貪生。總名為貪。順憂受觸。所起心憂。不平等受。戚受所攝。總名為憂。彼觀行者。修此觀時。於世所起貪憂二法。能斷能徧知。遠離極遠離。調伏極調伏。隱沒除滅。是故說彼除世貪憂。\n　　云何於此內心住循心觀？若具正勤正知正念。除世貪憂。內心者。謂自心。若在現相續中。已得不失。於此內心。循心觀者。\n　　謂有苾芻。於此內心。觀察思惟內心諸相。\n　　於內有貪心。如實知是內有貪心。\n　　於內離貪心。如實知是內離貪心。\n　　於內有嗔心。如實知是內有嗔心。\n　　於內離嗔心。如實知是內離嗔心。\n　　於內有癡心。如實知是內有癡心。\n　　於內離癡心。如實知是內離癡心。\n　　於內聚心。如實知是內聚心。\n　　於內散心。如實知是內散心。\n　　於內沉心。如實知是內沉心。\n　　於內策心。如實知是內策心。\n　　於內小心。如實知是內小心。\n　　於內大心。如實知是內大心。\n　　於內掉心。如實知是內掉心。\n　　於內不掉心。如實知是內不掉心。\n　　於內不靜心。如實知是內不靜心。\n　　於內靜心。如實知是內靜心。\n　　於內不定心。如實知是內不定心。\n　　於內定心。如實知是內定心。\n　　於內不修心。如實知是內不修心。\n　　於內修心。如實知是內修心。\n　　於內不解脫心。如實知是內不解脫心。\n　　於內解脫心。如實知是內解脫心。\n　　如是思惟內心相時。所有於法簡擇。乃至毘缽舍那。是循內心觀。亦名心念住。成就此觀。現行隨行。乃至解行。說名為住。彼觀行者。能發起勤精進。乃至復能於此急疾迅速。名具正勤。彼觀行者。能起於法簡擇。乃至能圓滿極圓滿。名具正知。彼觀行者。具念隨念。乃至心明記性。名具正念。於諸欲境諸貪等貪。乃至貪類貪生總名為貪。順憂受觸。所起心憂。不平等受。戚受所攝。總名為憂。彼觀行者。修此觀時。於世所起貪憂二法。能斷能徧知。乃至隱沒滅除。是故說彼除世貪憂。",
    "陵蔑尋": "　　謂有一類。作是思惟。我之種姓。家族色力。工巧事業。若財若位。戒定慧等。隨一殊勝。恃此方他。而生陵蔑。由此等故。起心尋求遍尋求。乃至思惟分別。總名陵蔑尋。",
    "障法無畏": "　　障法無畏者，謂依止靜慮由利他門，於一切種說障礙法自稱德號建立具足中，若定若慧，餘如前說，如經言，又我為諸弟子說障礙法，染必為障，乃至廣說。",
    "障清淨差別": "　　障清淨差別者，謂永斷一切煩惱障所知障故。",
    "障礙": "　　障礙者，謂隨所數習諸煩惱故，隨所有惑皆得相續增長堅固，乃令相續遠避涅槃，此遍行因，非唯令相似煩惱增長。所以者何？若有隨習貪等煩惱，皆令瞋等一切煩惱相續增長堅固，由此深重縛故障解脫得，是故建立遍行因。",
    "隨信行補特伽羅": "　　隨信行補特伽羅者，謂資糧已具性是鈍根，隨順他教修諦現觀。",
    "隨法行": "　　八支聖道名隨法。佛弟子眾。於此中行。名法隨法行。又別解脫名法別解脫律儀名隨法。佛弟子眾。於此中行。名法隨法行。又身律儀語律儀命淸淨名法。受持此法名隨法。佛弟子眾。於此中行。名法隨法行。和敬行者。謂佛弟子眾。一戒一學。一說一別解脫。同戒同學。同說同別解脫。受具百歲。所應學處。初受具者。亦於中學。初受具者。所應學處。受具百歲。亦於中學。如受具百歲所應學法。初受具者。亦如是學。如初受具者所應學法。受具百歲。亦如是學。佛弟子眾。能於此中。一戒性。一學性。一說性。一別解脫性。同戒性。同學性。同說性。同別解脫性。名和敬行。又佛弟子眾。互相恭敬。互相推讓。於長宿者。起迎合掌。慰問禮拜。表相和敬。佛弟子眾。如是而行。名和敬行。隨法行者。謂八支聖道。名為隨法。佛弟子眾。於中隨順遊歷涉行。名隨法行。",
    "隨法行補特伽羅": "　　隨法行補特伽羅者，謂資糧已具性是利根，自然隨順諦增上法修諦現觀。",
    "隨煩惱": "　　隨煩惱者，謂所有諸煩惱皆是隨煩惱，有隨煩惱非煩惱，謂除煩惱所餘染污行蘊所攝一切心法。此復云何？謂除貪等六煩惱，所餘染污行蘊所攝忿等諸心法。又貪瞋癡名隨煩惱心法，由此隨煩惱隨惱於心令不離染令不解脫令不斷障故，名隨煩惱。如世尊說，汝等長夜為貪瞋癡隨所惱亂心恒染污。",
    "隨眠": "　　隨眠有七種，謂欲愛隨眠、瞋恚隨眠、有愛隨眠、慢隨眠、無明隨眠、見隨眠、疑隨眠。欲愛隨眠者，謂欲貪品麤重。瞋恚隨眠者，謂瞋恚品麤重。有愛隨眠者，謂色無色貪品麤重。慢隨眠者，謂慢品麤重。無明隨眠者，謂無明品麤重。見隨眠者，謂見品麤重。疑隨眠者，謂疑品麤重。若未離欲求者由欲愛瞋恚隨眠之所隨眠，由依彼門此二增長故，未離有求者由有愛隨眠之所隨眠，未離邪梵行求者由慢無明見疑隨眠之所隨眠，由彼眾生得少對治，便生憍慢，愚於聖諦，虛妄計度外邪解脫解脫方便，隨其次第三見二取，如結中說，於佛聖教正法毘柰耶中，猶豫疑惑。",
    "隨逐善": "　　何等隨逐善？謂即彼諸法習氣。",
    "隨逐無記": "　　何等隨逐無記？謂即彼戲論習氣。",
    "集諦": "　　云何集諦？謂諸煩惱及煩惱增上所生諸業，俱說名集諦，由此集起生死苦故。煩惱增上所生業者，謂有漏業，若爾何故？世尊唯說愛為集諦，由最勝故，謂薄伽梵隨勝而說，若愛，若後有愛，若貪喜俱行愛，若彼彼希樂愛，是名集諦。言最勝者是遍行義，由愛具有六遍行義，是故最勝。何等為六？一事遍行，謂於一切已得未得自身境界事遍行故，於已得自身起愛，於未得自身起後有愛，於已得境界起貪喜俱行愛，於未得境界起彼彼希樂愛。二位遍行，謂於苦苦性等三位諸行中遍隨行故，於已得苦苦性位起別離愛，於未得苦苦性位起不和合愛，於壞苦性位起不別離愛，及和合愛，已得未得差別故，於行苦性位起愚癡愛，由煩惱麤重所顯故，及不苦不樂受所顯故，唯阿賴耶識是最勝行苦位，依止此位因我癡門貪愛轉故。三世遍行，謂於三世中遍隨行故，於過去世起追憶行遍隨行愛，於未來世起希樂行遍隨行愛，於現在世起耽著行遍隨行愛。四界遍行，謂欲色無色三愛次第遍三界故。五求遍行，謂由貪愛遍求欲有邪梵行故，由欲求力不脫欲界招欲界苦，由有求力不脫二界招色無色界苦，由邪梵行求力不脫生死彼彼流轉故。六種遍行，謂有無有愛遍行斷常一切種故。",
    "集諦體相": "　　復次如是集諦總有四種行相，所謂因相、集相、生相、緣相。因相云何？謂能引發後有習氣因，是名因相，由業煩惱是能引發後有習氣因故。集相云何？謂彼彼有情所集習氣，於彼彼有情類為等起因，是名集相，由諸有情所集習氣，於人天等有情類中，能為相似形貌種類，平等起因故。生相云何？謂各別內身無量品類差別生因，是名生相，是諸有情各別內身，相續決定趣生地等，所有一切品類差別，乃至有頂生因故。緣相云何？謂諸有情別別得捨因，是名緣相，能令有情得未曾得，自體捨已，曾得自體故，如是名為集諦體相。",
    "離": "　　云何離？謂離欲。亦名離。離惡不善法。亦名離。出家亦名離。色界善根。亦名離。初靜慮亦名離。今此義中意。說初靜慮名離。",
    "離不與取": "　　即前所說鄔波索迦。於不與取。能善思擇。厭患遠離。止息防護。不作不為。不行不犯。棄捨堰塞。不拒不逆違不越。如是名為離不與取。",
    "離喜者，第三靜慮": "　　離喜者。云何喜？謂心欣極欣。乃至歡喜歡喜性。總名為喜。心於此喜。離染解脫。故名離喜。住捨正念正知者。彼於爾時。安住行捨正念正知。云何捨？謂離喜時。心平等性。心正直性。心無警覺寂靜住性。總名為捨。云何正念？謂離喜時。諸念隨念。乃至心明記性。總名正念。云何正知？謂離喜時。所起於法簡擇。乃至毘缽舍那。總名正知。身受樂者。身謂意身。由意身中。有受樂故。四大種身。亦得安適。由此因緣。名身受樂。此中樂者。謂離喜時。已斷身重性心重性。乃至身調柔性。心調柔性。總名為樂。此是受樂。非輕安樂。聖說應捨者。聖謂諸佛。及佛弟子。說謂宣說。分別開示勸修定者。應捨此樂。不應耽味。唯應住捨正念正知。第三者。謂此靜慮。順次數中。居第三故。復次此於九種次第定中。在第三故。靜慮者。謂在此定中。行捨正念正知身受樂。心一境性。總此五支。名第三靜慮。如有頌言。\n　　離喜最上跡　　捨念知樂定\n　　名第三靜慮　　諸佛所稱譽\n　　在此定中。諸心意識名第三靜慮。俱有之心。諸思等思。乃至造心意業。名第三靜慮。俱有意業。諸心勝解。已勝解。當勝解。名第三靜慮。俱有勝解。在此定中。若受若想。乃至若慧等。名第三靜慮。俱有諸法。如是諸法。亦得名為第三靜慮。此靜慮名。所依之義。具足及住。亦如前說。",
    "離欲": "　　復次有一分離欲、具分離欲、通達離欲、損伏離欲、永害離欲。一分具分離欲者，謂或依地離欲說，若於此地乃至能斷八品煩惱，是一分離欲。若已斷第九品，是具分離欲，或依薩迦耶離欲說，若有學位是一分離欲，若無學位是具分離欲。通達離欲者，謂由見道離欲。損伏離欲者，謂由世間道離欲。永害離欲者，謂由出世間道離欲。復有十種離欲，謂自性離欲、損害離欲、任持離欲、增上離欲、愚癡離欲、對治離欲、遍知離欲、永斷離欲、有上離欲、無上離欲。如是十種離欲當知，是違背義不必斷義，由自性故離欲名自性離欲，乃至由永斷故離欲名永斷離欲，如是諸句義分別種類應知。自性離欲者，謂於苦受及順苦受處法生厭背性。損害離欲者，謂習欲者暢熱惱已生厭背性。任持離欲者，謂飽食已於諸美膳生厭背性。增上離欲者，謂得勝處已於下劣處生厭背性，猶如世間已得城主等勝位已，於村主等下劣位生厭背心。愚癡離欲者，謂諸愚夫於涅槃界生厭背性，以不了達寂靜性故，及堅實著薩迦耶故。對治離欲者，謂由世出世道斷諸煩惱。遍知離欲者，謂已得見道者於三界法生厭背性，由遍了知行苦性已，厭背一切有漏事故。永斷離欲者，謂永斷地地諸煩惱已生厭背性。有上離欲者，謂諸世間聲聞獨覺所有離欲。無上離欲者，謂佛菩薩所有離欲，為欲利樂諸有情故。",
    "離欲惡不善法者": "　　云何欲？謂貪亦名欲。欲界亦名欲。五妙欲境亦名欲。今此義中。意說五妙欲境名欲。所以者何。以五妙欲極可愛故。極可醉故。極可欲故。極可樂故。極可貪故。極可求故。極可悶故。極可縛故。極可希故。極可系故。此中名欲。然五妙欲。非真欲體。真欲體者。是緣彼貪。如世尊說。\n　　世諸妙境非真欲　　真欲謂人分別貪\n　　妙境如本住世間　　智者於中已除欲",
    "離欲謂於諸欲": "　　云何離欲謂於諸欲？遠離極遠離。空不可得。故名離欲。",
    "離欲邪行": "　　於欲邪行。能善思擇。厭患遠離。止息防護。不作不為。不行不犯。棄捨堰塞。不拒不逆。不違不越。如是名為離欲邪行。",
    "離生喜樂": "　　云何離生喜樂？謂前喜樂。因離依離。離所建立。由離勢力起等起生等生。趣入出現。故說此名離生喜樂。",
    "離繫得": "　　離繫得者，謂於麤重離散，假立離繫得性。金剛喻定者，謂居修道最後斷結道位所有三摩地，此復略有二種，謂方便道攝、無間道攝。方便道攝者，謂從此已去不為一切障所礙而能破一切障。無間道攝者，謂從此無間盡智無生智生，又此三摩地無間堅固一味遍滿，云何此金剛喻定名無間？謂此相續流非世間行所間缺故，堅固者，非一切障所壞，能壞一切障，極堅猛故。一味者，無分別性純一味故。遍滿者，緣一切所知法共相真如為境故，為顯此義薄伽梵說，如大石山無缺無隙無穴一段，極善圓滿十方猛風所不動轉。無間轉依者，謂已證得無學道者所有三種轉依，何等為三？謂心轉依、道轉依、麤重轉依。心轉依者，謂已得無學道證得法性心自性清淨，永離一切客塵隨煩惱故，名為轉依，即是真如轉依義。道轉依者，謂昔世間道於現觀時轉成出世說名有學，餘有所作故，若永除一切所治，永離三界欲時，此道自體究竟圓滿，立為轉依。麤重轉依者，謂阿賴耶識一切煩惱隨眠永遠離故，名為轉依",
    "離虛誑語": "　　於虛誑語。能善思擇。厭患遠離。止息防護。不作不為。不行不犯。棄捨堰塞。不拒不逆。不違不越。如是名為離虛誑語。",
    "離飲諸酒諸放逸處": "　　於飲諸酒。能善思擇。厭患遠離。止息防護。不作不為。不行不犯。棄捨堰塞。不拒不逆。不違不越。如是名為離飲諸酒諸放逸處。",
    "靜慮": "　　此靜慮名。依何義立。謂能寂靜惡不善法。及余雜染。後有熾然。當苦異熟。生老死等諸有漏法。故名靜慮。復次寂靜種種惡不善法。及余雜染。後有熾然。當苦異熟。生老死等。有漏法已。此靜慮。起等起生等生。趣入出現。故名靜慮。復次寂靜種種惡不善法及余雜染後有熾然當苦異熟生老死等有漏法已。此靜慮。明盛徧照。故名靜慮。",
    "靜慮律儀所攝業": "　　靜慮律儀所攝業者，謂能損伏發起犯戒煩惱種子，離欲界欲者所有遠離，離初二三靜慮欲者所有遠離，是名靜慮律儀所攝身語業。性發起犯戒煩惱者，謂貪瞋等欲界所繫煩惱隨煩惱。能損伏彼種子者，謂由伏對治力損彼種子。離欲界欲者，謂由伏對治力，或少分離欲或全分離欲。所有遠離者，謂從彼犯戒所得遠離性。離初二三靜慮欲者，謂由遠分對治力，令彼發起犯戒煩惱所有種子轉更衰損，所以不說離第四靜慮欲者，由無色界麤色無故，略不建立色戒律儀。",
    "靜慮波羅蜜多相": "　　云何靜慮波羅蜜多相？謂諸菩薩安住菩薩法性菩提心為依止，以悲導心起一切種身語意業自在用時，所有一切心恒安住。",
    "靜慮解脫三摩地三摩鉢底智力": "　　靜慮解脫三摩地三摩鉢底智力者，謂於一切種靜慮解脫等持等至智具足中，若定若慧，餘如前說，由於一切種靜慮解脫等持等至智無著無礙現行中所有三摩地等為體故。",
    "非一切時同行相應": "　　復有非一切時同行相應，謂依止心，或時起信等善法，或時起貪等煩惱隨煩惱法。",
    "非學非無學": "　　云何非學非無學？幾是非學非無學？為何義故觀非學非無學耶？謂諸異生所有善不善無記法，及諸學者染污無記法，諸無學者無記法并無為法，是非學非無學義。諸異生者，謂除求解脫者，以彼於諸學處求修學故，即名有學，有學染污無記者，如其所應不善及有覆無記是染污，無覆無記是無記，八界八處全及餘蘊界處一分，是非學非無學，為捨執著不解脫我故，觀察非學非無學。",
    "非學非無學界": "　　謂有漏五蘊。及虛空擇滅非擇滅。是名非學非無學界。",
    "非已生": "　　云何非已生？幾是非已生？為何義故觀非已生耶？謂未來及無為法，是非已生義，一切一分是非已生，為捨執著常住我故，觀察非已生。又已生相違是非已生義。",
    "非律儀非不律儀業": "　　非律儀非不律儀業者，謂住非律儀非不律儀者所有善不善業，若布施愛語等業，若毆擊等業，律儀不律儀所不攝故，名非律儀非不律儀。",
    "非所斷": "　　云何非所斷？幾是非所斷？為何義故觀非所斷耶？謂諸無漏法除決擇分善，是非所斷。無漏法者，謂出世聖道及後所得并無為法，十界四處諸蘊一分，是非所斷。問何等色聲是非所斷？答無學身中善身語業自性，是非所斷，為捨執著成滿我故，觀察非所斷。",
    "非擇滅": "　　非擇滅者，謂是滅非離繫，不永害隨眠故。",
    "非有相": "　　何等非有相？謂蘊界處於一切時我我所性常非有故。",
    "非法貪": "　　謂於母女姊妹。及余隨一親眷。起貪等貪。執藏防護。堅著愛染。名非法貪。",
    "非福行": "　　謂諸不善身業語業。心心所法。不相應行。如是諸行。長夜能招不可愛不可樂不可欣不可意諸異熟果。此果名非福。亦名非福果。是非福業異熟果故。是名非福行。",
    "非苦似苦住大寂靜": "　　云何非苦似苦住大寂靜？謂已得究竟菩薩摩訶薩等，乘大悲願力故生諸有中。",
    "順前句": "　　順前句者，謂於諸法中隨取二法更互相問，依止前法以答所問。如有問言，若智亦所知耶，設所知亦智耶，此應作順前句答，諸智亦所知，有所知非智，謂餘法。",
    "順後句": "　　順後句者，謂即二法展轉相問，依止後法以答所問。如有問言，若所取亦能取耶，設能取亦所取耶，此應作順後句答，諸能取亦所取，有所取非能取，謂色等五境及法處。除相應二句者，謂於所問應二句答，不得有餘，如有依蘊建立依界建立。而發問言，若蘊數亦界數耶，設界數亦蘊數耶，此應作二句答，或蘊數非界數，謂色蘊識蘊何以故，無有一界全攝色蘊相，或全攝識蘊相故，或界數非蘊數謂法界。",
    "順逆": "　　順逆者，謂雜染順逆故，清淨順逆故，是說緣起順逆。雜染順逆者，或依流轉次第說謂無明緣行，如是等順次第說或依安立諦說，謂老死苦老死集老死滅老死趣滅行，如是等逆次第說。清淨順逆者，謂無明滅故行滅，如是等順次第說，由誰無故老死無，由誰滅故老死滅，如是等逆次第說，應如是觀緣生起義，一切皆是緣生，唯除法界法處一分諸無為法。為捨執著無因不平等因我故，觀察緣生。",
    "預流向補特伽羅": "　　豫流果補特伽羅者，謂住見道第十六心剎那位，即此見道，亦名入正性決定，亦名於法現觀。問誰於見道最後心位得初果耶？答若於欲界未離欲者，後入正性決定得預流果，謂次第者，雖少分離欲亦名未離欲，彼後入正性決定，至第十六心位得預流果。若倍離欲者後入正性決定得一來果，謂先用世間道已斷欲界修道所斷六品煩惱，名倍離欲，彼後入正性決定，至第十六心位得一來果。若已離欲者後入正性決定得不還果，謂先用世俗道已斷欲界修道所斷九品煩惱，名已離欲，彼後入正性決定，至第十六心位得不還果。問若已永斷見道所斷一切煩惱得預流果，何故但言永斷三結得預流果耶？答最勝所攝故，由此三種障解脫，得最為殊勝，所以者何？於解脫是不發趣因故，雖已發趣復為邪出離因故，及不正出離因故，由薩迦耶見執五取蘊為我我所深生愛樂故，於大苦聚不生厭背，於勝解脫無發趣心，或有眾生，雖已發趣解脫，然由戒禁取及疑，僻執邪道疑正道故，便邪出離及不正出離。又此三結是迷所知境因故，迷見因故，迷對治因故，所以者何？由薩迦耶見迷所知境，於大苦聚虛妄增益我我所相故，由戒禁取迷能知見，於顛倒見謂為清淨出離因故，由疑迷正對治，於三寶所不決定故。",
    "預流支": "　　由精進修法隨法行。所以能修法隨法行。由如理觀甚深妙義。所以能觀甚深妙義。由能恭敬聽聞正法。所以復能聽聞正法。由能親近供養善士。若能親近供養善士。便聞正法。聞正法已。便能如理觀深妙義。如理觀察深妙義已。便能進修法隨法行。既精進修法隨法行。便得趣入正性離生。如山頂上。天雨霖霪。先溪澗滿。溪澗滿已。小溝瀆滿。小溝瀆滿已。大溝瀆滿。大溝瀆滿已。小河滿。小河滿已。大河滿。大河滿已。大海滿。大海如是漸次方滿。聖道大海。亦復如是。要先親近供養善士。方聞正法。聞正法已。方能如理觀深妙義。如理觀察深妙義已。方能進修法隨法行。精進修行法隨法行得圓滿已。方得趣入正性離生。既得趣入正性離生。便名已生八支聖道。謂正見等。如前已說。如是四種。名預流支。\n　　能獲能得。能至隨至。能辦能滿。能觸能證。能作證故。名預流支。又此四種。於所求義。由修習多修習。能獲能得。能至隨至。能辦能滿。能觸能證。能作證故。名預流支。又此四種。於聖道流。能隨順能增長能嚴飾。能磨瑩。能為常安助資糧故。名預流支。又此四種。由語增語。由想等想施設言說。為預流支故。名預流支。",
    "預流果": "　　謂預流果。略有二種。一者有為。二者無為。所言有為預流果者。謂彼果得。及彼得得。有學根力。有學尸羅。有學善根。八有學法。及彼種類諸有學法。是名有為預流果。所言無為預流果者。謂於此中。三結永斷。及彼種類結法永斷。即是八十八諸隨眠永斷。及彼種類結法永斷。是名無為預流果。",
    "預流果者": "　　謂現法中。已於三結。永斷徧知。謂：有身見、戒禁取、疑。彼住此斷中。未能進求一來果證。名預流果。",
    "預流果補特伽羅": "　　復次如說預流補特伽羅，此有二種，一漸出離，二頓出離。漸出離者，如前廣說。頓出離者，謂入諦現觀已，依止未至定發出世間道頓斷三界一切煩惱，品品別斷唯立二果，謂預流果阿羅漢果。品品別斷者，謂先頓斷欲色無色界修道所斷上上品隨眠，如是乃至軟軟品。頓斷三界者，如見道所斷，非如世間道界地漸次品品別斷。此義以何為證？如指端經說，諸所有色乃至識，若過去若未來若現在，廣說乃至若遠若近，總此一切略為一分一團一積一聚，如是略已。應觀一切皆是無常一切皆苦，乃至廣說。依如是觀但可建立初後二果，由此二果如其次第，永斷三界一切見修所斷煩惱，無餘所顯故，不立第二第三兩果，由此二果已見諦者，唯斷欲界修道所斷，有餘無餘所顯故。又依如是頓出離者，如來於分別經中預流果無間即建立阿羅漢果，如是補特伽羅多於現法或臨終時善辦聖旨，設不能辦由願力故，即以願力還生欲界，出無佛世成獨勝果，設不辦者未能無餘離諸欲故，即以願力生欲界者，彼能速證般涅槃故。",
    "頻申欠呿": "　　謂身低舉手足卷舒。名曰頻申。鼻面開蹙。唇口喎張。名為欠呿。",
    "願智": "　　願智者，謂依止靜慮於為了所知願具足中，若定若慧，餘如前說。所以者何？由得願智者為欲了知所有三世等所應知事，先於彼彼事發正願心，願我如實了知如是如是，次入增上靜慮，從彼起已所願成滿，謂能了知所應知故。\n　　願智作何業？謂能善記別三世等事，一切世間咸所恭敬，由達一切眾所歸仰故。",
    "顯欲": "　　謂有一類。實是誦持經律對法。廣說乃至。得持息念。及得預流一來果者。但無名譽。人所不知。意欲令他。知有此德。因斯便獲供養恭敬尊重讚歎。為作依怙。又自實有出家遠離所生善法。而為他人。宣說開示顯己證得。如斯等類。總名顯欲。",
    "顯示差別": "　　何等顯示差別？謂諸佛及已得究竟菩薩摩訶薩所示現諸蘊界處。",
    "風界": "　　謂風界有二種。一內二外。云何內風界？謂此身內所有各別動性動類有執有受。此復云何？謂此身中。或上行風。或下行風。或傍行風。脅風背風。胸風肚風。心風臍風。嗢缽羅風。蓽缽羅風。刀風劍風。針風結風。纏風掣風。努風。強風。隨支節風。入出息風。復有所餘身內各別動性動類有執有受。是名內風界。云何外風界？謂此身外諸外所攝動性動類無執無受。此復云何？謂東風西風南風北風有塵風無塵風旋風暴風吠嵐婆風小風大風無量風風輪風依空行風。復有所餘動性動類無執無受。是名外風界。前內此外。總名風界。",
    "食": "　　云何食？幾是食？為何義故觀食耶？謂變壞故有變壞者，境界故有境界者，悕望故有悕望者，取故有取者，是食義。初是段食，由變壞時長養根大故。二是觸食，由依可愛境觸攝益所依故。三是意思食，由繫意悕望可愛事力攝益所依故。四是識食，由阿賴耶識執持力身得住故。所以者何？若離此識所依止身便爛壞故，三蘊十一界五處一分是食，為捨執著由食住我故，觀察食。又此四食差別建立略有四種，一不淨依止住食，謂欲界異生由具縛故。二淨不淨依止住食，謂有學及色無色界異生有餘縛故。三清淨依止住食，謂阿羅漢等解脫一切縛故。四示現住食，謂諸佛及已證大威德菩薩，由唯示現食力住故。",
    "食不調性": "　　謂以不食。或食過量。或食匪宜。而生苦受。總名食不調性。",
    "飲諸酒": "　　言諸酒者。謂窣羅酒。迷麗耶酒。及末沱酒。言窣羅者。謂米麥等。如法蒸煮。和麴糵汁。投諸藥物。醞釀具成。酒色香味。飲已惛醉。名窣羅酒。迷麗耶者。謂諸根莖。葉花果汁。不和麴糵醞釀具成。酒色香味。飲已惛醉。名迷麗耶酒。言末沱者。謂蒲萄酒。或即窣羅迷麗耶酒。飲已令醉。總名末沱飲諸酒者。謂飲咽啜。如上諸酒。名飲諸酒。",
    "餘心所法": "　　問何等名餘心所有法？答所謂作意觸欲勝解念三摩地慧信，慚愧無貪無瞋無癡勤安不放逸捨，不害貪瞋慢無明，疑薩迦耶見邊執見見取戒禁取邪見忿恨覆惱嫉慳誑諂憍害無慚無愧惛沈掉舉不信懈怠放逸忘念不正知散亂睡眠惡作尋伺，如是思等五十五法，若遍行若別境若善若煩惱若隨煩惱若不定，如其次第五五十一十二十四應知，又此諸心所有法若相若業，當廣分別。",
    "饒益善": "　　何等饒益善？謂以四攝事饒益一切有情。",
    "饒益無記": "　　何等饒益無記？謂如有一於自僕使妻子等所，以非穢非淨心而行惠施。",
    "饕餮": "　　謂有一類。分財利時。捨一取一。情貪無定。是名為饕。前後食時。往飲食所。嘗此歠彼。好惡不定。是名為餮。此即及前。總名饕餮。",
    "香": "　　香者，四大種所造鼻根所取義，謂好香，惡香，平等香，俱生香，和合香，變異香。當知此香三因建立，謂相故、損益故、差別故。俱生香者，旃彈那等。和合香者，謂和香等。變異香者，謂熟果等。",
    "香處": "　　謂香為鼻。已正當嗅。及彼同分。是名香處。又香為鼻。增上發鼻識。已正當了別。及彼同分。是名香處。又香於鼻。已正當礙。及彼同分。是名香處。又香為鼻。已正當行。及彼同分。是名香處。如是過去未來現在諸所有香。名為香處。亦名所知。乃至所等證。\n　　此復云何？謂四大種所造。根香莖香。枝香葉香。花香果香。好香惡香。平等香。及余所有鼻根所嗅。鼻識所了。所有名號。異語增語。想等想。施設言說。謂名香。名香界。名香處。名彼岸。如是香處。是外處攝。",
    "麤重": "　　云何名一切麤重，略說有二十四種，謂一切遍行戲論麤重，領受麤重，煩惱麤重，業麤重，異熟麤重，煩惱障麤重，業障麤重，異熟障麤重，蓋麤重，尋思麤重，飲食麤重，交會麤重，夢麤重，病麤重，老麤重，死麤重，勞倦麤重，堅固麤重，麤麤重，中麤重，細麤重，煩惱障麤重，障麤重，所知障麤重，如是二十四種略攝一切麤重。\n　　一切遍行戲論麤重者，謂執眼等諸法習氣無始時來依附阿賴耶識相續不斷，即此名為戲論習氣，從此習氣眼等諸法，及名言執數數生起。領受麤重者，謂有漏諸受習氣。煩惱麤重者，謂煩惱隨眠。業麤重者，謂有漏業習氣。異熟麤重者，謂異熟無堪能性。煩惱障麤重者，謂猛利長時煩惱性。業障麤重者，謂能障道無間等業障性。異熟障麤重者，謂與諦現觀相違，地獄等自體得。蓋麤重者，謂能障礙善品方便盛貪欲等性。尋思麤重者，謂能障礙欣樂出家欲尋思等性。飲食麤重者，謂極多少食於方便行無堪任性。交會麤重者，謂兩兩形交身心疲損性。夢麤重者，謂睡眠所發身惛劣性。病麤重者，謂諸界互違所發不安隱性。老麤重者，謂大種衰變所起不隨轉性。死麤重者，謂臨命終時諸根亂性。勞倦麤重者，謂遠行等所作支體頓弊性。堅固麤重者，謂無涅槃法者，如其所應，所有戲論麤重等性。麤中細麤重者，謂欲色無色所有麤重，如其次第。煩惱障麤重者，謂聲聞獨覺菩提所治。定障麤重者，謂九次第定所發功德所治。所知障麤重者，謂一切智性所治如是隨其所應，一切麤重永已息故，名究竟道，如說如是行者，心解脫圓滿，慧解脫圓滿，身麤重永息，由成就念為因故，於最初門善調善護善防善覆極善修治，謂於眼所識色乃至於意所識法亦爾。",
    "鼻根": "　　謂鼻於香。已正當嗅。及彼同分。是名鼻根。鼻根增上發鼻識。於香已正當了別。及彼同分。是名鼻根。又鼻於香。已正當礙。及彼同分。是名鼻根。又鼻於香。已正當行。及彼同分。是名鼻根。如是過去未來現在諸所有鼻。名為鼻根。亦名所知。乃至所等證。\n　　此復云何？謂四大種所造淨色。或地獄。乃至或中有。非修所成。所有名號。異語增語。想等想。施設言說。謂名鼻。名鼻處名鼻界。名鼻根。名嗅名道路。乃至名此岸。如是鼻根。是內處攝。",
    "鼻處": "　　謂如鼻根應說其相。"
}
