{
    "header": { "title": "法華大成音義", "author": "清 淨昇集" },
    "華嚴宗五祖": "一。帝心大師。帝心。號也。姓杜。諱法順。世間聾啞者。遇之必能聞能語。唐太宗詔謂之曰。朕苦勞熱。師之神力。何以蠲除。師曰。聖德御宇。微恙何憂。但頒大赦。聖躬自安。上從之。疾遂瘳。因賜號曰帝心。作法界觀門。專弘華嚴。二。雲華大師。雲華。寺名也。師居是寺。因以名之。姓趙。諱智儼。得帝心之親傳。以授賢首。其教大行。三。賢首大師。賢首。諡號也。姓康。諱法藏。其先康居國人。唐則天詔於太原寺。開華嚴宗旨。感白光自口而出。須臾成葢。萬衆懽呼。召對長生殿。指殿隅金獅子。以喻法界體用。而爲說法。則天領解。遂著其說。爲金師子章。四。清涼大師。清凉。號也。姓夏侯氏。諱澄觀。會稽人也。造華嚴大疏。唐德宗誕節。召對內殿。能以妙法清涼帝心。遂賜號清涼。憲宗問華嚴宗旨。豁然有得。加號大統清涼國師。文宗開成三年示寂。凡歷九朝爲七帝門師。九朝者。玄宗肅宗代宗德宗順宗憲宗穆宗敬宗文宗也。七帝者。卽代宗以下七帝也。五。圭峰大師。圭峰。終南山之別名也。師居是山。因得是號。姓何。諱宗密。果州西充入也。清涼甞謂之曰。毗盧華藏。能隨我遊者。其汝乎。遂著圓覺華嚴等疏鈔。唐文宗詔問佛法大意。賜號大德。至宣宗追諡定慧禪師。其詳見起信論會閱。今依三藏法數錄出。",
    "循循善誘": "論語。顏淵喟然歎曰。夫子循循然善誘人。博我以文。約我以禮。註云。循循。有次序貌。誘。引進也。博文約禮。教之序也。言夫子道雖高妙。而教人有序也。",
    "若萬派以朝宗": "尚書禹貢篇云。江漢朝宗于海。註云。春見曰朝。夏見曰宗。朝宗。諸侯見天子之名也。江漢合流于荆。去海尚遠。然水道已安。而無有壅塞橫決之患。雖未至海。而其勢已奔趨于海。猶諸候之朝宗于王也。見音現。",
    "似羣星而拱北": "論語。子曰。爲政以德。譬如北辰居其所。而衆星共之註云。政之爲言正也。所以正人之不正也。德之爲言得也。行道而有得於心也。北辰。北極。天之樞也。居其所。不動也。共。向也。言衆星四面旋繞。而歸向之也。",
    "率由舊章": "詩云。不愆不忘。率由舊章。註云。愆。過也。率。循也。章。典法也。所行不過差不遺忘者。以其循用舊典故也。詩大雅假樂之篇。又見孟子離婁章。假。詩作嘉。",
    "有教無類": "論語。子曰。有教無類。註云。人性皆善。而其類有善惡之殊者。氣習之染也。故君子有教。則人皆可以復於善。而不當復論其類之惡矣。",
    "善繼善述": "中庸。子曰。武王周公。其達孝矣乎。夫孝者。善繼人之志。善述人之事者也。註云。武王纘大王王季文王之緒。以有天下。而周公成文武之德。以追崇其先祖。此繼志述事之大者也。",
    "王道坦坦千古同規": "王者。貫三才。主萬物。無爲化世。有道恩民。坦坦者。平廣也。旣平且廣。千古之下孰不同規。見會玄記。",
    "梵音楚夏": "秦洛。謂之中華。亦云華夏。亦云中夏。淮南楚地。非是中方。楚洛言音。呼召輕重。今西域梵語。有似於斯。中天如中夏。餘四如楚蜀。見華嚴懸談。",
    "七十五法": "頌云。色法十一心法一。四十六箇心所法。一十四種不相應。三種無爲七十五。其詳見法數。",
    "部執不同": "二十部者。按異部宗輪論云。佛涅槃後。百有餘年。摩竭陀國。俱蘇摩城。王號無憂。統攝贍部。感一白葢。化洽人神。是時佛法大衆初破。謂因龍象邊鄙多聞大德四衆。共議無常苦空無我涅槃寂靜五事不同。分爲兩部。一大衆部。二上座部。從大衆部流出八部。合有九部。一大衆部。二一說部。三說出世部。四雞胤部。五多聞部。六說假部。七制多山部。八西山住部。九北山住部。從上座部分爲兩部。一說一切有部。二卽上座部。轉名雪山都。從說一切有部。展轉流出九部。共前根本兩部。成十一部。一說一切有部。二雪山部。三犢子部。四法上部。五賢胄部。六正量部。七密林山部。八化地部。九法藏部。十飲光部。十一經量部。共前九部。成二十部。見百法明門論贅言。",
    "初地卽爲八": "楞伽四卷云。初則爲八地。第九則爲七。七亦復爲八。第二爲第三。第四爲第五。第三爲第六。無所有何次。其義詳見科解。",
    "五法三自性八識二無我": "五法者。曰名。曰相。曰妄想。曰正智。曰如如。三自性者。曰緣起。曰妄想。曰成。八識者。前五識。第六意識。第七末那識。第八阿賴耶識。二無我者。人無我。法無我也。出楞伽經。",
    "記莂": "記莂者。謂授將來成佛之記。劫國名號之莂也。見大藏音釋。",
    "擔麻棄金": "昔有三人入山。各擔一擔麻。偶於中路。見無數布帛。一智者云。吾棄麻擔布帛。一愚者云。吾擔來路多。只是擔麻。往前不遠。又見白銀。智者棄布擔銀。愚者依舊擔麻。往前又見黃金。智者棄銀擔金。愚者依舊只是擔麻。自負所見。不肯從人者。大率如是。見彌陀演義。",
    "李山龍": "唐。左監門校尉。李山龍。於武德年中暴亡。而心上不冷如掌許。家人未忍殯殮。至七日而甦。自說云。當死時。被冥收至一官曹內。有囚數千人。受罪不一。吏將山龍至廳下。有天官問曰。汝在生作何福業。龍曰。鄉人每設齋講。恒施物同之。王曰。汝作何善業。龍曰。誦法華經兩卷。王曰善。可升階。山龍旣升。東北有高座。王曰。請法師升座。山龍遂坐。開經曰。妙法蓮華經序品第一。王曰。請法師止。下座復立階下。顧廳內囚已無一人。王謂山龍曰。君誦經之福。非惟自利。乃令囚衆。皆因聞經獲免。豈不善哉。乃至遊諸獄念佛皆空等事不錄。見法苑珠林第二十卷。",
    "釋道裕": "釋道裕。一云遺俗。常誦法華千有餘遍。以貞觀初。因病將終。囑友人慧廓曰。比雖誦經。意望靈驗。身死之後。不須露骸。埋之十載。屈爲發出。舌根爛不。審若不壞。爲起一塔。以示經感。言訖而終。依囑而埋。至貞觀十一年。廓與知友就墓開之。身肉皆盡。惟舌不朽。然後然起塔。出法苑珠林十八卷。又出續高僧傳。",
    "嚴法華": "嚴法華者。乃陳時揚州嚴恭是也。本泉州人。因領父親五萬錢。往揚州致貨。偶江中見一船黿。遂以五萬錢贖之。父母在家。昏夜中。見烏衣五十人。詣門送錢。錢皆小濕。後嚴恭還家。父母說客付錢之日。乃贖黿之日也。是知五十客。皆所贖之黿也。其後父子深信因果共往揚州起精舍。專寫法華經。因名嚴法華焉。出法苑珠林第十八卷。",
    "尼法信": "唐武德時。河東有尼法信。常誦法華。訪工書人。淨室寫經。然香薰衣。仍於寫經之室通外。加一竹筒。令寫經人出息於外。八年乃畢。龍門僧法端請講。開卷惟見黃紙。了無文字。卽送與尼。尼悲泣受。以香水洗函。沐浴頂戴。繞佛行道。七日七夜。旣而開視。文字如故。出法苑珠林第二十七卷。至於窓鷄聽法。立脫毛羽之狀。轉爲法師。躬遇普賢摩頂。山牛齅經。坐忘戴角之形。生作大臣。面會文殊點化。今不繁引。",
    "七種立題法": "一單人立題。如佛說阿彌陀等經。二單法立題。如大般涅槃等經。三單喻立題。如梵網等經。四人法立題。如文殊問般若等經。五法喻立題。如妙法蓮華等經。六人喻立題。如如來獅子吼等經。七具足立題。如大方廣佛華嚴等經。見四教儀集註。並三藏法數。",
    "五百比丘各說身因": "如五百比丘。問舍利弗。大德。佛說身因。何者是耶。舍利弗言。諸大德。汝等亦各得正解脫。自應識之。何緣方作如是問耶。有比丘言。大德。我未獲得正解脫時。意謂無明卽是身因。作是觀時。得阿羅漢果。復有說言。大德。我未獲得正解脫時。謂愛無明卽是身因。作是觀時。得阿羅漢果。或有說言。行。識。名色。六入。觸。受。愛。取。有。生。飲食。五欲。卽是身因。爾時五百比丘。各各自說己所解已。共往佛所。稽首佛足。右繞三帀。禮拜畢已。却坐一面。各以如上己所解義。向佛說之。舍利弗白佛言世尊。如是諸人誰是正說。誰不正說。佛告舍利弗。善哉善哉。一一比丘無非正說。出涅槃經三十五卷。又見五百弟子自說本起經。",
    "三十二士入不二門": "維摩經第二。入不二法門品。前有三十二菩薩。各說不二法門。後問文殊言。何等是入不二法門。文殊曰。如我意者。於一切法。無言無說。無示無識。離諸問答。是爲入不二法門。於是文殊問維摩言。我等各自說已。仁者當說何等是入不二法門。時維摩默然無言。文殊歎曰。善哉善哉。乃至無有文字語言。是爲真入不二法門。",
    "四句感應": "四句感應者。一者冥機冥應。二者冥機顯應。三者顯機顯應。四者顯機冥應。其義云何。若過去善修三業。現在未運身口。藉往善力。名爲冥機也。雖不現見靈應。而密爲法身所益。不見不聞。而覺而知。是爲冥益也。二冥機顯益者。過去植善而冥機已成。便得值佛聞法。現前獲利。是爲顯益。如佛初出世最初得度之人。現在何甞修行。諸佛照其宿機。自往度之。卽其義也。三顯機顯應者。現在身口。精勤不懈。而能感降。如須達長跪。佛往祇桓。月葢曲躬。聖居門閫。如卽行人道場禮懺。能感靈瑞。卽是顯機顯應也。四顯機冥應者。如人雖一世勤苦。現善濃積而不顯感。冥有其利。此是顯機冥益也。詳見法華玄義第六卷。",
    "三十六句感應": "三十六句感應者。前冥顯互論。略舉四句。若具足辨者。用四機爲根本。所謂冥機。顯機。亦冥亦顯機。非冥非顯機。冥是過去。顯是現在。冥顯是過現。非冥非顯是未來。如佛爲闡提說法。於一句中。復爲四句。所謂冥機冥應。冥機顯應。冥機亦冥亦顯應。冥機非冥非顯應。餘三機亦如是。四四卽成十六句。機旣召應。應亦有十六句。一機而感四應。一應而赴四機。機應各爲十六。合成三十二句。就前根本四句。便是三十六句也。詳見法華玄義第六卷。",
    "或是祥師安此名目": "元。道者山。雲峯寺。如意野老祥邁者。姓延氏。太原人也。九歲落紺。隨師受業。內窮三藏。外覈九流。名冠中華。聲聞朝野。曾與道士丘處機。李志常等。辯論真僞。於至元十八年。十月二十日。奉旨焚經。道經皆毀。由是佛日重輝。法雲廣布。曾著辯僞錄五卷。入藏流通。詳見本錄序。祥師曾注法華序。當時未有弘傳二字。故疏家。以爲祥師注序最先。故疑其安弘傳二字之名目也。",
    "關中記": "漢都長安。東有函谷關。南有嶤關武關。西有散關。北有蕭關。居四關之中。故名關中。見正字通。記者。誌也。乃長安之誌書也。",
    "溯其閥閱": "太史公曰。古者人臣。功有五品。以德立宗廟。定社稷。曰勳。以言曰勞。用力曰功。明其等曰閥。積日曰閱。出史記功臣表。溯。與泝㴑二字同。爾雅云。逆流而上曰泝洄。順流而下曰泝游。疏家引之。乃逆推宣師所自出。爲上古彭祖之後。然彭祖姓籛名鏗。後封於彭。故稱彭祖。嘗爲商賢大夫。今人稱世家。爲簪纓世胄。閥閱名門。彭。卽今徐州彭城是也。",
    "操觚續傳": "釋道宣。丹徒人。一云長城人。年至十五。依日嚴寺智頵律師受業。年滿從弘福寺智首律師受具。後從智師習律。纔聽一徧。方議修禪。頵師訶曰。夫適遐自邇。因微知章。修捨有時。功願須滿。未宜卽去律也。後晦迹終南。有處士孫思邈。與師相接。結林下之交。往來談論。終日不倦。甞築一壇。俄有長眉僧談道。知者以爲賓頭盧也。復有梵僧禮壇讚曰。自佛滅後。像法住世。興發毗尼。惟師一人也。故疏云。操觚續傳。後於西明寺行道。感天王之子張瓊。以佛牙授師。師遂付文綱掌之。然文綱。俗姓孔氏。會稽人也。後於崇聖寺。將佛牙建塔供養。詳見宋高僧傳。觚者。竹簡也。陸士衡文賦云。或操觚以率爾。今稱善作文者。謂之染翰操觚。",
    "樂記云": "故知禮樂之情者能作。識禮樂之文者能述。作者之謂聖。述者之謂明。明聖者。述作之謂也。註云。情。謂理趣之深奧者。知之悉。故能作。文。謂節奏之。宣著者。識之詳。故能述。出禮記樂記篇。",
    "唐虞曰載": "爾雅云。夏曰歲。商曰祀。周曰年。唐虞曰載。言載者。取物終更始之義。",
    "山河百二": "田肯賀高祖曰。陛下得韓信。又治秦中。秦形勝之國。帶山河之險。持戟百萬。秦得百二焉。言秦地險固。二萬人足當百萬人。齊得十二焉。言二十萬人。當百萬人。上曰善。出綱鑑。史記。秦形勝之國。帶山河之險。懸隔千里。持戟百萬。秦得百二焉。虞喜註云。二。倍也。秦地險固。百倍於天下。故云百二。葢言秦兵百萬。當諸侯兵三百萬也。",
    "邵平種瓜": "邵平。秦東陵侯也。秦滅平爲布衣。種瓜於長安城東。故世謂之東陵瓜。一云青門瓜。後賢詠詩曰。漢王提劒滅孤秦。亡國諸候盡是臣。惟有東陵能守節。甘作青門種瓜人。出漢史。並故事書。",
    "五胡亂華": "前趙劉淵。都平陽。後趙石勒。都襄陽。前秦苻堅。都長安。後秦姚萇。都長安。前燕慕容雋。據鄴。自惠帝後。有五凉。四燕。二趙。三秦。大夏。并蜀。共十六國。出鑑書。其詳又見東西晉。",
    "梓里": "詩云。維桑與梓。必恭敬止。註云。桑梓。二木名。古者五畝之宅。樹之墻下以遺子孫。給蠶食具器用者也。言桑梓父母所植。尚且必加恭敬。況父母至尊至親。宜莫不瞻依也。出詩經小雅。今稱故鄉。謂之梓里者。葢本諸此也。",
    "度人不減掬多": "第四祖優波毱多尊者。吒利國人也。在世化導證果最多。每度一人。以一籌置於石室。其室縱十八肘。廣十二肘。充滿其間。出傳燈錄。及禪宗正脉等。",
    "嵩高維嶽八句": "詩云。嵩高維嶽四方于宣。註云。賦也。山大而高曰崧。嶽。山之尊者。東岱。南霍。西華。北恒是也。駿。大也。甫。甫侯也。卽穆王時作呂刑者。或曰。此是宣王時人。而作呂刑者之子孫也。申。申伯也。皆姜姓之國也。翰。幹。蕃。蔽也。宣王之舅申伯。出封于謝。而尹吉甫作詩以送之。言嶽山高大。而降其神靈和氣。以生甫侯申伯。實能爲周之楨幹屏蔽。而宣其德澤於天下也。葢申伯之先。神農之後。爲唐虞四嶽。總領方嶽諸侯。而奉嶽神之祭。能修其職。嶽神享之。故此詩推本申伯之所以生。以爲嶽降神而爲之也。謝。在今鄧州南陽縣。",
    "接武": "堂上接武。堂下布武。疏曰。接武。足迹相接也。陳氏曰。文者。上之道。武者。下之道。故足在體之下。曰武。出禮記曲禮上篇。",
    "不龜手之樂": "惠子謂莊子曰。魏王貽我大瓠之種。我樹之成。而實五石。以盛水漿。其堅不能自舉也。剖之以爲瓢。則瓠落無所容。非不呺然大也。吾爲其無用而掊之。莊子曰。夫子固拙於用大矣。宋人有善爲不龜手之藥者。世世以洴澼絖爲事。客聞之。請買其方百金。聚族而謀曰。我世世爲洴澼絖。不過得數金。今一朝而鬻技百金。請與之。客得之。以說吳王。越有難。吳王使之將。冬與越人水戰。大敗越人。裂地而封之。能不龜手一也。或以封。或不免於洴澼絖。則所用之異也。今子有五石之瓠。何不慮以爲大樽。而浮于江湖。而憂其瓠落無所容。則夫子猶有蓬之心也夫。出莊子逍遙遊。",
    "四榮四枯": "佛於拘尸那城。娑羅雙樹間入滅。東西南北。各有雙樹。每面雙樹。一榮一枯。故名四榮四枯。以表凡夫二乘。常無常等八倒也。此四榮正表凡夫四倒。而言榮者。以凡夫由此四倒。增長惑業。有榮茂之義。故名四榮。一非常計常。二非樂計樂。三非我計我。四不淨計淨。四枯者。表二乘四倒也。而言枯者。以二乘觀無常苦空無我等。則煩惱有朽滅不生之義。故名四枯。一常計無常。二樂計非樂。三我計非我。四淨計不淨。見涅槃經。並三藏法數。",
    "顧命之誓誥": "書云。顧命。顧。還視也。成王將崩。命羣臣立康王。史序其事爲篇。謂之顧命者。鄭玄云。回首曰顧。臨死回顧而發命也。出書經顧命篇下小註。",
    "毗伽羅論": "章安涅槃經疏云。此云字本。河西道朗云。世間文字之根本。典籍音聲之論。宣通四辯。訶責世法。讚出家法。言詞清雅。義理深邃。雖是外論。而無邪法。將非善權大士之所爲也。三藏傳云。其音不正。正云毗耶羯剌諵。此翻爲聲名記論。以其廣記諸法能詮。故名聲名記論。見名義集。",
    "文軌出中庸": "今天下。車同軌。書同文。行同倫。註云。今。子思自謂當時也。軌。轍迹之度。倫。次序之體。三者皆同。言天下一統也。文。書名。",
    "伯牙絕絃": "列子云。伯牙善鼓琴。鍾子期善聽。伯牙鼓琴。志在高山。子期曰。善哉峩峩兮若泰山。志在流水。子期曰。善哉洋洋兮若江河。伯牙所念。子期必善得其意。伯牙遊於泰山之陰。卒逢暴雨。止於巖下。心悲。乃援琴而鼓之。初爲霖雨之操。更造崩山之音。音曲每奏。鍾子期輙窮其趣。伯牙乃捨琴而歎曰。善哉子之聽夫志。想象猶吾心也。吾於何以逃聲哉。莊子云。鍾子期死。伯牙終身不復鼓琴。文選。司馬遷報任安書云。葢鍾子期死。伯牙終身不復鼓琴。何則。士爲知己者用。女爲悅己者容。",
    "嘉會二字": "周易。文言曰。元者善之長也。亨者嘉之會也。利者義之和也。貞者事之幹也。註云。元者生物之始。天地之德莫先於此。故於時爲春。於人則爲仁。而衆善之長也。亨者生物之通。物至於此。莫不嘉美。故於時爲夏。於人則爲禮。而衆美之會也。利者生物之遂。物各得宜。不相妨害。故於時爲秋。於人則爲義。而得其分之和。貞者生物之成。實理具備。隨在各足。故於時爲冬。於人則爲智。而爲衆事之幹。幹。木之身。而枝葉所依以立者也。",
    "辯擬天女": "華嚴經二十九卷云。復次佛子。譬如自在天王。有天婇女。名曰善口。於其口中。出一音聲。其聲則與百千種樂而共相應。一一樂中。復有百千差別音聲。佛子。彼善口女。從口一聲。出於如是無量音聲。當知如來。亦復如是。於一音中。出無量聲。隨諸衆生。心樂差別。皆悉遍至。悉令得解。",
    "北方曰譯": "禮記王制篇云。五方之民。言語不通。嗜欲不同。達其志。通其欲。東方曰寄。南方曰象。西方曰狄鞮。北方曰譯。方氏曰。寄。言能寓風俗之異於此。象。言能倣象風俗之異於彼。鞮。則欲別其服飾之異。譯。則欲辨其言語之異。周禮有象胥氏。通四方之語。故四官通稱象胥氏。今俗謂之通士。然周禮。乃周公所作。爲周室一代設官分職之制。秦毀詩書。不用周禮。至漢求書始出。漢儒以考工記補之。宋代用以取士。今不用。",
    "若干": "禮記曲禮篇云。問天子之年。對曰。聞之始服衣。若干尺矣。註云。若。如也。未定之辭。數始於一。而成於十。干字从一从十故言若干。謂或如一。或如十。凡數之未定者皆可言。",
    "六種突吉羅罪": "大迦葉言。汝更有罪。佛意不聽女人出家。汝勸佛聽。是故佛之正法。五百歲而衰微。是汝突吉羅罪。阿難言。我憐愍憍曇彌。又三世諸佛。皆有四部弟子。我釋迦佛。云何獨無。迦葉復言。佛涅槃時。背痛敷臥。語汝須水。汝不供給。是汝突吉羅罪。阿難言。是時五百乘車。截流而渡。令水渾濁。是故不取。迦葉復言。佛問汝。若有人四神足好修。可住壽一劫。若減一劫。佛四神足好修。欲住壽一劫。若減一劫。汝默然不答。問汝至三。汝故默然。汝若答佛佛。四神足好修。應住一劫。若減一劫。由汝不答。令佛早入涅槃。是汝突吉羅罪。阿難言。魔蔽我心。是故無言。我非惡心。而不答佛。汝於一時。以鬱多羅僧襯身而臥。是汝突吉羅罪。迦葉復言。汝疊佛衣。以足蹈上。是汝突吉羅罪。阿難言。爾時有大風起。無人助我。墮我脚下。非不恭敬。故蹈佛衣。迦葉復言。佛陰藏相。般涅槃後。以示女人。是爲可耻。是汝突吉羅罪。阿難言。時我思惟。若女人見佛陰藏相者。便自羞耻女人身形。欲得男身修行佛相。種福德根。是故我示女人。不爲無耻而故破戒。迦葉言。汝有六種突吉羅罪。盡應僧中悔過。阿難言諾。隨長老大迦葉及僧所教。詳見智度論第二卷。善見律云。突者。惡也。吉羅者。作也。卽衆學法。僧尼各有一百。婆沙論云。何以此戒。獨名應當學。葢餘戒易持罪重。此戒難持易犯。常須念學。故不列罪名。但言應當學也。若依七聚而言。則身名惡作。口名惡說也。",
    "耳是五官之別": "五官者。耳目口鼻心也。言官者司也。耳目口鼻。各有所司。而皆受治于心也。見故事捷錄。",
    "祖述憲章": "中庸。仲尼祖述堯舜。憲章文武。註云。祖述者。遠宗其道。憲章者。近守其法。",
    "私淑": "孟子曰。予未得爲孔子徒也。予私淑諸人也。註云。私猶竊也。淑。善也。李氏以爲方言是也。人。謂子思之徒也。自孔子卒。至孟子遊梁時。方百四十餘年。而孟子已老。然則孟子之生。去孔子未百年也。故孟子言。予雖未得親受業於孔子之門。然聖人之澤尚存。猶有能傳其學者。故我得聞孔子之道於人。而私竊以善其身。葢推尊孔子。而自謙之辭也。見孟子離婁章。",
    "讀古": "桓公讀書於堂上。輪扁斵輪於堂下。釋椎鑿而上。問桓公曰。敢問公之所讀者。何言也。公曰。聖人之言也。曰。聖人在乎。公曰。已死矣。曰。然則公之所讀者。古人之糟魄已矣。公曰。寡人讀書。輪人安得議乎。有說則可。無說則死。扁曰。臣也。以臣之事觀之。斵輪。徐則甘而不固。疾則苦而不入。不徐不疾。得之於手。應之於心。口不能言。有數存焉於其間。臣不能喻臣之子。臣之子。亦不能受之於臣。是以行年七十而老斵輪。古之人與其不可傳者死矣。然則君之所讀者。古人糟魄已夫。精解云。餔糟魄者。豈知酒味。讀古人之遺書者。豈知道味哉。出莊子外篇。",
    "六甲": "甲子。甲寅。甲辰。甲午。甲申。甲戌。見世事通考。",
    "不依淨命": "舍利弗入城乞食。得已。向壁而坐。食時有梵志女。名淨目。見舍利弗問言。沙門汝食耶。答言食。淨目言。汝沙門下口食耶。答言不。仰口食耶。不。方口食耶。不。維口食耶。不。淨目言。食法有四種。我問汝。汝言不。我不解。汝當說。舍利弗言。有出家人。合藥種穀植樹等。不淨活命者。是名下口食。觀視星宿。日月風雨。不淨活命者。是名仰口食。曲媚豪勢。巧言多求。不淨活命者。是名方口食。學種種呪術。卜算吉凶。不淨活命者。是名維口食。姊。我不墮是四不淨食中。我用清淨乞食活命。淨目聞已。歡喜信解。舍利弗因爲說法。得證初果。出智度論第三卷。",
    "行五方便": "四念處爲一。卽身受心法。四善根爲四。卽四加行。不言五停者。未入正觀故。見文句記。",
    "長者園內樹耳多": "第十五祖。迦那提婆者。南天竺國人也。後得法於龍樹。旣得法已。至迦毗羅國。彼有長者。名梵摩淨德。一日園樹生耳。大如菌。味甚美。惟長者與第二子羅睺羅多。取而食之。取已復生。自餘親屬。皆不能見。祖知其宿因。遂至其家。長者問其故。祖曰。汝曾供養一比丘。然此比丘。道眼未明。虗霑信施。故報爲木菌。惟汝與子。精誠供養。得以享之。餘卽否矣。又問長者年多少。答曰。七十有九。祖乃說偈曰。入道不通理。復身還信施。汝年八十一。此樹不生耳。長者聞已。彌加歎伏。且曰。弟子衰老。不能事師。願捨次子。隨師出家。後爲十六祖焉。見傳燈錄。并禪宗正脉等。古德云。暖衣飽食意如何。爾將何德報檀那。合米農牛流血汗。寸絲千命下湯鍋。法王座下知音少。長者園中木耳多。今生犯禁迷真道。死後還他費力䭾。見寶訓珠類。",
    "名者實之賓也": "堯讓天下與許由曰。日月出矣。而爝火不息。其於光也。不亦難乎。時雨降矣。而猶浸灌。其於澤也。不亦勞乎。夫子立而天下治。而我猶尸之。吾自視缺然。請致天下。由曰。子治天下。天下旣已治也。而我猶代子。吾將爲名乎。名者實之賓也。吾將爲賓乎。鷦鷯巢於深林。不過一枝。偃鼠飲河。不過滿腹。歸休乎君。予無所用天下爲。庖人雖不治庖。尸祝不越樽爼而代之矣。由莊子內篇逍遙遊。",
    "佛作十種神變度之": "所謂毒龍不中。龍火不燒。恒水不溺。三方取果。北取粳糧。忉利取甘露。知嫌隱去。知念現來。火滅還然。斧舉不下。詳出瑞應經。",
    "焚得勝之殿": "帝釋與修羅戰勝。造得勝堂。莊嚴奇麗。目連往看。諸天女皆隱。避不出。目連念帝釋著樂。不修道本。乃以神通。焚得勝堂。仍爲帝釋說無常等法。帝釋歡喜。後堂儼然。無灰烟色見法華文句。",
    "止耆域之車": "目連以弟子病。上忉利天。以問耆婆。正值諸天入歡喜園。爾時目連在路側立。一切諸天無顧看者。耆婆後至。顧見目連。向舉一手。乘車直過。目連自念。此本人中。是我弟子。今受天福。以著天樂。都失本心。卽以神力。制車令住。耆婆下車。禮目連足。目連種種因緣。責其不可。耆婆答曰。以我人中爲大德弟子。是故舉手問訊。頗見諸天有爾者不。生天以著樂深。心不得自在。是使爾耳。目連語耆婆曰。有弟子病。當云何治。耆婆答言。唯以斷食爲本。出報恩經第六卷。",
    "如周公曰": "周公使其子伯禽。就封於魯。戒之曰。我文王之子。武王之弟。成王之叔。我於天下。亦不賤矣。然我一沐三握髮。一飯三吐哺。起以待士。猶恐失天下之賢人。子之魯國。慎勿以國驕人。見周史。並列國傳。",
    "歡喜丸": "本生經中。說釋迦佛。有二夫人。一名瞿毗耶。二名耶輸陀羅。瞿毗耶是寶女。故不孕。耶輸以佛出家。夜自覺妊。六年不產。諸釋詰言。菩薩出家。何由有此。耶輸言。我無他罪。我所懷子。實是太子體胤。諸釋言。何以久而不產。答言。非我所知。諸釋集議。王欲治罪。瞿毗耶白王。願寬恕之。待其子生。治之非晚。王卽寬置。佛六年苦行旣滿。初成佛時。其夜生羅睺羅。王見似父。愛樂忘憂。語群臣言。我子雖去。今得其孫。與子無異。王常請佛入宮食齋。是時耶輸持一鉢百味歡喜丸。與羅雲上佛。佛以神力。變五百羅漢如佛無異。羅雲以七歲身。持歡喜丸。徑至佛前。奉進世尊。佛攝神力。諸阿羅漢身復如故。空鉢而去。惟佛鉢滿。耶輸白王。以此證驗。我無罪也。卽問佛言。我有何因緣。懷妊六年。佛言。汝子羅雲。過去世時。曾作國王。時有五通仙人。來語王言。王法治賊。請治我罪。王言。汝有何罪。答言。我入王國。犯不與取。飲王水及楊枝。王言。我以水及楊枝。施及一切。何罪之有。答言。王雖如此。我心疑悔。罪不除也。王言。若必欲爾。小停。待我入還。王入宮中。六日不出。仙人在王園中。六日飢渴。仙人思惟。王正以此治我。過六日出。辭謝仙人。我便相忘。莫見咎也。以是因緣。故受五百世三惡道罪。五百世常六年在母胎中。見智度論十七卷。又見佛本行經。亦有經云。羅雲由過去。塞其鼠孔。禁鼠六日不出。故受胎六年。見法苑珠林第十卷。",
    "摩那埵": "善見律十四卷云。摩那埵。漢言折伏貢高。亦云下意。下意者。承事衆僧。二十僧中行。四分律云。摩那埵。此云意喜。謂比丘犯罪。隨順受罰。衆意生喜故。",
    "三從四德": "孔子曰。婦人。伏於人者也。是故無專制之義。有三從之道。在家從父。適人從夫。夫死從子。無所敢自遂也。出朱子小學。與禮記家語大同小異。四德者。婦德。貞順也。婦言。辭令也。婦容。婉娩。婦功。絲麻。出禮記昏義篇。",
    "破塵出經喻": "如有大經卷。量等三千界。在於一塵內。一切塵亦然。有一聰慧人。淨眼悉明見。破塵出經卷。普饒益衆生。佛智亦如是。徧在衆生心。妄想之所纏。不覺亦不知。諸佛大慈悲。令其除妄想。如是乃出現。饒益諸菩薩。出華嚴經五十一卷。",
    "罔象得珠說": "黃帝遊乎赤水之北。登乎崑崙之丘。而南望旋歸。遺其玄珠。使知索之而不得。使離朱索之而不得。使喫詬索之而不得。乃使罔象。罔象得之。黃帝曰。異哉。罔象乃可以得之乎。出莊子天地篇。",
    "神無方易無體": "周易。繫辭傳云。範圍天地之化而不過。曲成萬物而不遺。通乎晝夜之道而知。故神無方易無體。註云。此聖人知命之事也。範。如鑄金之有模範。圍。匡郭也。天地之化無窮。而聖人爲之範圍。不使過于中道。所謂裁成者也。通。猶兼也。晝夜。卽幽明生死鬼神之謂。如此然後可見至神之妙。無有方所。易之變化。無有形體也。",
    "聖人之大寶": "周易繫辭云。天地之大德。曰生。聖人之大寶。曰位。何以守位。曰仁。何以聚人。曰財。理財正辭禁民爲非。曰義。",
    "緣幢倒擲": "爾時世尊。告諸比丘。過去世時。有緣幢技師。肩上竪幢。語弟子言。汝等於幢上下向護我。我亦護汝。迭相護持。遊行嬉戲。多得財利。時技弟子。語技師言。不如所言。但當各各自愛護。遊行嬉戲。多得財利。身得無爲。安隱而下。技師答言。如汝所言。各自愛護。出雜阿含經二十四卷。",
    "踧踖與與": "論語。君在。踧踖如也。與與如也。註云。君在。視朝也。踧踖。恭敬不寧之貌。與與。威儀中適之貌。",
    "此興合宜": "詩經註云。比者。以彼物比此物也。興者。先言他物。以引起所詠之辭也。",
    "色究竟天": "智度論云。譬如從色界初際。下一丈石。經一萬八千三百八十三年。方至於地。",
    "發一言爲天下則三句": "中庸。是故君子。動而世爲天下道。行而世爲天下法。言而世爲天下則。註云。動。兼言行而言。道。兼法則而言。法。法度也。則。準則也。又云。故時措之宜也。註云。以時措之。而皆得其宜也。",
    "理出希夷": "視之不見。名曰夷。聽之不聞。名曰希。摶之不得。名曰微。註云。夷。無形也。希。無聲也。微。妙也。出道德經上篇。",
    "衆中之白眉": "蜀志。馬良。字季常。兄弟五人。皆以常爲字。惟良眉有白毫。兄弟皆賢。時人語云。馬氏五常。白眉最良。",
    "困於心橫於慮": "孟子曰。人恒過。然後能改。困於心。衡於慮。而後作。註云。恒。常也。猶言大率也。橫。不順也。作。奮起也。言中人之性。常必有過。然後能改。葢不能謹於平日。故必事勢窮蹙。以至困於心。橫於慮。然後能奮發而興起。出孟子告子章。衡。與橫同。",
    "玉轉璣旋": "在璿璣玉衡。以齊七政。註云。在。察也。美珠謂之璿。璣。機也。以璿餝璣。所以象天體之轉運也。衡。橫也。謂橫簫也。以玉爲管橫而設之。所以窺璣而齊七政之運行。猶今之渾天儀也。七政。日月五星也。出書經舜典。",
    "預侵二習": "預者進也。二習。卽見思家習耳。大經云。我衣我鉢。見習也。舍利弗嗔。畢陵伽慢。思習也。出四教儀集註。",
    "馬援傳": "居前不能令人輊。居後不能令人軒。軒。輕也。輕。重也。言爲人無所輕重也。出後漢馬援傳。",
    "觀妻妾如畵瓶": "出曜經云。昔有婬逸之人。意專女色。不能去離。家有知識道人往反。其婦白道人曰。我夫性多婬欲。恐不自濟。道人告曰。汝夫若近汝身者。便以此語其夫曰。須陀洹法。禮應爾耶。後果如言告之。其夫甚懷慚愧。內自思惟。我將不審是須陀洹乎。卽便息欲。婦問其夫。何故永息欲事。其夫遂彩畵好瓶。內盛糞穢。牢葢其口。令婦抱此。如我無異。婦依其語。抱瓶不離。其夫將瓶打破。告婦曰。汝何故抱此破瓶耶。婦言不爾。夫曰。我觀汝身。劇於此瓶。從頭至足三十六物。有何可貪處也。",
    "藏舟夜負": "夫藏舟於壑。藏山於澤。謂之固矣。然而夜半有力者。負之而走。昧者不知也。出莊子內篇大宗師。",
    "瓶穿雀飛": "佛說七女經云。雀來入瓶中。以縠覆其口。縠穿雀飛去。識心隨業走。又見彌陀演義。",
    "捨魚而取熊掌": "孟子曰。魚。我所欲也。熊掌。亦我所欲也。二者不可得兼。舍魚而取熊掌者也。註云。魚與熊掌。皆美味。而熊掌尤美也。",
    "屈九五之尊": "周易。九五。飛龍在天。利見大人。註云。剛健中正。以居尊位。如以聖人之德。居聖人之位。故其象如此。",
    "率土之濵": "詩云。溥天之下。莫非王土。率土之濵。莫非王臣。註云。賦也。溥大也。率循。濵涯也。言土之廣。臣之衆。出小雅北山之篇。",
    "心馳魏闕": "周禮。天官懸治象之法於象魏。又云。宮門雙闕懸法象。其狀巍然高大。曰象魏。又天子之門。謂之魏闕。",
    "飯糗茹草": "孟子曰。舜之飯糗茹草也。若將終身焉。註云。飯。食也。糗。乾糒也。茹。亦食也。言聖人之心。不以貧賤而有慕於外。不以富貴而有動於中。隨遇而安。無預於己。所性分定故也。出孟子盡心章。",
    "扣關擊節": "扣關。緊要處。難過而能過。擊節。阻隔處。不通而能通。謂扣其機關。擊其節要。見寶訓音義。",
    "近取諸譬": "論語。子曰。能近取譬。可謂仁之方也。已。註云。譬。喻也。方。術也。近取諸身。以己所欲。譬之他人。知其所欲。亦猶是也。",
    "運斤成風": "莊子送葬。過惠子之墓。顧謂從者曰。郢人堊漫其鼻端。若蠅翼。使匠石斵之。匠石運斤成風。聽而斵之。盡堊而鼻不傷。郢人立不失容。宋元君聞之。召匠石曰。嘗試爲寡人斵之。匠石曰。臣則嘗能斵之。雖然。臣之質死久矣。自夫子之死也。吾無以爲質矣。吾無與言之矣。出莊子雜篇。",
    "鵝珠": "昔有乞食比丘。到珠師舍。正逢彼匠爲王穿珠。見比丘來。歡喜持鉢。入家取食。比丘衣赤。日照光生。遙映寶珠。亦同赤色。有鵝在側謂肉便吞。比丘見之。遮護不及。珠師持鉢。盛滿食來。授與比丘。交謝而去。其人於後。覺少一珠。竊謂比丘盜去。卽追擒還。責言。汝旣釋子。何無廉耻。盜我王珠。答言。我無此事。其人竊念。若不苦治。珠不可得。便加拷打。觸處血流。鵝來囓血。其人恚怒。以杖擊之。鵝因致死。比丘便請看鵝死活。報言已死。比丘告曰。鵝吞汝珠。其人不信。比丘曰。我實見吞。彼遂持刀以剖鵝腹。果得其珠。其人慚耻。禮謝曰。何不早示。使我盲愚。苦楚尊身。造斯惡業。比丘曰。我受禁戒。寧捨身命。不傷蟻卵。若先示汝。必害其鵝。不護衆生。豈名持戒。出毗婆沙論。並大莊嚴論。",
    "草繫": "有諸比丘。曠野中行。爲賊劫奪。賊懼比丘往告聚落。盡欲殺之。賊中一人先曾出家。語同伴曰。比丘之法不得傷草。以草繫之。終不能往。卽以草繫。捨之而去。諸比丘等。恐傷草命。不敢動轉。時國王田獵。見而問曰。以何因緣。草繫不動。比丘答言。佛說草木。是鬼神村。敬佛語故。是以不動。王爲比丘。解其草縛。而後別去。出譬喻經第六卷。又見大莊嚴論。並法苑珠林。",
    "小不忍則亂大謀": "論語。子曰。巧言亂德。小不忍。則亂大謀。註云。巧言。變亂是非。聽之使人喪其所守。小不忍。如婦人之仁。匹夫之勇皆是。",
    "沂水濯纓": "有孺子歌曰。滄浪之水清兮。可以濯我纓。滄浪之水濁兮。可以濯我足。註云。滄浪。水名。纓。冠系也。出孟子。",
    "藻梲奇節": "論語。子曰。藏文仲居蔡。山節藻梲。何如其知也。註云。節。柱頭斗拱也。藻。水草名。梲。梁上短柱也。葢爲藏龜之室。而刻山於節畫藻於梲也。當時以文仲爲知。孔子言。其不務民義。而諂凟鬼神如此。安得爲知。",
    "巧奪輪奐": "晉獻文子成室。晉大夫發焉。張老曰。美哉輪焉。美哉奐焉。歌於斯。哭於斯。聚國族於斯。註云。輪。輪囷高大也。奐。奐爛衆多也。出禮記檀弓下。",
    "油然作雲": "孟子曰。七八月之間旱。則苗槁矣。天油然作雲。沛然下雨。則苗浡然興之矣。註云。周七八月。夏五六月也。油然。雲盛貌。沛然。雨盛貌。浡然。興起貌。出孟子書。",
    "黃粱一夢": "異聞集。呂翁經邯鄲道上。邸店中。有少年盧生。自歎貧困。言訖思睡。主方炊黃粱。翁探囊中一枕。以授生曰。枕此。卽榮遇如意。生枕之。夢至一國。功名得意。身歷富貴。五十餘年。老病而卒。欠伸而寤。呂翁在傍。主人炊黃粱猶未熟。生謝曰。先生以此。窒吾之欲。",
    "山中七日": "漢永平五年。剡縣劉晨阮肇。共入天台山。迷不得返。遙望山上有一桃樹。大有子實。攀藤而上。各噉數枚復下山持杯取水。至一溪邊。有二女子。見而笑曰。劉阮二郎。來之何晚。因邀洞中。酒肉飲樂。遂成夫婦。及其歸家。無相識者。問得七世孫。傳聞上世入山。迷不得歸。至晉太元八年復去。不知何所。出幽明錄。又見法苑珠林。與續齊諧記大同小異。",
    "青出於藍": "荀子書云。學不可已。青出於藍而青於藍。氷生於水而寒於水。",
    "波羅奢華": "章安云。此是樹名。其葉青色。華有三色。日未出時則黑色。日正照時則赤色。日沒時則黃色。今取赤色。如血義耳。見名義。集。",
    "指窮於爲薪": "莊子內篇養生主云。指窮於爲薪。火傳也。不知其盡也。憨山大師註云。形雖化而性常存。如薪盡而火存。有形相禪。如薪火相傳。是以生生而不已。化化而無窮。故如薪火之傳。不知其盡也。一雨大師註云。其可盡者薪。其不可盡者火。有盡者形。無盡者神。薪有盡而火無窮。形有盡而神不滅也。",
    "彌勒真彌勒": "明州奉化縣。布袋和尚。將示滅於嶽林寺。偈曰。彌勒真彌勒。其詳見傳燈錄。並五燈會元。指月錄。",
    "申申夭夭": "論語。子之燕居。申申如也。夭夭如也。註云。燕居。閑暇無事之時。申申。其容舒也。夭夭。其色愉也。此弟子善形容聖人處也。",
    "小知不及大知": "莊子逍遙遊云。小知不及大知。小年不及大年。奚以知其然也。朝菌不知晦朔。蟪蛄不知春秋。此小年也。",
    "南嶽大師": "慧思。姓李。武津人。常夢梵僧。勸令出俗。遂辭親入道。自光州大蘇山。徑趨南岳。學徒甚衆。師患無水。忽見巖下潤。以鍚卓之。果得一泉。猶未周續。有二虎引師登嶺。哮吼跑泉。今虎跑泉是也。又於石下得遺骨。遂乃建塔。今三生塔是也。師常爲衆講般若法。正當南岳中心。今般若寺是也。因志公傳語曰。何不下山教化衆生。目視雲漢作甚麼。師曰。三世諸佛。被我一口吞盡。更有甚麼衆生可化。道風旣盛。名稱普聞。臨終泯然而逝。其詳見續高僧傳。並神僧傳。呼十如等言。見玄義第二卷。",
    "望望而去": "孟子曰。伯夷。推惡惡之心。思與鄉人立。其冠不正。望望然去之。若將凂焉。註云。望望。去而不顧之貌。凂。汙也。出孟子公孫丑章。",
    "黃流不注瓦缶": "詩云。瑟彼玉瓚。黃流在中。豈弟君子。福祿攸降。註云。興也。瑟。縝密貌。玉瓚。圭瓚也。以圭爲柄。黃金爲勺。青金爲外。而朱其中也。黃流。鬱鬯也。釀秬黍爲酒。築鬱金煑而和之。使芬芳條鬯。以瓚酌而祼之也。收所。降下也。言瑟然之玉瓚。則必有黃流在其中。豈弟之君子。則必有福祿下其躬。明寶器不薦於褻味。而黃流不注於瓦缶。則知盛德必享於福壽。而福澤不降於淫人矣。出大雅文王之篇。",
    "未得患得": "論語。子曰。鄙夫可與事君也與哉。其未得之也。患得之。旣得之。患失之。苟患失之。無所不至矣。",
    "狐假虎威": "史。楚王問群臣。北方畏昭奚恤何如。江乙曰。虎得一狐。狐曰。子勿食我。上帝命我長百獸。不信吾爲子先行。子隨後觀。獸見皆走。虎不知獸畏己。以爲畏狐也。今北方非畏昭奚恤。實畏王之甲兵也。",
    "喻如黐膠": "涅槃經二十六卷云。如諸獵師。純以黐膠。置之案上。用捕獼猴。獼猴痴故。往手觸之。觸已粘手。欲脫手故。以脚蹋之。以口囓之。獼猴五處。悉無得脫。於是獵師。以杖貫之。負還歸家。",
    "擊壤": "風土記。壤以木爲之。長三四寸。其形如履。臘節童少以爲戲。將戲。先側一壤於地。遙於三四十步。以手中壤擿之。中者爲上。",
    "渾沌日死": "南海之帝爲鯈。北海之帝爲忽。中央之帝爲渾沌。鯈與忽。時與遇於渾沌之地。渾沌待之甚善。鯈與忽。謀報渾沌之德。曰。人皆有七竅。以視聽食息。此獨無有。甞試鑿之。日鑿一竅。七日而渾沌死。出莊子內篇。",
    "拔一毛而利天下": "孟子曰。楊子取爲我。拔一毛而利天下。不爲也。註云。楊子名朱。取者僅足之意。取爲我者。僅足於爲我而已。不及爲人也。",
    "止啼黃葉": "嬰兒啼哭之時。父母卽以楊樹黃葉。而語之言。莫啼莫啼。我與汝金。嬰兒見已。生真金想。便止不啼。出涅槃經第二十卷。",
    "舉一三反": "論語。子曰。不憤不啟。不悱不發。舉一隅。不以三隅反。則不復也。註云。憤者。心求通而未得之意。悱者。口欲言而未能之貌。啟。謂開其意。發。謂達其辭。物之有四隅者。舉一可以知其三。反者。還以相證之義。復。再告也。",
    "見鞭影而行": "世尊因外道問。不問有言。不問無言。世尊良久。外道讚嘆曰。世尊大慈大悲。開我迷雲。令我得入。作禮而去。阿難白佛。外道得何道理。稱讚而去。世尊曰。如世良馬。見鞭影而行。見宗門統要。並五燈會元。指月錄。",
    "伽陀藥": "華嚴經云。阿伽陀藥。衆生見者。衆病悉除。此云普去。能去衆病故。亦翻圓應。見名義集。又阿。此云普也。伽陀。此云去也。言服此藥者。身中諸病。普皆除去也。又云阿無也。伽陀病也。服此藥已。更無有病也。見華嚴經音義。",
    "以斯道覺斯民": "孟子述伊尹之言曰。天之生此民也。使先知覺後知。使先覺覺後覺也。予天民之先覺者也。予將以斯道覺斯民也。非予覺之而誰也。見孟子下。",
    "塗毒鼓": "廣誌云。鴆毒者。大如鷂子。頸長八寸。毛紫綠色。徧身是毒。以蛇蝮爲食。雄名暉。雌名陰。毛羽瀝酒。沾唇卽死。用犀牛角解之。昔王莽酒酖平王是也。騰空日月失色。落地草木皆枯。人見之眼瞎身瘡。值影者氣絕身死。旣死之後。用血塗于皷上。聞其聲者必死。須得返魂香方可。故天童小參云。十分收得返魂香。一等來檛塗毒皷。漢延和元年。西胡月氏國。遣使獻香四兩。大如雀卵。色如桑椹。至始元年。京城大疫。死者大半。帝取香焚之。其死未三日皆活。香氣三月不歇。香出聚窟洲。人鳥山。樹如楓。香聞數里。名返魂樹。伐根五釜。煑汁黑粘。一名驚精魂。二名返生。三名振檀。四名劫死。見拾遺傳。",
    "君子愛人以德": "曾子寢疾病。樂正子春坐於牀下。曾元曾申坐於足。童子隅坐而執燭。童子曰。華而睆。大夫之簀與。子春曰。止。曾子聞之。瞿然曰。呼。曰。華而睆。大夫之簀與。曾子曰。然。斯季孫之賜也。我未之能易也。元起易簀。曾元曰。夫子之病革矣。不可以變。幸而至於旦。請敬易之。曾子曰。爾之愛我也。不如彼。君子之愛人也以德。細人之愛人也以姑息。吾何求哉。吾得正而斃焉斯已矣。舉扶而易之。反席未安而沒。出禮記檀弓篇。",
    "桑間濮上之地": "桑間濮上之音。亡國之音也。註云。桑間濮上。衛地。濮水之上。桑林之間也。史記言衛靈公適晉。舍濮上。夜聞琴聲。召師涓聽而寫之。至晉命涓爲平公奏之。師曠曰。此師延靡靡之樂。武王伐紂。師延投濮水死。故聞此聲。必於濮水之上也。出禮記樂記篇。",
    "不思曲突之防": "漢宣帝時。初霍氏奢侈。茂陵徐福上疏言。宜以時抑制。其後霍氏誅滅。而告者皆封。人爲徐福上書曰。臣聞客有過主人者。見其竈直突。傍有積薪。客謂主人更爲曲突。遠徙其薪。不者且有大患。主人不應。俄而家果失火。鄰里共救。幸而得息。於是殺牛置酒。謝其鄰人。灼爛者在上。餘各以功次坐。而不錄言曲突者。人謂主人曰。向使聽客之言。不費牛酒。終亡火患。今論功請賞。曲突徙薪無恩澤。焦頭爛額爲上客耶。主人寤而請之。今茂陵徐福數上書。言霍氏有變。宜防絕之。向使福說得行。則國無裂土出爵之費。臣無逆亂誅滅之敗。往事旣已。而福獨不蒙其功。唯陛下察之。貴徙薪曲突之䇿。使居焦髮灼爛之右。上乃賜福帛十匹。後遷爲郎。見霍光傳。並綱鑑。",
    "猶揭鼓而求亡子": "老子謂孔子曰。夫子亦放德而行。循道而趨已至矣。又何偈偈乎揭仁義。若擊皷而求亡子焉。噫。夫子亂人之性也。精解云。偈偈。勞力貌。亡子。逃亡之子。擊皷而求之。是速其亡也。猶揭仁義而治天下。是速其亂也。出莊子天道篇。",
    "仲尼浮海之歎": "論語。子曰。道不行。乘桴浮于海。程子曰。浮海之歎。傷天下之無賢君也。",
    "爲蛇添足": "史。陳軫見楚使昭陽曰。人有遺舍人一巵酒。舍人相謂曰。請畫地爲蛇。先成者獨飲。一人先成。舉酒而起曰。吾能爲之足。及爲足。其一人奪酒飲曰。蛇無足。今爲之。非蛇也。",
    "三十年來用意猜": "杭州淨住院。居說真淨禪師。參金山達觀穎。遂問曰。某甲經論粗明。禪直不信。願師決疑。觀曰。旣不信禪。豈可明經。禪是經綱。經是禪網。提綱正網。了禪見經。師曰。爲某甲說禪看。觀曰。向下文長。師曰。若恁麼。經與禪乃一體。觀曰。佛及祖非二心。如手搦拳。如拳搦手。師因有省。述偈曰。三十年來用意猜。見五燈會元。",
    "不致傷鋒犯手": "憨山大師。莊子內篇養生主註云。任其游刃。尚有餘地。又何傷鋒犯手之有。",
    "婆羅門乞眼": "舍利弗。於六十劫中。行菩薩道。時有一人。乞其眼。舍利弗言。眼無所住。何以索之。若須我身及財物者。當以相與。答曰。惟欲得眼。舍利弗出一眼與之。乞者得眼。唾而脚蹋。舍利弗言。如此等人。難可度也。不如自調。早伏生死。於是回向小乘。見智度論。",
    "楚王孫圉答趙簡子": "王孫。圉聘於晉。定公饗之。趙簡子鳴玉以相。問於王孫圉曰。楚之白珩猶在乎。對曰然。簡子曰。其爲寶也幾何矣。曰。未甞爲寶。楚之所寶者。曰。觀射父。能作訓辭。以行事於諸候。使無以寡君爲口實。又有左史倚相。能道訓典。以敘百物。以朝夕獻善敗於寡君。使寡君無忘先王之業。又能上下說乎鬼神。順道其欲惡。使神無有怨痛於楚國。此楚國之寶也。若夫白珩。先王之玩也。何寶焉。其詳見國語。",
    "干城": "詩云。赳赳武夫。公侯干城。註云。赴赴武貌。干盾也。干城。皆所以扞外而衛內者。出詩國風周南之篇。左傳云。天下有道。則公候能爲民干城。",
    "善見": "華嚴經云。雪山有藥名善見。見聞齅觸消衆疾。",
    "觸籓之羊": "周易云。羝羊觸籓。不能退。不能遂。註云。壯終動極。故觸籓而不能退。然其質本柔。故又不能遂其進也。",
    "口無擇言": "孝經云。非法不言。非道不行。口無擇言。身無擇行。言滿天下無口過。行滿天下無怨惡。註云。所言皆遵法度則出於口者。無可擇之言。雖言滿天下。而不至於有口過矣。所行皆合道理。則體諸身者。無可擇之行。雖行滿天下。而不至於來人之怨惡矣。",
    "左貂右插": "說文。貂鼠屬。大而黃黑。出胡丁零國。一曰出東北夷。古今註。侍中冠。以貂爲飾。徐廣曰。北方寒。以貂皮煖額。附施於冠。因爲首飾。漢官儀。貂蟬。應劭曰。金取堅剛。蟬取居高飲潔。貂取內勁悍外溫潤。漢宦者傳。秦漢中常侍。參用士人。冠皆銀璫左貂。明帝改爲金璫右貂。悉用奄人爲之。",
    "鹽梅阿衡": "王曰。爾惟訓于朕志。若作酒醴。爾惟麯糵。若作和羮。爾惟鹽梅。註云。酒非麴糵不成。羮非鹽梅不和。人君雖有美質。必得賢人輔導。乃能成德。作酒者。麴多則太苦。糵多則太甘。麴糵得中。然後成酒。作羮者。鹽過則醎。梅過則酸。鹽梅得中。然後成羮。臣之於君。當以柔濟剛。可濟否。左右規正。以成其德。此湯高宗謂傅說之言。見尚書說命篇。阿。倚也。衡。平也。阿衡。商之官名。言天下之所倚平也。亦曰保衡。或曰伊尹之號。見尚書太甲篇。",
    "銅陵金谷": "漢文帝椒房之親。鄧通。有相者相曰。當餓死。帝曰。能富通者朕。遂賜通蜀道銅山。鑄錢布滿天下。其後遭事。逃避人家。終餓而死。出綱鑑。並西漢書。金谷。石崇之園名也。石崇。晉時人也。嘗與王愷鬪富。愷以珊瑚。高二尺許者示崇。崇以鐵如意擊碎。遂取高三四尺者。六七株以與之。見晉史。並故事書。",
    "武庫": "王勃。滕王閣序云。王將軍之武庫。言無所不有也。",
    "白圭無玷": "詩云。白圭之玷。尚可磨也。斯言之玷。不可爲也。註云。葢玉之玷缺。尚可磨鑢使平。言語一失。莫能救之。其戒深切矣。故南容一日三復此章。而孔子以其兄之子妻之。出大雅蕩之篇。",
    "老厭龍鍾": "廣韻。龍鍾竹名。產羅浮山。丹鉛錄曰。人老似竹搖曳不自持。",
    "拳拳服膺": "中庸。子曰。回之爲人也。擇乎中庸。得一善。則拳拳服膺。而弗失之矣。註云。回。孔子弟子顏淵名。拳拳。奉持之貌。服。猶著也。膺。胸也。奉持而著之心胸之間。言能守也。顏子葢真知之。故能擇能守如此。",
    "毋意毋必": "論語。子絕四。毋意。毋必。毋固。毋我。註云。絕。無之盡者。毋。史記作無是也。意。私意也。必。期必也。固。執滯也。我私己也。四者相爲終始。起於意。遂於必。留於固。遂於我也。葢意必常在事前。固我常在事後。至於我又生意。則物欲牽引。循環不窮矣。程子曰。此毋字。非禁止之辭。聖人絕此四者。何用禁止。",
    "皮旣不存": "魯僖公十四年冬。秦饑。使乞糴于晉。晉人弗與。慶鄭曰。背施無親。幸灾不仁。貪受不祥。怒鄰不義。四德皆失。何以守國。虢射曰。皮之不存。毛將安傅。註云。慶鄭。晉大夫。虢射。惠公舅。先是惠公許賂秦五城。以求入國。已而背之。故射以皮喻城。以毛喻粟。言旣不與秦城。爲怨已深。今雖與之粟。猶無皮而施毛。亦無所附也。出春秋左傳註評測義第十一卷。",
    "不言而信者天也": "君子曰。禮樂不可斯須去身。致樂以治心則易直子諒之心油然生矣。易直子諒之心生。則樂。樂則安。安則久。久則天。天則神。天則不言而信。神則不怒而威。致樂以治心者也。註云。致。謂研窮其理也。樂由中出。故以治心言之。子諒。從朱子說讀爲慈良。樂之感化人心。至於天而且神。可以識窮本知變之妙矣。出禮記樂記篇。",
    "有諸己之謂信": "浩生不害問曰。樂正子何人也。孟子曰。善人也。信人也。何謂善。何謂信。曰。可欲之謂善。有諸己之謂信。註云。凡所謂善。皆實有之。又曰。誠善於身之謂信。出孟子盡心章。",
    "未信則爲厲己": "論語。子夏曰。君子信而後勞其民。未信則以爲厲己也。信而後諫。未信則以爲謗己也。",
    "青囊見於愚婦": "華陀。字元化。沛國譙郡人也。其人妙手。世之罕有。曹操夢中。被棃樹神劍砍之後。頭痛不止。召華陀至。以麻肺湯破腦之言。操疑其奸。拏下獄中。獄中禁子姓吳。人稱爲吳押獄。此人每日。以酒食供奉華陀。陀感其恩。乃告曰。我今死于非命。有青囊書。未傳于世。深感汝恩。無可以報。我修一書。汝遣一人送于我家。取青囊書。來付與汝。以繼吾神効也。吳押獄曰。我若得此書。棄了此役。醫治天下。以全先生之德也。陀卽修書。付吳押獄曰。吾臨來時。將書與妻藏之矣。吳押獄辭了華陀。直至金城。問陀妻取之。吳押獄回家。令妻藏之。旬日之後。操病越加沉重。華陀死於獄中。吳押獄却了差役。回家問妻要書。求醫治病。妻曰。吾已燒毀矣。夫問其故。妻曰。縱然學得與華陀。一般。只落得死于獄中。吾故毀之。因此青囊書不傳於世。後賢詩曰。神醫妙手最爲良。傳得仙人海上方。愚婦焚燒真可恨。後人無復見青囊。詳見三國志。犀纛落於嬖人。犀纛者。大將之旗也。若落於嬖人之手。必有不測。若實其人。則不可攷。",
    "請益則起": "侍坐於先生。先生問焉。終則對。請業則起。請益則起。註云。請益者。再問未盡之蘊。起。所以致敬也。出禮記曲禮篇。",
    "更端則起": "侍坐於君子。君子問更端。則起而對。呂氏曰。問更端則起而對者。因事有所變而起敬也。出禮記曲禮篇。",
    "鄭伯降楚": "楚子圍鄭。克之。鄭伯肉袒。牽羊以逆。曰。孤不天。不能事君。使君懷怒以及敝邑。孤之罪也。敢不唯命是聽。出左傳。",
    "不識廬山真面目": "東坡遊廬山。至東林。作二偈曰。溪聲盡是廣長舌。山色無非清淨身。夜來八萬四千偈。他日如何舉似人。橫看成嶺側成峰。遠近看山了不同。不識廬山真面目。只緣身在此山中。山谷曰。此老於般若。橫說竪說。了無剩語。非筆端有口。安能吐此不傳之妙乎。見遊戲三昧。並禪喜集。及徵文錄。",
    "去華拜座": "時維摩室。有一天女。卽以天華。散諸菩薩大弟子上。華至諸菩薩。卽皆墮落。至大弟子。便著不落。一切弟子神力去華。不能令去。天女問舍利弗。何故去華。答曰。華不如法。是以去之。天女曰。勿謂此華不如法。是華無所分別。仁者自生分別想耳。結習未盡。華著身耳。結習盡者。華不著也。其詳出維摩經。維摩語舍利弗。就獅子座。弗言。此座高廣。吾不能昇。士言。唯舍利弗爲須彌燈王如來作禮。乃可得坐。舍利弗於是作禮。便得此座。其詳出維摩經。",
    "無厭示以王刑": "爾時善財。至多羅幢城。見無厭足王。執諸罪人。無量楚毒。善財作念。我爲利益一切衆生。求菩薩行。修菩薩道。此王如是。云何求法。時聞空中之言。卽詣王所。頂禮其足。白言聖者。我已先發阿耨菩提之心。未知云何學菩薩行。修菩薩道。時王告善財言。我若實作如是惡業。云何而得如是果報。我爲調伏衆生。令發菩提之心。出華嚴經六十六卷。",
    "勝熱示以火炙": "爾時善財。至伊沙那聚落。見彼勝熱。修諸苦行。求一切智。四面火聚。猶如大山。中有刀山。高峻無極。登彼山上。投身入火。時善財禮足。白言聖者。我已先發阿耨菩提之心。未知云何學菩薩行。修菩薩道。婆羅門言。汝能上此刀山。投身火聚。諸菩薩行。悉得清淨。善財作念。得人身難。離諸障難。時八部鬼神。告善財言。此婆羅門。五熱炙身。爲我等說法。令我愛樂無上菩提。善財聞之。歡喜悔過。遂卽登山投火。未至中間。卽得菩提善住三昧。出華嚴經六十四卷。",
    "寒風": "世尊於冬至。前後八夜。寒風破竹。佛索二衣禦寒。見智度論第九卷。",
    "馬麥": "中本起經云。隨羅然國。有婆羅門王。名阿耆達。聰明多智。問須達多言。此土有神人可宗者不。答曰。有悉達太子。出家成佛。天人所尊。阿耆達往詣佛所。卽白佛言。願佛及僧。顧我三月夏坐。佛言。我此衆多。王言。不以爲多。如是至三。佛及五百比丘受請至國。於城北林下住止。佛勅比丘。此邑窮隘。人多不信。乞食難得。若安居者住。不者隨意。時舍利弗受帝釋及修羅女請。時有天魔。迷惑王心。還入後宮。勅守門者。三月之內。事無大小。悉不得啟。比丘乞食艱難。目連白佛。有樹名閻浮。我欲取其果供衆。鬱單越有自然粇米。忉利食。修羅味。皆欲取以供大衆。願佛聽許。佛不許。有牧馬人。告諸比丘。我有馬麥。君能噉不。比丘白佛。佛遂應受。馬有五百。一馬日食二升。分半及僧。有一良馬。日食四升。分半奉佛。阿難取佛分並自分。持入聚落。見一女人。謂阿難言。我爲汝作飯。及熟。阿難持飯奉佛。佛遂受之。時國人民。聞佛食馬麥。備衆奉佛。自恣餘有七日。佛告阿難。汝入城告王。云安居竟。復餘國遊行。阿難至王所。陳佛語。王問佛何所在。阿難言。受王三月請。今故在國。王問誰爲供給。阿難言。惟食馬麥。王始覺悟。詣佛懺悔。興起行經云。佛告舍利弗。過去有佛。名毗婆葉。有王。名槃頭。有婆羅門。名因提耆利。教五百童子。時王設齋請佛。有一比丘。名曰彌勒。病不能行。食竟爲病人請食。梵志不與。罵曰。髠頭沙門。正應食馬麥。不應食如是甘美之供。時諸童子曰實爾。舍利弗。時婆羅門。我身是也。五百童子。今五百比丘是。病比丘。今彌勒是。又見經律異相第五卷。",
    "河伯井蛙": "秋水時至。百川灌河。涇流之大。兩涘渚涯之間。不辨牛馬。於是焉河伯欣然自喜。以天下之美爲盡在己。順流而東。至於北海。東面而視。不見水端。於是焉河伯始旋其面目。望洋向若而歎曰。野語有之。聞道百。以爲莫己若者。我之謂也。且夫我嘗聞。少仲尼之聞。而輕伯夷之義者。始吾弗信。今我賭子之難窮也。吾非至於子之門則殆矣。吾長見笑於大方之家。北海若曰。井鼃不可以語於海者。拘於墟也。夏蟲不可以語於氷者。篤於時也。曲士不可以語於道者。束於教也。今爾出於涯涘。觀於大海。乃知爾醜。爾將可與語大理矣。天下之水。莫大於海。萬川歸之。不知何時止而不盈。尾閭泄之。不知何時已而不虗。春秋不變。水旱不知。此其過江河之流。不可爲量數。而吾未嘗以此自多者。自以比形於天地。而受氣於陰陽。吾在天地之間。猶小石小木之在泰山也。出莊子秋水篇。",
    "莫之爲而爲者": "孟子曰。莫之爲而爲者天也。莫之致而至者命也。",
    "貫朽粟陳": "漢武帝初。京師之錢累鉅萬。貫朽不可校。太倉之粟。陳陳相因。充溢露積于外。紅腐而不可食。見史記。",
    "紫標黃榜": "梁武帝弟。蕭宏。封臨川王。性愛錢。百萬一聚。黃榜標之。千萬一庫。掛一紫標。如此十餘間。武帝見之。計錢三億餘萬。他物滿庫。不計多少。簫綜作錢愚論譏之。見梁史。並故事書。",
    "體羣臣": "中庸。子曰。凡爲天下國家有九經。曰。修身也。尊賢也。親親也。敬大臣也。體羣臣也。子庶民也。來百工也。柔遠人也。懷諸侯也。註云。經。常也。體。謂設以身處其地。而察其心也。",
    "尊德性問學也": "中庸。故君子尊德性而道問學。註云。尊德性。所以存心而極乎道體之大也。道問學。所以致知而盡乎道體之細也。二者修德凝道之大端也。",
    "近悅遠來": "論語。葉公問政。子曰。近者悅。遠者來。註云。被其澤則悅。聞其風則來。然必近者悅。而後遠者來也。",
    "雲興二百問": "爾時普慧菩薩。知衆已集。問普賢菩薩言。佛子。願爲演說。何等爲菩薩摩訶薩依。何等爲奇特想。乃至何故如來應正等覺。示般涅槃。善哉佛子。如是等法。願爲演說。爾時普賢菩薩。告普慧等諸菩薩言。佛子。菩薩摩訶薩。有十種依。有十種奇特想。乃至如來應正等覺。作佛事已。觀十種義。故示般涅槃。其詳出華嚴經離世間品。雲興瓶瀉者。言二菩薩。問者。如雲興長空。答者。如倒瓶瀉水。故本經讚云。普賢瓶瀉二千酬是也。",
    "雲龍風虎": "周易。子曰。同聲相應。同氣相求。水流濕。火就燥。雲從龍。風從虎。聖人作而萬物覩。本乎天者親上。本乎地者親下。則各從其類也。",
    "綸音宣召": "子曰。王言如絲。其出如綸。王言如綸。其出如綍。註云。綸綬也。綍引棺大索也。出禮記緇衣篇。",
    "飛狸之先陰": "爾時世尊。心生智見。知優陀羅迦羅摩子。今在非想。彼處命終。後還墮落。生於此處。受飛狸身。若有衆生。生於水中。或居陸地。或空飛行。當當殺害。報盡餓死。世尊成道。欲往度之。命終已經七日。而有偈言。世尊欲說羅摩子。發心觀察其所生。知今命終在於天。心念五仙欲至彼。出佛本行集經三十三卷。大論十九卷云。鬱頭藍弗。得非想定。具五神通。日日飛入王宮中食。其王夫人。依其國法。接足而禮。觸足欲發失通。求車還山。更修五通。一心專志。垂當得定。所依林池。爲諸魚鳥之所喧鬧。因發惡誓。噉諸魚鳥。後得定如初。生非想處。報盡爲先誓所牽。墮飛狸身。佛名經說。佛語舍利弗言。汝師鬱頭藍弗。得非想定。八萬四千劫滿。命終之後。不免還作飛狸之身。緣修此定時。林間被鵶鳥喧噪。近水被魚等聲亂。心生嗔恚。願入水飛空噉之。定力旣盡。便受此報。見圓覺經略鈔第十一卷。",
    "快見之後身": "佛言。舍衛城中。須達長者。有一老母。不欲見佛。佛在其前。以扇自障。佛令其扇如鏡。無所障礙。四方上下總皆是佛。以手覆面。十指皆化爲佛。老母不信。佛命羅雲度之。羅雲化作轉輪王。至長者家。宣揚善法。老母聞已。心生歡喜。遂詣佛所出家。波斯匿王。末利夫人。禮佛白言。如此老母。宿有何罪。生卑賤處。爲人使婢。復何福慶。今值世尊。佛言。過去有佛。名寶葢燈王佛。滅後像法中有王。名曰雜寶華光。有子。名曰快見。欲求出家。王卽聽許。遂至山中。有一比丘。受爲弟子。謗師空無智慧。願我後生不樂見也。我阿闍黎。智慧辯才。願生生爲我知識。以謬解故。命終之後。墮阿鼻獄。爾時和尚者。今我身是。阿闍黎者。今羅雲是。王子比丘。今老母是。出觀佛三昧海經第六卷。",
    "六師之徒黨": "六師者。淨名有名。一富蘭那。名也。迦葉。姓也。二末伽黎。名也。俱奢梨。母名子。三刪闍夜。名也。毗羅胝。母名子。四阿耆多。名也。翅舍欽婆羅。弊衣名也。五迦羅鳩䭾。名也。迦旃延。姓也。六尼揵陀。名也。若提。母名子。見華嚴懸談。",
    "螳蜋不能拒轍": "蘧伯玉答顏闔曰。汝不知夫螳蜋乎。怒其背以當車轍。不知其不勝任也。出莊子人間世。史。齊莊公出獵。有螳蜋舉足。將搏其輪。問其御曰。此何蟲也。對曰。螳蜋也。此蟲知進而不知退。不量力而輕就敵。公曰。此爲天下之勇蟲矣。迴車避之。勇士歸焉。",
    "三十輻共一轂": "道德經云。三十輻共一轂。當其無有車之用。精解云。輻。輪之股也。轂。車中容軸者。輪之心也。當。惟也。虗中曰無。轂惟虗中。乃可以轉軸而行車。故曰。有車之用。",
    "甘棠民不忍伐": "詩曰。蔽芾甘棠。勿翦勿伐。召伯所𦭞。註云。賦也。蔽芾。盛貌。甘棠。杜棃也。白者爲棠。赤者爲杜。翦。翦其枝葉也。伐。伐其條榦也。伯。方伯也。𦭞。草舍也。召伯循行南國。以布文王之政。或舍甘棠之下。其後人思其德。故愛其樹而不忍傷也。召地名。召公奭之采邑也。舊說扶風雍縣。南有召亭。卽其地。今雍縣析爲岐山天興二縣。未知召亭的在何縣。出國風召南篇。並列國傳。",
    "目擊道存": "仲尼見溫伯雪子而不言。子路曰。夫子欲見溫伯雪子久矣。見之而不言何也。仲尼曰。若夫人者。目擊而道存。亦不可以容聲矣。出莊子外篇。",
    "非無萌蘖生焉": "孟子曰。牛山之木嘗美矣。以其郊於大國也。斧斤伐之。可以爲美乎。是其日夜之所息。雨露之所潤。非無萌蘖之生焉。",
    "瞻之在前": "論語。顏淵喟然歎曰。仰之彌高。鑽之彌堅。瞻之在前。忽焉在後。註云。喟。歎聲。仰彌高。不可及。鑽彌堅。不可入。在前在後。恍惚不可爲象。此顏子深知夫子之道。無窮盡。無方體。而歎之也。",
    "眼智明覺": "眼智等。見道中位也。苦法忍爲眼。苦法智爲智。苦比忍爲明。苦比智爲覺。出輔行第五卷。真諦三藏云。慧眼爲總。智明覺爲別。智了過去。明達未來。覺察現在。出部異執記。",
    "禮樂征伐": "論語。孔子曰。天下有道。則禮樂征伐自天子出。天下無道。則禮樂征伐自諸侯出。",
    "上士聞道": "道德經云。上士聞道。勤而行之。中士聞道。若存若亡。下士聞道。大笑之。不笑不足以爲道。精解云。聞而必信。故果於行。且信且疑。若以爲有。若以爲無。最下鄙俚之人。則直笑之耳。惟最下之人。以之爲笑。方見吾道之高也。",
    "乾乾不息": "周易。乾卦。君子終日乾乾。象曰。天行健。君子以自彊不息。註云。乾乾。惕厲之象。",
    "以貌取人": "孔子曰。以容取人。則失之子羽。以辭取人。則失之宰予。孔子謂失之云者。欲人知言貌之不可以取人耳。與史記言同。而意則反矣。見孔子家語。",
    "身子與羅度爭勝": "爾時須達長者。生七男兒。各娶其妻惟第七子未娶遂與城中護彌長者之女配之。見護彌家。廣設供具。卽問將何所爲。答言。請佛及僧。須達問言。云何名佛。護彌答言。汝不聞乎。淨飯王子出家成佛也。若往見之。得福無量。須達歡喜。往世尊所。世尊命坐。時首陀會天。化爲四人。行列而來。右遶三帀。接足胡跪。却住一面。須達如彼禮敬。世尊卽爲說法。令得初果。問世尊言。舍衛城中。人多信邪。佛何不度。佛言。彼無處所。云何住止。須達白佛。弟子能起。願見聽許。世尊默然。須達同舍利弗。周遍尋之。惟祇陀太子之園。可建精舍。遂白太子。以黃金布地。感動太子。同建精舍。須達歡喜。六師聞之。往白國王。須達買園。欲爲沙門建立精舍。聽我徒衆。與衆較術。沙門若勝。便聽起立。若其不如。不得立也。王召須達問言。今此六師。欲與沙門較其技術。若勝得立。如其不勝。不得立也。須達聞之。愁惱不樂。時舍利弗。至長者家。遂問何故不樂。答言。所立精舍。但恐不成。是故不樂。遂以六師之言告之。弗言。隨意較之。是時各設其座。擊鼓衆集。時舍利弗樹下入定。須達白言。大德。大衆集已。願來詣會。舍利弗從禪定起。往詣大衆。衆見不覺作禮。舍利弗便昇其座。六師之中有一弟子。名勞度差。善知幻術。於大衆前。呪作一樹。舍利弗以神力化作旋風。吹倒於地。又復呪作一池。四面寶成。池中生種種華。舍利弗化作六牙白象。其一牙上。有七種華。一一華上。有七玉女。其象往詣池邊。池水卽滅。復作一山。七寶莊嚴。舍利弗化作金剛力士。以杵破壞。復作一龍。舍利弗化一金翅鳥王。擘裂噉之。復作一牛。舍利弗化作師子。分裂食之。復變夜义鬼形。舍利弗化作毗沙天王。夜叉驚走。四面火聚。無有去處。唯舍利弗身邊清涼。羅度卽時屈伏求哀。舍利弗昇於虗空。現十八變。時會大衆。咸皆歡喜。舍利弗卽爲說法。時六師弟子。於舍利弗所。出家學道。其詳出賢愚因緣經第九卷。",
    "期期艾艾": "漢高祖。欲廢呂后之太子。而立戚夫人之子如意。令周昌奉詔傳宣。使天下知之。周昌爭之不得而怒。故對言。臣期期不能奉詔。期期。口訥也。故重語。猶今之結舌也。漢楊雄爲人口訥。故語每重疊。魏鄧艾口訥。常自稱艾艾。見者不一。",
    "幹蠱之道": "周易。幹父之蠱。有子考無咎。厲終吉。象曰。幹父之蠱。意承考也。註云。幹。如木之榦。枝葉之所附而立者也。蠱者。前人已壞之緒。故諸爻皆有父母之象。子能幹之。則餝治而振起矣。",
    "睟然見於面": "孟子曰。君子所性。仁義禮智。根於心。其生色也。睟然見於面。盎於背。施於四體。四體不言而喻。註云。睟然。清和潤澤之貌。盎。豐厚盈溢之意。施於四體。謂見於動作威儀之間也。喻。曉也。四體不言而喻。言四體不待吾言。而自能曉吾意也。出孟子盡心章。",
    "布在方䇿": "中庸。哀公問政。子曰。文武之政。布在方䇿。其人存。則其政舉。其人亡。則其政息。註云。方。版也。䇿。簡也。息。滅也。有是君。有是臣。則有是政矣。",
    "象帝之先": "道德經云。和其光。同其塵。湛兮似若存。吾不知誰之子。象帝之先。精解云。光而不露。曰和其光。無塵而不自潔。曰同其塵。此佛經所謂不垢不淨也。如此則所謂宗者。湛兮常寂。似亡若存矣。然此果伊誰之子乎。吾恐此道。雖天帝未易當之。意者其在帝之先與諡法。德象天地曰帝。帝之與王。葢通稱也。",
    "大浸稽空而不溺": "肩吾問於連叔曰。吾聞言於接輿。大而無當。往而不反。吾驚怖其言。猶河漢而無極也。大有逕庭。不盡人情焉。連叔曰。其言謂何哉。曰。藐姑射之山。有神人居焉。肌膚若氷雪。綽約若處子。不食五穀。吸風飲露。乘雲氣。御飛龍。而遊乎四海之外。其神凝。使物不疵癘而年穀熟。吾以是誑而不信也。連叔曰。然。盲者無以與乎文章之觀。聾者無以與乎鐘鼓之聲。豈惟形骸有聾盲哉。夫知亦有之。是其言也。猶時女也。之人也。之德也。將磅礴萬物。以爲一世蘄乎亂。孰弊弊焉以天下爲事。之人也。物莫之傷。大浸稽天而不溺。大旱金石流土山焦而不熱。是其塵垢粃糠。將猶陶鑄堯舜者也。出莊子逍遙遊。",
    "太陽妄授平侍": "太陽平侍者。預明安之室有年矣。雖盡得其旨。惟以生滅爲己任。擠陷同列。忌出其右。時瑯瑘廣照。公安圓鑑。居衆時。汾陽昭禪師。令探明安宗旨。太陽明安曰。興洞山一宗。非遠卽覺也。二師云。有平侍者在。安以手指𮌎云。此處不佳。又揑拇指叉中示曰。平向去當死於此耳。旣明安遷化遺囑云。瘞身十年無難。當爲太陽山打供。入塔時。門人恐平。將不利於師。遂作李和文都尉。所施黃白器物。書於塔銘。實無也。後平住太陽。忽云。先師靈骨。風水不利。取而焚之。山門耆宿切諫。平曰。與我有妨。遂發塔。見師顏貌如生。薪盡儼然。衆皆驚異。平以钁破腦。益油薪。俄成灰燼。衆以其事聞于官。坐以謀塔中物。不孝還俗。平後自稱爲黃秀才。謁瑯瑘。瑯瑘曰。昔年平侍者。今朝黃秀才。我在太陽時。見你做出來。遂不納。又謁公安。公安亦然。平流浪無依。後于三叉路口。遭大蟲食之。竟不免太陽手叉之記。見寶訓音義。",
    "夜夜抱佛眠": "傅大士頌云。夜夜抱佛眠。朝朝還共起。起坐鎮相隨。語默同居止。纖毫不相離。如身影相似。欲知佛去處。只這語聲是。見宗門統要。及五燈會元。並指月錄。",
    "葉公畵龍": "莊子。葉公好龍。凡於室廬。及帷帳器皿。皆畵龍爲玩於是天龍聞而下。葉公見之。棄而遠走。人以爲葉公所好。非真龍也。",
    "道聽塗說": "論語。子曰。道聽而塗說。德之棄也。註云。雖聞善言。不爲己有。是自棄其德也。",
    "善其事利其器": "論語。子貢問爲仁。子曰。工欲善其事。必先利其器。",
    "奏鈞之美": "史。秦穆公夢至帝所。觀鈞天廣樂。帝賜以䇿。秦遂大昌。淮南子云。九天。中央曰鈞天。",
    "入息不居陰界": "二十七祖般若多羅。因東印度國王請齋次。王問諸人盡轉經。唯師爲甚不轉。祖曰。貧道出息不隨衆緣。入息不居蘊界。常轉如是經。百千萬億卷。非但一卷兩卷。見宗門統要。並禪宗正脉等。",
    "尸毗王代鴿": "尸毗王大精進。視一切衆生如子。時世無佛。帝釋命欲終時。心自念言。何處有一切智人。處處問難。不能斷疑。憂愁而坐。巧變化師。名毗首羯摩天。問曰。天主何愁。答曰。我求一切智人。竟不能得。摩曰。有優尸那種。尸毗王。不久作佛。帝釋使摩。化一赤眼鴿。自化爲鷹。鴿飛入王腋下求救。鷹在樹上語王。還我鴿。王割股肉。與之。鷹曰。王雖以熱肉與我。當用道理。令肉輕重得與鴿等。王以秤對鴿肉。割王肉盡。與鴿始等。帝釋語王。汝割身肉。心不惱耶。王誓曰。我若惱者。不復如故。若弗惱者。卽當平復。言訖如故。見智度論第四卷。",
    "大施太子抒海": "佛告舍利弗。過去世時。有一婆羅門。號尼拘樓陀。後生一子。名曰大施。父甚愛念。一日出遊。見諸苦惱。白父給濟。父遂許之。庫藏之物。三分施二。大施不忍竭父之財。遂入海採寶。所得三珠。繫於衣角。及乎出海休歇之時。諸龍密解持去。大施睡覺。看珠不在。卽自思惟。必是海龍持去。欲抒大海。海龍知之。遂還其珠。及回其家。如意濟衆。其詳出賢愚因緣經第八卷。",
    "七日翹足": "菩薩本行經云。佛告阿難。我念往昔。有佛出世。號曰弗沙。在雪山寶窟內入定。時我入山採藥。觀見彼佛。心生歡喜。合掌翹足。七日七夜。讚歎彼佛。乃超九劫。而說偈言。天上天下無如佛。又見智度論第四卷。",
    "尚闍黎雀巢": "釋迦昔爲螺髻仙人。名尚闍黎。常在樹下。兀坐不動。鳥以謂木。卽於髻上生卵。是菩薩從禪定覺。知頂上有鳥卵。卽自思惟。若我起動。鳥不復來。卵必盡壞。卽還入定。至鳥生子飛去乃起。見智度論十七卷。劬嬪大臣。均分閻浮提。城邑山川爲七分。諸國息諍。慧斯極矣。見智度論第四卷。",
    "善人之資": "道德經云。善人不善人之師。不善人善人之資。精解云。善人可以師範一世。雖異於不善之人而天下若無不善之人。則誰知善人之爲善。是不善乃爲善人之資也。資者。賴之以自別也。",
    "揚波啜糟": "屈原旣放。遊於江潭。行唫澤畔。顏色憔悴。形容枯槁。漁父見而問之曰。子非三閭大夫與。何故至於斯。屈原曰。世人皆濁我獨清。衆人皆醉我獨醒。是以見放。漁父曰。聖人不凝滯於物。而能與世推移。世人皆濁。何不掘其泥而揚其波。衆人皆醉。何不餔其糟而歠其釃。何故深思高舉。自令放爲。屈原曰。吾聞之。新沐者必彈冠。新浴者必振衣。安能以身之察察。受物之汶汶者乎。寧赴湘流。葬於江魚腹中。安能以皓皓之白。而蒙世俗之塵埃乎。漁父莞爾而笑。鼓枻而去。乃歌曰。滄浪之水清兮。可以濯我纓。滄浪之水濁兮。可以濯我足。遂去不復與言。見離騷經。並戰國䇿。",
    "苞苴骯髒": "苞苴。包裹奇物。奉獻諂佞。以求託囑也。骯髒體盤旋貌。漢書云。曲眉骯髒。倚立門傍是也。見寶訓音義。",
    "脅肩諂笑": "曾子曰。脅肩諂笑。病于夏畦。註云。脅肩竦體。諂笑強笑。皆小人側媚之態也。病。勞也。夏畦。夏月治畦之人也。出孟子。",
    "不入我室": "孔子曰。過我門而不入我室。我不憾焉者。其惟鄉原乎。鄉原。德之賊也。見孟子。",
    "雕蟲之技": "或曰。吾子少而好賦。曰然。童子雕蟲篆刻。俄而曰。壯夫不爲也。出楊子法言吾子篇。",
    "文會之友": "論語。曾子曰。君子以文會友。以友輔仁。",
    "不相爲謀": "論語。子曰。道不同。不相爲謀。註云。不同。如善惡邪正之類。",
    "翔而後集": "論語。色斯舉矣。翔而後集。註云。言鳥見人之顏色不善則飛去。回翔審視而後下止。人之見幾而作。審擇所處。亦當如此。",
    "桑間之刺": "列子。秋胡納妻五日。往仕于陳。五年始旋。將及家。見一婦人採桑于陌上。婦貌甚美。胡戲之曰。力田不如見少年。採桑不如見貴郎。吾有黃金願與子。婦不受。胡到家見母。母呼妻出。乃桑間之婦也。婦責之曰。見色棄金而忘其母。大不孝也。任君另娶。乃投水而死。後賢詠詩曰。郎恩葉薄妾氷清。郎與黃金妾不應。假使偶然通一笑。半生誰信守孤燈。其詳又見列國志。",
    "不見可欲": "道德經云。不見可欲。使心不亂。精解云。我不示人以可欲之形。使民心自定而不亂。",
    "櫽括規正": "荀子。用句木者必檃括。揉曲者曰檃。正方者曰括。又檃括之側多曲木。亦作檃括。尚書有櫽括之器。卽正邪曲之器也。",
    "德不孤也": "論語。子曰。德不孤。必有鄰。註云。鄰猶親也。德不孤立。必以類應。故有德者。必有其類從之。如居之有鄰也。",
    "握六龍以象乾": "周易。大明終始。六位時成。時乘六龍以御天。註云。此言聖人大明乾道之終始。則見卦之六位。各以時成。而乘此六陽。以行天道。是乃聖人之元亨也。",
    "參七鷹之膺鼎": "漢光武生。赤光照室。影如五麟七鳳。望氣者。見舂陵城郭。曰。佳哉鬱鬱葱葱。余應虬曰。負鳳扆以當陽。位膺大寶。御羅圖而出宸。運際昌辰。見啟牘故事。",
    "帝心簡在": "論語。帝臣不蔽。簡在帝心。註云。此引商書湯誥之辭。簡。閱也。言桀有罪。己不敢赦。而天下賢人。皆上帝之臣。己不敢蔽。簡在帝心。惟帝所命。",
    "補衮之勞": "詩云。衮職有闕。維仲山甫補之。註云。衮職。王職也。天子龍衮。不敢斥言王闕。便曰衮職有闕也。至於王職有闕失。亦維仲山甫獨能補之。蓋唯大人然後能格君心之非。未有不能自舉其德。而能補君之闕者也。出大雅蕩之篇。",
    "潛龍之象": "周易。初九。潛龍勿用。九二。見龍在田。利見大人。註云。潛。藏也。龍。陽物也。初陽在下。未可施用。故其象爲潛龍。其占曰勿用。九二。剛健中正。出潛離隱。澤及於物。物所利見。故其象爲見龍在田。其占爲利見大人。九二雖未得位。而大人之德已著。常人不足以當之。葢亦謂在下之大人也。",
    "何闔而晦四句": "此四句。乃屈子楚辭第四卷天問章之言。至下出入天地而一捫視乎。乃擕李周拱辰別註之言。此書共十九卷。盛行於世。",
    "圖南九萬": "北冥有魚。其名爲鯤。鯤之大。不知其幾千里也。化而爲鳥。其名爲鵬。鵬之背。不知其幾千里也。怒而飛。其翼若垂天之雲。是鳥也。海運則將徙於南冥。南冥者。天池也。齊諧者。志怪者也。諧之言曰。鵬之徙於南冥也。水擊三千里。搏扶搖而上者九萬里。去以六月息者也。野馬也。塵埃也。生物之以息相吹也。天之蒼蒼。其正色邪。其遠而無所至極邪。其視下也。亦若是則已矣。且夫水之積也不厚。則其負大舟也無力。覆杯水於坳堂之上。則芥爲之舟。置杯焉則膠。水淺而舟大也。風之積也不厚。則其負大翼也無力。故九萬里則風斯在下矣。而後乃今培風。背負青天而莫之夭閼者。而後乃今將圖南。出莊子逍遙遊。",
    "指南者": "越裳氏來貢。歸忘其路。周公作指南車。刻木爲人。舉手指南。令其望南而走。則知歸路。今羅經是也。見列國傳。並古今註。",
    "觀耕夫而厭浮世": "佛告諸比丘。菩薩年漸長大。出城遊觀。行至園中。見諸農夫。勤勞執役。菩薩見已。心生慈悲。哀嗟世間。有如斯苦。乃於閻浮樹下。思離苦法。出方廣大莊嚴經第四卷。又出普曜經。",
    "提謂覩金人而受戒": "提謂與五百賈人。和麨蜜於樹下。稽首上佛。佛念先佛受施。法皆持鉢。不宜如餘道人手受食。時四天王。各獻一鉢。佛令合成一鉢。卽以其鉢。受賈麨蜜。授記成佛。名曰蜜成如來。出普曜經第七卷。其詳又見提謂經。",
    "剖璞出玉": "楚卞和。遊荆山得璞玉。奉獻武王。王使玉人相之曰。石也。王以和爲詐。刖其左足。武王死。子文王立。和又獻之。王又令玉人相之曰。石也。又以和爲詐。刖其右足。文王死。子成王立。和又欲獻。恐其害命。乃抱璞哭于荆山之下。三日三夜。淚盡。繼之以血。王聞之。使人問曰。天下刖足者多矣。子奚悲之甚耶。和曰。吾非悲刖也。悲夫寶玉而題之以石。貞士而名之以詐。是以悲也。隨使獻上。王令玉人琢之。果得美玉。王曰。二先君易刖人足。難剖其石。遂名曰和氏璧。後賢詩曰。抱石岩前桂葉稠。碧溪流水至今流。空山日落猿聲叫。疑是荆人哭未休。出史記。並列國志。",
    "左右逢原": "孟子曰。君子深造之以道。欲其自得之也。自得之。則居之安。居之安。則資之深。資之深。則取之左右逢其原。故君子欲其自得之也。註云。造。詣也。深造之者。進而不已之意。道。則其進爲之方也。資猶藉也。左右。身之兩旁。言至近而非一處也。逢猶值也。原。本也。水之來處也。言君子務於深造。而必以其道者。欲其有所持循。以俟夫默識心通。自然而得之於己也。自得於己。則所以處之者。安固而不搖。處之安固。則所藉者。深遠而無盡。所藉者深。則日用之間。取之至近。無所往而不值其所資之本也。見孟子離婁章。",
    "修證不無": "南嶽懷讓禪師。詣曹溪。參六祖。祖問甚處來。師曰。嵩山來。祖曰。甚麼物恁麼來。師無語。遂經八年。忽然有省。白祖曰。某甲有箇會處。祖曰。作麼生。師曰。說似一物卽不中。祖曰。還假修證否。師曰。修證則不無。染汚卽不得。祖曰。秪此不染汚。諸佛之所護念。汝旣如是。吾亦如是。出法寶壇經。並禪定正脉等。",
    "父作子述": "中庸。子曰。無憂者。其惟文王乎。以王季爲父。以武王爲子。父作之子述之。",
    "博施濟衆": "論語。子貢曰。如有博施於民。而能濟衆。何如。可謂仁乎。子曰。何事於仁。必也聖乎。堯舜其猶病諸。",
    "連城不易尺璧": "趙有卞和璧。秦昭王欲以十五連城貿之。趙遣相如送之入秦。相如視秦王獨有愛璧之心。而無割城之意。乃詐曰。璧有瑕。請示之。王授璧與相如。如持璧倚柱而立。怒髮衝冠。乃曰。臣聞布衣之交。尚不忍相欺。況大國乎。王若急臣。臣頭與璧。俱碎於柱。王恐璧碎。使人扶相如起。而遂歸趙。後賢詩曰。卞璧無瑕耀日輝。秦王雖愛不輸機。可憐又入相如手。一陣清風滿路歸。其詳見史記。並列國志。",
    "觀窓草聽驢鳴": "周惇頥。字茂叔。舂陵人。時佛印寓鸞溪。公謁見。相與講道。問曰。天命之謂性。率性之謂道。禪門何謂無心是道。師曰。疑則別參。公曰。參則不無。畢竟以何爲道。師曰。滿目青山一任看。公有省。一日忽見窓前草生。乃曰。與自家意思一般。以偈呈師曰。昔本不迷今不悟。心融境會豁幽潛。草深窓外松當道。盡日令人看不厭。師和云。大道體寬無不在。何拘動植與蜚潛。行觀坐看了無礙。色見聲求心自厭。見徵文錄第九卷。周茂叔。窓前草不除去。問之云。與自家意思一般。張子厚。聽驢鳴。亦謂如此。見二程全書。",
    "秀支替戾岡": "石勒欲拒劉曜。僚佐皆諫。勒以訪澄澄曰。塔上風鈴云。秀支替戾岡。僕谷劬禿當。此羯語也。秀支。軍也。替戾岡。出也。僕谷。劉曜胡位也。劬禿當。捉也。此言軍出捉得劉曜也。其後果獲劉曜。其詳見高僧傳。並神僧傳。及經論塵餘。",
    "四齊日": "月旦。月望。初八。二十三。謂之四齋日。見百丈清規。又云。白月八日。十五。黑月八日。十四。或十五見法數。",
    "寶積見屠子": "盤山寶積禪師。嗣馬祖。因於市肆行。見一客人買猪肉。語屠家曰。精底割一斤來。屠放下刀叉手曰。長史那箇不是精底。師於此有省。見宗門統要。並禪宗正脉。指月錄。",
    "樓子聞婬辭": "樓子和尚。未詳法嗣。一日偶經遊街市間。於酒樓下整襪帶次。聞樓上唱曲云。伱旣無心我也休。忽然大悟。因號樓子焉。見禪宗正脉。並指月錄。",
    "偷蘭遮罪": "善見律云。偷蘭。名大遮。言障善道。後墮惡道。體是鄙惡。從不善體以立名者。由其成初二篇之罪故也。",
    "孔子甘於夕死": "論語。子曰。朝聞道。夕死可矣。註云。道者。事物當然之理。苟得聞之。則生順死安。無復遺恨矣。朝夕所以甚言其時之近。程子曰。言人不可以不知道。苟得聞道。雖死可也。",
    "楊雄不羨久生": "或問楊子曰。人羨久生。將以學也。可謂好學已乎。楊子曰。未之好也。學不羨。註云。仲尼志道。朝聞夕死。楊子好學。不羨久生。出楊子法言學行篇。",
    "純陀最後供": "爾時拘尸那城。工巧之子。名曰純陀。禮佛白言。唯願世尊。及比丘僧。受我最後供養。我等窮困。欲從如來求將來食。唯願哀受我等微供。然後涅槃。佛言。善哉善哉。我今爲汝斷。除貧窮。以無上法雨。雨汝身田。令汝具足。檀波羅蜜。純陀白衆。同共禮勸。佛莫涅槃。佛言。諸佛法爾。有爲亦然。速辦所施。不宜久停。是時天人。皆來奉供。佛皆不受。大衆唱言。善哉純陀。成就大福。世尊欲滿衆願。毛孔化佛。及比丘僧。悉皆受供。世尊自受純陀所奉設者。以佛神力。皆悉充足。其詳出涅槃經。爾時佛與阿難。往鐵師子純陀之家。此是如來最後食處。爾時世尊。受其食已。而說偈言。我今最後食。在於純陀家。如是五衆身。不久當滅度。出蓮華面經。",
    "免螻蟻之食": "莊子將死。弟子欲厚葬之。莊子曰。吾以天地爲棺槨。日月爲連璧。星辰爲珠璣。萬物爲齎送。吾葬具豈不備耶。何以加此。弟子曰。吾恐烏鳶之食夫子也。莊子曰。在上爲烏鳶食。在下爲螻蟻食。奪彼與此。何其偏也。出莊子雜篇。",
    "善伏": "時有國王。名曰勝光。王有太子。名曰善伏。因見獄中。受罪之人。心生悲慜。白父垂宥。大臣不可。王怒欲誅太子。王后聞之。白言大王。願聽太子半月行施。卽於日光園中。設大施會。時虗空燈王如來。知其可度。入園說法。令得道果。出華嚴經七十三卷。",
    "吉祥長者": "佛告諸比丘。菩薩思惟。古佛坐於何座而證菩提。作是念時。卽知過去諸佛。皆坐淨草而成正覺。復念誰能與我如是淨草。時釋提桓因。卽變其身。爲刈草人。作菩薩右。持草而立。菩薩問曰。汝名字誰。答曰。我名吉祥。菩薩思惟。我今欲求自身吉祥。復欲令他而得吉祥。人名吉祥。於我前立。我今定證阿耨菩提。卽坐淨草而發誓言。我今若不證。無上大菩提。寧可碎是身。終不起此座。出方廣大莊嚴經第八卷。",
    "二南雅頌": "二南者。詩經篇名周南召南也。雅者。大雅小雅也。頌者。周頌魯頌商頌也。詳見詩經小註。",
    "陽春雪曲": "楚襄王問宋玉曰。先生其有遺行與。何士民衆庶。不譽之甚也。宋玉對曰。唯。然有之。願大王寬其罪。使得畢其辭。客有歌於郢中者。其始曰夏里巴人。國中屬而和者數千人。其爲陽阿薤露。國中屬而和者數百人。其爲陽春白雪。國中屬而和者數十人。引商刻羽雜以流徵。國中屬而和者。不過數人而已。是其曲彌高其和彌寡。詳見戰國䇿。",
    "琳法師稱名七日": "貞觀十三年。方士秦世英。譖法師慧琳。著論訕毀皇宗。有旨捕琳。琳知之。變服自繫。詣闕請譴。制旨曰。據爾論。有念觀音者。臨刑不傷。今詳罪犯。當坐大辟。賜假七日。爾可勤念之。貴臨刑自免。琳奉制一無所念。至期詔問。所念觀音感應如何。對曰。隋季失德。四海沸騰。陛下廓清寰宇。道洽生靈。琳自七日已來。不念觀音。惟念陛下。帝訝其言。遣御史韋琮。問琳所以念朕之狀。對曰。觀音至聖。垂形六道。上天下地。皆爲師救。陛下御臨宸極。萬國懽心。文治正平。靈鑑無外。聖與觀音齊等。所以惟念陛下。琮奏其語有旨免刑。流於益州。師著辯正論八卷。死於蜀。百牢關。未幾秦世英被誅矣。見佛祖通載。",
    "孫敬德誦經千遍": "魏天平中。定州孫敬德。造觀音像。常加禮事。後爲劫賊所加。不勝考掠。遂妄承罪。將斷死刑。夢一沙門。令誦救生觀世音經千遍。得脫其難。有司執縛向市。且行且誦。臨刑滿千。刀斫折爲三段。皮肉不損。凡經三換。刀折如初。官史驚異。具奏丞相高歡。表請免死。勅寫其經。廣布於世。孫敬德還家。見像項上。有三刀之痕。其感應如此。見法苑珠林十七卷。",
    "道冏": "宋京師南㵎寺。道冏。姓馬氏。扶風人也。出家爲道懿弟子。懿病。嘗遣冏等四人。至河南霍山採鍾乳。入穴數里。跨木渡水。三人溺死。炬火又亡。冏料無濟理。冏素誦法華。存念觀音。見一火光。遂得出穴。見法苑珠林。及高僧傳。",
    "魯肆大眚": "魯莊公二十有二年。春王正月肆大眚。註云。肆放。眚過也。放縱大過猶今赦書。大罪悉皆原免也。春秋特書肆大眚。於文姜薨葬之間。善莊公之能補過也。出春秋左傳註評測義第六卷。",
    "唐禁笞背": "唐太宗。讀明堂鍼炙書云。人五臟之繫。咸附于背詔自今毋得笞囚背出鑑書。及唐史。",
    "不孝有三": "孟子曰。不孝有三無後爲大註云。於禮有不孝者三事。謂阿意曲從。陷親不義。一也家貧親老。不爲祿仕。二也不娶無子絕先祖祀。三也。三者之中。無後爲大。出孟子離婁章。",
    "逢場作戲": "鄧隱峰禪師。一日辭馬祖。祖曰甚處去師云。石頭去祖曰。石頭路滑。師云。竿木隨身。逢場作戲便去。纔到石頭。遂繞禪床一帀。振錫一下。便問是何宗旨頭云。蒼天蒼天。師無語。却回舉似馬祖。祖云。汝更去見他道蒼天。汝便噓兩聲。師又去。一依前問。頭乃噓兩聲。師又無語。歸舉似馬祖。祖云向汝道石頭路滑出宗門統要並五燈會元指月錄。",
    "無親往他國": "僧祇律云。佛告諸比丘過去世時。有國名波羅奈時有弗盧醯大孝婆羅門爲國王師。常教五百弟子。時婆羅門。有一奴名迦羅呵聞說法音。盡能持憶。共諸童子。小有嫌恨。便往他國。詐言。我是盧醯婆羅門子耶國師大喜。因告之曰。我有一女今以妻汝。答言。從教。其人常嗔飲食。其婦念言脫有婆羅奈國來者。從彼受教。彼婆羅門具聞此事。便往他國。其人𭡍曰。我來此國。言是大家之子。望主勿泄此事。主言。汝實我子。卽時同主歸家。告言。我親來爲辦飲食其婦密問婆羅門曰。我夫飲食。常不可意。願尊指教客曰我臨去時。教汝一偈其人爲主求伴。其婦請偈。客教偈言。無親往他國欺誑天下人。粗食是常食。細食復何嫌。其婦念此偈。其人常作軟語。不復生嗔。佛言。彼婆羅門者。我身是也彼奴者。今闡陀比丘是也。",
    "王索仙陀婆": "善男子。如來密語。甚深難解。譬如大王。告諸羣臣先陀婆來。先陀婆者。一名四實一者鹽。二者器。三者水。四者馬如是四法。皆同此名有智之臣。善知此名。若王洗時。索先陀婆。卽便奉水。若王食時。索先陀婆。卽便奉鹽。若王食已。將欲飲漿。索先陀婆。卽便奉器。若王欲遊。索先陀婆。卽便奉馬。如是智臣。善解大王。四種密語。是大乘經。亦復如是。出涅槃經第十卷。",
    "車馬駢闐": "左思賦。車馬雷駭。轟轟闐闐。詩緝曰。闐闐衆盛猶今駢闐也。又羣行聲也。",
    "心迷法華轉": "洪州法達禪師念法華經三千部。後禮六祖曰。惟願和尚大慈略說經中義理。祖曰。汝念此經以何爲宗。師曰學人愚鈍。從來但依文誦念。豈知宗趣祖曰。汝試爲吾念一遍。吾當爲汝解說。師卽高聲。念至方便品。祖曰止。此經元來以因緣出世爲宗。縱說多種譬喻亦無越於此何者因緣惟一大事。一大事。卽佛知見也。汝慎勿錯解經義。見他道開示悟入。自是佛之知見。我輩無分。若作此解。乃是謗經毀佛也。彼旣是佛。已具知見。何用更開。汝今當信佛知見者。只汝自心。更無別體。葢爲一切衆生。自蔽光明。貪愛塵境。外緣內擾。甘受驅馳。便勞他從三昧起。種種苦口。勸令寢息。莫向外求。與佛無二。故云。開佛知見。汝但勞勞執念。謂爲功課者。何異𤛆牛愛尾也。師曰。若然者。但得解義。不勞誦經也。祖曰。經有何過。豈障汝念只爲迷悟在人。損益由汝。聽吾偈曰。心迷法華轉心悟轉法華。誦經久不明。與義作讐家。無念念卽正。有念念成邪。有無俱不計。長御白牛車師從此領旨。亦不輟誦持。其詳見法寶壇經。今依禪宗正脉錄出。"
}
