{
    "七地沈空難": "謂十地中第七遠行地之菩薩，住於無相觀，上不求菩提，下不度眾生，沈於一切空寂之理，而不能起六度事行。此為此土菩薩沈空之難，若往生安樂淨土，則能免此難。〔大智度論卷十、往生論註卷下、往生論註翼解卷七、往生論註顯深義記卷五〕 p95 ",
    "二脅士": "又稱二挾侍。謂侍於中尊左右之二菩薩。如彌陀如來兩旁之觀音、勢至二菩薩，藥師如來兩旁之日光、月光二菩薩，釋迦如來兩旁之文殊、普賢二菩薩。 p209 ",
    "二種迥向": "乃淨土門所立。(一)往相迴向與還相迴向。(一)以己之功德，迴施一切眾生，願同往生彌陀淨土者，是為往相迴向。(二)已生彼土，成就一切功德，而願迴還生死稠林，教化一切眾生，使向淨土，則為還相迴向。〔往生論註卷下〕",
    "八名陀羅尼經": "請參閱  八名經 ",
    "八葉蓮臺": "乃指胎藏界曼荼羅之第一院中臺，因以八瓣蓮華描繪，故有此名。又作八葉中臺。大日如來坐於其中，稱八葉之中尊，四方之八葉分別配以寶生、開敷華王、無量壽、天鼓雷音等四佛及普賢、文殊、觀音、彌勒等四菩薩，合為九尊，為三密相應時我人肉團心（心臟）開敷之相。〔大日經卷二、大日經疏卷四〕 p304 ",
    "十誦比丘波羅提木叉戒": "請參閱  十誦比丘波羅提木叉戒本 ",
    "三箇告敕": "於法華經之說會中，釋尊對迹化菩薩與來自他方之菩薩所予之三度教敕。即：(一)如來不久當入涅槃，乃欲以此法華經付囑諸弟子乃至後世之人。(二)告諸大眾，佛滅度後，若有能讀誦護持此經者，今於佛前自說誓言。(三)諸善男子，於佛入滅後，若有能受持讀誦此經者，今於佛前自說誓言。〔法華經卷四見寶塔品〕 p664 ",
    "上品蓮臺": "指上品往生極樂者所化生之蓮臺。往生極樂之三品中，上品生者化生於七寶池中之七寶大蓮華，故稱上品蓮臺。 p717 ",
    "尢智表": "籍貫生年不詳。交通大學電機系畢業，曾任商務印書館編輯，後赴美國哈佛大學攻讀無線電工程，回國後歷任大學教授。著有佛教科學觀、一個科學者研究佛經的報告。以科學之客觀立場，闡揚佛法深奧之妙義。以科學家之眼光，證明佛學所詮釋之理論，無一不符合科學家之觀念，初機學佛者不可不讀，以科學非難佛法之人，更應該讀。 p941 ",
    "分別善惡業報經": "請參閱\t    佛為首迦長者說業報差別經 ",
    "分別聖位修經": "請參閱  略述金剛頂瑜伽分別聖位修證法門經 ",
    "心經玄贊": "請參閱\t    波羅蜜多心經幽贊 ",
    "文殊師利作報法言稱經": "請參閱  須真天子經 ",
    "北臺": "指五臺山。五臺山位於山西省代州，地處北地，故稱北臺。自古為佛教聖蹟，乃文殊菩薩之靈地。（參閱「五臺山」1192） p1587 ",
    "右脅": "又作右脅臥、右脅師子臥、師子臥、獅子臥。即右脅向下，兩足相疊，以右手為枕，左手伸直，輕放身上之臥法，為比丘之正規臥法。印度以來，佛教徒一般皆採用此一臥法，而禁止左脅臥（淫欲相）、仰身臥（屬阿修羅之業）、伏臥（屬餓鬼之業）等臥法。〔中阿含卷二十長老上尊睡眠經、長阿含卷三遊行經〕 p1616 ",
    "四大泥梨經": "請參閱    四泥梨經 ",
    "四泥梨經": "全一卷。東晉竺曇無蘭譯。又作四大泥犁經。收於大正藏第二冊。泥梨，即地獄。內容敘說提舍、瞿波離、諦婆達兜、末法梨等四人墮於四大泥梨中，受大火焰之苦相。本經與增一阿含卷五十禮三寶品第五經為同本異譯，四人之名略有出入。〔出三藏記集卷四、法經錄卷四〕 p1713 ",
    "四品學經": "請參閱\t    四品學法經 ",
    "本生蔓": "請參閱\t    菩薩本生鬘論 ",
    "本誓": "指三昧耶形。即諸佛菩薩表示本誓之幖幟，顯示救度眾生之心願。〔性靈集卷七〕（參閱「三昧耶形」583） p1974 ",
    "生滅滅巳": "謂遠離生、滅之無常世界，而至無生亦無滅之涅槃寂靜世界。三卷本大般涅槃經卷下（大一・二〇四下）：「諸行無常，是生滅法；生滅滅已，寂滅為樂。」 p2070 ",
    "目連問戒律生五百輕重事": "全一卷。譯者佚名。又作五百問事經、五百問。收於大正藏第二十四冊。記述佛陀答目連所問末世比丘違犯戒律罪報之輕重。共分十八品。本經在開元釋教錄卷十三中始編入小乘律部。異本目連問戒律中五百輕重事經，凡二卷，約譯於東晉，然譯者佚名。注釋書有明代永海之目連五百問戒律中輕重事經釋二卷，及性祇著述之目連問戒律中五百輕重事經略解二卷。〔開元釋教錄卷二十、貞元新定釋教目錄卷二十三、卷三十〕 p2108 ",
    "石窟菴": "韓國著名石窟建築之一，為新羅石刻藝術之最高傑作。位於慶尚北道慶州市南約十六公里，海拔六百公尺之吐含山頂東側，其西南即為著名之佛國寺。本菴於新羅景德王十年（751）由金大城所創建。係模仿我國雲岡、龍門二石窟之形式，依山壁而開鑿，然菴內所用之花崗岩全由他處移來。 ",
    "伊梨沙掌拏": "梵語  īrsyā-pandaka。意譯妒黃門。為五種不能男之一。即見他人行淫而有妒心，生起淫根之病者。〔翻譯名義集卷二〕（參閱「五種不能男」1175） p2157 ",
    "光明玄義捨遺記": "請參閱\t    金光明經玄義捨遺記 ",
    "因順餘力": "為顯示極樂淨土之人、天、聲聞等差別之語。因，依因之意；順，從順之意；餘方，指廣大所化之世界。謂極樂淨土實無人、天之別，然為接引十方世界之眾生，故因順其世界之相，而立有人、天等名稱。因順之義有三：(一)就本業而論，據六要鈔卷四所引義寂之言，往生者或有得生人業，或有得生天業者，其生於淨土時雖無異狀，然因順本業而有人、天之名。(二)就居處而論，據大方等大集經卷四舉出淨光明佛土之相，即佛土中無二乘之名，一切皆係不退轉菩薩，其壽命具足半劫，無人、天之差別，在地為人，處空為天。(三)就舊名而論，據往生論註卷上所舉，聲聞者，乃他方之聲聞生於淨土，然仍用本名，故稱聲聞。〔無量壽經、讚阿彌陀佛偈〕 p2301 ",
    "如來悲苦薩": "如來悲，梵名    Tathāgata-karnā，音譯怛他誐多迦盧拏。列於密教胎藏現圖曼荼羅釋迦院內列北方第三位。此尊係主佛四無量心中之悲無量心。密號慈化金剛。其形像為全身呈肉色，髮下垂，天衣覆於二肘，二手合掌，交腳坐於荷葉上。種子為   （ka）。三昧耶形為合掌，或如意珠。印契為「普通合掌」。真言為悲無量心之真言，即：唵（oṃ）摩訶（mahā，大）迦盧拏夜（karnāyā，悲）娑頗羅（sphāra，普及擴大）。 p2357 ",
    "如意輪陀羅尼神咒經": "請參閱    觀世音菩薩祕密藏如意陀羅尼神咒經 ",
    "如意輪蓮花心觀門儀": "請參閱    如意輪蓮花如來修行觀門儀 ",
    "如意寶珠金輪咒經": "請參閱\t    如意寶珠轉輪祕密現身成佛金輪咒王經 ",
    "戌博迦": "梵名  Jīvaka。又作戎博迦、瞿波迦、鍋巴嘎。十六羅漢之第九。此聖者與其眷屬九百阿羅漢同住於香醉山中，護持正法，饒益有情。據唐代禪月大師貫休所畫之像，此尊側坐石上，左手持拂扇，右手屈三指，仰掌安膝上，眼光炯炯凝視前方。蘇東坡贊曰：「一劫七日，剎那三世，何念之勤，屈指默計；屈者已住，信者未然，孰能住此屈信之間？」於西藏所傳之十六羅漢中，戍博迦位列第十五。〔大悲經卷二持正法品、大阿羅漢難提蜜多羅所說法住記、羅漢圖讚集〕 p2422 ",
    "求子妊胎法": "又作求子妊胎祕法。係為求子女者所修之法。修此法時先如圖設壇，再向東方修之。若依大法之儀法修行時，則以佛眼、金輪，或以藥師、釋迦為本尊；若依平常之行儀而修時，則以觀音、文殊為本尊。然諸尊中以訶利帝母為最要。 p2964 ",
    "有炯": "（1824～1889）朝鮮禪僧。湖南玉果縣（全羅南道寶城郡）人，俗姓李。初名奉聞。號雪竇。自幼聰慧，嫻習儒典。十九歲，於長城府（全羅南道）白巖山白羊寺之正觀快逸門下得度。未久，在曹溪山之枕溟翰醒門下受具足戒。歷參諸長老宿德，後承嗣白巖道圓之法。其後，化導徒眾十餘年。李太王七年（1870），移住母岳山佛岬寺。二十六年，於楊州（京畿道）天磨山之奉印寺舉行禪門講會。同年八月，於龜巖寺小林窟示寂。世壽六十六，法臘四十六。為朝鮮近代佛門三傑之一。著有禪源溯流、楷正錄等。〔朝鮮佛教通史卷上、靈龜山雪竇大師行狀、東師列傳卷五〕 p2442 ",
    "衣祴": "乃盛花之器具。又作華祴。於印度，供養高貴之人時，用以盛花而捧之。又據玄應音義卷八、窺基之阿彌陀經疏、智圓之阿彌陀經義疏等之說，皆謂衣祴即指衣之前衿、衣襟、大帶、衣袖等，亦即以衣之一部分盛花供養。諸佛境界攝真實經卷上（大一八・二七一上）：「各各脫身所著天衣，手執衣祴，旋轉空中，以供養佛。」另據智顗之阿彌陀經義記所載，衣祴乃盛花之器，其狀如函，具有一足，可持之以為供養之用。〔法華經卷二化城喻品、阿彌陀經疏鈔卷三、慧琳音義卷七十八、希麟音義卷九〕 p2569 ",
    "衣鉢薄": "指記錄住持私有財產之簿冊。衣鉢亦指僧人之私財。據西巖了慧禪師語錄卷末所附之西巖了慧禪師行狀所載，師晚年退隱太白山，以衣鉢簿交予執事，囑咐示寂後之私財處理。可知衣鉢簿係生前私財之記錄，以便於侍者之管理。僧逝後，或充作喪送之資，或作為拍賣亡僧遺物時之憑藉，以避免疑誤。敕修百丈清規卷三遷化條（大四八・一一二七中）：「示疾覺沈重，預請兩序勤舊點對，封收衣鉢行李，就留方丈，差公謹行僕看守，以俟估唱。」黃檗清規遺物條（大八二・七七九上）：「住持人所有遺物，當一一登簿、散眾、設齋、俵嚫，餘者分及耆宿、檀越、故舊等，以表遺意；若有可鎮山門者，存焉。」〔禪林象器箋簿券門、錢財門〕 p2570 ",
    "佛開梵志阿颰經": "請參閱\t    梵志阿颰經 ",
    "阪本幸男": "（1899～1973）日本佛教學者。文學博士。岡山縣人。西元一九二九年畢業於東京大學研究所。曾任立正大學教授及法華文化研究所所長等職。屬日蓮宗。為日本當代華嚴教學權威。主要著作有華嚴經探玄記譯註、華嚴教學的研究、法華經譯註、大毘婆沙論譯註等書。 p2834 ",
    "旱雲寺": "位於日本神奈川縣。號金湯山，屬臨濟宗大德寺派。大永元年（1521，一說永正十六年，1519），北條氏綱依先考早雲庵宗瑞之遺言，再興當地之真覺寺（一說春閣寺），而命名為早雲寺，延請紫野大德寺宗清以天為開山第一世，而一切佛殿、法堂、眾寮等均仿傚大德寺之制。現今寺中尚保有方丈室、鐘堂、開山堂、書院等。〔小田原記、北條五代實紀卷三、本朝高僧傳卷四十四〕 p2425 ",
    "旱離速離": "觀世音菩薩和大勢至菩薩往昔為長那梵志之子時，分別名為早離、速離。據觀世音菩薩往生淨土本緣經載，阿僧祇劫前，於南天竺之摩涅婆吒國中，有一梵志（婆羅門志求生梵天者），名長那，其妻為摩那斯羅，生有二子，此兄弟二人以其早離父母之故，而取名為早離、速離。於兄七歲、弟五歲時母病歿，父遂再娶。時遇饑年，父北行至檀那羅山求食，繼母乃設計陷害二子，棄之於絕島上，二子悲痛之餘，遂發百願，願修菩薩道以利益十方國之眾生，發願畢即命終。父還，得知其子棄於孤島，遂往尋覓，然僅見白骨一堆，乃悲泣發五百願，以廣度諸惡眾生速成佛道，並願常住娑婆世界，說法教化。上述之長那梵志，即釋迦如來之前身，摩那斯羅為阿彌陀如來，而兄早離即觀世音菩薩，弟速離即大勢至菩薩。又檀那羅山即佛世時之靈山，絕島即補陀落山。 p2425 ",
    "沈香": "梵語    agaru, aguru,  kālāguru,  krsnāgaru，巴利語  agalu。音譯阿伽嚧、阿伽樓、阿竭流、惡揭嚕。意譯不動。為沈水香之略稱。又稱黑沈香、蜜香。係採自熱帶所產瑞香科常綠喬木之天然香料。此香木學名    Aquilaria agallocha，材質甚重，為青白色。印度、波斯、暹羅、交趾及我國廣東南部、海南島等地均產之。其木朽敗或伐採時，由中心木質部分滲出黑色樹脂，即是沈香。其香濃郁，木心堅實，入水必沈，故稱沈水香，可供藥用，治療風水腫毒。 ",
    "沒蘗藍": "梵語 mudgara。為密教法器之一，乃屬具有鉤之棓、杵等之武器。又作目竭嵐。據大日經卷三悉地出現品載，沒蘗藍係以  （kha，佉）字作成就法之成就物。另於大日經卷五祕密漫荼羅品中，記載焰摩后曾使用沒揭羅印；另於不空羂索經卷二十三中，亦曾舉出「唵沒誐囉鉢頭米」之真言，是知沒誐囉、沒揭羅等名稱，皆指沒蘗藍。又據慧琳音義卷三十六所載，目竭嵐乃具有鉤之棓、杵、劍、矛、索等武器。〔大日經疏卷十二、大日經義釋卷九、枳橘易土集卷二十五〕 p2980 ",
    "阪田寺": "又作金剛寺、小墾田坂田尼寺。為日本最早之寺廟，今為廢寺。位於奈良縣高市郡明日香村坂田。為鞍作部之氏寺，以繼體天皇十六年（522），司馬達等赴日安置大唐神為其起源，其子多須奈於用明天皇二年（587）營建。三代之鳥佛師奉獻水田二十町，為至奈良前期止之大寺。其後衰微，僅存伽藍石，出土者有布目瓦。 p2834 ",
    "剌他": "悉曇字 （rtha）。四十二字門之一。又作他、伊陀、辣他、囉他、咤呵、曷攞多、曷囉多。大智度論卷四十八廣乘品、放光般若經卷四陀鄰尼品、大般若經卷四一五念住等品等，均解為義不可得，因梵語 artha（譯為意義、義理）含此字之故；光讚般若經卷七觀品，解為逮得所持；華嚴經普賢行願品卷三十一，則解為利益眾生無我無人智慧燈。〔大般若經卷四九〇善現品、大方廣佛華嚴經入法界品四十二字觀門、華嚴經隨疏演義鈔卷八十九〕 p3262 ",
    "法問大意": "請參閱\t    大乘義章 ",
    "治禪病秘要法": "凡二卷。劉宋沮渠京聲譯。又作治禪病秘要經、禪要秘密治病經、治禪病秘要法經、治禪病秘要。收於大正藏第十五冊。內容詳述修禪者於阿蘭若處修禪時對治身心病魔之方法。共列舉十二種：(一)對治於阿蘭若亂心病之七十二種法，(二)對治噎之法，(三)對治行者貪淫患之法，(四)對治利養瘡之法，(五)對治犯戒之法，(六)對治喜樂音樂之法，(七)對治喜好歌唄偈讚之法，(八)對治因「水大」猛盛而患下之法，(九)對治因「火大」而頭痛、眼痛、耳聾之法，(十)對治入地三昧見不祥事而驚怖失心之法，(十一)對治「風大」之法，(十二)對治初學坐禪者若為鬼魅所著而致種種不安、不能得定之法。",
    "金光明玄義捨遺記": "請參閱\t    金光明經玄義捨遺記 ",
    "阿蜜栗多": "梵語    amrta，巴利語  amata。又作阿弭哩多、啞蜜哩達、阿沒㗚睹。意譯作神酒。此語常見於梨俱吠陀，原意係指「達於不死之位」、「不滅」，一般皆直譯為不死或甘露。佛典中，以此語比喻諸天所用之不死妙藥，或表示佛法之妙味與妙法。〔注維摩結經卷七〕（參閱「甘露」2052） p3667 ",
    "剌繡佛像": "指刺繡的佛菩薩圖像。日本佛教界稱之為繡佛，或縫佛。為古代印度與我國所發展之技術。此技術與佛教同時傳入日本。亦有將亡人之遺髮縫入所繡之圖像，以為追弔之用。現今日本舊勸修寺藏有平安朝之釋迦如來說法圖，或有疑為出自我國唐朝者。（參閱「錦麝幀」6334） p3084 ",
    "阿彌陀二脅侍": "又作阿彌陀二夾侍。指侍立於阿彌陀佛兩邊之觀音、勢至二菩薩。觀無量壽經（大一二・三四二下）：「無量壽佛住立空中，觀世音、大勢至是二大士，侍立左右。」（參閱「阿彌陀三尊」3679） p3678 ",
    "阿鍐": "為密教用以表示胎藏、金剛二界之二祕要字。（    a，阿）字為胎藏界大日如來理法身之種子，（vaṃ，鍐）字為金剛界大日如來智法身之種子，故以此二字習胎金兩部理智之種子，此二字即可代表密教胎藏、金剛兩大部。 p3698 ",
    "南五臺": "位於陝西西安附近。為終南山中段之主峰，因有大臺、文殊、清涼、靈感、捨身五個小臺（即五座小峰）而得名。關中通志：「今南山神秀之區，惟長安南五臺為最。」有磴道直登峰頂，南望終南群峰，如翠屏環列，芙蓉插雲；北望秦川，莽莽蒼蒼，壯麗河山，盡入眼底。有明、清以來建造之大小廟宇四十多處，布局別緻，建造精巧，引人入勝。聖壽寺內有隋建五級實心磚塔。大臺頂端隋建之圓光寺，今已不存，但登臨其上，一覽群山，別具風趣。 p3737 ",
    "迦梨迦龍王": "迦梨迦，梵名  Kālika。屬鬼類之惡龍。又作迦羅迦龍王、伽陵伽龍王、加梨加龍王。意譯為俱時龍王、黑色龍王。與惡龍金毘羅皆為佛所調伏。此龍住於尼連禪河，兩目皆盲，後遇佛始重見光明。據勝天王般若波羅蜜經卷四載，此龍因見菩薩行般若波羅蜜多時，足下千輻輪相大放光明而供養之。〔有部毘奈耶破僧事卷五、佛所行讚卷四、翻譯名義集卷四〕 p3967 ",
    "迦梨龍王": "迦梨、梵名  Kāla。又作迦羅龍王、加梨加龍王、迦羅迦梨龍王。意譯黑色龍王、黑龍王。屬鬼類之龍王。據佛本行集經卷三十一載，佛成道後，曾受此龍王之請而止住於其宮殿。又據阿育王經卷二所記，佛上菩提道場時，此王奉上讚歌。又有部毘奈耶藥事卷四謂，其與憍曇摩龍王共由大海至蘇波羅城聽聞佛說法。〔雜阿含經卷二十三、正法念處經卷十八、阿育王傳卷二〕 p3967 ",
    "香姓娑羅門": "香姓，梵名  Drona，巴利名 Dona。又作豆磨婆羅門、頭那婆羅門、屯屈婆羅門、突路拏婆羅門。佛陀入滅，遺骸舉行火葬後，諸國國王爭奪佛陀遺骨。此時，香姓婆羅門提議分遺骨為八份，予八國建塔供養。眾從其議，爭端乃息。〔長阿含卷四遊行經、三卷本大般涅槃經卷下〕 p4011 ",
    "修法阿闍梨": "指密教修法中，作加持祈禱之阿闍梨。阿闍梨，即教授弟子，使之行為端正合宜，而自身又堪為弟子楷模之師，故又稱導師。祈禱者，為加附佛力於信徒或弟子，使之蒙受佛力，故祈禱又可直稱為加持，或並稱為加持祈禱。 p4045 ",
    "宮阪宥勝": "（1921～",
    "娜多家瑟奼": "梵語   danta-kāstha。又作禪多抳瑟插。譯作齒木、楊枝。為比丘十八物之一。古印度人於飯後每以楊枝剔牙，故稱此種可供清潔牙齒之細楊枝為齒木。〔梵語雜名〕（參閱「楊枝」5487） p4080 ",
    "唅鍐": "指  （hāj）與 （maj），為不動明王之種子。通常在口誦不動真言之最後方用此二字。例如火界咒、慈救咒中即有此二字。大日經疏卷十（大三九・六八五上）：「用後二字為種子，諸句義皆成就此也」（參閱「不動明王」988） p4073 ",
    "跡門開顯": "於法華經前十四品中，對昔所言之三乘權教開三顯一、開權顯實，此時所明示之一乘實教，稱為迹門開顯。權者方便，實者真實，開方便而顯真實，乃法華經之主旨。法華經前十四品係就教法而言，為開三顯一之說；後十四品係就佛身而言，乃開近顯遠之說。即前者開三乘教之方便，而顯一乘教之真實；後者開垂迹之近佛，而顯本地之遠佛。p4326 ",
    "唵嘛呢叭咪吽": "梵語      oṃ   mani padme  hūṃ。又作唵嚤呢叭𡁠吽、唵麼抳鉢訥銘吽、唵摩尼鉢頭迷吽。意為「歸依蓮華上之摩尼珠」，即西藏佛教徒向蓮華手菩薩（梵      Padma-pāni）祈求未來往生極樂之時所唱之六字明咒。西藏佛教徒相信此菩薩在極樂世界（藏       bde-ba-can）之蓮臺救濟祈禱者，令出離生死，故不問僧俗，盛行口唱此明咒。據西藏古來之傳說，約西元四世紀左右，有一袷陀朵㗚思顏贊王（藏      Tho-tho-ri-gñan-btsan），曾由天上得到四寶，四寶之一即為六字明咒。又西藏觀音經摩尼伽步婆（藏      Mani  bkah  hbum），以詩讚歎此六字明咒之功德，稱其為智慧、解脫、救濟、快樂之本源。即人若一度唱六字明咒中之唵（oṃ）字，其功德能斷死後流轉於天界之途；唱嘛（ma）字，能免輪迴於惡鬼所住之修羅道；唱呢（ni）字，離再受生於人間界之厄；唱叭（pad）字，令人能遠離輪迴畜生道之災難；唱𡁠（me）字，能脫沈淪於餓鬼道之苦；唱吽（hūṃ）字，能免於死後墮入地獄道之苦。又描出唵字以白色表示天上界，嘛字以青色表示修羅道，呢字以黃色表示人間界，叭字以綠色表示畜生道，𡁠字以紅色表示餓鬼道，吽字以黑色表示地獄。又不單口唱此明咒始有功德，即著之於身，或持於手，或藏於家，亦得生死解脫之因。西藏人多書此六字明咒於長布片等，藏於經筒中，稱為法輪；一般以手自轉，或依風車、水車之力使之旋轉，稱為轉法輪。並認為旋轉法輪之功德得以了脫生死輪迴之苦。最大之法輪，書有十億之明咒。又西藏境內所見門戶飄揚之旗旆，即為此六字明咒，路旁所建之碑亦是，可見其尊信六字明咒之情狀。〔大乘莊嚴寶王經卷四、E. Schlagintweit: Buddhism in Tibet〕 p4417 ",
    "婆子偷筍": "禪宗公案名。即唐代趙州從諗禪師與途中所遇之婆子，藉偷筍之機緣問答而引發之一則公案。笋，即筍。據禪苑蒙求卷上載，趙州於路中遇一老婆，問其往何處去，老婆答言，偷趙州之筍；趙州又問，若遇趙州將如何，老婆即時打趙州一掌。此處係以趙州之筍為禪之真實義，老婆以此表示萬人萬物皆平等，不拘於所有或非所有。 p4452 ",
    "破跡顯本": "十種顯本之一。拂迷執於伽耶垂迹之情，而顯久遠之本地。〔法華玄義卷九〕p4235 ",
    "破羯摩僧": "為兩種破和合僧之一。即於同一結界內，別作布薩羯磨說戒，而破壞僧伽和合者。 p4235 ",
    "神迴": "唐代僧。幼習佛道，博學多聞。從大義修習天台學，復從左溪尊者學三觀，皆能精通奧旨。於寶應年中（762），聲名遠播，四方欽仰。生卒年不詳。 p4250 ",
    "脅": "梵名    Pārśva。音譯作波栗溼縛。又作波奢。意譯為難生。為印度小乘說一切有部之論師，付法藏之第九祖，禪宗傳法之第十祖。精進修行，未曾脇臥，故時人稱之為脇尊者、脇比丘、脇羅漢、長老脇、勤比丘等。尊者初為梵志師，年八十捨家染衣，城中少年譏之，以為其年衰老耄，無所進取，托跡清流，徒知飽食而已。脇尊者聞之，乃自誓必通三藏之理，斷三界之欲，以得六神通，具八解脫；終不以脇至席，經歷三載，果斷三界欲，得三明智。後又從佛陀蜜多習佛教深旨，並證得羅漢果。馬鳴初習婆羅門之學，才氣縱橫，智辯無礙，僧侶備受攻擊，致中天竺佛教大衰，脇尊者欲挽中天竺佛教之衰運，入中天竺華氏城與馬鳴對論，並折服之，馬鳴即入尊者門下，受具足戒。其後脇尊者歸北天竺，馬鳴留住中天竺宣揚佛教。後迦膩色迦王攻華氏城，攜馬鳴歸。脇尊者後奉迦膩色迦王之命，於迦濕彌羅國，與五百聖賢共編纂大毘婆沙論，得王崇敬。後於北天竺布教，高齡以歿，君臣哀悼，集其舍利，起塔供養。〔付法藏因緣傳卷五、大唐西域記卷二、卷三、翻譯名義集卷二〕p4289 ",
    "脅士": "又作夾侍、挾侍、脇侍、脇立。指侍立於本尊兩側之侍聖。士者，大士之意，為菩薩之異譯。然脇侍一般不限於菩薩，童子與羅漢亦為常見之脇侍。較常見之脇侍，釋迦佛有普賢、文殊二菩薩，或迦葉、阿難二羅漢。阿彌陀佛有觀音、勢至二菩薩。藥師如來有日光、月光，或藥王、藥上二菩薩。不動明王有制吒迦、矜羯羅二童子。觀音菩薩有善財、龍女，般若菩薩有梵天、帝釋，或法涌、常啼二菩薩。傅大士有普建、普成二童子。現存最古之釋迦像係自印度秣突羅（梵   Mathurā）一帶所出土者，釋迦趺坐於中央，其後方左右各有執持拂子之脇侍一尊。脇侍之數未必左右各一，例如藥師如來有十二神將，不動明王有八大童子，普賢菩薩有十羅剎女等。〔陀羅尼集經卷一、古今圖書集成神異典佛像部〕p4290 ",
    "脅桌": "佛堂內之用具。置於禮盤兩側之長方形桌，一般以密教較常安置此類脇桌。行者右方之脇桌通常放置敲鳴之法器，左方之脇桌則放置灑水器、塗香、念珠、柄香爐等。此外，山門左右兩邊之小門則稱脇門。p4290 ",
    "脅懸": "懸於本尊兩脇之繪像、名號等。日本真宗一般用九字、十字之名號，又有懸掛宗祖、中祖之像者。p4290 ",
    "烏魔鬼": "烏摩，梵名 Unmada。又作憂摩陀鬼。或謂醉鬼，或謂食精鬼。〔涅槃經疏卷七、慧琳音義卷二十六〕 p4180 ",
    "高臺寺": "屬日本臨濟宗寺。位於京都市。山號鷲峰山。係豐臣秀吉之嫡室北政所出家後，為祈求豐臣秀吉之冥福而創建者。德川氏傾力經營之，外觀極其壯麗，然歷來屢遭大火。寺中堂宇頗多利用山之傾斜形勢所造成，此即著名之桃山建築。 p4363 ",
    "參天台五臺山記": "凡八卷。日僧成尋（1011～1081）撰。又稱善惠大師賜紫成尋記。延久四年（1072），成尋時年六十二歲，偕賴緣、快宗、聖秀、惟觀、心賢、善久、長明等自肥前松浦來宋。翌年六月，巡禮天台山、五臺山等聖蹟，並蒙宋朝之優遇，乃以漢文逐日記載，著成此書，成為後人了解當時中日海路交通、宋代佛教概況，及其文物、風俗等之珍貴資料。全書自日本延久四年從肥前松浦出發時起筆，至宋熙寧六年（1073）六月託送新譯佛經及佛像去日本為止。本書有後人成島讓儉之考證加註而成「刪補天台五臺山記」八卷，以及高楠順次郎以京都東福寺所藏原本為底本，校合多處之抄本，更撰「成尋所記入宋諸師傳考」一卷。本書收於大日本佛教全書卷一一五、改訂史籍集覽卷二十六。 p4394 ",
    "惛沈": "梵語   styāna，巴利語 thīna。又作昏沈、惛、昏。指使身心沈迷、昏昧、沈鬱、鈍感、頑迷，而喪失進取、積極活動之精神作用。俱舍宗以惛沈為大煩惱地法之一，為引生一切染污心（不善心與有覆無記心）之心所；唯識宗則納為二十種隨煩惱之一，就其體性之假實問題而言，歷來有各種異說，然諸說中，以「惛沈之體性另有別體」之說法為正統說法。此心所以癡為根本而生起，癡以迷闇為性，故此心所以瞢重為性。屬十纏之一。與睡眠合為「惛沈睡眠蓋」，為五蓋之一。禪家以此為禪之障礙，比喻如黑暗塵坑、無明山鬼窟、蝦蟆窟裏，乃五十禪魔之一。〔成唯識論卷六、大毘婆沙論卷三十七、俱舍論卷四〕（參閱「五蓋」1194） p4578 ",
    "善見律毘娑沙": "巴利名   Samantapāsādikā。凡十八卷。南齊僧伽跋陀羅譯。又稱善見論、毘婆沙律。收於大正藏第二十四冊。本書為小乘律部五論之一，注釋錫蘭上座部所傳之律藏。卷一至卷四敘述第一、二、三次經典之結集，及律藏之傳持與阿育王之子摩哂陀至錫蘭布教之事。卷四以下主要注釋四分律，分比丘戒、比丘尼戒、騫陀伽、大德舍利弗問優波離律污出品等四篇。 ",
    "勝幢臂印陀經尼經": "梵名  Dhvajāgra-keyūrā。全一卷。唐代玄奘（602～664）譯。又稱勝幢臂印經、勝幢印經。收於大正藏第二十一冊。旨在闡論「拔苦與樂」得道之法。內容敘述昔時釋尊於雞羅（梵   Hila）山頂之天仙神宮，為大梵王及觀世音菩薩宣說勝幢臂印陀羅尼，謂受持讀誦此陀羅尼，能脫離諸惡趣之苦難，而得殊勝之利樂。本經之異譯本有實叉難陀譯之妙臂印幢陀羅尼經一卷、施護譯之勝幡瓔珞陀羅尼經一卷。 p4868 ",
    "善薩行": "指修行者為成佛道而修六度之行。如釋迦牟尼佛於成道前曾就諸仙修種種苦行，於前世現種種身，修布施、忍辱等行，即稱菩薩行。本生經所述即為佛陀前世五百身之修行。 p5215 ",
    "揵稚": "梵語   ghantā，巴利語同。又作揵槌、揵遲、犍椎、揵植、揵鎚、犍地。為報時之器具。意譯作鈴、鼓、鐸。本為木製，後世多為銅製。敲打揵椎之規則，稱為鼓儀。依五分律卷十八載，諸比丘布薩時，若到時不集，荒廢坐禪行道，佛乃唱「時至」，敲打揵椎，或擊鼓、吹螺集眾。〔增一阿含經卷十四、自誓三昧經、四分律卷三十五、敕修百丈清規卷下東序知事條、玄應音義卷一〕（參閱「犍椎」5521） p4957 ",
    "阜蘭寺": "位於韓國忠清南道扶餘邑扶蘇山。寺約建於百濟時代。因本寺金堂之後，有一靈泉，其周圍遍生皋蘭草，故稱阜蘭寺。臯蘭草乃該地區所特有之多年生草本，生存期限可長達三十年至五十年，故有濟州島不老草之名。其靈泉之水據傳對胃腸病具有奇效。百濟威德王（554～597）時代，日本曾派遣比丘尼數人留學於該寺。據「日本書紀」載，蘇我馬子曾勸請百濟僧，並請問受戒之法，及使善信尼等留學百濟，即指此事。 p4741 ",
    "粗餐易飽細嚼難饑": "禪林用語。又作麤食易飽細嚼難饑、麁食易飽細嚼難饑。即大口吞食雖容易飽腹，但不易吸收；細細嚼嚥則不易饑餓，且能體會其中滋味和養身。禪林中，轉指若能持續綿密之修行，將有所體悟，終必得道。無門關第四十八則兜率三關條（大四八・二九八下）：「若能下得此三轉語，便可以隨處作主，遇緣即宗；其或未然，麤湌易飽，細嚼難飢。」 p4766 ",
    "焚經臺": "漢明帝時，佛道二教燒經決真疑之處。永平十四年（71）正月一日，五嶽八山之道士褚善信等六九〇人上表，請帝火驗佛道二教之優劣。同月十五日，帝集眾於壇上，驗燒二教經典，道教之書盡成灰燼，而佛經毫無損壞。翻譯名義集卷七譯師條引唐太宗焚經臺詩（大五四・一一七八上）：「門徑蕭蕭長綠苔，一回登此一徘徊；青牛謾說函關去，白馬親從印土來。確實是非憑烈焰，要分真偽築高臺；春風也解嫌狼籍，吹盡當年道教灰。」（參閱「迦葉摩騰」3971） p5068 ",
    "無文道璨禪師語錄": "請參閱      無文道燦禪師語錄 ",
    "陰騭錄": "全一卷。明代袁了凡（十六世紀）撰。又稱了凡四訓。為敘述我國民間道德之代表作品。本書為袁了凡某次參訪雲谷禪師，因此了悟「立命說」，知善惡行為與因果報應真理，而編著本書，認為陰隲為支配人類之天，依人行為之善惡，可定其福禍。其內容首論「謙虛利中」之理，次述「積善餘慶」之列，並列舉善行之十大德目。卷末載「知過能改，善莫大焉」，並提出改過三法。本書思想頗受形成於南北朝時代之增壽益算說之影響，且為一儒、道、佛三教混融一體之思想。佛教因果報應之觀念更散見於全書各處，而成為一般民眾善惡行為之道德準則。 p4827 ",
    "華臺": "指佛菩薩之臺座。佛菩薩之臺座大都以蓮華所成，故稱華臺。大日經疏卷十五（大三九・七三三下）：「如世人以蓮華為吉祥清淨，能悅可眾心，今祕藏中亦以大悲胎藏妙法蓮華為最深祕吉祥，一切加持法門之身，坐此華臺也。」（參閱「蓮臺」6155） p5234 ",
    "梨師達多富那羅": "梨師達多，巴利名   Isidatta，意譯仙授、仙施、仙餘，意指從仙人處求得之子；富那羅，巴利名  Purāna，又作布囉拏、富蘭那，意譯宿舊、舊，為梨師達多之兄。此兄弟二人，係佛世中印度波斯匿王之大臣，為拘薩羅國之首富，然能於佛及四部眾等共與受用，而不計我所。據雜阿含經卷三十五載，富蘭那專修梵行，離欲清淨，不著香華，遠諸凡鄙，故以持戒為勝；梨師達多不專精梵行，然其智足達四聖諦，故以智慧為勝。其後命終，佛記說二人一為持戒勝，一為智慧勝，於後世得斯陀含果，生於兜率天。又據具德經載，仙授與布囉拏同為佛之優婆塞弟子。〔雜阿含經卷三十〕 p5056 ",
    "浮土五祖繪傳": "全一卷。藏於日本鎌倉光明寺。係描繪我國淨土教五祖之像，並附有漢文之傳記。書後有（1305，嘉元三年）之記。 p4683 ",
    "跋伽娑仙": "跋伽婆，梵名  Bhārgava，巴利名  Bhaggava。又稱婆伽婆仙、婆伽仙、跋伽仙。意譯作瓦師。又稱無不達。為住毘舍離國苦行林之仙人。釋尊出家踰城後，直往其處問道，因以著名。其學說不詳。據過去現在因果經卷二載，此仙人與其他修行諸仙，皆修苦行，求生於天，披草、樹皮蔽體，食花果，或行自餓之法，事水火，奉日月，或翹一腳，臥於塵土、荊棘等。依之，可知此仙為苦行外道。其他事蹟不詳。〔佛本行經卷二瓶沙王問事品、佛本行集經卷二十觀諸異道品、有部毘奈耶破僧事卷三〕 p5285 ",
    "雲巖豎起掃帚": "禪宗公案名。又作雲巖掃地、雲巖拂地。本則公案記述雲巖曇晟接化道吾圓（宗）智，令其覺醒本來面目之因緣。從容錄第二十一則（大四八・二四〇下）：「雲巖掃地次，道吾云：『太區區生！』巖云：『須知有不區區者。』吾云：『恁麼則有第二月也！』巖提起掃箒云：『這箇是第幾月？』吾便休去。」上引之中，雲巖將掃箒豎起，問道吾「這箇是第幾月」，意謂除自己本來面目之外，是否尚有另外一個自己，旨在令道吾覺醒「本來之自己」。或謂此則公案亦顯示雲巖忙中有閑之生活情致；蓋凡悟道之人，無論掃地搗米、搬柴運水，當下即是所行所事之三昧，忙中有閑，悠悠其境，既不干涉任何其他之景物、心念，然又含攝森羅萬象於此一當下三昧中。 p5351 ",
    "隆睹喇嘛全書": "凡三十一帙。格魯派僧人隆睹喇嘛著。內容主要為對於顯宗、密宗及大小五明諸類名詞之注釋。 p5321 ",
    "黑𧈭懷珠": "(一)黑𧈭，含有劇毒之蛇。以黑𧈭懷有寶珠，毫無用處；喻指修行者對佛法雖有所解而不能用，或用而不當，猶是生死凡夫，終不能破除煩惱而入無生忍。摩訶止觀卷七下（大四八・一〇一中）：「雖聞不用，如黑𧈭懷珠，何益於長蛇者乎？」 ",
    "焭絕老人天奇直註雪竇和尚頌古": "請參閱    雪竇頌古直註 ",
    "圓覺修多羅了義經": "請參閱    大方廣圓覺修多羅了義經   或   圓覺經 ",
    "窣睹波大吉祥菩薩": "窣覩波大吉祥，梵名    Stūpa-mahāśrī，音譯窣覩波摩訶尸利。七白吉祥之一。又作塔大吉祥菩薩、窣堵波大吉祥菩薩、薩埵大吉祥菩薩。於阿闍梨所傳曼荼羅中，稱帶塔德菩薩、戴塔吉祥菩薩。即密教現圖胎藏界曼荼羅中，觀音院第二列第二位之菩薩。其形像身呈肉色，二手置於胸前，手中持蓮花，半跏趺坐於赤蓮花上。密號利益金剛，三昧耶形為開敷蓮花。或謂此尊即彌勒菩薩，表菩薩紹承如來佛位，或以手結窣覩波印，或因頂髻上置塔，故稱帶塔之尊。〔大日經疏卷六、大日經疏演奧鈔卷十六本、胎藏圖像卷上、諸說不同記卷三〕 p5547 ",
    "新釋仁王般若經疏": "請參閱    仁王謢國般若波羅蜜多經疏 ",
    "新釋華嚴經音義": "請參閱    新譯大方廣華嚴經音義 ",
    "經論": "請參閱    往生論 ",
    "道𭮨": "（1056～？）遼道宗時之僧。雲中（山西）人，俗姓杜。號法幢。初習儒學，兼學老莊。壯年出家，偏好禪寂，精研華嚴學。住五臺山金河寺，鑽研秘密瑜伽之法。著有顯密圓通成佛心要集二卷，該書係依據一行之大日經義釋、覺苑之演密鈔，而主張顯教與密教一致。於天慶（1111～1120）末年示寂，世壽不詳。 p5646 ",
    "道吾得褌": "禪宗公案名。南泉普願某日以裩（腰卷）示眾僧言：「無色無相之法身，具備萬有之元素（地、水、火、風等四大）否？能解明此問題者，將此裩與之。」道吾答：「地大之性，異於空性，其他水火風亦如是。」南泉即將裩予以道吾。蓋法身與四大，立於平等門則同，立於差別門則異，此語乃立於差別門而言者。景德傳燈錄卷十四（大五一・三一四中）：「南泉示眾云：『法身具四大否？有人道得，與他一腰裩。』師云：『性地非空，空非性地，此是地大，三大亦然。』南泉不違前言，乃與師裩。」另禪苑蒙求卷下謂此公案乃藥山惟儼與道吾問答之公案。 p5630 ",
    "犍稚": "梵語  ghantā，巴利語同。又作揵遲、揵槌、揵抵。為寺院中敲打用之報時器具。據五分律卷十八與大比丘三千威儀卷下所載，或於布薩，或於誦經，或於集會眾僧飯食等諸時皆可敲鳴犍椎，一如今世寺院中之打板。然據諸經所譯，或作板，或作鐘、磬、寶鈴、鐸等，所用名稱不一。其敲打之法，據四分律疏飾宗記卷八本之說，初敲時輕緩，其後漸急漸重；將欲收音時，亦須漸細漸沒。如是而鳴擊之，稱為一通；前後凡三通。後通於聲沒之次，大打三下，或二，或一，以表聲絕，即完成犍椎敲打之法。〔增一阿含經卷十四、大智度論卷二、玄應音義卷一〕（參閱「鐘」6839） p5521 ",
    "說不空羂索觀世音菩薩之祕密修行法門": "請參閱    不空羂索神變真言經 ",
    "睹貨邏國": "覩貨邏，梵名    Tukhāra,  Tuhkhāra,  Tusāra。係位於帕米爾高原西南與奧克薩斯河（Oxus）上游之古國。又稱覩佉羅國、吐火羅國、兜佉勒國、都佉國。此國地處東土耳其斯坦至波斯、印度之要衝，該地區原屬波斯帝國之一部分，於西元前三世紀為亞歷山大大帝征服後，出現大夏。至前二世紀為月氏（西方人稱為     Tokharoi）所滅，於前一世紀建立貴霜王朝。其後，相繼遭受印度笈多王朝、波斯薩珊王朝、嚈噠、西突厥之侵擾或統治。至七世紀頃，曾內附唐朝。後復受阿拉伯回教徒統治。 ",
    "豪斯貝爾": "（Fausböll, Michael Viggo; 1821～1908）丹麥之印度學學者。曾任哥本哈根大學教授（1878～1902）。從事印度古代典籍之研究，尤致力於當時尚未被重視之巴利語聖典，對於巴利學之研究風氣頗具推展貢獻。一八五五年，豪斯貝爾以巴利文校訂法句經（巴    Dhammapada），並譯成拉丁文出版，又輯有法句經註（巴   Dhammapadatthakathā）之資料，為其最初之學術研究；另有本生經（The  Jātaka, 6 vols., 1877～1897）、經集（巴   Suttanipāta, 1884）等之校訂與翻譯著作之刊行。 p5930 ",
    "儀規經": "請參閱    大悲空智金剛大教經 ",
    "彈偏析小": "天台宗於所立「五時」中用以表示第三「方等時」特質之用語。全稱彈偏析小歎大褒圓。此語出自高麗天台宗大學者諦觀所集錄之「天台四教儀」一書中。隋代天台大師智顗之法華經玄義一書則有「析小彈偏，歎大褒圓」之語。又「彈」，彈斥之意；「偏」，指化法四教中之前三教（藏、通、別），天台宗認為此三教之教法猶為應機之權教，而非圓融之究竟教法，故謂之偏；「析」，析挫之意；「小」，指小乘教（即藏教）或執於淺窄狹隘之思想教說；「歎」，稱歎之意；「大」，指大乘教或持正不偏、深廣圓融之思想教說；「褒」，褒美之意；「圓」，指圓教，即化法四教中之第四教。",
    "稻芊經": "請參閱    稻稈經 ",
    "箬庵通問": "（1604～1655）明末清初臨濟宗僧。江蘇吳江松陵人，俗姓俞。號箬庵。二十四歲，受磬山之天隱圓修所啟發，依南澗理安寺佛石大師出家。後師事金粟密雲圓悟，復歸磬山，嗣圓修之法。歷住杭州理安寺、金山龍游寺、西河古漏澤寺等，晚年住於磬山。順治十二年九月示寂，世壽五十二，法臘二十七。著有續燈存槀十二卷、箬庵問禪師語錄十二卷等。〔理安寺志卷五、正源略集卷二、五燈全書卷六十八〕 p6119 ",
    "閰羅王授記四眾逆修生七往生淨土經": "請參閱    預修十王生七經 ",
    "謝无量": "四川人。筆名謝畏因。生卒年不詳。曾任監察委員。亦曾發起佛教會、大同會。所著之「中國哲學史」，引證不少佛學資料。其弟法名萬慧，未出家前，以公費派往印度留學，精於梵文、英文，後來出家於印度，入寂於緬甸。 p6518 ",
    "榓": "梵語     deva-dāru。又作樒、木蜜、木櫁、密香、沒香。俗稱梻。屬沈香類。學名      Pinus  devadāru，或  Avaria longifolia，或      Erythrosylon sideroxyloides。其樹高三公尺餘，皮青白色，葉似槐而長，略有椒氣。六月開細白似橘之花並結果，果實如天蓼子，熟則破裂，中有子五、六顆，黑色大如豆，酸甜可食，多食則醉。其根粗厚，砍伐後，經四、五年，取其不腐壞處製成香，其味辛溫，可避臭氣及鬼尸惡氣。樹枝可供佛，皮及葉於乾後可焚香，稱為抹香。 \n另有日本所產之榓，屬木蘭科之常綠木。其學名為 Ilicium anisatum，與前者恐不同科。又有稱茵芋者，其葉似榓而稍厚，高約零點五至一公尺。生於深山之陽地，四五月頃開花結果。〔法華經卷一方便品、法華義疏卷四下、玄應音義卷七、和漢三才圖會卷八十二、乳味鈔卷一〕p6568 ",
    "禪要祕密治病法": "請參閱    治禪病祕要法 ",
    "禪要訶欲品": "請參閱    禪要經 ",
    "禪要經訶欲經": "請參閱    禪要經 ",
    "翻經臺": "南北朝劉宋詩人謝靈運，欽服於廬山慧遠，乃於寺中築臺翻涅槃經，又鑿池，並植白蓮於池中，遂稱其臺為翻經臺，後世於其舊址築有白蓮亭。〔佛祖統紀卷二十六、廬山記卷一〕 p6589 ",
    "藏王記": "請參閱    王統記 ",
    "關捩子": "禪林用語。又作關𪴛子。關，關要、關卡；棙，鍵、鈕。原為門鎖、門閂、機軸等意。引申為關鍵；在禪宗，轉指參悟奧祕玄機之要訣。景德傳燈錄卷九（大五一・二六六下）：「且如四祖下牛頭融大師橫說堅（疑作豎）說，猶未知向上關棙子，（中略）且當人事實。能體會得，但知學言語，念向皮袋裏安著，到處稱我會禪。」〔大慧書卷下、雲門匡真禪師廣錄卷上、五燈會元卷四、卷十五、祖庭事苑卷上〕 p6712 ",
    "蘇悉地羯囉經": "請參閱   蘇悉地經 ",
    "續燈存槀": "凡十二卷，另有目錄一卷。明代僧箬庵通問編，居士施沛彙集，清康熙五年（1666）刊行。收於卍續藏第一四五冊。本書由施沛蒐集宋末至明代禪門諸師之語錄、傳記、塔銘等，由通問編纂而成。共收錄臨濟宗大鑑下自十八世至三十四世、曹洞宗大鑑下自十六世至三十六世，及法系不詳者四十五人，總數約五百人。 p6862 ",
    "蘗馱矩吒": "梵名  Gandakūtī。意譯作香臺殿。為世尊之居室，位於祇園精舍中央。 p6865 ",
    "蘗羅訶": "梵名 Graha。為魅鬼之一種。又作蘗㗚何、誐囉訶、羯羅訶。即附著人身而不離之魅鬼。金剛峰樓閣一切瑜伽瑜祇經卷上愛染王品（大一八・二五六下）：「薩嚩訥瑟吒及諸誐囉訶，加忿怒降伏，一夜當終竟。」〔蕤呬耶經卷中、大日經疏卷七、卷八〕 p6865 ",
    "塵尾": "即用獸毛、麻等紮成一束，另配上象牙或木板製成之長柄，而於說法或講解經義時所用之物。麈，為外形似鹿而較大之麋類，古人以其尾製成拂塵、拂蠅。後則與拂塵同為整肅威容而持用者；或談論演說時，指授聽眾之用。我國魏晉時代之清談家，於談論之際，多有手持麈尾之習慣；其後僧侶之間，持麈尾之風氣亦廣為流行。（參閱「拂子」3259） p6372 ",
    "靈㟧": "唐代僧。籍貫、生卒年均不詳。高宗乾封（666～668）年間，住西明寺，後往終南山參謁道宣，研習律法。其後並謁文綱、大慈等師。嘗輯錄道宣平日之法語，作四分律行事鈔記、四分律輕重訣等書，今散佚不傳。〔宋高僧傳卷十四、卷十五〕 p6938 ",
    "鬱密森沈": "鬱密，形容樹木密生繁茂；森沈，形容樹林茂盛而深奧。為獅子（喻大乘）所住，而狐鬼（喻小乘）不能靠近之境域；引申指佛法之幽邃深奧。永嘉證道歌（大四八・三九六中）：「旃檀林，無雜樹，鬱密森沈師子住，境靜林間獨自遊，走獸飛禽皆遠去。」 p6983 "
}
