{
    "header": {"title": "法門名義集", "author": "唐 李師政撰"},
    "四大": "地水火風是也。和合成身。地者骨肉形體也。水者血髓潤也。火者溫暖也。風者出入氣息也。",
    "六大": "地水火風空識也。四大前說。此空大虛通分也識大了別心也。",
    "五陰": "色受想行識。此五陰共成衆生也。何以色陰。形礙爲色。領納爲受。假名爲想。起作名行。了別爲識。何謂爲陰者。陰蓋積聚。以成衆生。",
    "六根": "眼耳鼻舌身意。是爲六根。發生六識中間緣。染是識六塵。眼受何塵。色亂其想。耳取何塵。聲蕩其志。鼻染何塵。香熏其欲。舌受何塵。味長其嗜。身取何塵。著於細滑。意染何塵。流於分別。何以謂之塵。六根所緣合生染著汚心智有等塵埃之坋物也。六識隨塵障無塵智。行者觀空。得無塵解。故能不染聲色。不貪舌味。不著細滑。不起分別。達無想之理。得聖人之名。",
    "九識": "從眼至意爲六。前已具言。第七阿陀那識。第八阿黎耶識。第九阿磨羅識。通前是爲九。何名爲阿陀那者。此西域語。以義言之。我見之識。凡夫我見依此識起。障無我智令不得生。聖人修滅心定者。乃能除此惑也。除有我之惑。得無我之智。阿黎耶識者。亦西域音也。以義言之。其能有二。一持有色諸根。令其不壞。二持清淨種子。使之不亡。阿摩羅者。西域音也。此語翻之名曰淨識。又名佛性。亦名法身。體修衆德。本來清淨。在聖體而不增。處凡身而不減。但有隱顯之殊。而無高下之別。煩惱覆之則隱。智惠了之方現。非生因之所生。從了因而得了。",
    "十二入": "眼入。耳入。鼻入。舌入。身入。意入。色入。聲入。香入。味入。觸入。法入。眼等六根。爲內六入。色等六塵。相對通生識道。爲外六入。內外二六。是爲十二入。何謂爲入。根塵相對通生識道。受入愛憎。故名爲入。",
    "十八界": "六根六塵六識。總此三六爲十八界。何以名界界。性別爲義。",
    "二邊": "有見無見。是爲二邊。復有二邊。斷見常見。有見者。法性空故。不可執有。斷見者。因果滅。業報不失。不可斷也。常見者。諸法常也。法無空相。不可爲常。何以謂之邊。空有斷常皆是邪僻。不合中道。故謂之邊。維摩經云。雖行於空。而殖衆德本。雖行無相。而度諸衆生。雖行無起。而起一切善行。此是菩薩離邊無著之行也。",
    "三毒": "貪欲。嗔恚。愚癡是也。此毒能生萬咎。",
    "五欲": "色欲。聲欲。香欲。味欲。觸欲。是爲五欲也。人天福報受五欲樂。修道之人捨而不著。故維摩經云。雖福應有。不當自恣。當觀五欲無常。以求善本。於身命財。而修堅法。",
    "六賊": "六識染塵能生三毒。刦害功德。故比之賊。經云。而此識賊如猿猴走遊六根是也。",
    "八倒": "唯大涅槃有常樂我淨。而衆生謂無常樂我淨。於無見有謂無邊理及實。故名倒也。前後二四。名爲八倒。",
    "四倒": "常倒。我倒。淨倒。樂倒。我一切法謂無常樂我淨。而衆生見有常樂我淨。復有四倒。",
    "五蓋": "貪欲蓋。嗔恚蓋。睡眠蓋。掉舉蓋。疑蓋。何名爲蓋。能覆行人。名之爲蓋。蓋掩其心。令不明了。是名爲蓋。",
    "四惑": "我見。我愛。我慢。無明。謂之四惑。是第七阿陀那識生。",
    "八邪": "邪見。邪思惟。邪語。邪業。邪命。邪精進。邪念。邪定。",
    "九惱": "憎我善友。愛我怨家。及憎我身。此三種違情。各有三世。是爲(九惱)。",
    "三障": "煩惱障。業障。報障。",
    "四魔": "煩惱魔(生死因)。陰魔。死魔(此二是生死果)。天魔(生死緣)此四種(障)能解脫。故名爲魔。",
    "十纏": "一無慚。二無愧。三睡。四悔。五慳。六嫉。七姤。八眠。九忿。十覆。",
    "三漏": "欲漏。有漏。無明漏。",
    "六十二見": "於過去世五陰上。各橫計四句。過去四句者。一者如去。二者不如去。三者亦如去亦不如去。四者非如去非不如去。於未來五陰上計四句。一者有邊。二者無邊。三者亦有邊亦無邊。四者非有邊非無邊。於現在陰上。各計四句。一者常。二者無常。三者亦常亦無常。四者非常非無常。一一陰上各起四見。五陰合數爲二十。三世總計爲六十見。總目斷常二見以爲根本。是爲六十二見。十使煩惱一者身見。二者邊見。三者見取(於有漏見而生取著)四者戒取(執有漏戒以求淨果)五者邪見。六者貪。七者嗔。八者癡。九者慢。十者疑。邪見已上五種名五利使。貪嗔已下五種鈍使。利使五種爲見諦煩惱。能迷實理令不得見。鈍使五種爲修道煩惱。能障事中修之行。須陀洹人斷見諦煩惱盡。斯陀含阿那含修道煩惱而未盡。阿羅漢斷三界見諦修道二輪煩惱盡。故不生三界。小乘法中。用此使以辨煩惱。若大乘教中。則用五住以辨煩惱。",
    "五住地煩惱": "見一切處住地(遍通三界煩惱)欲愛住地(欲界煩惱)色愛住地(無?色界煩惱)小乘三果四向。漸斷前四住地煩惱未盡。故在三界中受分段生死。阿羅漢、辟支佛、地前三賢菩薩，乃至十住已還，斷四住地煩惱盡，故免三界分段生死。仍有無明住地漸斷未盡，故受三界外變易生死。故經云，阿羅(漢)、辟支佛、大力菩薩三種意生身，悉受變(易生死)。",
    "三種意生身者": "初地二地三地。名摩跋提樂意生身。四五六地。名覺法自性性意生身。七八九十地。名種類俱生無行作意生身。",
    "三歸": "歸依佛。歸依法。歸依僧。",
    "四依": "依法不依人。依義不依語。依智不依識。依了義經不依不了義經。",
    "五戒": "一不殺生。二不偷盜。三不邪婬。四不妄語。五不飲酒。是爲五戒。淨度經云。持定者天令五神護之。五戒定者二十五神營救門戶不令惡□。",
    "八戒": "一不殺。二不盜。三不婬。四不妄語。五不飲酒。六不得帶珮瓔珞。香油塗身。香熏衣裳。七不得歌舞作唱及故往觀聽。八不得上高廣大床。是爲八戒。此是白衣一日一夜持出家戒。",
    "十無盡戒": "一不殺生。二不偷盜。三不邪婬。四不妄語。五不沽酒。六不說出家在家菩薩過失。七不爲貪利自讚毀他。八不故慳。九不故嗔。十不故謗三寶藏。從今身至佛身不得犯。若有犯失。四十二賢聖法此是菩薩戒。",
    "三聚淨戒": "一切惡無不斷。是攝律儀戒。一切善無不修。是攝善法戒。一切衆生無不度。是攝衆生戒。此三聚戒者菩薩道。一不殺生。二不偷盜。三不邪婬。四不妄語。五不綺語。六不兩舌。七不惡口。八不貪欲。九不嗔恚。十不邪見。十地論中有五種十善。一者人天十善。二者聲聞十善。三者緣覺十善。四者菩薩十善。五者佛十善。五種之別言多義廣。備在論中。此不具載。",
    "六念": "第一念佛。佛是衆生無上慈父。第二念法。法是衆生煩惱良藥。第三念僧。僧是衆生三乘福田。第四念戒。戒是衆生防非止惡。第五念捨。捨是衆生除慳雜著。第六念天。天是衆生清淨果報。此天非三界之天。謂第一義也。淨故名爲天。",
    "六和敬": "身同。口同。意同。戒同。施同。見同。是謂六同。等修佛法。離諸慢爭。故名和敬。亦名質直心。",
    "六度": "布施度。持戒度。忍辱度。精進度。禪定度。智慧度。到彼岸名之度。西國正音名波羅蜜。波羅者言彼岸。蜜之言到。彼岸到也。若不達三事之空。雖行六種之善。但名爲施。但名爲戒。不得爲波羅蜜。",
    "十波羅蜜": "檀戒忍精禪慧爲六。第七方便波羅蜜(迴善施物爲他求果。名爲方便勝智)。第八願(要期起行名之爲願)第九力(伏戒斷障名之爲力)第十智(能知六度法門。名之爲智)。",
    "四攝": "布施攝。愛語攝。利益攝。同事攝。菩薩以此四事攝化衆生。故名四攝。",
    "四無量心": "慈無量。悲無量。喜無量。捨無量。慈能與樂饒益。名之慈。慈緣不局。稱爲無量。悲慜救苦厄。名之爲悲。喜慶彼得。名之爲喜。捨能亡憎愛。心會平等。離前三心。不著於相。名之爲捨。無量之義皆如前釋。",
    "八大人覺": "少欲。知足。寂淨。精進。不忘念。正慧。正定。不戲論。",
    "四親近行": "親近善友。聽聞正法。繫念思惟。如法修行。",
    "三明": "過去宿命明。未來天眼明。現在漏盡明。",
    "六通": "一身通。二天眼通。三天耳通。四他心通。五宿命通。六漏盡通。離壅無礙。名之爲通。",
    "八解脫": "第一內有色外觀色。初觀不淨。觀道未強。不能壞滅內身。但觀外色死屍膖脹。能除欲縛。故名解脫。第二內無色外觀色。習行積久。觀道增強。能於自身作亡身滅色想。唯觀外色死屍膖脹。第三淨解脫。青黃赤白可愛之色。名之爲淨。觀淨離縛。名淨解脫。第四空處解脫。希求無色。名之爲空。空處四陰離縛。名空處解脫。第五識處解脫。空境廣多。多緣則繁。厭境存心。名之爲識。識處四陰離縛。名識處解脫。第六無處有處解脫。以識多故。令心勢亂末。若心境俱亡。名爲無處有處。其處離縛。名爲(無處有處)解脫。第七非想非非想處解脫。心境麁故不復現行。外道之人名爲無心行。佛法性望猶有細慮。內外合說故言非想非非想處。第八滅盡定解脫。心法並息。名滅盡定解脫。滅諸心法離有心過。故名解脫。此名八解脫。亦名八背捨。得上棄下。名爲背捨。是八解脫。",
    "三慧": "聞慧。思慧。修慧。",
    "二智": "實相智。方便智。復有二智。如理智。如量智。",
    "四智": "我生已盡智。梵行已立智。所作已辦智。不受後有智。",
    "二道": "一者見道。二者修道。見道者。昭理名見。增明曰修。見是解也。修道者。修是修行也。能除壅障。名之爲道。",
    "四修": "無間修。長時修。恭敬修。無餘修。無間修者。惡及無記不得間隔。故名無間。長時修者。三大阿僧祇。其時長久。恭敬修者。敬人重法。盡於至心。無餘修者。修大慈悲。利他之行。遍法界衆生。修妙智慧。自利之行。徹無生法忍。備盡滿足。無所不周。故曰無餘修。",
    "十智": "一法智。二比智。三世智。四他心智。五苦智。六集智。七滅智。八道智。九盡智。十無生智。",
    "五忍": "一伏忍。二信忍。三順忍。四無生忍。五寂滅忍。地前三賢菩薩得伏忍。初地二地三地得信忍。四地五地六地得順忍。七地八地九地得無生忍。十地與佛地得寂滅忍。",
    "十想": "無常想。苦想。空無我想。食厭想。一切世間不可樂想。死想。不淨想。斷想。離欲想。盡想。",
    "四禪": "愚癡凡夫所行禪。觀察義想禪。襷緣真如禪。諸佛如來禪。",
    "十二頭陀": "一者盡形乞食。二者阿蘭若處住。三者著糞掃衣。四一坐食。五者常坐。六者中後不受非時食。七者中後不飲漿。八者但有三衣。九者毳衣。十者樹下坐。十一者空地住。十二者死屍間住。",
    "十一切處": "地水火風青黃赤白空識等。是一切處。",
    "八勝處": "一者內[02]無有色想。外觀色少。二者內有色想。外觀色多。三者內無色想。外觀色少。四者內無色想。外觀色多。五者內無色想。外觀青色少。六者內無色想。外觀色黃多。七者內無色想。外觀赤色少。八者內無色想。外觀白色多。",
    "五分法身": "戒身。定身。慧身。解脫身。解脫知見身。是名五法身。戒者防非止惡。定者心住一境。慧者緣中決斷。解脫身者。絕縛離羈。解脫知見身。解脫緣中。審之明白。此五分法身。是佛德體故。言爲說身。",
    "七淨": "戒淨。定淨。見淨。度超淨。道非道淨。行斷淨。菩提分上法上淨。",
    "七財": "信戒施聞慧慚愧。是名七財。以能資助正道故名爲財。",
    "四相": "自正。正他。能隨問答。善解因緣義。",
    "四心": "廣大心。第一心。常心。不顛倒心。",
    "三十七道品": "四念處。四正勤。四如意足。五根。五力。七覺分。八正道。總而合數爲三十七道品。四念處大小乘名有異。觀身不淨。觀受有苦。觀心生滅。觀法無我。是小乘四念處。觀身如虛空。觀受內外空。觀心但名字。觀法善惡俱不可得。是大乘四念處。四正勤。惡法未生方便令不生。名一正勤。惡法已生方便令滅。二正勤。善法未生方便令生。三正勤。善法已生方便令增。四正勤。四如意足。欲如意足。念如意足。精進如意足。慧如意足。五根。信根。進根。念根。定根。慧根。前能生後。名之爲根。五力。信力。進力。念力。定力。慧力。前能掌後。目之爲力。七覺分。念覺分。精進覺分。喜覺分。猗覺分。定覺分。捨覺分。擇覺分。八正道。正見。正思惟。正語。正業。正命。正精進。正念。正定。",
    "十力": "是處非處力、業力、定力、根力、欲力、性力、至處道力、宿命力、天眼力、漏盡力，是佛十力。是處非處力。善招樂報。惡得苦果。因果相當。名爲是處。與上相違。名爲非處。佛於是非二處。皆如實知。是名是處非處力。二業力。一切衆生三世諸業。造業之處。受報之所。皆如實知。是名業力。三定力。於諸禪定。垢淨分別。皆如實知。名爲定力。四根力。衆生諸根上下之相。皆如實知。是名根力。五欲力。知他衆生種種諸欲。是名欲力。六性力。知諸世間種種之性。是名性力。七至處道力。知一切道至處之相。名至處道力。八宿命力。知諸衆生種種宿命。是名宿命力。九天眼力。佛之天眼淨過人天。視諸衆生。無所不見。是天眼力。十漏盡力。佛諸漏盡解脫盡如實知。是名漏盡力。煩惱結使點汚流注。名之爲漏。漏無之處。名爲漏盡。以如來智慧。於此十境。照之窮極。無過無伏。故名爲力。",
    "四無畏": "一切智無畏。漏盡無畏。說障道無畏。說盡苦道無畏。一切智無畏。佛作是誠言。我是一切正智人。無有人天能如實難言。是法不知。乃至不見是微畏相。漏盡無畏。佛作誠言。我一切漏盡。無能如實難言。是漏不盡。乃至不見微畏相。說障道無畏。佛作誠言。我說障法。無能如實難言。受障法不能障道。乃至不見是微畏相。惑法礙聖。名爲障道。說盡苦道無畏。佛作誠言。我說聖道能出世間。隨是行能盡苦。無有人天能如實難言。行是聖人道不出世間。不能盡苦。乃至不見微畏相。能除煩惱。名爲盡苦。難不懼名無畏。",
    "四無礙智": "義無礙智。法無礙智。辭無礙智。樂說無礙智。義名下所以。稱之爲義。法自義之名。稱之爲法。辭說法之言。名之爲辭。樂說隨欲善授。名爲樂說。善通無滯。故言無礙智。",
    "十八不共法": "一者諸佛身無失。身行善順。名身無失。二者口無失。口業善順。名口無失。三者念無失。念順無差。名念無失。四者無異相。怨親等節護。名無異想。五者無不定心。常住三昧。無散須臾。故名無不定心。六者無不知已捨。麁細等事所有經心莫不知而後辯。故言無知已捨。七者欲無[2301]減。欲善滿足。名爲無[2401]減。八者精進無[2402]減。榮修不住。名爲精進。九者念無[2501]減。繫心守境。名之爲念。十者慧無[2502]減。緣中決斷。名爲智慧。十一者解脫無[2601]減。絕縛離羈。名爲解脫。十二者解脫智見無[2701]減。於解脫能照了明白。名解脫知見。知滿足故言無[2901]減。十三者身業隨智慧行。色形動作。名爲身業。身順智故言隨[03]行。(十四者口業隨智慧行)。十五者意業隨智慧行。思念所作。名爲意業。十六者智慧知過去世無礙。事謝往故名爲過去。過去之境盡能遍知。十七者智慧知未來世無礙。事者非未迹。名爲未來。未來之境盡知無礙。十八者智慧知現在無礙。事起未謝。名爲現在。現在之境通達遍知。此十八種唯佛獨有。不通下果。故言不共法。",
    "十號": "如來、應供、正遍知、明行足、善逝、世間解、無上士調御丈夫、天人師、佛、婆伽(婆)，是爲十號。如來，乘如實道來成正覺故名如來。應供，內具智斷受天人供養，故名應供。正遍知，解離邪錯，名之爲正；有境斯鑒，名爲正遍知。明行足者，明行無缺故言明行足。善逝者，善好也，逝去也，去至涅槃，更不復還故言好去也。世間解者，衆生及器，二種世間，智照明白，故言世間解。無上士者，功智員備，勝出餘人，無能及者，故名無上士。調御丈夫者，以三乘勝法，隨機調制，故名調御丈夫。天人師者，德備天人有所訓道，故言天人師。佛，此地翻名爲覺，覺乃無礙故言佛陀。婆伽婆者，破煩惱故名婆伽婆。",
    "五眼": "肉眼。天眼。慧眼。法眼。佛眼。是爲五眼。肉眼障內近色。天眼障外遠色。慧眼所照觀空。法眼照有。佛眼空有俱照。明過四眼。所不能知。悉皆明淨。凡言眼者。以爲功良由境別不同。所以分之爲五。",
    "三十二大人相": "一者足下安平。二者足下千輻輪。三者纖長指。四者𦢚足跟。五者手足網縵。六者手足柔軟。七者𦢚𨄔膓如伊尼近鹿王。八者踝骨不見。九者平身立手摩兩膝。十者陰藏如馬王。十一者身圓滿如尼𤘽類樹。十二者身毛上靡。十三者一一毛右旋。十四者身如金色。十五者圓光一尋。十六者皮膚細軟塵垢不著。十七者兩手兩足兩肩頂七處滿。十八者身上如師子王。十九者臂肘𦢚圓。二十者肩骨平滿。二十一者身𦢚直。二十二者四十齒。二十三者齒白淨。二十四者齒齊密。二十五者頰骨車方如師子。二十六者次第味中得上味。二十七者肉髻相。二十八者廣長舌。二十九者梵音聲。三十者目如紺色。三十一者上下眴如(牛)王。三十二者眉間白毫。",
    "八十隨形好": "咽已下六十種好。咽已上二十種好。是爲八十種好。咽下六十種。足二十抓指手足八處表裏平滿。兩踝兩膝兩𨹫兩肩兩腕兩股兩臂藏相兩圓兩膊兩脇兩腋兩乳腰背心臍咽覆(悉皆妙好。是名咽下六種十好)咽上二十者。上下耳齒兩脣兩齗兩頰兩髮鬢兩眼兩耳兩鼻孔兩眉兩額兩角。已上是名咽上二十種好。若犯戒者不課下賤人身。況大人相。復次好差葉三種無量。三阿僧祇劫修習名爲無量。安樂一切衆生名心無量。種種善業名行無量。稱德衆具修習出如來相好。",
    "三佛": "法佛。報佛。應佛。是三佛也。法佛者。佛之法身也。名爲法佛。凡聖俱有。隱顯則異。惑障未除。佛者性常隱。煩惱旣盡。法身乃現。但由了因出。不從生。因有。報佛者。佛之報身。名爲報佛。修因得果。名之爲報。應佛者。佛之應身。名之爲應佛。隨惑應現。名之爲應。始習聞思修。習能觀了法身生成報應。故般若論云。於實令各了因。亦爲餘生因。",
    "三寶": "佛寶。法寶。僧寶。三寶有三種。一者一體三寶。法身體有妙覺。名爲佛寶。法身體有妙軌。名爲法寶。法身離違爭。名爲僧寶。二者別相三寶。丈六化身以爲佛寶。不說教法以爲法寶。大乘十信已上。小乘初果已上。名爲僧寶。三者住持三寶。泥龕素像以爲佛寶。紙素竹帛以爲法寶。凡夫比丘以爲僧寶。",
    "三藏": "修多羅藏。詮戒定二學隨機破病。毘尼藏。唯詮戒學。摩德勒伽藏。唯詮慧學。亦名阿毘達摩藏。此三藏約大小乘分爲二藏。所謂聲聞菩薩藏。",
    "三乘": "聲聞乘。緣覺乘。佛菩薩乘。",
    "五乘": "人乘。天乘。聲聞乘。緣覺乘。佛菩薩乘。能運衆生從因至果。故名爲乘。",
    "二諦": "一者世諦。亦名俗諦。二者第一義諦。亦名真諦。謂緣法不目名用萬差別言顯相。皆是世諦。諦者實也。於凡是實。於聖非實。故名世諦。第一義諦真妄平等垢淨不二。凡是無實無相無詮。皆是第一義諦所攝。出世聖人乃證斯理。最實無比。故言。第一義諦。諸佛說法是依二諦。共表一法。不相違反。故維摩經云。無我無造。無受善惡之業。亦不之。上明無造受。下說有善惡。上下句豈相反樂。故有理有會通。不可偏取。世人有著空而背教者。豈不迷惑哉。",
    "四諦": "苦諦。集諦。滅諦。道諦。是爲四諦。四諦有二。一者小乘有作四諦。二者大乘無作四諦。生死果爲苦。煩惱爲集諦。寂滅聖是名滅聖諦。以無二法得道。是名道聖諦。大乘無作四諦。觀苦聖諦。知集無和合。是集聖諦。知滅無滅。是滅聖諦。以無二法得道。是名道聖諦。",
    "三法印": "一切作法無常。一切法無我。涅槃寂滅。無常有爲作法體藉緣興。遷變非恒。故名無常。無我一切諸法體無性實自在之功。故名無我。別依大乘二無我(人無我法無我)涅槃寂滅者。三毒六垢永離無餘。山體恬怕。名爲寂滅。若依大乘亦通理滅。此三法咸言印者。揩定不移故爲印。",
    "六垢": "害恨惱誑高諂。",
    "四優壇那": "一切行無常。一切行苦。一切法無我。涅槃寂滅。",
    "四種悉檀": "世界悉檀。各爲人悉檀。對治悉檀。第一義悉檀。此四悉檀總攝一切十二部經。并八萬四千法藏。悉皆是實。無相違背。佛法中有以世界悉檀故。有以對治悉檀故實。有以第一義悉檀故實。又有佛二夜經中說。佛從得道夜至涅槃夜。是二夜中間所說經教。一切皆實不顛倒。此悉檀名并其下言說。並出大智度論第一卷中。",
    "十二部經": "修多羅。祇夜。受記。伽陀。優陀那。尼陀那。阿波陀那。伊帝目多伽。闍陀伽。毘佛略。阿浮陀達摩。優波提。爲十二部經名藏。修多羅者。是一切本經一切論法。從如是我聞至歡喜奉行。無問卷數多少。皆言修多羅。祇夜真說偈不重說。受記經如釋迦如來爲彌勒授記。於來世當得作佛。是授記。伽陀是重頌偈不直說也。優陀那是無問自說經也。尼陀那是說因緣經。阿波陀那譬喻經也。伊帝目多伽是界經。亦名本事經。闍陀伽是本生經。如佛世尊本爲菩薩時所有受身是也。毘佛略是。廣經。謂大乘方等經典其義廣大。猶如虛空。阿浮陀達摩者。名未曾經也。如佛初生十方各行七步。彌猿奉蜜，白項狗聽法。如是等本名未曾有經也。優波提舍是論義經也。如佛世尊所說諸經分別廣說辯者相根也。",
    "三種般若": "一者實相般若。二者觀照般若。三者文字般若。實相般若以理爲體。體絕虛假。目之爲實。印體表彰。名之爲相。亦可以其無相爲相也。觀照般若以智慧爲體。體是般若。觀照是用。體用合說故名觀照般若。文字般若以音聲言教詮提爲體。文字非般若。何以名般若。一能生般若。二能詮般若。因中說過果故立般若也。",
    "二種涅槃": "一者性淨涅槃。二者方便涅槃。性淨天真之理。體通三世。其德圓備。本無增減。雖隱顯從緣。而體無染累。故就實彰名。稱曰性淨涅槃也。方便淨。含靈稟識。雖有真性。煩惱惑覆心莫能自反。要須籍善知識開示。有方順教傳修理鑒理事。解觀漸增。煩惑捐盡。爾乃體用行成報用方便。是以果不自剋功用差巧滅累而成。故從能爲自名曰方便淨。分別性(五根六塵爲分別性)依他性(識體爲依他性)真實性(真如爲真實性)。",
    "二無我": "一者人無我。二者法無我。人無我亦名衆生空。亦名人空。始從衆生空乃至佛空。是名人空。以龜毛破。法無我亦名法空。衆生五陰空。乃至佛五陰空。是法空。五陰是成衆生之法。五陰體空。是名法空。已上兔角破。",
    "三無性": "一無相性。二名生性。三無性性。無相性者。根塵等法據理本寂。名無相性。無生性者。本識等心據理不起。名無生性。無性性者。雙泯前二名無性性。無性體一。以從詮故立其三名。真法離相。名爲無性性。",
    "三空": "一者空三昧。二者無相三昧。三者無願三昧。三空之稱生於惑計。惑計雖衆。大統唯三。對惑辯空。空亦三矣。三惑者。一滯有故遣以空。二者有狀故祛以無相。三存情願故蕩以無願。空三昧生陰靡實。俱以爲空。垢止此空。名空三昧。無相三昧空絕有狀。以爲無相。凝慮無相。名無相三昧。無願三昧空義?稀求。以爲無願。晏然無願。名無願三昧(本音三昧漢言調直)。",
    "三無爲": "數滅無爲。非數滅無爲。虛空無爲。數滅無爲大小二乘。用智慧品數。以斷煩惱。隨分滅處。名曰數滅無爲。非數滅無爲。謂世間萬物成必有壞。久則自滅。不自智斷。草枯木朽。花彫菓落。如此之類。名非數滅無爲。虛空無爲虛空之處體非作法。名曰虛空無爲。",
    "十八空": "內空。外空。內外空。空空。大空。第一義空。有爲空。無爲空。畢竟空。無始空。散空。性空。自相空。諸法空。不可得空。無法空。有法空。無法有法空。此十八種空者。是惑之次第也。衆生之惑不可頓除。聞起執觸語生滯。故須十八種空遣惑。六足大智度論廣釋其義。義大言多。不能具載。",
    "三轉": "一者示相轉。二者勸相轉。三者證相轉。示相轉者。謂顯示有作無作四諦之相。是苦是集是滅是道。名示相轉。勸相轉者。謂勸知勸修四諦之相。經言。苦應知。集應斷。滅應證。道應修。是之勸相轉也。證明轉者。佛言。苦我已知。集我已斷。滅我已證。道我已修。是名證相轉。經云。三轉法輪於大千。謂此義也。亦可轉三乘教。名爲三轉。",
    "七種善": "初中後說善。其義真實二。言辭巧妙三。其音清淨四。純一無雜五。具足清白六。梵行之相七。",
    "五明論": "內明。因明。聲明。醫方明。功業明。內明者。佛所說者名教內論。因明能屈他論。自申己義。名爲因論。聲明顯示一切音聲差別巧便言辭。名爲聲論。醫方明者有四種。一者顯示差知病因。二者顯示病因。三者能顯示除已起之病。四者顯示已除之病令不重起。功業明顯示種種世業成就。此五種明處菩薩悉求。",
    "七種學人": "須陀洹向。須陀洹果。斯陀含向。斯陀含果。阿那含向。阿那含果。阿羅漢果。是小乘七種學人也。修而未至。名之爲向。修之已至。名之爲果。此七種人。於小乘法。果行未滿。進趣未息。故名學人。唯阿羅漢於小乘果滿。更無進趣之學。故名無學。若大乘法中。唯佛是無學。",
    "四沙門果": "須陀洹果。斯陀含果。阿那含果。阿羅漢果。須陀洹者中國音也。此云修習無漏。亦名逆流。或云解債。初果聖人得無我解。永斷見諦有漏惑盡。故名修習無漏。旣有無漏真解。能永背生死。故云逆流。逆生死流也。以其無漏力強能排三塗等苦故。立解三塗債也。斯陀含者。果頓盡修道惑細三人共除。就欲界修道煩惱。分爲九品。前六爲麁。後三爲細。斯陀含人斷前六品。正後三微住在三品薄中。故立住薄。存彼語音故名斯陀含。阿那含者。亦是西音。此云不還。亦名出淤泥。旣斷欲界惑盡。上生二界。一去不返。故名不還。欲界煩惱猶如淤泥。如得永離故云出欲淤泥。存彼西音故名阿那含。阿羅漢者。此云應供。亦名殺賊。或言不生。智斷具足。堪受物供故名應供。三界煩惱劫人功德。羅漢除之已盡故名殺賊。煩惱旣盡。業種復燋。於三界地中更不受生存。彼語音名阿羅漢。四果之通大小乘。大乘法中佛是羅漢。",
    "二種辟支佛": "一者出無佛世。獨悟非常思惟得道。名爲緣覺辟支。二者值佛爲說十二因緣之法。觀因緣之理而得悟道。名爲聲聞辟支。於三乘中。此爲中乘。亦得有餘無餘二種涅槃。辟支佛者此云緣覺。辟支者此言緣。佛者此言覺。",
    "菩薩摩訶薩乘": "菩薩此云道心衆生。摩訶薩此云大道心衆生。此人發心求佛。自利利人。六度行滿。修佛相好。學佛威儀。於三乘別教中。此是大乘。",
    "十信菩薩": "此是習種性前外凡之位。三乘諸人捨本別習。迴心向大起十心。一信心。信佛慶住大乘。歸宗不二決定無疑。二念心。於六念處憶念不忘。三精進心。如念而行勤修正觀。四慧心。還觀人法二種無我。五定心。解空處寂止心理靜。六不退心。正觀兩融心不退後。七迴向心。善會平等迴向於捨。八護法心。解理堅固受持不壞。九戒心。善護身口意業齋淨。十願心。以三業之善正求菩提故曰願心。",
    "習種性有十住菩薩": "此是內凡下品三賢初位。一發心住。始從凡境發無上道心。歷奉衆聖廣多聞慧。始入空界住性位。由彼發心而得此住。二治地住。更起勝解淨治八萬四千法門。離諸塵穢。心地清顯。三修行住。善觀諸法對治之門。慧照逾明解心涉境修種覺故。曰修行住。四生貴住。理解勝還生在真如法性理寂種清淨故。曰生貴住。五方便具足住。涉有空福智相資。善行無滯。萬解普還故。曰方便具足住。六正心住。得般若真解安心正理故。曰正心住。七不退住。空有不二。得堅固真解故。曰不退住。八童真住。從發心已來。遠離二邊。不起煩惱。長養真解。契同無生。得佛法分故。曰童真住。九法王子住。旣從法化生。得佛法分故。能治真宗令菩提立。名曰法王子住。十灌頂住。觀達真宗理照逾淨。解滿最上故。曰灌頂住。",
    "性種性有十行菩薩": "此是三賢位之中品。一歡喜行。前觀解旣滿。今如解而得自行化人。離於邪倒慶子除得之利故。曰歡喜行。二饒益行。自利行旣轉深。利他行彌廣故。曰饒益行。三無嗔恨行。旣善利他。慈悲喜捨。怨親平等。憎愛無二故。曰無嗔恨行。四無盡行。以無厭心度人不倦。利行增進無休無息故。曰無盡行。五離癡亂行。雖行有爲以度衆生。而無我人之相。爲不無昭所惑。心心不離。念佛三昧故。曰斷癡亂行。六善現行。心常在空而現行慈悲化物同己故。曰善現行。七無著行。心空不住於無行有不染相。靜亂俱遊無滯無礙故。曰無著行。八尊重行。當行於有無而有無所動不正以等行諸法一切皆如無可種棄重法心成故。曰尊重行。九善法行。旣自善行於法。而以此法授人。動成物軌故。曰善法行。十真實行。於真諦自利行成行。於俗諦利他行。真不棄於俗不乖。於其僞曰真。非虛稱實。故曰真實行。",
    "道種性有十迴向": "亦名解行地。三賢位之內凡之上品。一救護一切衆生相迴向。菩薩攝無爲衆生不合住空。攝有爲衆生不令著俗。皆迴邪倒而向正道故。救護一切衆生離衆生相迴向。二者不壞迴向。有則有爲所不礙。迴無爲而向有爲。則無爲所不俱。有無俱通。則行成莫毀故。曰不壞迴向。三等一切佛迴向。若行有爲平等圓通。則與三世諸佛同行菩提故。曰等一切佛迴向。四至一切處迴向。若能通行一切諸法實際之處故。曰至一切處迴向。五無盡功德藏迴向。旣至一切諸法實際故。能依實而成行。蘊積集衆善利潤無窮故。曰無盡功德藏迴向。六順平等善根迴向。卽以無盡平等之善出生增益故。隨順平等善根迴向。七隨順等觀一切善生衆彌廣故。能平等津道法界衆生故。曰隨順等觀一切衆生迴向。八如相迴向。一切衆生皆如也。一切法亦如也。夫如者不二不異。如此道相無不融故。曰如相迴向。九無著無縛解脫迴向。衆生卽如本來無縛也。如如卽衆生。則如無可著也。此道妙通。則無所覊礙故。曰無縛無著解迴向。十法界無礙迴向。旣達一切諸法皆是真如實相故。其縛通非可限極故。目法界無礙迴向。自此已前三十心是地前三賢之位。用三品伏忍除伏我相。相心不起。行善調順。得名爲賢。旣未永斷我相故。名內凡夫。若作無相觀行猶有相關故。在世間之位。",
    "聖種性有十地菩薩": "自此已後是出間聖人之位。初歡喜地。始出凡境初登聖境。慶心內融悅情外發。故地持論云。初證聖處多生歡喜。故名歡喜地。用聞思修慧爲加行智。斷凡夫我性無明。證遍滿功德檀波羅蜜增上。二離垢地。妙修中道芸除法垢故。名離垢地。以加行智斷於諸衆生起邪行無明盡。證最勝功德戒波羅蜜爲增上。三明地。隨聞思修照法顯現。故名明地。以加行智斷心遲苦聞思修忘失無明盡。證勝流功德忍波羅蜜爲增上。自此以前三地。總修大乘三摩提(斷闡提不信習氣障方便生死果報云得大淨果也)四炎地。定旣內明發惠外照妄僞之法於前寂滅。故名炎地。以加行智斷微細煩惱行共生身見無明盡。證無攝功德精進波羅蜜爲增上。五難勝地。得出世間智方便善功能度難度故。名難勝地。以加行智斷於下乘般涅槃無明盡。證無異功德禪波羅爲增上。六現前地。大智現前地。以加行智斷麁行相無明盡。證無染淨功德般若波羅蜜爲增上。自此已前三地。總修集福德生三摩提(斷外道著我集氣障因緣生死果報。云得大樂果)七遠行地。照法見空。於有不著。照空見法。於空不證。乃超越有九世二乘世間道故。名遠行地。以加行智斷細相行無明盡。證無分別功德方便波羅蜜爲增上。八不動地。報行純熟無明無間故。名不動地。以加行智斷於無明作功用心無明盡。證不咸功德願波羅蜜爲增上。九善慧地。色難擁已窮心滯復盡。無礙力說法成就利行故。名善慧地。以加行智斷利益衆生事不由功用無明盡。證智自在依心功德力波羅蜜爲增上。自此已前三地。總修賢護三摩提(斷聲聞自利習氣障有生死果報。云得大我果)。十法雲地。自以取得無邊善法普益蒼生。悲覆若雲。法澤如雨。能令善根開敷道耳滋義。故地論云。得大法身具足自在。名法雲地。以加行智斷於諸法中不得自在無明盡。證業因在依心功德智波羅蜜增上。此之一切地。修首楞伽三摩提(斷獨覺自愛習氣障無有生死報。云得大常果)。十一等覺地。體冥大寂安心平等。照齋種智一相無二故。名等覺地。亦名無垢地。斷煩惱垢習皆盡故。名金剛心斷無明住地。十二妙覺地。圓照內融窮鑒法性體無修始窮微盡極。故曰妙覺。亦名佛地。種智現前無上菩提。金剛以後至極常果前等覺住中。斷煩惱習除生死盡。名無礙道。今於此地得菩提證涅槃果外之果。名解脫道。前來十二聖所以名爲地者。有二體義。一能住持萬德故。通喻爲地。",
    "四十二賢聖": "十解。十行。十迴向。十地。等覺地。妙覺地。總合而數爲四十二賢聖。",
    "十二住地": "種性住(十解十行是也)。解行住(十𢌞向是)。歡喜行(初地是)。增上戒(二地是)。增上意住(三地是)。道品相應增上惠住(四地是)。諦相應增上慧住(五地是)。緣起相應增上惠住(六地是)。有行有開發無相住(七地是)。無行無開發無相住(八地是)。無得住(九地是)。最上菩薩住(十地是)。菩薩是菩薩地位。名之爲住。又行德堅固。名之爲住。住別不同。有此十二。維摩經云。我心此室十有二年者。謂十二住爲十二年。非世間十二月之年。",
    "大乘四向四果": "須陀洹向。地前三賢菩薩是。大乘須陀洹向須陀洹果。初歡喜地菩薩是。大乘須陀洹果斯陀含向。二地四地五地菩薩是。大乘斯陀含向斯陀含果。第六地菩薩是。大乘斯陀含果阿那含向。第七地菩薩是。阿那含果。第八地菩薩是。阿羅漢向。第九地菩薩是。阿羅漢果。第十地菩薩是。佛是大乘羅漢果。但十地與佛同住究竟地故。得羅漢果名。",
    "四位": "一者願樂位。二者見位。三者修位。四者究竟位。願樂位。地前三十心菩薩總名願樂位。但以此智知法身。未以證智見真如。以求欲見故名願樂。十信菩薩猶受三界分段生死。分覺生空觀。對治闡提不信障。斷四住地煩惱。盡分段生死果報。云方入十解之位。十解菩薩生空觀成就。對治外道著我障。十行菩薩分作法空觀。修自利利他行。對治聲聞自利障。十迴向菩薩作法空觀成。起大悲願力乘形六道教化衆生。對治獨覺自愛障。此地前三十心菩薩對治四種障。但除正使。未治習氣。十地菩薩始斷其習。次第於十地名下已錄。見位。爲得入初地見本身中真如佛性故名見位。修位。從二地至七地修位猶有功用而修其行。究竟位從八地至十地名究竟位。不修功用其心運運還至佛果。",
    "三行": "善行。不善行。不動行。人天福業名爲善行。三塗罪業名不善行。色界無色界空地名不動行。",
    "三業": "白業。黑業。不白不黑業。人天名白。四趣名黑。無漏名爲不白不黑。",
    "四報": "一者現報。二者生報。三者後報。四者不定報。現世而得報者。名爲現報。未來次生而得報者。名爲生報。從第三生已去而得報者。名爲後報。遇緣則受。不定三時。名爲不定報。善惡之業皆有四報。",
    "二報": "一者依報(亦名共相)二者正報(亦名不共相)身外之果名爲依報。國土善惡。如此等是。身上之果名爲正報。形容醜麗。如此等是。",
    "十因": "隨說因(諸法名想言說。是名隨說因)。以有因(以有事故有所作。是名以有因。以有手故有所作。以有足故有遊行。以有飢渴故求飲食。如此之類名因)。種殖因(種諸種子。名種殖因)攝因(水土潤澤。是名攝因)生因(種子於芽。是名生因)長因(芽莖相續乃至成熟。名長因也)自種因(種種種子各各生子。是自種因)共事因(彼以有因種殖因攝因生因長因自種因。總此因名共事因)相違因(障礙於生。名相違因)不相違因(不障礙者。名不相違因)。",
    "四緣": "因緣。次第緣。緣緣。增上緣。因緣親生名因。就因辨緣故名因緣次第緣後心是前心次第子。次第法爲緣故名次第緣。緣緣六識能緣六塵。名之爲緣。六塵與彼緣法作緣故名緣緣。增上緣六根等法生識中。強名爲增上用。增上法爲緣故名增上緣。",
    "十二因緣": "無明緣行。行緣識。識緣名色。名色緣六入。六入緣觸。觸緣受。受緣愛。愛緣取。取緣有。有緣生。生緣老死(諸經說十二因緣。其言如此)無明緣行。於緣不了名爲無明。以無明故發生於行。無明與行二種是過去二因也。行者生死業也。行緣識。以有過去行業。發起現在生識。神初受生之時。名之爲識。識緣名色。以有受生之識。發起名色。名色者五陰也。受想行識四陰名爲名。色之一陰稱爲色。受等四陰總爲名者。以心道冥隱無形可見但可障其名字故。謂之名也。此謂在胎之時。六根未用五陰初具故云名色。名色緣六入。由名色故發生六入。六入者六根也。通生識道故名爲入。此謂出胎在外六根開顯時也。六入緣觸。由六入故發生於觸。根塵識等之事和合觸對前境。名之爲觸。觸緣受。由觸境故發生受。於境領納名爲受也。從識至受五種是現在果也。受緣愛。由受納故發生於愛。於緣起染名爲愛也。此是現在第一因。愛緣取。由染愛故發生於取。緣染入有所執惑名爲取也。此是現在第二因。取緣有。由取著故發起於有。身口造作能招來有。以果自因故名有也。此是現在第三因。有緣生。由現在起有令未來受生。於法始起名之爲生。生緣老死。由有生故起於老死。是老死之緣故云生緣老死。餘皆類此。生與死是未來二報。夫十二因緣者生死繫縛之因緣也。必須滅此因緣。乃得免於生死。是故經云。無明滅則行滅。乃至生滅則老死滅是也。若三世分之。過去二種。中間有八。未來有二。過去唯因。未來唯果。中間現在因果合說。所以然者。旣前有二因故。以五果往酬。未來二果故。須三因往剋。",
    "三世": "過去世。現在世。未來世。",
    "三界": "欲界。色界。無色界。是名三界。亦名三有。欲界始從地獄上至六天。皆有六欲之情。通爲欲界。色界總有四禪。合十八天。初禪梵天已上無有女形。色身清淨故曰色界。非是散善所能惑也。要修禪定得生其中。無色界有四天。此衆生過去時厭患色礙。修無邊虛空三昧生在其中。無有身形。但有四心故。曰無色界。不得聞法。名爲難處。",
    "二世間": "一者衆生世間。二者器世間。衆生世間衆生種數等是。器世間國土山河等是。",
    "四天下": "東名弗婆提。西名拘邪尼。南名閻浮提。北名欝單越。此四天下居須彌山四面住也。南閻浮提人壽命一百二十五歲。東弗婆提人壽命五百歲。西拘邪尼人壽命二百五十歲。北欝單越人壽命千歲。無中夭者。聖人不生其中。名爲難處。",
    "二十八天": "欲界有六天。色界有十八天。無色界有四天。欲界六天。第一四天王天(修中之下品十善則生其中)第二忉利天(修中之中品善則生其中)。第三夜摩天(修中之上品十善則生品十其中)。第四兜率陀天(修上之下品十善發願行慈則生其中)。第五化樂天(修上之中品十善則生其中)第六他化自在天(威力自在與佛等故稱爲魔王修上上品十善則生其中)。色界四禪合十八天。初禪(梵天梵衆天大梵天)。第二禪(少光天。無量光天。光音天)第三禪(少淨天。無量淨天。遍淨天)。第四禪(福生天。福受天。廣果天。無極天。此四天是凡夫。無煩惱天。無熱天。善見天。善現天。色究竟天。從無煩惱天以後五天是阿那含人。依第四禪修五品動禪生五天中。名五淨居天)。無色界四天。空處天。識處天。無處有處天。非想非非想天(凡夫爾時謂心都盡。名爲涅槃。聖者以理集之。怛無麁想。由有細想具足四心。是以更施後句情理合說故。曰非想非非想天。壽命八萬大劫。此三界中最上。名曰有頂。亦名第一有也)。",
    "二十五有": "四惡趣(爲四)四天下天(并前爲八)六欲天(并前爲十四)梵天(并前爲十五)無想天(并前十六)五淨居天(并前十七)初禪二禪三禪四禪等(并前合二十一)無色界四天。是名二十五有。",
    "五濁": "一命濁。二衆生濁。三煩惱濁。四見濁。五劫濁。壽命短促名曰命濁。衆生造惡名衆生濁。貪嗔癡長名煩惱濁。邪見轉生名爲見濁。飢饉疫病刀興等起是名劫濁。",
    "八難": "地獄難。畜生難。餓鬼難。北欝單難。佛前佛後難。長壽天難。聾盲喑啞難。世智辯聽難。生善處對治五難。謂三塗及欝單越長壽天等。值善人對治佛後難。發宿心願治世智辯聽。值善根治盲聾喑啞。",
    "四趣": "地獄。餓鬼。畜生。阿修羅。是爲四趣。",
    "六道": "地獄道。畜生道。餓鬼道。阿修羅道。人道。天道。是爲六道衆生。亦名六趣。",
    "三千大千世界": "一須彌山一四天下。下阿鼻地獄上至非想非非想天。此爲一段。三界衆生如是次第有千須彌山四天下。乃至千非想非非想天。有一大鐵圍山繞之。名爲小千世界。卽以小千鐵圍爲數至千。復有大鐵圍繞之。名爲中千世界。亦名二千世界。卽以中千名數數之至千。復有大鐵圍山繞之。名爲三千大千世界。此諸鐵圍山次第倍高。初一四天下鐵圍倍高須彌。次小千鐵圍倍高於初。次中千鐵圍倍高小千。次三千鐵圍最爲高大。與色界等一切衆生在此四重鐵圍之中。流轉生死不能得出。名爲窂獄。此等一段衆生善惡萬差苦樂雜穢。故名娑婆世界。釋迦如來於中絁化令得出世。從化主爲名亦名佛世界。猶如西方無量壽國。十方無量無邊盡虛空法界亦名如是。然其多少不同。或以恒沙三千大千世界爲一佛土。或復清淨無三惡道。"
}
