{
    "header": {"title": "翻譯名義集", "author": "宋 法雲編"},
    "多陀阿伽陀": "亦云怛闥阿竭，後秦翻為如來。金剛經云：無所從來，亦無所去，故名如來。此以法身釋。轉法輪論云：第一義諦名如，正覺名來。此以報身釋。成實論云：乘如實道，來成正覺，故名如來。此約應身釋。",
    "阿羅訶": "秦云應供。大論云：應受一切天地眾生供養。亦翻殺賊，又翻不生。觀經疏云：天竺三名相近，阿羅訶，翻應供；阿羅漢，翻無生；阿盧漢，翻殺賊。",
    "三藐三佛陀": "亦云三耶三菩。秦言正遍知。大論云：是言正遍知一切法。什師言正遍覺也。言法無差故言正；智無不周故言遍；出生死夢故言覺。妙宗云：此之三號，即名三德。今就所觀，義當三諦：正遍知，即般若，真諦也；應供，即解脫，俗諦也；如來，即法身，中諦也。故維摩云：阿難！若我廣說此三句義，汝以劫壽不能盡受。",
    "鞞侈遮羅那三般那": "秦言明行足。大論云：宿命、天眼、漏盡，名為三明。三乘雖得三明，明不滿足，佛悉滿足，是為異也，具足三明及六神通。智論云：一如意、二天眼、三天耳、四他心、五識宿命通、六無漏通。言神通者，易曰：陰陽不測之謂神，寂然不動，感而遂通。瓔珞云：神名天心，通名慧性。天然之慧，徹照無礙，故名神通。一如意者，有三種：能到、轉變、聖如意。能到復四：一、身飛行如鳥無礙；二、移遠令近，不往而到；三、此沒彼出；四、一念能至。轉變者，大能作小，小能作大，一能作多，多能作一。種種諸物，皆能轉變。外道輩轉，極久不過七日。諸佛及弟子，轉變自在，無有久近。聖如意者，外六塵中，不可愛不淨物，能觀令淨；可愛淨物，能觀令不淨，是聖如意法，唯佛獨有。天眼通者，於眼得色界四大造清淨色，是名天眼。天眼所見，自地及下地、六道眾生、諸物、若近若遠、若麤若細，諸色，無不能照。是天眼有二種：一從報得，二從修得。是五道中天眼，從修得，非報得。何以故？常憶念種種光明得故（云云）。天耳通者，於耳得色界四大造清淨色，能聞一切聲，天聲、人聲、三惡道聲。云何得天耳通修得？常憶念種種聲，是名天耳通。識宿命通者，本事常憶念日月年歲至胎中，乃至過去世中，一世、十世、百世、千萬億世。乃至大阿羅漢、辟支佛，知八萬大劫；諸大菩薩及佛，知無量劫，是名識宿命通。知他心通者，知他心，若有垢、若無垢。自觀心生住滅時，常憶念故得。復次觀他人喜相、瞋相、怖相、畏相，見此相已，然後知心，是為他心智。無漏通者，如來莊嚴入一切佛境界經云：言無漏者，謂離四漏，謂欲漏、有漏、無明漏、見漏，以不取彼四種漏故，乃名遠離諸漏。智論問：神通與明，有何等異？答：直知過去宿命事，名通；知過去因緣行業，名明（宿命）。直知死此生彼，名通；知行因緣際會不失，名明（天眼）。直盡結使，不知更生不生，名通；若知漏盡，更不復生，名明（無漏）。",
    "脩伽陀": "秦言好去。大論云：於種種諸深三摩提，無量智慧中去。或名脩伽度。此云善逝。菩薩地持經云：第一上升，永不復還，故名善逝。",
    "路伽憊": "大論云：是名知世間。知二種世間：一眾生，二非眾生；及如實相，知世間果、世間因，出世間滅、出世間道。地持經云：知世間眾生界一切種煩惱及清淨，名世間解。",
    "阿耨多羅": "秦云無上。大論云：如諸法中，涅槃無上；眾生中，佛亦無上。地持經云：唯一丈夫，名無上士。大經云：有所斷者，名有上士；無所斷者，名無上士。",
    "富樓沙曇藐婆羅提": "秦云可化丈夫調御師。大論云：佛以大慈大智故，有時軟美語，有時苦切語，有時雜語，令不失道。若言佛為女人調御師，為不尊重；若說丈夫，一切都攝。",
    "舍多提婆魔㝹舍喃": "此云天人教師。大論云：佛示導，是應作、是不應作，是善、是不善，是人隨教行。又云：度餘道眾生者少，度天人眾生者多。",
    "佛陀": "大論云：秦言知者，知過去、未來、現在，眾生、非眾生數，有常、無常等，一切諸法，菩提樹下，了了覺知。故名佛陀。後漢郊祀志云：漢言覺也。覺具三義：一者自覺，悟性真常，了惑虛妄；二者覺他，運無緣慈，度有情界；三者覺行圓滿，窮源極底，行滿果圓。故華嚴云：一切諸法性，無生亦無滅，奇哉大導師，自覺能覺他。肇師云：生死長寢，莫能自覺；自覺覺彼者，其唯佛也。妙樂記云：此云知者覺者，對迷名知，對愚說覺。佛地論云：具一切智，一切種智，離煩惱障，及所知障。於一切法，一切種相，能自開覺，亦能開覺一切有情。如睡夢覺，如蓮華開，故名為佛。肇曰：佛者何也？蓋窮理盡性，大覺之稱也。其道虛玄，固已妙絕常境。心不可以智知，形不可以像測。同萬物之為，而居不為之域。處言數之內，而止無言之鄉。非有，而不可為無。非無，而不可為有。寂寞虛曠，物莫能測。不知所以名，故強謂之覺。其為至也，亦以極矣。何則？夫同於得者，得亦得之；同於失者，失亦失之。是以則真者同真，法偽者同偽。如來冥照靈諧，一彼實相，實相之相，即如來相。無機子敘六即佛曰：癡禪任性，濫上聖以矜高，狂慧隨情，居下凡而自屈。由是天台智者祖師，明六即佛。破二種見，揀其太過，六分因果之事殊，收彼不收，即顯聖凡之理等。沈生死海，如寶在暗而不失。升涅槃山，猶金出礦以非得。不一不異，其道融通，無是無非，此智圓妙。今述鄙頌，式讚大猷，庶幾見聞，咸得開悟云爾！一、頌理即佛，動靜理全是，行藏事盡非，冥冥隨物去，杳杳不知歸。二、頌名字即佛，方聽無生曲，始聞不死歌，今知當體是，翻恨自蹉跎。三、頌觀行即佛，念念照常理，心心息幻塵，遍觀諸法性，無假亦無真。四、頌相似即佛，四住雖先脫，六塵未盡空，眼中猶有翳，空裏見華紅。五、頌分真即佛，豁爾心開悟，湛然一切通，窮源猶未盡，尚見月朦朧。六、頌究竟即佛，從來真是妄，今日妄皆真，但復本時性，更無一法新。",
    "路迦那他": "大論云：翻世尊。成論云：具上九號，為物欽重，故曰世尊，天上人間所共尊故。此十號義，若總略釋：無虛妄，名如來；良福田，名應供；知法界，名正遍知；具三明，名明行足；不還來，名善逝；知眾生國土，名世間解；無與等，名無上士；調他心，名調御丈夫；為眾生眼，名天人師；知三聚，名佛；具茲十德，名世間尊。涅槃疏云：阿含及成論，合無上士與調御丈夫為一號，故至世尊十數方滿。涅槃及大論，開無上士與調御丈夫為兩號。而輔行云：大論合無上士調御丈夫以為一句。此文誤也，學者詳之。",
    "婆伽婆": "應法師云：薄伽梵，總眾德至尚之名也。大論云：一名有德；二名巧分別諸法；三名有名聲，無有得名聲如佛者；四能破婬怒癡。新云薄伽梵，名具六義。佛地論曰：薄伽梵聲，依六義轉。一自在，二熾盛，三端嚴，四名稱，五吉祥，六尊貴。頌曰：自在熾盛與端嚴，名稱吉祥及尊貴，如是六德義圓滿，是故彰名薄伽梵。其義云何？謂如來永不繫屬諸煩惱故，具自在義。猛燄智火所燒煉故，具熾盛義。妙三十二大士相等所莊飾故，具端嚴義。一切殊勝功德圓滿，無不知故，具名稱義。一切世間親近供養，咸稱讚故，具吉祥義。具一切德，常起方便，利益安樂一切有情，無懈廢故，具尊貴義。唐奘法師明五種不翻：一、祕密故不翻，陀羅尼是；二、多含故不翻，如薄伽梵含六義故；三、此無故不翻，如閻浮樹；四、順古故不翻，如阿耨菩提，實可翻之，但摩騰已來，存梵音故；五、生善故不翻，如般若尊重，智慧輕淺，令人生敬，是故不翻。",
    "釋迦文": "淨名疏云：天竺語，釋迦為能，文為儒，義名能儒。大論云：釋迦文佛，先世作瓦師，名大光明。爾時有佛，名釋迦文，弟子名舍利弗、目伽連、阿難。佛與弟子，俱到瓦師舍一宿。爾時瓦師，布施草座、燈明、石蜜漿，便發願言：我於當來作佛，如今佛名，弟子名字，亦如今佛。優婆塞戒經云：我於釋迦最初發心，於迦葉佛滿三僧祇。須知三祇正滿，在於勝觀。今言迦葉，兼百劫故。大論云：初阿僧祇中，心不自知我當作佛、不作佛；二阿僧祇中，心雖能知我必作佛，而口不稱我當作佛；三阿僧祇中，了知得佛，口自發言，無所畏難，我於來世當得作佛。從過去釋迦文佛，到剌那尸棄佛，為初阿僧祇，是中菩薩，永離女人身。從剌那尸棄佛，至燃燈佛，為二阿僧祇，是時菩薩，七枝青蓮華，供養燃燈佛，敷鹿皮衣，布髮掩泥，便授其記，汝當作佛，名釋迦牟尼。從燃燈佛，至毗婆尸，為三僧祇。過三僧祇，種三十二相業。",
    "罽那尸棄": "名出俱舍。大論則名剌那尸棄。此云寶髻，亦云寶頂。吾佛世尊，初僧祇滿時值此佛，與七佛中第二尸棄，隔二僧祇，先達謂同，故今辯異。",
    "提洹竭": "或云提和竭羅。此云燃燈。大論云：太子生時，一切身邊，光如燈故，故云燃燈，以至成佛，亦名燃燈。鐙字，說文從金。徐鉉云：錠中置燭，故謂之燈。聲類云：有足曰錠，無足曰燈。故瑞應經翻為錠光。摭華云：錠音定，燈屬也。古來翻譯，迴文不同，或云燃燈，或云錠光，語異義同，故須從金。釋尊修行名儒童時，二僧祇滿，遇燃燈佛，得受記莂。",
    "毗婆尸": "亦名維衛，此云勝觀。俱舍云：三無數劫滿，逆次逢勝觀。燃燈寶髻佛，初釋迦牟尼。此由釋尊於勝觀佛，初種相好，故毗婆尸，為七佛首。以讚弗沙精進力故，超九大劫，故至於今，過九十一大劫也。",
    "尸棄": "大論云：秦言火，或翻火首。法華疏云：外國喚火為樹提尸棄。此王本修火定，破欲界惑，從德立名。又云：經標梵王，復舉尸棄，似如兩人。依大論正以尸棄為王，今舉位顯名，恐目一人耳。肇曰：尸棄，梵王名，秦言頂髻。",
    "毗舍浮": "翻遍一切自在。藥王藥上經云：莊嚴劫中，最後一佛。",
    "俱留孫": "此云所應斷，又翻作用莊嚴。賢劫第九減六萬歲，出成佛道，為千佛首。",
    "拘那含牟尼": "此云金寂。大論名迦那迦牟尼。秦言金仙人。四萬歲時，出現閻浮。",
    "迦葉波": "此云飲光。二萬歲時，出成正覺。至百歲時，釋迦牟尼居兜率天，四種觀世。故大論云：一者觀時，人壽百歲，佛出時到。二觀土地諸國，常在中國生故。三觀種姓，剎利種姓勢力大，婆羅門種智慧大，隨時所貴，佛於中生。四觀生處，何等母人，能懷那羅延力菩薩，亦能自護淨戒？如是觀竟，唯中國迦毗羅婆淨飯王后，能懷菩薩。如是思惟已，於兜率天下，不失正慧，入於母胎。",
    "彌勒": "西域記云：梅哩麗耶，唐云慈氏，即姓也。舊曰彌勒，訛也。什曰：姓也。阿逸多，字也。南天竺婆羅門子。淨名疏云：有言從姓立名，今謂非姓，恐是名也。何者？彌勒，此翻慈氏，過去為王，名曇摩流支，慈育國人，自爾至今，常名慈氏。姓阿逸多，此云無能勝。有言阿逸多是名，既不親見正文，未可定執。觀下生經云：時脩梵摩，即與子立字，名曰彌勒。",
    "袍休蘭羅": "漢言大寶，即多寶佛，出薩曇分陀利經。",
    "弗沙": "正名富沙。清涼云：亦云勃沙，此云增盛，明達勝義故也。亦云底沙，亦云提舍，此翻明。又云說度，說法度人也。什師解弗沙菩薩云：二十八宿中，鬼星名也，生時相應鬼宿，因以為名。或名沸星，或名孛星。",
    "樓夷亘羅": "清淨平等覺經翻世饒王，無量壽經翻世自在王。",
    "曇摩迦": "此翻法藏比丘，乃無量壽行因時名。",
    "阿彌陀": "清淨平等覺經翻無量清淨佛，無量壽經翻無量壽佛。稱讚淨土經云：其中世尊，名無量壽，及無量光。智論云：無量有二：一者、實無量，諸聖人所不能量，如虛空、涅槃、眾生性，是不可量。二者、有法可量，但力劣者不能量，如須彌山、大海水，斤兩滴數多少，諸佛菩薩能知，諸天世人所不能知，故言無量。是故天台乃立四句：實有量而言無量，彌陀是也；實無量而言量，如此品及金光明是也；實無量而言無量，如涅槃云唯佛與佛其壽無量是也；實有量而言量，如八十唱滅是也。又以三身對，凡立四句。故法華疏云：復次，法身，非量非無量；報身，金剛前有量，金剛後無量；應身，隨緣則有量，應用不斷則無量。通途詮量，三句在聖，一句屬凡，有量無常，都非佛義。",
    "㙠濕弗羅跋那": "此翻自在大聲。",
    "迦羅鳩村䭾": "此翻所應斷已斷。",
    "阿閦": "淨名經云：有國名妙喜，佛號無動。疏云：阿之言無，閦之言動。",
    "剌那那伽羅": "此云寶積。以無漏根力覺道等法寶集故，名為寶積。問：若爾，一切佛皆應號寶積？答：但此佛，即以此寶為名。",
    "樓至": "此翻啼泣，又名盧遮，亦名魯支，此翻愛樂。",
    "鞞恕婆附": "大論云：秦言一切勝。",
    "提和羅耶": "晉言天人王。佛授調達作佛之號。",
    "須扇多": "亦云須肩頭。此云甚淨。弟子未熟，便入涅槃，留化佛一劫。",
    "毗盧遮那": "輔行曰：此云遍一切處。煩惱體淨，眾德悉備，身土相稱，遍一切處。唯識論云：一自性身，謂諸如來，真淨法界，受用變化，平等所依，離相寂然，絕諸戲論，具無邊際真實功德，是一切法平等實性，即此自性，亦名法身。光明玄云：法名可軌，諸佛軌之而得成佛。故經言諸佛所師，所謂法也。摩訶衍論云：剋其法身，真實自體，湛湛絕慮，寂寂名斷，能為色相作所依止。今問：寂寂名斷，安名法身？答：法實無名，為機詮辯，召寂寂體，強稱法身。問：湛湛之體，當同太虛？答：凡所有相，皆是非相。覺五音如谷響，知實無聲，了萬物如夢形，見皆非色。空有不二，中道昭然，不可聞無，謂空斷絕。",
    "盧舍那": "賢首梵網疏云：梵本盧舍那，此云光明遍照。照有二義：一、內以智光，照真法界，此約自受用義；二、外以身光，照應大機，此約他受用義。淨覺雜編云：盧舍那，寶梁經翻為淨滿。以諸惡都盡，故云淨；眾德悉圓，故云滿。此多從自受用報得名。或翻光明遍照，此多從他受用報為目。若論色心皆得淨滿，身智俱有光明，則二名並通自他受用也。唯識論云：二受用身，此有二種：一、自受用身，謂諸如來三無數劫，修習無量福德資糧，所起無邊真實功德。又極圓淨常遍色身，相續湛然盡未來際，常自受用廣大法樂；二、他受用身，由平等智，示現妙淨功德身，居純淨土，為住十地菩薩。現大神通，轉正法輪，決眾疑網，令彼受用大乘法樂。合此二身，名曰報身。摩訶衍云：所言報身者，具勝妙因，受極樂果。自然自在，決定安樂，遠離苦相，故名為報。",
    "釋迦牟尼": "摭華云：此云能仁寂默。寂默故不住生死；能仁故不住涅槃。悲智兼運，立此嘉稱。發軫云：本起經翻釋迦為能仁。本行經譯牟尼為寂默。能仁是姓，寂默是字。姓從慈悲利物，字取智慧冥理。以利物故，不住涅槃。以冥理故，不住生死。長水云：寂者，現相無相。默者，示說無說。此則即真之應也。能仁是姓者，長阿含云：昔有輪王，姓甘蔗氏。聽次妃之譖，擯四太子，至雪山北，自立城居，以德歸人。不數年間，鬱為強國。父王悔憶，遣使往召。四子辭過不還，父王三歎：我子釋迦，因此命氏。又云：住直樹林，又號釋迦，既於林立國，即以林為姓。此以釋迦翻為直林。寂默是字者，本行經云：又諸釋種，立性憍慢多言，及見太子，悉皆默然，王云宜字牟尼。稱讚淨土經：名釋迦寂靜，又釋迦牟尼，翻度沃焦。如舊華嚴名字品，及十住婆沙所列。大海有石，其名曰焦。萬流沃之，至石皆竭，所以大海水不增長。眾生流轉，猶如焦石，五欲沃之，而無厭足，唯佛能度，故此為名。釋迦牟尼，屬應身也。摩訶衍云：所言應者，隨順根機而不相違，隨時隨處隨趣出現，非安樂相，故名為應。而此應身，周帀千華上，復現千釋迦。一華百億國，一國一釋迦。故召釋迦牟尼，名千百億化身也。唯識論云：三變化身，謂諸如來由成事智，變現無量，隨類化身，居淨穢土，為未來登地菩薩，及二乘異生，稱彼機宜，現通說法。若就應身，開出變化，則成四身，以現同始終，名應。無而欻有，名化。然此三身之法，或執即義，名失三身。或執離義，相乖一體。今約三義，通而辯之。一者體用，智與體冥，能起大用。自報，上冥法性，體名真身。他報，下赴機緣，用名應身。故光明云：佛真法身，猶如虛空，應物現形，如水中月。而觀世音普門示現，令無涯人獲乎冥顯兩種利益者，由此二身也。二者權實，權名權暫，實謂實錄。以施權故，從勝起劣，三佛離明，以顯實故。從劣起勝，祗是一身。故曰：吾今此身，即是法身。又云：微妙淨法身，具相三十二。是知順機則權設三身，就應乃實唯一佛也。三者事理，觀經疏云：佛本無身無壽，亦無於量，隨順世間而論三身。是則仰觀至理，本實無形，俯隨物機，跡垂化事。猶明鏡也，像體本虛；若水月焉，影元非實。苟於跡事而起封執，則同癡猴墮井而死。學出世法，宜誡之哉！",
    "瞿曇": "或憍曇彌，或俱譚。西域記云：喬答摩，舊云瞿曇，訛略也。古翻甘蔗泥土等，南山曰非也。瞿曇星名，從星立稱，至於後代，改姓釋迦。慈恩云：釋迦之群望也。文句曰：瞿曇，此云純淑。應法師翻為地最勝，謂除天外，人類中此族最勝。如十二游經：明阿僧祇時，大茅草王，捨位付臣，師婆羅門，遂受其姓，名小瞿曇。仁賢劫初，識神託生，立瞿曇姓，故知瞿曇，遠從過去，近自民主。二、姓甘蔗者，菩薩本行經云：大茅草王，得成王仙，壽命極長，老不能行。時，諸弟子出求飲食，以籠盛仙，懸樹枝上。獵師遙見，謂鳥便射，滴血於地，生二甘蔗。日炙開剖，一出童男，一出童女。占相師立男名善生，即灌其頂，名甘蔗王；女名善賢，為第一妃。三、姓日種者，本行經云：又以日炙甘蔗出故，亦名日種。四、姓釋迦，具三身篇。",
    "舍夷": "文句云：舍夷者，貴姓也，此名訛略，正云奢夷耆耶。本行經云：以住釋迦大樹蓊鬱枝條之林，是故名為奢夷耆耶，此以其處而立於姓，故國名舍夷。",
    "剎帝利": "肇曰：王種也，秦言田主。劫初人食地味，轉食自然粳米。後人情漸偽，各有封殖。遂立有德，處平分田，此王者之始也。故相承為名，為其尊貴自在，強暴快意，不能忍和也。什曰：梵音中含二義：一言忍辱，二言能瞋。言此人有大力勢，能大瞋恚，忍受苦痛，剛強難伏，因以為姓。",
    "薩婆悉達": "唐言頓吉。太子生時，諸吉祥瑞，悉皆具故。大論翻為成利。西域記云：薩婆曷剌他悉陀，唐言一切義成。舊云悉達，訛也。此乃世尊小字耳。",
    "摩納縛迦": "或號摩那婆。瑞應翻為儒童。本行翻為雲童，又云善慧，又翻年少淨行。燃燈佛時，為菩薩號。今問：瑞應明昔為摩納，獻燃燈華。諸文引此，證二僧祇。何故妙玄，證通行因耶？答：經中既云得不起法忍，三藏由伏惑故，無此法忍，故證通教。而諸文中證二僧祇者，以瑞應是三藏故。淨名疏中，義以初祇為伏，二三祇為順，百劫為無生，三十四心為寂滅。故諸文中證二僧祇。發軫問：若通別圓，妙玄何故判為通教？答：非但通二，亦通三藏。隨教所說，淺深不同。一往瑞應，多屬通義。以得忍故，異前三藏，不說行因不思議相，異後別圓。況復若判屬通，必兼後二。又云：餘經說，遇燃燈是八地。正是通教辟支佛地。",
    "菩薩": "肇曰：正音云：菩提薩埵。菩提，佛道名也。薩埵，秦言大心眾生。有大心入佛道，名菩提薩埵。無正名譯也。安師云：開士，始士。荊溪釋云：心初開故，始發心故。淨名疏云：古本翻為高士。既異翻不定，須留梵音。但諸師翻譯不同。今依大論釋，菩提名佛道，薩埵名成眾生。天台解云：用諸佛道，成就眾生，故名菩提薩埵。又，菩提是自行，薩埵是化他。自修佛道，又化他故。賢首云：菩提，此謂之覺；薩埵，此曰眾生。以智上求菩提，用悲下救眾生。",
    "鳩摩羅伽": "或云鳩摩羅䭾。或云究磨羅浮多。此云童真，亦云毫童，亦云童子。熏聞云：內證真常，而無取著，如世童子，心無染愛，即法王子之號也。大論云：復次又如王子，名鳩摩羅伽。佛為法王，菩薩入法正位，乃至十地故，悉名王子，皆任為佛。如文殊師利，十力四無所畏等，悉具佛事故，住鳩摩羅伽地。佛地論云：從世尊口正法所生，紹繼佛身不斷絕故，名法王子。觀經疏云：以法化人，名法王子。什注淨名云：妙德，以法身遊方，莫知其所生，又來補佛處，故言法王子。荊溪問曰：經稱文殊為法王子，其諸菩薩，何人不是法王之子？答：有二義：一、於王子中，德推文殊；二、諸經中，文殊為菩薩眾首。",
    "辟支迦羅": "孤山云：此翻緣覺，觀十二緣而悟道故。亦翻獨覺，出無佛世，無師自悟故。今楞嚴云：復有無量辟支者，將非他方無佛之土，大權引實，而來此會乎。霅川云：或佛知此眾當獲大益，威神攝至，不亦可乎？獨覺稱麟喻者，名出俱舍，名為犀角，出大集經。檇李云：獨覺亦觀十二因緣，亦可名為緣覺。但約根有利鈍，值佛不值佛之殊，分二類也。",
    "畢勒支底迦": "此云各各獨行。音義云：獨覺。正得其義也。義鈔中問：獨覺為有戒耶？解云：亦得。雖出無佛世，緣於別等得脫，亦得別解脫也。若爾，此戒佛世有，既出無佛世，云何得有戒？答：別解脫有二：一、在家諸戒，二、出家別解脫。又善見云：五戒十戒，一切時有，乃至無佛出世，辟支、輪王等，亦有教受。妙玄云：今明三藏，三乘無別眾，不得別有菩薩緣覺之戒也。",
    "須陀洹": "金剛疏云：此翻入流，又曰逆流。斷三法者，約逆而言，即四流中逆見流也。得果證者，約入流而說，即入八聖道之流也。今經云名為入流，又云不入色聲香等，不亦二義乎？四教義翻修習無漏。刊正釋云：初見真理故。",
    "斯陀含": "此云一往來。金剛疏云：是人從此死，一往天上，一來人間，得盡眾苦。大論云：息忌伽彌。息忌名一，伽彌名來，是名一來。四教義：翻云薄。前斷已多，其所未斷少，故名薄。",
    "阿那含": "此云不來。金剛疏云：是人欲界中死，生色無色界，於彼漏盡，不復來生。大論名阿那伽彌。阿那名不，伽彌名來。四教義翻云不還。",
    "阿羅漢": "大論云：阿羅名賊，漢名破，一切煩惱賊破。復次，阿羅漢，一切漏盡故，應得一切世間諸天人供養。又，阿名不，羅漢名生，後世中更不生，是名阿羅漢。法華疏云：阿颰（音跋）經云：應真。瑞應云：真人。悉是無生釋羅漢也。或言無翻，名含三義：無明穅脫，後世田中，不受生死果報，故云不生。九十八使煩惱盡故，名殺賊。具智斷功德，堪為人天福田，故言應供。含此三義，故存梵名。",
    "摩訶那伽": "大論云：那伽，或名龍，或名象。是五千阿羅漢，諸羅漢中最大力，以是故言如龍如象。水行中龍力最大，陸行中象力大。中阿含經：佛告鄔陀夷：若沙門等，從人至天，不以身口意害，我說彼是龍象。淨名疏云：羅漢若得超越，名摩訶那伽，心調柔軟，三乘事定。齊此為極記云：如涅槃歎德云：人中之龍也。",
    "阿離野": "此翻聖者，亦云出苦者。孔氏傳云：於事無不通，謂之聖。孔子對魯哀公云：所謂聖人者，智通大道，應變不窮，惻物之情性者也。商太宰嚭（匹鄙切）問孔子曰：夫子聖者歟？曰：丘博識強記，非聖人也。三王聖者歟？曰：三王善用智勇，聖非丘所知。五帝聖者歟？曰：五帝善用仁信，聖非丘所知。三皇聖者歟？曰：三皇善用時政，聖非丘所知。太宰大駭曰：然則孰為聖人乎？夫子有間，動容而對曰：西方有聖者焉！不治而不亂，不言而自信，不化而自行，蕩蕩乎人無能名焉。",
    "文殊師利": "此云妙德。大經云：了了見佛性，猶如妙德等。淨名疏云：若見佛性，即具三德，不縱不橫，故名妙德。無行經，名滿殊尸師利，或翻妙首。觀察三昧經，并大淨法門經，名普首。阿目佉經、普超經，名濡首。無量門微密經，名敬首。西域記云：曼殊室利，唐言妙吉祥。首楞嚴經說：是過去無量阿僧祇劫，有佛號龍種上尊王佛。央掘經說：是現在北方常喜世界，歡喜藏摩尼寶積佛。慈恩上生經疏引經云：未來成佛，名曰普現。",
    "邲輸跋陀": "或云三曼跋陀，此云普賢。悲華云：我行要當勝諸菩薩。寶藏佛言：以是因緣，今改汝字，名曰普賢。文句云：今明伏道之頂，其因周遍曰普；斷道之後，鄰於極聖曰賢。檇（音醉）李云：行彌法界曰普，位鄰極聖曰賢。請觀音經疏云：跋陀云賢首，等覺是眾賢位極故，佛聖首極故。觀經、大論並翻遍吉。圓覺略疏云：一約自體，體性周遍曰普，隨緣成德曰賢。二約諸位，曲濟無遺曰普，鄰極亞聖曰賢。三約當位，德無不周曰普，調柔善順曰賢。表於理行，清涼國師，制華嚴三聖圓融觀中，先明二聖三對表法：一、普賢即所信如來藏，（理趣般若云：一切眾生皆如來藏。普賢菩薩自體遍故，初會即入如來藏身三昧故也。）文殊即能信之心；（佛名經說一切諸佛，皆因文殊而發心故。善財始見發大心故。）二、普賢表所起萬行，（上下經文，皆云普賢行故。）文殊表能起之解。（慈氏云：汝先得見諸善知識，聞菩薩行，入解脫門，皆文殊力也。）三、普賢表證出纏法界。（經云：身相如虛空故，善財入其身故，善財見之，即得智波羅蜜者，依體起用故也。）文殊表能證大智。（本所事佛，名不動智故，常為諸佛母故。再見文殊，方見普賢者。顯其有智方證理故，故古德名後文殊，為智照無二相也。）然此二聖，各相融攝。謂依體起行，行能顯理，故三普賢，而是一體。信若無解，信是無明；解若無信，解是邪見。信解真正，方了本源，成其極智，極智返照，不異初心。故三文殊，亦是一體。又二聖亦互相融，二而不二，沒同果海，即是毗盧遮那，是為三聖。故此菩薩常為一對。",
    "阿那婆婁吉低輸": "文句名婆婁吉低稅。別行玄：此云觀世音。能所圓融，有無兼暢，照窮正性，察其本末，故稱觀也。世音者，是所觀之境也。萬象流動，隔別不同，類音殊唱，俱蒙離苦，菩薩弘慈，一時普救，皆令解脫，故曰觀世音。應法師云：阿婆盧吉低舍婆羅，此云觀世自在。雪山已來經本，云娑婆羅，則譯為音。無量清淨平等覺經名廅（烏合切）樓亘。此云光世音。西域記云：阿縛盧枳多伊濕伐羅，唐言觀自在，合字連聲，梵語如上。分大散音，即阿縛盧枳多，譯曰觀。伊濕伐羅，譯曰自在。舊譯為光世音，或世自在，皆訛謬也。唐奘三藏云：觀有不住有，觀空不住空；聞名不惑於名，見相不沒於相。心不能動，境不能隨；動隨不亂其真，可謂無礙智慧也。",
    "摩訶那缽": "此云大勢至。思益云：我投足之處，震動三千大千世界，及魔宮殿。故名大勢至。觀經云：以智慧光，普照一切，令離三塗，得無上力，是故號此菩薩名大勢至。",
    "維摩羅詰": "什曰：秦言淨名。垂裕記云：淨即真身，名即應身。真即所證之理，應即所現之身。生曰：此云無垢稱，其晦跡五欲，超然無染，清名遐布，故致斯號。大經云：威德無垢稱王優婆塞。西域記：毗摩羅詰，唐言無垢稱，舊曰淨名。然淨則無垢，名則是稱，義雖取同，名乃有異。舊曰維摩詰者，訛也。",
    "純陀": "舊云：本名純陀。後大眾稱德，號為妙義。補注云：不應名德兩分，純陀是西音，妙義乃此語。",
    "阿迦雲": "此云藥王。觀藥王藥上菩薩經云：過去有佛，號瑠璃光照。滅度之後，時有比丘，名為日藏，宣布正法。時有長者，名星宿光，聞說法故，持呵梨勒，及諸雜藥，奉上日藏，并諸大眾，因此立名藥王。後當作佛，名為淨眼。星宿光弟，名電光明，聞說法故，以其醍醐上妙之藥，而用供養。因此立名，名為藥上。後當作佛，名為淨藏。文句云：若推此義，星光應在喜見之後，從捨藥發誓已來，名藥王故。本草序云：醫王子姓韋，名古，字老師，元是疏勒國得道人也。身被毳袍，腰懸數百葫蘆，頂戴紗巾，手持藜杖，常以一黑犬同行，壽年五百餘歲。洎開元中，孟夏之月，有人疾患，稍多疼困。師發願，心存目想，遂普施藥餌，無不痊平，睹之者便愈。後乃圖形供養，皇帝敬禮，為藥王菩薩。又神仙傳云：昔堯舜之時，殷湯之際，周秦已後，大漢至唐，凡五度化身，來救貧病。其犬化為黑龍，背負老師，沖天而去。",
    "颰陀羅": "大論翻云善守。思益云：若眾生聞名者，畢竟得三菩提，故名善守。孤山云：賢守，自守護賢德，復守護眾生。或云賢首，以位居等覺，為眾賢之首。亦名跋陀和，此云賢護。妙樂云：善即賢也，王城在家菩薩。",
    "薩陀波崙": "大論云：秦言常啼。是菩薩求佛故，憂愁啼哭，七日七夜，故號常啼。具如智論。",
    "鬱伽陀達磨": "大論云：鬱伽陀，秦言盛；達磨，秦言法。故號盛法。",
    "尸梨伽那": "大論：此云厚德。",
    "和須蜜多": "亦云婆須蜜多。西域記云：伐蘇蜜俎多，唐言世友；舊曰和須蜜多，訛也。觀法師云：亦翻天友，隨世人天，方便化故。",
    "乾陀訶提": "此云不休息。念念流入薩婆若海，初無休息。",
    "瞿沙": "西域記云：此云音。",
    "瞿師": "此云美音。",
    "提婆達多": "亦名調達，亦名提婆達兜。法苑云：本起經，提婆達多，齊云天熱。以其生時，人天等眾，心皆驚熱。無性攝論云：唐云天授，亦云天與。謂從天乞得故。入大乘論問：彼提婆達多，世世為佛怨，云何而言是大菩薩？答：若是怨者，云何而得世世相值？如二人行，東西各去，步步轉遠，豈得為伴？又云是賓伽羅菩薩。",
    "商莫迦": "此云善。西域記云：舊曰晱摩菩薩，訛。",
    "阿差末": "此云無盡意。天台云：知一切法性無盡故，菩薩發心無盡。",
    "般若拘羅": "此云智積。淨名疏云：觀於實相，智慧積聚。",
    "跋陀婆羅賒塞迦": "下生經云：秦言善教。",
    "那羅延": "翻鉤鎖力士，或翻堅固。",
    "阿若憍陳如": "亦名俱鄰。法華疏云：阿若，名也。此翻已知，或言無知。無知者，非無所知，乃是知無耳。又翻為解。楞嚴云：我初稱解等，具云解本際。孤山云：以第一解法者也。憍陳如，姓也。此翻火器，婆羅門種。其先事火，從此命族，亦名憍陣那。",
    "頞鞞": "亦阿說示，此云馬勝，亦云馬師。亦云阿輸波踰祗，此云馬星。頞（烏葛切）。",
    "跋提": "亦云婆提。本行集云：跋提梨迦，此云小賢。文句亦名摩訶男。若五分律，及本行集，則跋提與摩訶男兩別。",
    "十力迦葉": "亦名婆敷。",
    "拘利太子": "若涅槃疏，則摩訶男與拘利是一。",
    "舍利弗": "大論云：有婆羅論義師，名婆陀羅王（云云）。婦生一女，眼似舍利鳥眼，即名此女為舍利（云云）。眾人以其舍利所生，皆共名之為舍利弗。弗，秦言子也。涅槃云：如舍利弗母名舍利，因母立字，故名舍利弗。又翻身子。文句云：此女好形身，身之所生，故言身子。亦云鶖子。母眼明淨，如鶖（七由切）鷺（來故切）眼。",
    "大目犍連": "什曰：目連，婆羅門姓也，名拘律陀。拘律陀，樹名。禱樹神得子，因以為名。垂裕記：問：大經云目犍連，即姓也。因姓立名目連，何故名拘律陀耶？答：本自有名，但時人多召其姓，故大經云耳。淨名疏云：文殊問經，翻萊（音羅）茯（蒲北切）根，父母好食，以標子名。真諦三藏云：勿伽羅，此翻胡豆，綠色豆也。上古仙人，好食於此，仍以為姓。正云摩訶沒特伽羅，新翻采菽氏。菽，亦豆也。西域記云：沒特伽羅，舊曰目犍連，訛略也。",
    "摩訶迦葉波": "文句：此翻大龜氏。其先代學道，靈龜負仙圖而應，從德命族，故云龜氏。時人多以姓召之。其實有名，名畢缽]羅。父母禱樹神而生子，故名畢缽羅。言大者，若約所表，或因智大、德大、心大，故稱大迦葉。若約事釋者，佛弟子中多名迦葉，如十力三迦葉等。於同姓中，尊者最長，故標大以簡之。迦葉，或翻飲光。文句云：迦葉身光，亦能映物，真諦翻光波，古仙人身光炎涌，能映餘光。",
    "阿那律": "或云阿那律陀，此云無滅。昔施食福，人天受樂，於今不滅。淨名疏云：或云阿泥盧豆，或阿（音遏）㝹（乃侯切）樓䭾（唐賀切），如楚夏不同耳。此云如意，或云無貧。過去餓世，曾以稗飯施辟支佛，九十一劫，天人之中，受如意樂，故名如意。爾來無所乏斷，故名無貧。佛之從弟。西域記云：阿泥𢫫（虛骨切）陀，舊曰阿那律者，訛也。",
    "須菩提": "淨名疏云：此云善吉，亦云善業，亦云空生。其生之日，家室皆空，父母驚異，請問相師。相師占云：此是吉相。因名善吉。稟性慈善，不與物諍。及其出家，見空得道，兼修慈心，得無諍三昧。是以常能將護物心，故名善業。以生時家宅皆空，因名空生。家宅皆空，即表其長成解空之相。生曰：無諍三昧者，解空無致論處為諍也。西域記云：蘇部底，唐言善現，舊曰須扶提。或云須菩提，譯曰善吉，皆訛。熏聞云：應知善相，不唯空物，亦能感物。故譬喻經云：舍衛國長者名鳩留，產子小字須菩提。有自然福報，食器皆空，所欲皆滿。然則空非斷無，表妙有之不亡也。真諦云：是東方青龍陀佛。又增一阿含云：喜著好衣，行本清淨，所謂天須菩提。是知釋門，有二須菩提。",
    "富樓那彌多羅尼子": "文句云：富樓那，翻滿願；彌多羅，翻慈；尼，女也。父於滿江禱梵天求子，正值江滿。又夢七寶器，盛滿中寶入母懷。母懷子，父願獲從，諸遂願故言滿願。彌多羅尼，翻慈行，亦云知識。四韋陀有此品，其母誦之，以此為名。或名彌窒（音質）子，翻善知識。支謙譯度無極經：名滿祝子，謂父於滿江禱梵天而得其子。西域記云：布剌拏梅呾麗衍尼弗呾羅，唐言滿慈子。舊訛略云彌多羅尼子。",
    "摩訶迦旃延": "什曰：南天竺婆羅門姓，善解契經者。淨名疏云：此翻不定，有云扇繩，有云文飾，未知孰正。或曰：此云離有無破我慢心。",
    "鄔波離": "有翻化生，或翻上首，以其持律為眾紀綱，故名。優波釐，或翻近執，以佛為太子時，彼為親近執事之臣。古人云：佛之家人，非也。訛云優波離。",
    "羅睺羅": "什曰：阿脩羅食月時，名羅睺羅。秦言覆障，謂障月明也。羅睺羅六年處母胎所覆障故，因以為名。西域記云：羅怙羅，舊曰羅睺羅，又曰羅云，皆訛略也。此云執日。淨名疏曰：有翻宮生。太子出家，太妃在宮，何得有娠？佛共淨飯王於後證是太子之子，親是宮之所生，因名宮生。",
    "阿難": "大論：秦言歡喜。佛成道時，斛飯王家，使來白淨飯王言：貴弟生男。王心歡喜，言：今日大吉。語來使言：是男當字為阿難。舉國欣慶。又名慶喜。亦翻無染。雖殘思未盡，隨佛入天人龍宮，見女，心無染著故。玄云：持三藏教。",
    "阿難跋陀": "此云喜賢。玄云：持通教。",
    "阿難迦羅": "此云喜海。玄云：持圓教。付法藏有三：一、阿難，此云慶喜，傳聲聞藏。二、阿難跋陀，此云喜賢，持緣覺藏。三、阿難迦羅，此云喜海，持菩薩藏。圓覺略疏云：略是一人，隨德名別。",
    "賓頭盧": "翻不動，字也。",
    "頗羅墮": "姓也。真諦云捷疾，亦云利根，或廣語。本行集，翻重幢。婆羅門凡十八姓，此居其一。或云賓度羅跋羅墮闍。感通傳云：今時有作賓頭盧聖僧像，立房供養，亦是一途。然須別施空座，前置碗缽。至僧食時，令大僧為受。不得以僧家盤盂設之，以凡聖雖殊，俱不觸僧食器。若是俗家，則隨俗所設。恐僧不知，附此編出。",
    "薄拘羅": "文句：此翻善容，色貌端正故。準賢愚經：應翻重姓。中阿含：異學又問：汝於八十年起欲想否？答：不應作如是問。我八十年，未曾起欲想，尚未曾起一念貢高，未曾受居士衣，未曾割截衣，未曾倩他衣，未曾針縫衣，未曾受請，未曾從大家乞食，未曾倚壁，未曾視女人面，未曾入尼房，未曾與尼相問訊，乃至道路亦不共語，八十年坐。荊溪云：弘法之徒，觀斯龜鏡。",
    "難陀": "文句云：亦云放牛難陀。此翻善歡喜，亦翻欣樂。文句記云：從初慕道為名，歡喜中勝，故云善也。",
    "離婆多": "正言頡（賢結切）隸伐多，亦云離越。此翻星宿，或室宿，從星辰乞子。",
    "摩訶拘絺羅": "大論云：秦言大膝。摩陀羅次生一子，膝骨麤大，故名拘絺羅。舍利弗舅，與姉舍利，論義不如。俱絺羅思惟念言：非姉力也，必懷智人。寄言母口，未生乃爾，及生長大，當如之何？故出家作梵志，入南天竺，誓不翦爪，讀十八種經。",
    "憍梵缽提": "或云憍梵波提、伽梵婆提、笈房缽底。此翻牛呞。法華疏云：昔五百世曾為牛王。牛若食後，常事虛哨，餘報未夷，時人稱為牛呞。楞嚴云：於過去世，輕弄沙門，世世生生有牛呞病。爾雅作齝與呞同。郭璞云：食之已久，復出嚼之。亦翻牛王，又翻牛相。",
    "畢陵伽婆蹉": "此云餘習。五百世為婆羅門，餘氣猶高，過恆水叱小婢駐流，非彼實心，蓋習氣也。或名畢藺（呂進切）陀筏蹉。此云餘習，五百生惡性麤言，今得餘習。",
    "孫陀羅難陀": "孫陀羅，此云好愛，妻名也。或云孫陀羅利，此云善妙。難陀云歡喜，己號也。簡放牛難陀，故標其妻。",
    "優樓頻螺迦葉": "文句翻云木瓜林，近此林居故。孤山云：此云木瓜癃（音隆），胸前有癃，如木瓜故。又云禱此林神而生，故得名也。",
    "伽耶迦葉": "孤山云：伽耶，山名。即象頭山也。文句翻城，近此山故，家在王舍城南七由旬。",
    "那提迦葉": "那提翻河。西域記云：捺地迦葉波，舊曰那提迦葉，訛也。緝諸迦葉，例無波字，此亦略也。毗婆尸佛時，共樹剎柱，緣是為兄弟。",
    "劫賓那": "此云房宿（音秀），父母禱房星感子。舊云金毗羅，此翻威如王。",
    "諾矩羅": "此云鼠狼山。",
    "提婆犀那": "西域記云：唐言天軍。",
    "憂婆提舍": "大論云：憂婆，秦言豕。提舍，星名，即舍利弗父字也。",
    "優波斯那": "本行集云：隋云最征上將。",
    "嗢呾囉": "西域記云：唐言上。",
    "阿折羅": "西域記云：唐言所行。",
    "迦留陀夷": "此云黑光，亦云麤黑，顏色黑光故。",
    "優陀夷": "此云出現，日出時生故。",
    "優波尼沙陀": "清涼疏云：此云近少，謂微塵是色之近少分也，亦翻近對，謂少分相近比對之分。應法師云：論中義言，因果不相似也。以珍寶等，但得三界果報；無漏善法，得佛果也。",
    "周陀": "或云周利，此云大路邊生。佛本行經云：其母是長者之女，隨夫他國，久而有孕。垂產思歸，行至中路，即誕其子。如是二度，凡生二子，乃以大小而區別之。大即周陀，小即莎伽陀。",
    "莎伽陀": "或云槃陀伽，此云小路邊生。又翻繼道，以其弟生繼於路邊，故名繼道。",
    "波濕縛": "西域記云：唐言[脅]，由自誓曰：我若不通三藏理、不斷三界欲、得六神通、具八解脫，終不以[脅]而至席。故號[脅]尊者。",
    "須跋陀羅": "此翻好賢。西域記云：唐言善賢，舊曰蘇跋陀羅，訛也。鳩尸那城梵志，年一百二十歲。泥洹經云：須跋，聰明多智，誦四毗陀經，一切書論，無不通達，為一切人之所崇敬。聞佛涅槃，方往佛所。聞八聖道，心意開解，遂得初果。從佛出家，又為廣說四諦，即成羅漢。",
    "迦多演尼子": "西域記云：迦陀衍那，佛滅度後三百年出。造發智論，舊訛云迦旃延。",
    "末田地": "亦名摩田地，亦名摩田提，此云中。阿難化五百仙人，在河中得戒，故曰摩田地。西域記云：達麗羅川中大伽藍側，有刻木慈氏菩薩像，通高百餘尺。末田底迦羅漢，攜引匠人，升睹史多天，親觀妙相，往來三返，爾乃功畢。",
    "優波毱多": "或名優波掘多，此云大護。或云笈（其劫切）多。佛滅百年出，得無學果。西域記云：烏波毱多，唐言近護。秣（音末）兔羅國，城東五六里，巖間有石室，高二十餘尺，廣三十餘尺，四寸細籌，填積其內。尊者近護，說法化導，夫妻俱證羅漢果者，乃下一籌，異室別族，雖證不記。",
    "室縷多頻設底俱胝": "西域記云：唐言聞二百億。舊譯曰億耳，謬也。長者豪富，晚有繼嗣，時有報者，輒賜金錢二百億，因名其子曰聞二百億。洎乎成立，未曾履地，故其足跖（音隻），毛長尺餘，光潤細軟。又西域記云：富一億財一洛叉，便耳著珠墜，人知富也。或云：耳有珠環，價直一億。",
    "摩訶波闍波提": "此云大生主，又云大愛道，亦云憍曇彌。此翻眾主。西域記云：缽邏闍缽底，唐言生主。舊云波闍波提者，訛也。",
    "耶輸陀羅": "此云華色，亦云名聞。悉達次妃，天人知識，出家為尼眾之主。",
    "阿濕縛窶沙": "或名阿濕矩沙。西域記云：唐言馬鳴。摩訶衍論曰：若剋其本，大光明佛；若論其因，第八地內住位菩薩。西天竺誕生，盧伽為父，瞿那為母，同生利益。過去世中，有一大王，名曰輪陀，有千白鳥，皆悉好聲。若鳥出聲，大王增德；若不出聲，大王損德。如是諸鳥，若見白馬，則其出聲；若不見時，常不出聲。爾時大王，遍求白馬，終日不得。作如是言：若外道眾，此鳥鳴者，都破佛教，獨尊獨信；若佛弟子，此鳥鳴者，都破外道，獨尊獨信。爾時菩薩，用神通力，現千白馬，鳴千白鳥，紹隆正法，令不斷絕。是故世尊，名曰馬鳴。律宗統要鈔，引緣異此，學者須檢。",
    "那伽曷樹那": "義翻為猛。此出龍樹勸誡王頌，彩字函。西域記云：那伽閼（音遏）剌那，此云龍猛；舊曰龍樹，訛也。什曰：本傳云：其母樹下生之，因自阿周那。阿周那者，樹名也。以龍成其道，故以龍字，號曰龍樹。輔行云：樹學廣通，天下無敵。欲謗佛經，而自作法，表我無師。龍接入宮，一夏但誦七佛經目，知佛法妙，因而出家。降伏國王，制諸外道。外道現通，化為花池，坐蓮花上，龍樹為象，拔蓮花，撲外道。作三種論：一、大悲方便論，明天文地理，作寶作藥，饒益世間；二、大莊嚴論，明修一切功德法門；三、大無畏論，明第一義。中觀論者，是其一品。大乘入楞伽云：大慧汝應知：善逝涅槃後，未來世當有持於我法者，南天竺國中，大名德比丘，厥號為龍樹，能破有無宗。世間中顯我，無上大乘法，得初歡喜地，往生安樂國。",
    "提婆": "此云天。法華疏云：天者天然、自然勝、樂勝、身勝。故論云：清淨光潔，最勝最尊，故名為天。苟非最勝之因，豈生最勝之處？言最勝因者，所謂十善：身三、語四、及意三行。由其三業，防止過非，有順理義，即名十善。以茲十善，運出五道，故此十戒，名曰天乘。若單修習上品十善，乃生欲界：一四天王天，二忉利天。若修十善，坐未到定，乃生三夜摩天，四兜率天，五化樂天，六他化自在天。由禪定力，故使四天，皆悉居空，不依於地。言未到定者，亦云未至，由其未入根本定故。如止觀云：若端坐攝身，調和氣息，泯然澄靜，身如雲影，虛豁清淨，而猶見有身心之相，是則名為欲界定也。從此已去，忽然不見，欲界定中，身首衣服、床鋪等事，猶如虛空，冋冋（戶頂切）安隱。身是事障，事障未來，障去身空，未來得發，如是名為未到定相，是為欲界六天因果。若修根本四禪，離欲麤散，則生色界。然此色界，依薩婆多，但十六處。俱舍疏云：除大梵天，謂梵輔天中，有高樓閣，名大梵天，一主所居，更無別地。除無想天，謂廣果天中，有高勝處，名無想天，非別有地。若依經部立十七天。故頌釋云：謂大梵王與梵輔等，處雖不別，身形壽量，皆不等故，別立大梵。若上座部，謂無想、廣果，因果別故。立十八天，分為四禪。初禪三天：一梵眾，乃所統之民也；二梵輔，輔弼梵王之臣佐也；三大梵，得中間禪，為世界主。劫初先生，劫盡後沒，威德既勝，褒（博毛切）美稱大。二禪三天：一少光，於二禪中，光最少故；二無量光，光明轉增，無限量故；三光音，口絕言音，光當語故。梵語廅（安合切）天，晉云有光壽，亦云少光天。梵云廅波摩那，此云無量光。梵語阿波會，此云光音。三禪三天：一少淨，意地樂受，離喜貪故，少分清淨；二無量淨，淨勝於前不可量故；三遍淨，梵云首訶既那，樂受最勝，淨周普故。四禪九天：一無雲，下之三禪，皆依雲住，至此四禪，方在空居；二福生，具勝福力，方得往生；三廣果，異生果報，此最勝故，梵云惟于頗羅，而此三天是凡夫住。四無想天，外道所居，謂為涅槃。但是一期心想不行，故名無想。五無煩，無於見思煩惱雜故。六無熱，意樂調柔，離熱惱故。七善見，梵語須䠠（於計切）天，定障漸微，見極明徹。八善現，形色轉勝，善能變現。九色究竟，色法最極，是究竟處。無煩等天，那含所居，呼此五天，名五那含。若厭色籠，修四空定，生四空天，名無色界。一空處，禪門云：此定最初，離三種色，心緣虛空。既與無色相應，故名虛空定。二識處，禪門云：捨空緣識，以識為處。正從所緣處受名。三無所有處，禪門名不用處。修此定時，不用一切內外境界。外境名空，內境名心，捨此二境，因初修時，故言不用處。四非有想、非無想，禪門云：有解云：前觀識處是有想，不用處是無想。今雙除上二想，亦有解言：約凡夫說言非有想，約佛法中說言非無想。合而論之，故言非有想非無想。然此四空，大、小乘教，論其無色，其義碩異。且小乘教，如俱舍云：無色無身，依同分命根轉，令心相續（不相應行有二十四種：一得，二命根，三眾同分。疏釋曰：獲成就者名之為得，第八識種，令色心不斷，名為命根。或種實命假業為命，類相似故，名眾同分）。又世品云：無色界，都無處所，以非色法，無方所故，謂於是處得彼定者，命終即於是處生故。又成實論云：色是無教，不至無色。今謂若云都無處所，華嚴安云：菩薩鼻根，聞無色界宮殿之香，若大眾部，乃云但無麤色，非無細色。故阿含說舍利弗入涅槃時，無色界天，空中淚下，如春細雨。故知無色，非無細色。此是小乘宗計兩殊。若大乘教，如楞嚴經云：是四空天，身心滅盡，定性現前，無業果色也。孤山釋云：非業果色者，顯有定果色也。俱舍纂云：無業果色，非異熟身。如輔行云：曾聞有一比丘，得無色定，定起摸空。人問何求？答：覓我身。旁人語言，身在床上。於此得定，尚不見身。驗知四空，無業果色。而言顯有定果色者，顯揚論：名定自在所生色，謂勝定力故。於一切色，皆得自在，即以定變起五塵境故。論云：變身萬億，共立毛端，空量地界。中陰經云：無色諸天，禮拜世尊。楞嚴亦云無色稽首。仁王經說：無色界天，雨諸香華，香如須彌，華如車輪。然涅槃云：非想等天，若無色者，云何得有去來進止？如是之義，諸佛境界，非聲聞緣覺所知。以聲聞經，說所證空，遂謂極處，悉皆無色。大乘實說，界外尚受法性之色，豈此四天唯空空然！故斥二乘非所知也。淨名疏云：若不了義教，明無色界無色；若了義教，明無色界有色。然大論云：諸天命欲終時，五死相現：一華冠萎，二腋下汗出，三蠅來著身，四見更有天坐已生處，五自不樂本座。諸天見是死相，念惜天樂，見當生惡處，心即憂毒。又俱舍論：明其五衰，有小大異。小五衰者，一衣服嚴具，出非愛聲；二自身光明，忽然昧劣；三於沐浴位，水滴著身；四本性囂（許嬌切）馳，今滯一境；五眼本凝寂，今數瞬（舒閏切）動。此五相現，非定命終，遇勝善緣，猶可轉故。復有五種大衰相現：一衣染塵埃，二華鬘萎悴，三兩液汗出，四臭氣入身，五不樂本座。此五相現，必定當死。又大論明天，通辨四種：一名天，二生天，三淨天，四淨生天。一名天者，如今國王名天子；二生天者，從四天王，至非有想、非無想天；三淨天者，人中生諸聖人；四淨生天者，三界天中生諸聖。又涅槃亦明四天：一者世間天，如諸國王；二者生天，從四天王至非非想；三者淨天，謂四果支佛；四者義天，謂十住菩薩，以見一切法是空義故。如是諸天，名廣義豐，當區別矣！",
    "鳩摩羅邏多": "西域記翻童受。",
    "室利邏多": "西域記：唐言勝受。起信論疏：明五日論師，以此論主，照北印度。",
    "訶梨跋摩": "宋言師子鎧（苦亥切）。佛涅槃後九百年出。中天竺國婆羅門子，初依薩婆多部出家，造成實論。",
    "阿僧伽": "西域記：唐言無著，是初地菩薩，天親之兄。佛滅千年，從彌沙塞部出家。三藏傳云：夜升睹史陀天，於慈氏所，受瑜伽師地論、莊嚴大乘論、中邊分別論；晝則下天，為眾說法。",
    "婆藪盤豆": "西域記云：伐蘇畔度，唐言世親。舊曰婆藪盤豆，譯曰天親，訛謬。言天親者，菩薩乃是毗紐天親，故云天親。於說一切有部出家受業，本自北印度至於此也。無著命其門人，令往迎候，至此伽藍，遇而會見。無著弟子，止戶牖外。夜分之後，誦十地經，世親聞已，感悟追悔，甚深妙法，昔所未聞。毀謗之愆，源發於舌，舌為罪本，今宜斷除。即執銛（息廉切）刀，將自斷舌。乃見無著住立告曰：夫大乘教者，至真之理也。諸佛所讚，眾聖攸宗。言欲誨汝，爾今自悟，悟其時矣！何善如之？諸佛聖教，斷舌非悔。昔以舌毀大乘，今以舌讚大乘，補過自新，猶為善矣！杜口絕言，其利安在？作是語已，忽復不見。世親承命，遂不斷舌，旦詣無著，諮受大乘。於是研精覃思，製大乘論，凡百餘部，並盛宣行。",
    "佛陀僧訶": "西域記云：唐言師子覺，無著弟子，密行莫測，高才有聞。二三賢哲，每相謂曰：凡修行業，願覲慈氏。若先捨壽，得遂宿心，當相報語，以知其至。其師子覺先捨壽命，三年不報。世親菩薩尋亦捨壽，時經六月亦無報命。時諸異學，咸皆譏誚，以為流轉惡趣，遂無靈鑒。其後無著菩薩，於夜初分，方為門人教授定法，燈光忽翳，空中大明。有一天仙乘虛下降，即進階庭，敬禮無著。無著云：爾來何暮？今至何謂？對曰：從此捨壽，往睹史多天，慈氏內眾，蓮華中生。蓮華纔開，慈氏讚言，善來廣慧。旋遶纔周，即來報命。無著曰：師子覺者，今在何處？曰：我纔旋遶時，見師子覺，在外眾中，耽著五欲，無暇相顧。無著曰：慈氏何相？演說何法？曰：慈氏相好，言不能宣；演說妙法，義不異此。然，菩薩妙音，清暢和雅，聞者忘倦。",
    "陳那": "西域記云：唐言童授。妙吉祥菩薩，指誨傳授。如慈恩云，因明論者，元唯佛說，文廣義散，備在眾經。故地持論云：菩薩求法，當於何求？當於一切五明處求。求因明者，為破邪論，安立正道。劫初題目，創標真似。爰暨世親，再陳軌式。雖紀綱已列，而幽致未分。故使賓主對揚，猶疑破立之則。有陳那菩薩，是稱命世，賢劫千佛之一也。匿跡巖藪，栖巒等持，觀述作之利害，審文義之繁約。於時巖谷震吼，雲霞變彩。山神捧菩薩足，高數百尺，唱言：佛說因明論道，願請重弘。菩薩乃放神光，照燭機感。時，彼南印土按達羅國王，見放光明，疑入金剛喻定，請證無學果。菩薩曰：入定觀察，將釋深經，心期大覺，非願小果。王言：無學果者，諸聖攸仰，請尊速證。菩薩撫之，欲遂王請。妙吉祥菩薩，因彈指警曰：何捨大心，方興小志？為廣利益者，當轉慈氏所說瑜伽，匡正頹綱，可製因明，重成規矩。陳那敬受指誨，奉以周旋。於是覃思研精，乃作因明正理門論。又輔行云：迦毗羅仙恐身死，往自在天問。天令往頻陀山，取餘甘子，食可延壽。食已，於林中化為石床。大有不逮者，書偈問石。後為陳那菩薩斥之，書偈石裂。",
    "賓伽羅": "中論序云：天竺諸國，敢預學者之流，無不玩味斯論，以為喉襟。其染翰申釋者，甚亦不少。今所出者，是天竺梵志，名賓伽羅，秦言青目之所釋也。其人雖信解深法，而辭亦雅中，其間乖僻繁重者，法師皆裁而裨之。",
    "波毗吠伽": "西域記：唐言清辯。靜而思曰：非慈氏成佛，誰決我疑？遂於觀音菩薩像前，誦隨心陀羅尼。經涉三年，菩薩現身，謂論師曰：何所志乎？對曰：願留此身，待見慈氏。菩薩曰：人命難保，宜修勝善，生睹史天，乃見慈氏。對曰：志不可奪也。菩薩又云：若其然者，宜往䭾那羯磔國，城南山巖，執金剛神所，志誠誦持執金剛陀羅尼者，當遂此願。論師於是往而誦焉。三載之後，神出問云：伊何所願？論師對曰：願留此身，待見慈氏。神又謂曰：此巖石內，有脩羅宮。如法行請，石壁當開，開即入中，可以見也。神又謂曰：慈氏出世，我當相報矣！論師受命，專精誦持。又經三載，乃咒芥子，以擊石壁，石壁乃開。論師乃與六人，入石壁裏。入已，石壁仍復如故。",
    "達磨波羅": "西域記云：唐言護法。神負遠遁，因即出家，清辯論師。外示僧佉之服，內弘龍猛之學。聞護法菩薩，在菩提樹，宣揚法教。乃命門人往問訊曰：仰德虛心，為日久矣！然以宿願未果，遂乖禮謁，菩提樹者，誓不空見。見當有證，稱天人師。護法菩薩謂其使曰：人世如幻，身命若浮，未遑談議。竟不會見。",
    "瞿拏缽類婆": "西域記云：唐言德光。作辯真等論，凡百餘部。論主本習大乘，未窮玄奧。因覽毗婆沙論，退業而學小乘，作數十部論。破大乘綱紀，成小乘執著。研精雖久，疑情未除。時有提婆犀那羅漢，往來睹史多天。德光願見慈氏，決疑請益。天軍以神通力，接上天宮。既見慈氏，長揖不禮。天軍謂曰：慈氏菩薩，次紹佛位，何乃自高，敢不致敬！方欲受業，如何不屈？德光對曰：尊者此言，誠為指誨。然我具戒苾（頻必切）蒭（丑朱切）出家弟子。慈氏菩薩，受天福樂，非出家之侶。而欲作禮，恐非所宜。菩薩知其我慢心故，非是法器。往來三返，不得請疑。",
    "達磨俎邏多": "西域記云：唐言法救。舊曰達磨多羅，訛也。俎（莊呂切）。",
    "伊濕伐邏": "西域記云：唐言自在。",
    "佛地羅": "西域記云：唐言覺取。",
    "布剌拏": "西域記云：唐言圓滿。",
    "僧伽跋陀羅": "西域記云：唐言眾賢。",
    "佛陀䭾娑": "西域記云：唐言覺使。",
    "尸羅跋陀羅": "西域記云：唐言戒賢。唐奘三藏，親承經論。",
    "瞿那末底": "西域記云：唐言德慧。",
    "跋羅縷支": "西域記云：唐言賢愛。西印度人，妙極因明，摧大慢婆羅門，生陷地獄。",
    "慎那弗呾羅": "西域記云：唐言最勝子。製瑜伽師地釋論。",
    "末笯曷利他": "西域記云：唐言如意。即婆沙論師。",
    "般若羯羅": "奘傳云：唐言慧生。",
    "達摩畢利": "奘傳云：唐言法愛。",
    "達摩羯羅": "奘傳云：唐言法性。",
    "阿黎耶䭾娑": "奘傳云：唐言聖使。",
    "阿黎斯那": "奘傳云：唐言聖軍。",
    "阿黎耶伐摩": "奘傳云：唐言聖冑。",
    "秣奴若瞿沙": "奘傳云：唐言如意聲。",
    "達摩鬱多羅": "此云法尚。佛滅八百年出，造雜毗曇。",
    "譯師": "唐太宗焚經臺詩：門徑蕭蕭長綠苔，一回登此一徘徊；青牛謾說函關去，白馬親從印土來；確實是非憑烈燄，要分真偽築高臺；春風也解嫌狼藉，吹盡當年道教灰。唐義淨三藏，題取經詩曰：晉宋齊梁唐代間，高僧求法離長安；去人成百歸無十，後者安知前者難；路遠碧天唯冷結，砂河遮日力疲殫；後賢如未諳斯旨，往往將經容易看。",
    "迦葉摩騰": "中印度人，婆羅門種。幼而敏悟，兼有風姿，博學多聞，特明經律，思力精拔，探賾鉤深，敷文析理，義出神表。嘗游西印度，有一小國，請騰講金光明經。俄而鄰國興師，來將踐境，輒有事礙，兵不能進。彼國兵眾，疑有異術，密遣使覘（敕廉切）。但見君臣安然共聽，其所講經，明地神王護國之法。於是彼國睹斯神驗，請和求法。時，蔡愔等，殷請於騰，騰與愔等俱來見帝，終於洛陽。",
    "竺法蘭": "中印度人。少而機悟，淹雅博愛，多通禪思，妙窮毗尼。誦經百餘萬言，學徒千餘。居不求安，常懷弘利，戒軌嚴峻，眾莫能窺。遇愔求請，便有輕舉之志，而國王不聽，密與騰同來。間行後至，共譯四十二章。騰卒，自譯五經。",
    "曇摩迦羅": "此云法時，印度人也。幼而才敏，質像傀（公回切）偉，善四韋陀，妙五明論。圖讖運變，靡所不該。自謂在世，無過於己。嘗入僧坊，遇見法勝毗曇，殷勤尋省，莫知旨趣。乃深歎曰：佛法鉤深！因即出家，誦大小乘，游化許洛。事鈔云：自漢明夜夢之始，迦竺傳法已來，迄至曹魏之初，僧徒極盛，未稟歸戒，止以翦落殊俗。設復齋懺，事同祀祠。後有中天竺曇摩迦羅，誦諸部毗尼。以魏嘉平至雒陽，立羯磨受法，中夏戒律始也。準用十僧，大行佛法，改先妄習，出僧祇戒心。又有安息國沙門曇諦，亦善律學，出曇無德羯磨，即大僧受法之初也。",
    "康僧鎧": "印度人。廣學群經，義暢幽旨。嘉平四年，於洛陽白馬寺，譯無量壽經。",
    "支謙": "月氏國優婆塞也。漢末游洛，該覽經籍，及諸伎藝。善諸國語，細長黑瘦，白眼黃睛。時人語曰：支郎眼中黃，形軀雖細是智囊。武烈皇帝，以其才慧，拜為博士。謙譯經典，深得義旨。",
    "維祇難": "此云障礙。印度人。學通三藏，妙善四含，游化為業，武昌譯經。",
    "康僧會": "康居國大丞相之長子。世居印度，年未齒學，俱喪二親。至性篤孝，服畢入道。厲行清高，弘雅有量。解通三藏，慧貫五明。辯於樞機，頗屬文翰。以吳初染佛法，大化未全，欲使江左興立圖寺。赤烏四年，仗錫建康，楊都譯經。",
    "竺曇摩羅察": "此云法護，月氏國人。甚有識量，天性純懿，操行精苦，篤志好學，萬里尋師。屆茲未久，博覽六經，游心七籍。解三十六種書，詁訓音義，無不備識。日誦萬言，過目咸記。先居燉煌，後處青門。大周目錄云：太康七年，譯正法華。",
    "尸利密多羅": "此云吉友，西域太子。以國讓弟，遂為沙門。天姿高朗，風神俊邁，儀貌卓然，出於物表。晉元帝世，來游建康。王公雅重，世號高座法師。譯灌頂等經。",
    "瞿曇僧伽提婆": "或名提和，此云眾天，罽賓國人。風采可範，樞機有彰。沈慮四禪，研心三藏。初於苻秦帝國，譯阿毗曇八犍度等。",
    "卑摩羅叉": "此云無垢眼，罽賓國人。澄靜有志，履道苦節，世號青目律師。羅什師事，改譯什公十誦。",
    "佛䭾跋陀羅": "此云覺賢。大乘三果人，甘露飯王之苗裔。於此與羅什相見，什所有疑，多就咨決。東晉義熙十四年，於謝司空寺，譯華嚴六十卷。堂前池內，有二童子，常從池出，捧香散華。",
    "法顯": "姓龔，平陽武陽人。常玩經律舛缺，誓志尋求。以晉安帝隆安三年，歲次己亥，游歷印度。義熙元年，歲次乙巳，汎海而還。楊都譯經。",
    "曇摩耶舍": "此云法稱。罽賓國人，少而好學，長而彌篤。神爽高雅，該覽經律，陶思八禪，游心七覺，明悟出群，幽鑒物表。欲苦節求果，天神語云：何不觀方弘化，而獨守小善？於是歷游諸國，譯差摩等經。",
    "鳩摩羅什婆": "此云童壽，祖印度人。父以聰敏見稱，龜茲王聞，以女妻之，而生於什。什居胎日，母增辯慧。七歲出家，日誦千偈，義旨亦通。至年九歲，與外道論義，辯挫邪鋒，咸皆愧伏。年十二，有羅漢奇之，謂其母曰：常守護之。若年三十五，不破戒者，當大興佛法，度無數人。又習五明，四韋陀典，陰陽星算，必窮其妙。後轉習大乘，數破外道，近遠諸國，咸謂神異。母生什後，亦即出家，聰拔眾尼，得第三果。什既受具，母謂之曰：方等深教，應大闡秦都，於汝自身無利，如何？什曰：菩薩之行，利物亡軀，大化必行，鑪鑊無恨。從此已後，廣誦大乘，洞其秘奧。西域諸王，請什講說，必長跪座側，命什蹹登。苻堅建元九年，太史奏云：有德星現，外國當有大德智人，入輔中國。堅曰：朕聞西域有羅什，襄陽有道安，將非此耶？後遣將軍呂光等，率兵七萬，西伐龜茲。光與什同來，什在道，數言應變，光盡用之。光據西涼，亦請什留。至姚秦弘始三年，興滅西呂，方入長安。秦主興，厚加禮之，延入西明閣，及逍遙園，別館安置。敕僧䂮（音略）等八百沙門，諮受什旨，興卑萬乘之心，尊三寶之教。於草堂寺，共三千僧，手執舊經，而參定之，莫不精究，洞其深旨。時有僧叡，興甚嘉焉，什所譯經，叡並參正。然什詞喻婉約，出言成章，神情鑒徹，慠岸出群，應機領會，鮮有其匹。且篤性仁厚，汎愛為心，虛己善誘，終日無倦。南山律師，嘗問天人陸玄暢云：什師一代所翻之經，至今若新，受持轉盛，何耶？答云：其人聰明，善解大乘，已下諸人，並皆俊乂，一代之寶也。絕後光前，仰之所不及。故其所譯，以悟達為先，得佛遺寄之意也。又從毗婆尸佛已來譯經。又云：什師位階三賢，文殊指授，令其刪定。",
    "佛䭾耶舍": "此云覺明。罽賓國人。操行貞白，戒節堅固，儀止祥淑，視瞻不凡。五明四韋之論、三藏十二之典，特悟深致，流辯無滯。以姚秦弘始年，達於姑臧。什先師之，勸興往邀，興即敕迎，并有贈遺。笑不受曰：明旨既降，便應載馳，檀越待士既厚，脫如羅什見處，未敢聞命。重使敦喻，方至長安。興自出迎，別立新省於逍遙園，四事供養，並皆不受，時至分衛，一食而已。耶舍赤髭，時人號為赤髭毗婆沙。興凡所供給，衣服臥具，滿三間屋，不以關心，興為貨之造寺。",
    "曇摩讖": "或曇無讖，此云法豐。中印度人。日誦萬言。初學小乘五明諸論，後遇白頭禪師，教以大乘，十日交諍，方悟大旨。讖明解咒術，所向皆驗，西域號為大神咒師。以北涼沮渠玄始元年，至姑臧。齎涅槃經前分十卷，并菩薩戒。止於傳舍。慮失經本，枕之而臥。夜有神人，牽讖墮地，讖謂為盜。如是三夕，乃聞空中聲曰：此是如來解脫之藏，何為枕之！讖聞漸寤，乃安高處。盜者夜捉，提舉不能。明旦讖持，不以為重。盜謂聖人，悉來拜謝。遜聞讖名，厚遇請譯。",
    "佛䭾斯那": "此翻覺軍。天才聰朗，誦半億偈經，明了禪法。西方諸國，號為人中師子。口誦梵本，北涼譯經。",
    "浮陀跋摩": "此云覺鎧。西域人。志操明直，聰悟出群。雖復遍集三藏，偏善毗婆沙論。常誦此部，用為心要。",
    "智猛": "雍州人，稟性端厲，明行清白。少襲法服，修業專誠，志度宏邈。情深佛法，西尋靈跡。北涼永和年中，西還翻譯。",
    "曇摩密多": "此云法秀。罽賓國人。生而連眉，沈邃慧鑒。常有善神，潛形密護。每之國境，神夢告王，去亦如之。宋文元嘉，建業翻譯。",
    "畺梁耶舍": "此云時稱。西域人。性剛直，寡嗜欲，深善三藏，多所諳知，尤工禪思。宋文元嘉元年，鐘山翻譯，僧含筆受。",
    "伊葉波羅": "此云自在。西域人。善通三藏，解貫四含。宋文元嘉，彭城翻譯。",
    "智嚴": "涼州人。道化所被，幽顯咸伏。未出家前，曾犯五戒。後受僧具，疑不得戒。遂泛海至印度，咨問羅漢，亦不能決。為詢彌勒，慈氏答云得戒。嚴甚喜焉。得經梵本。宋文元嘉，楊都翻譯。",
    "求那跋摩": "宋云功德鎧，罽賓王之少子。洞明九部，博曉四含，深達律品，妙入禪要，誦經百餘萬言。罽賓王薨，眾請紹位，恐為戒障，遂林栖谷飲，孤行山野，遁跡人世。形儀感物，見者發心。宋文元嘉，達於建業，帝曰：弟子常欲齋戒不殺，迫以身徇於物，不獲從志，法師何以教之？對曰：夫道在心，不在事；法由己，非由人。且帝王與匹夫，所修各異。匹夫身賤名劣，言令不威；若不剋己苦躬，將何為用？帝王以四海為家，兆民為子，出一嘉言，士女咸悅；布一善政，人神以和。固當刑不夭命，役無勞力；則使風雨適時，寒暖應節，百穀滋繁，桑麻鬱茂。如此持齋，齋亦大矣！如此不殺，德亦眾矣！寧在缺半日之餐，全一禽之命，然後方為弘濟耶！帝大悅曰：法師所言，真謂開悟人心，明達物理，談盡於人天之際矣。事鈔云：宋元嘉七年，至楊州，譯善戒等經。為比丘尼受具初緣。又後有師子國尼八人來至，云：宋地未經有尼，何得二眾受戒？摩云：尼不作本法者，得戒得罪，尋佛制意，法出大僧。但使僧法成就，自然得戒。所以先令作本法者，正欲生其信心，為受戒方便耳。至於得戒，在大僧羯磨時生也，諸尼苦求更受。答曰：善哉，夫戒、定、慧品，從微至著。若欲增明，甚相隨喜。且令西尼學語，更往中國請尼，令足十數。至元嘉十年，有僧伽跋摩者，此云眾鎧，解律雜心。自涉流沙，至楊州。初求那許尼重受，未備而終。俄而師子國尼，鐵索羅等三人至京，足前十數，便請眾鎧為師於壇上，為尼重受。",
    "寶雲": "證第二果。西涼州人。自少出家，精勤碩學，志韻剛潔，不偶世群。求法懇惻，忘身徇道。以晉隆安年初，西尋靈跡，經羅剎之野，聞天鼓之音，禮釋迦影跡，受羅漢之語。歷遊西方，善梵書語。印度字音、訓釋詞句，悉皆備解。後來長安，復至江左。",
    "求那跋陀羅": "此云功德賢。中印度人。幼學五明、四韋陀論。志性明敏，度量該博。後遇雜心，莫測涯際，方悟佛法崇深。投簪落彩，專精志業，博通三藏。慈和恭恪，事師盡禮，捨小學大，深悟幽旨。宋文敕住祇洹。荊州剌史南譙王劉義宣，嘗請講華嚴經。跋陀自愧未善宋言，旦夕禮懺，求觀世音。忽夢有人，白服持劍，擎一人頭來，謂陀曰：何故憂耶？陀以意對。答曰：不須多憂！即便以劍易於陀首，更安新頭。問曰：得無痛耶？答曰：不痛。既寤，心神喜悅，於是就講，辯注若流。後還楊都，屬帝宴會，王公畢集。帝欲試其機辯，并解人意不？帝見其白首，而謂曰：師今日不負遠來之意，自外知何，唯有一在？賢即答言：慕化遠來，天子恩遇，垂三十載，今年七十一，唯一死在。帝大悅。",
    "曇無竭": "此云法勇，亦云法上。姓李，黃龍人。幼為沙彌，勤修苦行，持戒誦經，為師所重。嘗聞法顯，躬踐佛國，慨然有忘身之誓。以武帝永初年，招集同志僧猛等二十五人，共遊西域二十餘年。自餘並死，唯竭獨還。於罽賓得梵經本，楊都翻譯。",
    "功德直": "西域人。道契既廣，善誘日新。宋大明年，到荊州，為釋玄暢翻譯，暢刊正文義，詞旨婉密。舒手出香，掌中流水，莫之測也。",
    "達摩摩提": "此云法意，西域人。悟物情深，隨方啟喻。齊武永明，譯提婆達多品。",
    "求那毗地": "此云德進。中印度人。誦大小乘二十萬言，陰陽圖讖，莫不窮究。執錫戒塗，威儀端肅，齊武永明翻譯。",
    "曇摩流支": "此云法希，亦曰法樂。南印度人。偏以律藏傳名，弘道為務，感物而動，遊魏洛陽。",
    "菩提流支": "此名覺希。北印度人。遍通三藏，妙入總持，志在弘法，廣流視聽。魏宣武帝，洛陽翻譯。",
    "勒那摩提": "或云婆提。此言寶意。中印度人。誦一億偈，博贍之富，理事兼通，光明禪法。魏宣武帝，請講華嚴，詞義開悟。忽於高座，見大官執笏云：天帝請師講華嚴。意曰：今法席未終，經訖從命；然法不獨資，都講香火維那梵唄，請亦定之。使如其言。講將了，見前使來迎。果與都講等五人，俱於座終，道俗咸睹。",
    "曼陀羅": "此云適意，又云白華。",
    "波羅末陀": "秦言第一義。大品云：波字門，一切法第一義故。楞伽云：謂第一義聖樂，言說所入是第一義，非言說是第一義。第一義者，聖智自覺所得，非言說妄想覺境界。是故言說妄想，不顯示第一義。言說者，生滅動搖，展轉因緣起。若展轉因緣起者，彼不顯示第一義。又云：如為愚夫，以指指物，愚夫觀指，不得實義。如是愚夫，隨言說指，攝受計著，至竟不捨，終不能得離言說指第一實義。大集經云：甚深之理不可說，第一義諦無聲字。華嚴唱波字門，名普照法界。疏云：諸法皆等，即普照法界。",
    "闍那崛多": "此言志德。北印度人，剎帝利種。少懷達量，長垂清範，遊涉行化，來達茲境。周武帝世，譯普門重頌。",
    "達摩笈多": "隋言法密，南賢豆國人。開皇十年，來屆瓜州。文帝延入京寺，義理允正，稱經微旨。然而慈恕立身，恭和成性；心非道外，行在說前；戒地夷而靜，定水幽而潔。經洞字原，論探聲意；容儀祥正，懃節高猛。誦響繼昏晨，法言通內外。好端居而簡務，貴寡欲而息求，無倦誨人，有踰利己。至煬帝定鼎東都，置翻譯館。",
    "波羅頗迦羅": "唐言作明知識，或云波頗，此云智光。中印度人，剎帝利種。識度通敏，器宇沖邃，博窮內外，研精大小。誓傳法化，不憚艱危，遠涉䓤河，貞觀屆此。",
    "玄奘": "河南洛陽人，俗姓陳氏，潁川陳仲弓之後。鳩車之齡落䰂，竹馬之齒通玄。牆仞干霄，風神朗月，京洛名德，咸用器之。戒具云畢，偏肆毗尼，儀止祥淑，妙式群範。閱筌蹄乎九丘，探幽旨於八藏。常慨教缺傳匠，理翳譯人，遂使如意之寶不全，雪山之偈猶半。於是杖錫裹足履險若夷，既戾梵境，籌諮無倦。五明四含之典、三藏十二之筌、七例八轉之音、三聲六釋之句，皆盡其微，畢究其妙。法師討論，一十七周，遊覽百有餘國。貞觀十九年，迴靶（布訝切）上京，敕弘福寺翻譯。已上多出靜邁法師譯經圖紀。",
    "伽梵達摩": "智昇續譯經圖紀云：唐云尊法。西印度人，譯大悲經。",
    "阿地瞿多": "唐言無極高，中印度人。學窮滿字，行潔圓珠，精練五明，妙通三藏。天皇永徽，長安翻譯。",
    "那提": "唐言福生。具依梵言，則云布如焉伐耶，此但訛略，而云那提也。本中印度人。慈恩翻譯。",
    "地婆訶羅": "唐言日照，中印度人。洞明八藏，博曉四含。戒行清高，學業優贍，尤工咒術，兼洞五明。志在利生，來譯弘福。",
    "佛陀多羅": "唐云覺救。罽賓人也。於白馬寺譯圓覺經。",
    "佛陀波利": "唐云覺護，罽賓國人。忘身徇道，遍觀靈跡。聞文殊在清涼山，遠涉流沙，躬來禮謁。天皇儀鳳元年，杖錫五臺，虔禮聖容。倏見一翁，從山出來，作婆羅門語，謂波利曰：師何所求？波利答曰：聞文殊隱山，求欲瞻禮。翁曰：師將佛頂尊勝陀羅尼經來不？此土眾生，多造諸罪。佛頂咒除罪祕方，若不將經，徒來無益。縱見文殊，何必能識？可還西國，取經傳此，弟子當示文殊所在。波利便禮，舉頭不見老人。遂返本國，取得經來，狀奏天皇。遂令杜行顗，及日照三藏，於內共譯，經留在內。波利泣奏：志在利人，請布流行。帝愍專志，遂留所譯之經，還其梵本。波利將向西明，與僧順貞，共譯佛頂尊勝陀羅尼經。所願已畢，持經梵本，入於五臺，於今不出。",
    "實叉難陀": "唐言學喜。于闐國人。智度弘曠，利物為心。善大小乘，兼異學論。天后明揚佛日，敬重大乘，以華嚴舊經處會未備，遠聞于闐有斯梵本，發使迎請。實叉與經同來，赴洛重譯。",
    "義淨": "齊州人，俗姓張，字文明。髫齓之年，辭榮落䰂，遍詢名匠，廣探群籍。內外通曉，今古遍知。年有十五，志遊西域。遍師名匠，學大小乘，所為事周，還歸故里。凡所遊歷，三十餘國。往來問道，出二十年。天后證聖，河洛翻譯。",
    "達摩流支": "唐言法希，天后改為菩提流志，唐云覺愛。南印度人，婆羅門種，姓迦葉氏。聰叡絕倫，風神爽異。生年十二，外道出家，年登耳順，自謂孤行，撩僧論議，䞈（居委切）以身事。時有耶舍瞿沙，知其根熟，遂與交論。未越機關，詞理俱屈，始知佛日高明，匪螢燈並照，法海深廣，豈涓渧等潤。投身敬事，專學佛乘。未越五年，通達三藏。天皇遠聞雅譽，遣使往邀，未及使還，白雲遽駕，暨天后御極，赴京翻譯。至和帝龍興，譯寶積經。此經玄奘昔翻數行，乃歎：此土群生，未有緣矣，余氣力衰竭。因而遂輟。和帝命志續奘餘功，遂譯於世。",
    "般剌蜜帝": "唐云極量。中印度人。懷道觀方，隨緣濟度，展轉遊化，達我支那。乃於廣州制旨道場，譯首楞嚴。自漢至唐，翻譯儒釋，總有二百九十二人，今略編集。現行經人，苟欲具知，當披新舊譯經圖紀。",
    "釋迦彌多羅": "此云能支。師子國長壽沙門，三果聖人，唐高宗敬重。",
    "彌伽釋迦": "說題云：迦釋，稍訛。正云鑠佉，此曰雲峰。璿云：此云能降伏。",
    "室灑": "舊翻弟子，新云所教。南山曰：學在我後名弟，解從師生名子。天台云：師有匠成之能，學者具資稟之德，資則捨父從師，敬師如父。師之謙讓，處資如弟。故夫子云：回也處余如父，余也處回如弟。律云：和尚於弟子，當生兒想；弟子於和尚，當生父想。司馬彪曰：徒弟子，謂門徒弟子。老子云：善人，不善人之師；不善人，善人之資也。南山云：佛法增益廣大，實由師資相攝，互相敦遇，財法兩濟，日益業深，行久德固，皆賴此矣。比真教陵遲，慧風掩扇，俗懷侮慢，道出非法；並由師無率誘之心，資缺奉行之志，二彼相捨，妄流鄙境，欲令道光，焉可得乎！",
    "比丘": "大論云：比丘名乞士，清淨活命故。復次，比名破，丘名煩惱，能破煩惱故。復次，比名怖，丘名能，能怖魔王及魔人民。淨名疏云：或言有翻，或言無翻。言有翻者，翻云除饉。眾生薄福，在因無法自資，得報多所饉乏。出家戒行，是良福田，能生物善，除因果之饉乏也。言無翻者，名含三義。智論云：一破惡、二怖魔、三乞士。一、破惡者，如初得戒，即言比丘。以三羯磨，發善律儀，破惡律儀，故言破惡。若通就行解，戒防形非，定除心亂，慧悟想虛，能破見思之惡，故名破惡。二、怖魔者，既能破惡，魔羅念言：此人非但出我界域，或有傳燈，化我眷屬，空我宮殿。故生驚怖。通而言之，三魔亦怖。三、名乞士者，乞是乞求之名，士是清雅之稱。出家之人，內修清雅之德，必須遠離四邪，淨命自居，福利眾生，破憍慢心，謙下自卑，告求資身，以成清雅之德，故名乞士。又云：此具三義：一殺賊，從破惡以得名；二不生，從怖魔而受稱；三應供，因乞士以成德。涅槃說四種比丘：一者畢竟道（無學）；二者示道（初二三果）；三者受道（通內外凡）；四者汙道，犯四重者。善見論云：善來得戒，三衣及瓦缽，貫著左肩上。缽色如青鬱缽羅華，袈裟鮮明如赤蓮華，針線斧子漉囊備具。",
    "比丘尼": "善見云：尼者，女也。文句云：通稱女為尼。智論云：尼得無量律儀故，應次比丘。佛以儀法不便，故在沙門後。比丘尼，稱阿姨師姨者，通慧指歸云：阿平聲，即無遏音，蓋阿音轉為遏也。有人云：以愛道尼，是佛姨故，傚喚阿姨。今詳梵云阿梨夷，此云尊者，或翻聖者。今言阿姨，略也。僧祇云：阿梨耶僧聽是也。事鈔尼眾篇云：善見佛初不度女人出家，為滅正法五百年；後為說八敬，聽出家，依教行故，還得千年。今時不行，隨處法滅。會正記云：佛成道後十四年，姨母求出家，佛不許度。阿難為陳三請，佛令慶喜傳八敬向說：若能行者，聽汝出家。彼云頂戴持。言八敬者：一者、百歲比丘尼，見初受戒比丘，當起迎送，禮拜問訊，請令坐；二者、比丘尼不得罵謗比丘；三者、不得舉比丘罪，說其過失，比丘得說尼過；四者、式叉摩那，已學於戒，應從眾僧，求受大戒；五者、尼犯僧殘，應半月在二部僧中，行摩那埵；六者、尼半月內，當於僧中求教授人；七者、不應在無比丘處夏安居；八者、夏訖，當詣僧中求自恣人。如此八法，應尊重恭敬讚歎，盡形不應違。今述頌曰：禮不罵謗不舉過，從僧受戒行摩那，半月僧中求教授，安居近僧請自恣。",
    "式叉摩那": "此云學法女。四分：十八童女，應二歲學戒。又云：小年曾嫁，年十歲者，與六法，十誦中六法練心也。能持六法，方與受具。二年者，練身也，可知有胎無胎。事鈔云：式叉尼具學三法：一學根本，謂四重是；二學六法，即羯磨所謂染心相觸、盜人四錢、斷畜生命、小妄語、非時食、飲酒也；三學行法，謂一切大尼戒行，並須學之。若學法中犯者，更與二年羯磨。僧祇云：在大尼下，沙彌尼上坐。今述頌曰：染心相觸盜四錢，斷畜生命小妄語，戒非時食及飲酒，是名式叉學六法。",
    "沙彌": "南山沙彌別行篇云：此翻息慈，謂息世染之情，以慈濟群生也。又云：初入佛法，多存俗情，故須息惡行慈也。音義云：沙彌二字，古訛略也。唐三藏云：室利摩拏路迦，此翻勤策男。寄歸傳云：授十戒已，名室羅末尼，譯為求寂。最下七歲，至年十三者，皆名驅烏沙彌。若年十四至十九，名應法沙彌。若年二十已上，皆號名字沙彌。",
    "沙彌尼": "奘三藏云：室利摩拏理迦，此云勤策女。",
    "優婆塞": "肇曰：義名信士男、信士女。淨名疏云：此云清淨士、清淨女。亦云善宿男、善宿女。雖在居家，持五戒，男女不同宿，故云善宿。此未可定用。荊溪云：依餘經文，但云近佛，得善宿名。不可定云男女不同宿也。涅槃疏云：一日一夜受八戒者，名為善宿優婆塞。西域記云：鄔波索迦，唐言近事男。舊曰伊蒲塞，又曰優婆塞，皆訛也。鄔波斯迦，唐言近事女。舊優婆斯，又曰優婆夷，皆訛也。言近事者，親近承事諸佛法故。後漢書名伊蒲塞，注云即優婆塞也。中華翻為近住，言受戒行，堪近僧住也。或名檀那者，要覽曰：梵語陀那缽底，唐言施主，今稱檀那，訛陀為檀，去缽底留那也。思大乘論云：能破慳吝嫉妒，及貧窮下賤苦，故稱陀。後得大富，及能引福德資糧，故稱那。又稱檀越者，檀，即施也。此人行施，越貧窮海。",
    "優婆夷": "見「優婆塞」。",
    "僧伽": "梁云小師子，又云狻猊。爾雅曰：狻猊如虦（在奸切）貓，食虎豹。註云：即師子。出西域。大論問：何以名師子座？答：是號名師子，非實師子。佛為人中師子，佛所坐處，若床若地，皆名師子座。",
    "沙門": "或云桑門，或名沙迦懣（門字上聲）曩，皆訛。正言室摩那拏，或舍羅磨拏。此言功勞，言修道有多勞也。什師云：佛法及外道，凡出家者，皆名沙門。肇云：出家之都名也。秦言義訓勤行，勤行取涅槃。阿含經云：捨離恩愛，出家修道，攝御諸根，不染外欲；慈心一切，無所傷害；遇樂不欣，逢苦不戚，能忍如地，故號沙門。後漢書郊祀志云：沙門，漢言息心，削髮去家，絕情洗欲，而歸於無為也。瑞應云：息心達本源，故號為沙門。或云具名沙門那，此云乏道。以為良福田故，能斷眾生饉乏；以修八正道故，能斷一切邪道。故迦葉品云：沙門那者，即八正道；沙門果者，從道畢竟永斷一切貪瞋癡等（云云）。世言沙門名乏，那者名道。如是道者，斷一切乏，斷一切邪道，以是義故，名八正道，為沙門那。從是道中獲得果故，名沙門果。或以沙門翻勤息。垂裕記云：謂勤行眾善，止息諸惡。息界內惡者，藏通沙門；次第息界內外惡者，別教沙門；一心遍息內外諸惡者，圓融沙門。瑜伽論云：有四沙門：一勝道沙門，即佛等；二說道沙門，謂說正法者；三活道沙門，謂修諸善品者；四汙道沙門，謂諸邪行者。",
    "苾蒭": "古師云含五義：一體性柔軟，喻出家人，能折伏身語麤獷故。二引蔓旁布，喻出家人，傳法度人，連延不絕故。三馨香遠聞，喻出家人，戒德芬馥，為眾所聞。四能療疼痛，喻出家人，能斷煩惱毒害故。五不背日光，喻出家人，常向佛日故。智論云：出家多修智慧，智慧是解脫因緣。俗人多修福德，福德是樂因緣。僧祇云：供養舍利，造塔寺，非我等事。彼國王居士，樂福之人，自當供養。比丘事者，所謂結集三藏，勿令佛法速滅。",
    "和尚": "或和闍羯磨。疏云：自古翻譯，多雜蕃胡，胡傳天語，不得聲實，故有訛僻。傳云：和尚，梵本正名鄔波遮迦。傳至于闐，翻為和尚，傳到此土，什師翻名力生。舍利弗問經云：夫出家者，捨其父母生死之家，入法門中，受微妙法。蓋師之力，生長法身，出功德財，養智慧命，功莫大焉。又和尚亦翻近誦，以弟子年少，不離於師，常逐常近，受經而誦。善見云：和尚外國語，漢言知有罪知無罪也。明了論本云：優波陀訶，翻為依學，依此人學戒定慧故，即和尚也。義淨云：鄔波陀耶，此云親教師，由能教離出世業故。故和尚有二種：一依教，即受業也；二依止，即稟學也。毗奈耶云：弟子門人，纔見師時，即須起立；若見親教，即捨依止。",
    "闍梨": "或阿祇利。寄歸傳云：梵語阿遮梨耶。唐言軌範，今稱闍梨，訛略。菩提資糧論云：阿遮梨夜，隋言正行。南山鈔云：能糾正弟子行故。四分律明五種阿闍梨：一出家阿闍梨，所依得出家者；二受戒阿闍梨，受戒作羯磨者；三教授阿闍梨，教授威儀者；四受經阿闍梨，所從受經若說義，乃至四句偈；五依止阿闍梨，乃至依住一宿者。和尚及依止，多已十夏者為之，上四師皆多已五夏者為之。",
    "頭陀": "新云杜多，此云抖擻，亦云修治，亦云洮汏。垂裕記云：抖擻煩惱故也。善住意天子經云：頭陀者，抖擻貪欲瞋恚愚癡。三界內外六入，若不取不捨，不修不著，我說彼人，名為杜多。今訛稱頭陀，大品云：須菩提，說法者，受十二頭陀：一作阿蘭若，二常乞食，三納衣，四一坐食，五節量食，六中後不飲漿，七塚間住，八樹下，九露地住，十常坐不臥，十一次第乞食，十二但三衣。大論六十七云：十二頭陀，不名為戒。能行則戒莊嚴，不能行不犯戒。然論但依經次第廣釋，不分部位，諸文引用多誤，故此點出。南山律鈔：位分為四。衣二：一納衣，二但三衣。食四：一乞食，二不作餘食法，三一坐，四一揣（徒端切。揣者，雜也。一和雜者，不以種種盛貯，名一揣食）。處五：一蘭若，二塚間，三樹下，四露坐，五隨坐。威儀一，常坐。此無次第乞食，處加隨坐。通源記引南山云：季世佛法，崇尚官榮，僥倖之夫，妄生朋翼。庶因斯語，自省厥躬。至若謂利養如毛繩，視朱門為蓬戶。尚思曳尾，猶被興嘲，況乎以咳唾為恩，眄睞成餙，潛通惠好，強事趨馳。縱假寵於一時，終受嗤於群口，榮不補辱，夫何誤哉？",
    "婆檀陀": "大論：秦言大德。毗奈耶律云：佛言：從今日後，小下苾蒭，於長宿處，應喚大德。",
    "體毗履": "此云老宿。他毗利，此云宿德。",
    "悉替那": "此云上座。五分律：佛言：上更無人，名上座。道宣敕為西明寺上座，列寺主維那之上。毗尼母云：從無夏至九夏，是下座；自十夏至十九夏，是中座；自二十夏至四十夏，是上座。五十夏已上，一切沙門之所尊敬，名耆宿。毗婆沙論云：有三上座，一生年上座，即尊長者具舊戒，名真生故；二世俗上座，即知法富貴、大財大位、大族大力、大眷屬。雖年二十，皆應和合，推為上座；三法性上座，即阿羅漢。律云：瓶沙王稱佛弟子為上人。大品經：佛言：若菩薩一心行阿耨多羅三藐三菩提，心不散亂，是名上人。瑜伽論云：無自利利他行者，名下士；有自利無利他，名中士；有二利，名上士。",
    "摩摩帝": "或云毗呵羅莎弭（名婢切）。此云寺主。僧史略云：詳其寺主，起乎東漢白馬寺也。寺既爰處，人必主之。於時雖無寺主之名，而有知事之者。東晉以來，此職方盛，故梁武造光宅寺，召法雲為寺主，創立僧制。",
    "維那": "南山云：聲論翻為次第，謂知僧事之次第。寄歸傳云：華梵兼舉也。維是綱維，華言也。那是梵語，刪去羯磨陀三字也。僧史略云：梵語羯磨陀那，譯為事知，亦云悅眾。謂知其事，悅其眾也。稽其佛世，飲光統眾於靈鷲，身子涖事於竹林。音義指歸云：僧如網，假有德之人為綱繩也。隋智琳潤州剌史李海游，命琳為斷事綱維，邇後寺立三綱：上座、維那、典座也。",
    "釋曷攞": "寄歸傳云：唐言小師。毗奈耶云：難陀比丘，呼十夏比丘為小師。如僧叡謂僧導云：君當為萬人法主，豈可對揚小師乎？",
    "阿夷恬": "此云新學，亦云新發意。",
    "提和越": "漢言天地。易曰：天地設位，而易行乎其中矣！繫詞云：易與天地準，故能彌綸天地之道。仰以觀於天文，俯以察其地理。白虎通曰：天之為言鎮也，居高理下，為人鎮也。地者，易也，言生萬物懷任，交易變化也。",
    "提多羅咤": "大論云：秦言治國，主乾闥婆，及毗舍闍。光明疏云：上升之元首，下界之初天，居半須彌東黃金埵，王名提頭賴吒。此云持國，又翻安民。",
    "毗流離": "大論云：秦言增長，主弓槃茶，及薜荔多。光明疏云：南瑠璃埵，王名毗留勒叉。亦翻免離。",
    "毗流波叉": "大論云：秦言雜語，主諸龍，及富樓多那。光明疏云：西白銀埵，王名毗留博叉。又翻非好報，又翻惡眼，亦翻廣目。",
    "鞞沙門": "大論云：秦言多聞，主夜叉，及羅剎。光明疏云：北水精埵，王名毗沙門。索隱云：福德之名聞四方故，亦翻普聞。佛令掌擎古佛舍利塔。僧史略云：唐天寶元年，西蕃五國來寇安西。二月十一日，奏請兵解援，發師萬里，累月方到。近臣奏，且詔不空三藏，入內持念。玄宗秉香鑪，不空誦仁王護國陀羅尼，方二七遍，帝忽見神人五百員，帶甲荷戈在殿前。帝問不空，對曰：此毗沙門天王第二子獨健，副陛下心，往救安西。其年四月奏：二月十一日巳時，後城東北三十里，雲霧冥晦中，有神可長丈餘，皆被金甲。至酉時鼓角大鳴，地動山搖，經二日，蕃寇奔潰。斯須，城樓上有光明天王現形，謹圖樣隨表進呈。因敕諸道州府，於西北隅居，置天王形像。此四天王，居須彌腹。故俱舍云：妙高層有四，相去各十千。傍出十六千，八四二千量，堅首及持鬘。常憍大王眾，如次居四級，亦住餘七山。此四名曰四王。八部，或標二十八部者，一云，一方有四部，六方則成二十四部，四維各一，合為二十八部。一云，一方有五部，謂地、水、火、風、空，四方成二十部，并四王所領八部，為二十八部。感通傳天人費氏云：一王之下，有八將軍，四王三十二將，周四天下，往還護助諸出家人。四天下中，北天一洲，少有佛法，餘三天下，佛法大弘。然出家人，多犯禁戒，少有如法。東西天下，少有黠慧，煩惱難化。南方一洲，雖多犯罪，化令從善，心易調伏。佛臨涅槃，親受付囑，並令守護，不使魔撓。若不守護，如是破戒，誰有行我之法教者！故佛垂誡，不敢不行。雖見毀禁，愍而護之。見行一善，萬過不咎，事等忘瑕，不存往失。韋將軍，三十二將之中，最存弘護，多有魔子魔女，輕弄比丘，道力微者，並為惑亂。將軍恓惶奔赴，應機除翦。故有事至，須往四王所。時王見皆起，為韋將軍修童真行，護正法故。",
    "迦留波陀天": "此言象跡，自有十處。",
    "質多羅": "此翻雜地。",
    "摩偷": "又云𡨧唎，翻酒。大論：酒有三種：一者穀酒；二者果酒，蒲萄阿梨咤樹果，如是等種種，名為果酒；三者藥酒，種種藥草，合和米麴、甘蔗汁中，能變成酒。同跡畜乳酒，一切乳熱者，可中作酒。漢書：酒者，天之美祿。所以頤養天下，享祀祈福，扶衰養疾。陶侃（空汗切）嘗曰：少時有酒失，亡親見約，故不敢多飲。或云醞者，釀也。蒼頡篇云：酒母也。或云醪（力刀切）。蒼頡篇謂有滓酒。大莊嚴論云：佛說身、口、意，三業之惡行，唯酒為根本，復墮惡行中。",
    "忉利": "應法師云：梵音訛略，正言多羅夜登陵舍。此云三十三。俱舍頌云：妙高頂八萬，三十三天居。四角有四峰，金剛手所住，中宮名善現，周萬踰繕那。高一半金城，中有殊勝殿，周千踰繕那。",
    "釋提桓因": "大論云：釋迦，秦言能；提婆，秦言天；因提，秦言主。合而言之，云釋提婆那民。或云釋迦提婆因陀羅，今略云帝釋，蓋華梵雙舉也。雜阿含云：有一比丘問佛：何故名釋提桓因？答：本為人時，行於頓施，堪能作主，故名釋提桓因。瓔珞經云：汝今天帝釋，功德眾行至，千佛兄弟過，無復賢劫名。中間永曠絕，二十四中劫，後乃有佛出，剎土名普忍。彼佛壽七劫，遺法亦七劫，其法已沒盡，曠絕經五劫。汝於彼剎土，當紹如來位，號名無著尊。淨名疏云：若此間帝釋，是昔迦葉佛滅，有一女人，發心修塔，復有三十二人，發心助修。修塔功德，為忉利天主，其助修者而作輔臣。君臣合之，名三十三天。",
    "須夜摩": "此云善時分，又翻妙善。新云須燄摩。此云時分，時時唱快樂故。或云受五欲境，知時分故。",
    "兜率陀": "此云妙足。新云睹史陀，此云知足。西域記云：睹史多，舊曰兜率陀。兜術陀，訛也。於五欲知止足故。佛地論：名憙足，謂後身菩薩，於中教化，多修憙足故。",
    "須涅密陀": "或尼摩羅。大論云：秦言化自樂，自化五塵，而自娛樂，故言化自樂。楞嚴名樂變化天。",
    "婆舍跋提": "或波羅尼密。大論云：秦言他化自在。此天奪他所化，而自娛樂，故言他化自在。亦名化應聲天。別行疏云：是欲界頂天，假他所作，以成己樂。即魔王也。",
    "大梵": "經音義，梵迦夷，此言淨身。初禪梵天，淨名疏云：梵是西音，此云離欲，或云淨行。法華疏云：除下地繫，上升色界，故名離欲，亦稱高淨。淨名疏云：梵王是娑婆世界主，住初禪中間，即中間禪也，在初禪二禪兩楹之中。毗曇云：二禪已上，無言語法故，不立王法。瓔珞：禪禪皆有梵王，今謂但加修無量心，報勝為王，無統御也。初禪有覺觀言語，則有主領，故作世主。次第禪門云，佛於仁王經說十八梵，亦應有民主之異。又云：四禪中有大靜王，而佛於三藏中，但說初禪有大梵天王者，以初禪內有覺觀心，則有語言法，主領下地眾生為便。證真云：劫初成時，梵王先生，獨住一劫，未有梵侶。後起念云：願諸有情，來生此處。作是念已，梵子即生。外道不測，便執梵王是常，梵子無常。",
    "梵富樓": "此云前益天。在梵前行，恆思梵天利益。亦名梵輔。",
    "首陀婆": "大論云：秦言淨居天，通五淨居。",
    "阿迦尼吒": "正名阿迦抳（女几切）瑟搋（敕佳切），或云阿迦尼沙。此云質礙究竟，即色究竟天。",
    "摩醯首羅": "大論：此云大自在，正名摩訶莫醯伊濕伐羅，八臂三眼騎白牛。普門疏云：樓炭稱為阿迦尼吒，華嚴稱為色究竟。或有人以為第六天，而諸經論多稱大自在，是色界頂。釋論云：過淨居天，有十住菩薩，號大自在，大千界主。十住經云：大自在天光明，勝一切眾生。涅槃獻供，大自在天最勝，故非第六天也。灌頂云：字威靈帝。",
    "摩利支": "此云陽炎，在日前行。",
    "散脂脩摩": "此翻云密，謂名行理智，四皆密故。天台釋天大將軍，乃云金光明以散脂為大將。大經云：八臂健提，天中力士。大論又稱鳩摩羅伽。此云童子，騎孔雀、擎雞、持鐸、捉赤旛。復有韋紐，此云遍聞，四臂、捉貝、持輪、持金翅鳥，皆是諸天大將。未知此大將軍，定是何等。光明疏云：二十八部，巡游世間，賞善罰惡，皆為散脂所管。",
    "跋闍羅波膩": "梁云金剛。應法師云：跋闍羅，此云金剛。波膩，此云手。謂手執金剛杵以立名。正法念云：昔有國王夫人生千子，欲試當來成佛之次第，故俱留孫探得第一籌，釋迦當第四籌，乃至樓至當千籌。第二夫人生二子，一願為梵王，請千兄轉法輪。次願為密跡金剛神（應法師云：梵語散那，譯云密主，知佛三密功德故也。梵本都無跡義，以示跡為神，譯者義立，故云密跡。）護千兄教法。世傳樓至化身，非也。乃法意王子，據經唯一人，今狀於伽藍之門，而為二像。夫應變無方，多亦無咎，出索隱記。",
    "訶利帝南": "光明云：訶利帝南，此標梵語。鬼子母等，此顯涼言。名雖有二，人祗是一。故律中明鬼子母後總結云：時王舍人眾，皆稱為訶離帝母神。寄歸傳云：西方施主，請僧齋日，初置聖僧供，次行眾僧食。後於行末，安一盤，以供訶利帝母。",
    "毗首羯磨": "正理論音云：毗濕縛羯磨，此云種種工業，西土工巧者，多祭此天。",
    "別他那": "梁言圍，亦云吠率怒天。",
    "耆婆天": "長水云：耆婆，此云命。西國風俗，皆事長命天神，此說未知所出。準法華疏云：耆域，此翻故活。生忉利天。目連弟子病，乘通往問。值諸天出園游戲，耆域乘車不下，但合掌而已，目連駐之。域云：諸天受樂忽遽，不暇相看，尊者欲何所求？具說來意。答云：斷食為要。目連放之，車乃得去。據此耆婆天，即是醫師耆域也。",
    "蘇利耶": "或蘇梨耶，或修利。此云日神。日者，說文云實也，太陽之精。起世經云：日天宮殿，縱廣正等五十一由旬，上下亦爾。",
    "蘇摩": "此云月神。釋名云：月者，缺也。言滿而復缺。淮南子云：月者，太陰之精。起世經云：月天宮殿，縱廣正等四十九由旬。問：何故月輪初後時缺？答：如涅槃云：月性常圓，實無增減。因須彌山，故有盈虧。又俱舍云：近日自影覆，故見月輪缺。世施設足論云：以月宮行近，日輪光所侵，照餘邊發影，自覆月缺輪，故於爾時見不圓滿。然一日月普照四洲者，長阿含云：閻浮提日中，弗婆提日沒，瞿耶尼日出，鬱單越夜半。經文次第，四方遍說，此二名出大孔雀咒王經。蘇，上聲。",
    "盎哦囉迦": "此翻火星。",
    "部陀": "此翻水星。",
    "勿哩訶娑跛底": "此翻木星。",
    "賒乃以室折囉": "此翻土星。",
    "戍羯羅": "此云金星。",
    "那伽": "秦云龍。說文云：龍，鱗蟲之長。能幽能明，能大能小，能長能短。春分而登天，秋分而入地，順也。廣雅云：有鱗曰蛟龍，有翼曰應龍，有角曰虯（渠幽切）龍，無角曰螭龍，未升天曰蟠龍。本行集經：稱佛為龍者，謂世間有愛，皆遠離之。繫縛解脫，諸漏已盡，故名為龍。故曰：那伽常在定，無有不定時。智論云：如菩薩本身，曾為大力毒龍。若眾生在前，身力弱者，眼視便死；身力強者，氣噓（音虛）乃死。此龍受一日一夜戒，出家求靜。入於林樹間，思惟坐久，疲怠而臥。龍法若睡，形狀如蛇，身有文章，七寶雜色。獵者見之，便驚喜言：如此希有難得之皮，獻上國王，以為莊飾，不亦宜乎？便以杖按其頭，以刀剝皮。龍自思惟：我力如意，傾覆此國，其如反掌。此人小物，豈能困我？我今以持戒故，不計此身，當從佛語。於是自忍，眠目不視，閉氣絕息。憐愍此人，一心受剝，不生悔意。既失其皮，赤肉在地。時，日大熱，踠轉土中，欲趣大水。見諸小蟲來食其身，為護戒故，復不敢動。自思惟言：我今此身，以施諸蟲，為佛道故。今以肉施，用充其身，後成佛時，當以法施，以益其心。如是誓已，身乾命終，生忉利天。爾時毒龍，釋迦文佛是；是時獵師，今調達等六師是也；諸小蟲者，初轉法輪八萬諸天得道者是。",
    "難陀跋難陀": "文句云：難陀，此云歡喜。跋，此翻善。兄弟常護摩竭提國，雨澤以時，國無飢年。瓶沙王年為一會，百姓聞皆歡喜，從此得名。慈恩云：第一名喜，次名賢喜。此二兄弟，善應人心，風不鳴條，雨不破磈。初令人喜，後性復賢，令喜又賢，故以為名。大論云：有龍王兄弟，一名姞（巨乙切）利，二名阿伽和羅，降雨以時。",
    "娑伽羅": "從海標名，如下所出。",
    "和脩吉": "此云多頭。",
    "德叉迦": "此云現毒，亦云多舌。",
    "阿那婆達多": "此云無熱，從池得名，池中有五柱堂。",
    "摩那斯": "此云大身，或云大意，或云大力。",
    "漚缽羅": "亦云優缽，亦云優波陀。此云黛色蓮華，又青蓮華，龍依此住，從池得名。",
    "伊羅缽": "闡義鈔云：亦云伊羅跋羅。伊羅，樹名，此云臭氣。跋羅，此云極。謂此龍往昔由損此極臭樹葉，故致頭上生此臭樹，因即為名。",
    "迦梨迦": "又名加羅加，此云黑龍。",
    "夜叉": "此云勇健，亦云暴惡。舊云閱叉。西域記云：藥叉，舊訛曰夜叉，能飛騰空中。什曰：秦言貴人，亦言輕健。有三種：一在地，二在虛空，三天夜叉。地夜叉，但以財施，故不能飛空。天夜叉，以車馬施，故能飛行。肇曰：天夜叉居下二天，守天城池門閣。",
    "和夷羅洹閱叉": "即執金剛神。",
    "羅剎": "此云速疾鬼，又云可畏，亦云暴惡，或羅叉娑。此云護士，若女，則名囉叉斯。",
    "跋陀波羅賒塞迦": "下生經云：秦言善教，此護彌勒城夜叉。",
    "乾闥婆": "或犍陀羅。淨名疏：此云香陰，亦云陵空之神。不噉酒肉，唯香資陰，是天主幢倒樂神，在須彌南金剛窟住。什曰：天樂神也。處地十寶山中。天欲作樂時，此神身有異相出，然後上天。新云尋香行。應法師云嗅香。",
    "童籠磨": "大論：秦言樹，是乾闥婆名。",
    "阿脩羅": "舊翻無端正，男醜女端正。新翻非天。淨名疏云：此神果報最勝，鄰次諸天，而非天也。新婆娑論云：梵本正音名素洛。素洛是天，彼非天故，名阿素洛。又素洛名端正，彼非端正，名阿素洛。西域記云：阿素洛，舊曰阿脩羅、阿須倫、阿須羅，皆訛也。什曰：秦言不飲酒，不飲酒因緣，出雜寶藏。法華疏云：阿脩羅採四天下華，醞於大海。龍魚業力，其味不變。瞋妒誓斷，故言無酒。大論云：佛去久遠，經法流傳五百年後，多有別異。或言五道，或言六道。觀諸經義，應有六道。以善有上、中、下，故有三善道。惡有上、中、下，故有三惡道。若不爾者，惡有三果報，而善二果報，是事相違；若有六道，於義無違。故此脩羅，在因之時，懷猜忌心，雖行五常，欲勝他故，作下品十善，感此道身。華嚴云：如羅睺阿脩羅王，本身長七百由旬，化形長十六萬八千由旬。於大海中出其半身，與須彌山而正齊等。楞嚴經云：復有四種阿脩羅類：若於鬼道，以護法力，乘通入空，此阿脩羅從卵而生，鬼趣所攝。若於天中，降德貶（悲斂切）墜，其所卜居，鄰於日月，此阿脩羅從胎而出，人趣所攝。有阿脩羅，執持世界，力洞無畏，能與梵王及天帝釋四天爭權，此阿脩羅因變化有，天趣所攝。別有一分下劣脩羅，生大海心，沈水穴口，旦遊虛空，暮歸水宿，此阿脩羅因濕氣有，畜生趣攝。淨覺問：此四阿脩羅，既為四趣所攝，應無別報同分之處耶？答：雖屬四趣，非無別報。今云卜居鄰於日月等，即同分之處也。又長阿含云：南洲有金剛山，中有脩羅宮，所治六千由旬，欄楯行樹等。然一日一夜，三時受苦，苦具來入其宮中。起世經云：脩羅所居，宮殿、城郭、器用，降地居天一等。亦有婚姻男女法式，略如人間。正法念經云：阿脩羅略有二種：一者鬼道所攝，魔身餓鬼，有神通力。二者畜生所攝，住大海底，須彌山側。問：法華所列四種脩羅，與楞嚴四，為同為異？答：資中云同。淨覺云：彼四祇可攝在此四之中，不可次第分屬其類。荊溪師云：法華四種，皆與帝釋鬥戰。一往觀之，但同今經第三類耳。",
    "婆稚": "正名跋稚迦，此云團圓。今誤譯云被縛。或云五處被縛，或云五惡物繫頸不得脫，為帝釋所縛。經音義云：居脩羅前鋒，為帝釋所縛，因誓得脫，故以名焉。",
    "佉羅騫䭾": "翻吼如雷。",
    "毗摩質多": "此云高遠。",
    "羅睺": "文句：此云障持，化身長八萬四千由旬，舉手掌障日月，世言日月蝕。釋名云：日月虧曰蝕，稍小侵虧，如蟲食草木之葉也。京房易傳云：日月赤黃為薄。或曰：不交而食曰薄。韋昭云：氣往薄之為薄，虧毀曰食。成論云：譬如天日月，其性本明淨；煙雲塵霧等，五翳則不現。等，取脩羅。故佛誡云：脩羅！脩羅！汝莫吞月，月能破暗，能除眾熱。",
    "迦樓羅": "文句：此云金翅，翅翮金色，兩翅相去三百三十六萬里。頸有如意珠，以龍為食。肇曰：金翅鳥神。",
    "緊那羅": "文句：亦名真陀羅，此云疑神。什曰：秦言人非人，似人而頭上有角。人見之言：人耶？非人耶？因以名之。亦天伎神也，小不及乾闥婆。新云歌神，是諸天絲竹之神。",
    "摩睺羅伽": "亦云摩呼羅伽，此云大腹行。什曰：是地龍而腹行也。肇曰：大蟒神腹行也。淨名疏云：即世間廟神。受人酒肉，悉入蟒腹。毀戒邪諂，多瞋少施，貪嗜酒肉。戒緩，墮鬼神；多瞋，蟲入其身而唼食之。亦名莫呼洛。諸經云人非人者，天台云此乃結八部數爾。",
    "魔羅": "大論云：秦言能奪命。死魔實能奪命，餘者能作奪命因緣，亦能奪智慧命，是故名殺者。又翻為障，能為修道作障礙故。或言惡者，多愛欲故。垂裕云：能殺害出世善根。第六天上，別有魔羅所居天，他化天攝。輔行云：古譯經論，魔字從石。自梁武來，謂魔能惱人，字宜從鬼。",
    "波旬": "訛也，正言波卑夜，此云惡。釋迦出世，魔王名也。什曰：秦言殺者，常欲斷人慧命故，亦名惡中惡。惡有三種：一曰惡，若以惡加己，還以惡報，是名為惡。二曰大惡，若人不侵己，無故加害，是名大惡。三曰惡中惡，若人來供養恭敬，不念報恩，而反害之，是名惡中惡。魔王最甚也。諸佛常欲令眾生安隱，而反壞亂，故言甚也。肇曰：秦言或名殺者，或云極惡。斷人善因，名殺者。違佛亂僧，罪莫之大，故名極惡也。涅槃疏云：依於佛法而得善利，不念報恩，反欲加毀，故云極惡。亦名波旬踰，此云惡也，常有惡意，成惡法故。",
    "鴦寠利魔羅": "西域記云：唐言指鬘，舊曰央掘摩羅，訛也。殺人取指，冠首為鬘。鴦崛摩鬘經云：師教殺人，限至於百，各貫一指，以鬘其頭。又翻一切世間現。",
    "魔登伽": "長水云：義翻本性。楞嚴云：性比丘尼是也。又過去為婆羅門女，名為本性。今從昔號，故曰性比丘尼。孤山云：以初見性淨明體，乃立嘉名。淨覺云：名為本性，出摩登伽經。據摩鄧女經，女之母名摩鄧耳。又云摩登。皆梵音奢切。應法師云：摩登伽，具名阿徙多摩登祇旃陀羅。摩登祇，女之總名。阿徙多，女之別名。此女卑賤，常掃市為業，用給衣食。",
    "頭師": "此云惡瞋，迦葉佛時魔名。",
    "室利毱多": "西域記云：唐言勝密，以火坑毒飲，請佛欲害。",
    "阿斯陀": "或云阿夷，此翻無比，又翻端正。大論云：阿私陀仙，白淨飯王言：我以天耳，聞諸天鬼神說，淨飯王生子，有佛身相，故來請見。王大歡喜，敕諸侍人，將太子出。侍人答王：太子小睡。時阿私陀言：聖王！常警一切，施以甘露，不應睡也。即從座起，詣太子所。抱著臂上，上下相之。相已涕零，不能自勝。王大不悅，問相師曰：有何不祥，涕泣如是？仙人答言：假使天雨金剛大山，不能動其一毛，豈有不祥？太子必當作佛。我今年暮，當生無色天上，不得見佛，不聞其法，故自悲傷耳。",
    "羼提": "此曰安忍。法界次第云：秦言忍辱，內心能安忍外所辱境，故名忍辱。忍辱有二種：一者生忍，二者法忍。云何名生忍？生忍有二種：一於恭敬供養中，能忍不著，則不生憍逸；二於瞋罵打害中能忍，則不生瞋恨怨惱，是為生忍。云何名法忍？法忍有二種：一者非心法，謂寒熱、風雨、飢渴、老病、死等；二者心法，謂瞋恚、憂愁、疑、婬、欲、憍慢諸邪見等。菩薩於此二法，能忍不動，是名法忍。",
    "阿羅羅迦摩羅": "亦名羅勒迦藍。",
    "鬱陀羅羅摩子": "亦云鬱頭藍弗，此云猛喜，又云極喜。中阿含羅摩經云：我為童子時，年二十九，往阿羅羅迦摩羅所，問言：依汝法，行梵行，可不？答言：無不可。云何此法自知證？仙言：我度識處，得無所有處。即往遠離處，修證得已，更往仙所，述己所得。仙問：汝已證無所有處耶？我之所得，汝亦得耶？即共領眾。又自念此法不趣智慧，不趣涅槃，寧可更求安隱處耶？是故更往鬱陀羅羅摩子所，云：我欲於汝法中學。彼答：無不可。問曰：自知證耶？答：我度無所有處，得非想定。我久證得。便修得之。乃至領眾等。復念言：此法不至涅槃。即往象頭山，鞞羅梵志村，尼連禪河邊，誓不起座。即得無上安隱涅槃。",
    "婆藪": "方等陀羅尼經云：爾時婆藪從地獄出，將九十二億罪人，來詣娑婆世界。十方亦然。於時文殊師利語舍利弗：此諸罪人，佛未出時，造不善行，經於地獄，因於華聚放大光明，承光而出（云云）。婆者言天，藪言慧。云何天慧之人，地獄受苦。又婆言廣，藪言通；又婆言高，藪言妙；又婆言斷，藪言智；又婆言剛，藪言柔；又婆言慈，藪言悲。",
    "佉盧虱吒": "隋言驢脣，此乃大仙人名。（虱音瑟）。",
    "殊致阿羅婆": "隋言光味。般若燈論云：聲聞菩薩等，亦名仙佛，於中最尊上故。已有一切波羅蜜多功德善根彼岸，故名大仙。",
    "摩㝹舍喃": "大論：此云人。法苑云：人者，忍也。於世違順，情能安忍。孔子曰：人者，仁也。禮記曰：人者，天地之心，五行之端。周書云：惟人萬物之靈。孔安國云：天地所生，惟人為貴。今謂若無善因，奚感美報？言善因者，謂五戒也。一不殺戒，常念有情，皆惜身命，恕己慜彼，以慎傷暴。二不盜戒，不與私取，是為偷盜，義既非宜，故止攘（汝陽切）竊。三不邪婬，女有三護，法亦禁約，守禮自防，故止羅欲。四不妄語，覆實言虛，誑他欺自，端心質直，所說誠實。五不飲酒，昏神亂性，酒毒頗甚，增長愚癡，故今絕飲。原佛五戒，本化人倫，與儒五常，其義不異。不殺即仁，不盜即義，不婬即禮，不妄語即信，不飲酒即智。故梵摩喻經曰：為清信士，守仁不殺，知足不盜，貞潔不婬，執信不欺，盡孝不醉。當以意解，勿執名別。又四分律，明受五戒，分四種異：但受三歸，名無分優婆塞；或受一戒，名少分優婆塞；受二三四，名多分優婆塞；具受五戒，名滿分優婆塞。其如五戒全缺，則人間之路終不復生。以此五戒，是大小乘尸羅根本。故經云：五戒者，天下大禁忌。若犯五戒，在天違五星，在地違五岳，在方違五帝，在身違五藏。故佛成道，未轉法輪，先為提謂，授五戒法，號曰人乘，居五乘首。由茲五戒，超出三塗，取運載義，以立乘名。古師通漫稱人天教，天台謂無詮理破惑之功，不得名為教矣。嵩輔教編，罔究名義，立二種教：一曰世教，二出世教。指人天乘，名曰世教，斯恣胸臆，而戾祖教。今謂三教立名，義意各異。且儒宗名教者，元命包云：教之為言傚也。上行之，下傚之。此以下所法傚名教。道家名教者，老子云：處無為之事，行不言之教。此寄教名，而顯無為。釋氏名教者，四教義云：說能詮理，化轉物心，故言教也。化轉有三義：一轉惡為善；二轉迷成解；三轉凡成聖。所言詮理者，藏通二教，詮真諦理，別圓二教，詮中道理。良以如來依理而立言，遂令群生修行而證理。故佛聖教，是出世法，不可妄立世教之名。問：所詮中道，為指何法？答：如輔教云：夫大理者，固常道之至。謂此大理，是本始二覺也。今評本始二覺，雖理智圓融，既名為覺，正從智立，所以經云本覺明妙。又本始二覺，分別言之，屬生滅門。故起信云：是心生滅因緣相，能示摩訶衍自體相用故。所詮之理，屬真如門。故起信云：是心真如相，即示摩訶衍體故。此乃對事揀理。若約即事說理，理性無體，全依無明。無明無體，全依法性。就此相即之義，則指無明為所詮理。由茲教理，是吾宗之綱紀，故寄人乘辨梗槩也。",
    "摩㝹賒": "文句：此云意，昔頂生王初化諸有所作，當善思惟善憶念。即如王教，諸有所作，先思惟憶念，故名為意。又人能息意，能修道，得達分。又人名慢，五道中多慢。毗曇論云：何故人道名摩㝹沙，此有八義：一聰明，二為勝，三意微細，四正覺，五智慧增一，六能別虛實，七聖道正器，八聰明業所生故。",
    "補特伽羅": "或福伽羅，或富特伽羅。此云數取趣。謂諸有情，起惑造業，即為能取。當來五趣，名之為趣。古譯為趣向，中陰有情，趣往前生故。俱舍云：未至應至處。應至處，即六趣也。又論云：死生二有中，五蘊名中有，故謂為趣。涅槃云：中有五陰，非肉眼見，天眼所見。瑜伽論：說八種人執，第六名補特伽羅。謂數數取諸趣故，或死於此，能生於彼。正能生者，即是人執。又翻有情，又翻人。大毗婆沙論：佛言：有二補特伽羅，能住持正法，謂說者、行者。若持教者相續不滅，能令世俗正法久住；若持證者相續不滅，能令勝義正法久住。持正法人有二：一持教法者，謂讀誦解說經律論等；二持正法者，謂能修證無漏聖道。",
    "僕呼繕那": "或薩多婆，或禪（是戰切）豆，或禪兜。此云眾生。摩訶衍云：謂意及意識，一切眾染，合集而生，故名眾生。而別自體，唯依心為體。同性經：佛言：眾生者，眾緣和合，名曰眾生。所謂地、水、火、風、空、識，名色，六入，因緣生。楞伽云：王言：世尊，彼眾生者，以何為本？依何而住？以何為因？佛言：此眾生者，無明為本，依愛而住，以業為因。楞伽云：王言：世尊，業有幾種？佛言：業有三種。何等為三？謂身、口、意業。又，釋論明眾生有三聚：一者正定，必入涅槃；二者邪定，必入惡道；三者不定，能破顛倒者名正定，不能破顛倒者名邪定。得因緣能破，不得則不能破，是名不定。漢書中眾生，去呼，釋氏相承，平呼也。",
    "逋沙": "或富樓沙，正言富盧沙，此云丈夫。大戴禮云：丈者，長也。夫者，扶也。言長制萬物，以道扶接也。孟子曰：富貴不能淫，貧賤不能移，威武不能屈，此之謂大丈夫。又翻士夫。傳云：通古今，辨然否，謂之士。數始於一，終於十。孔子曰：推一合十為士。詩傳云：士，事也。白虎通曰：士者，任事之稱也。周禮：天子有元士、中士、下士。涅槃云：是大乘典，有丈夫相，所謂佛性。若人不知是佛性者，則無男相，皆名女人。",
    "迦羅越": "大品經中居士是也。楞嚴云：愛談名言，清淨自居。普門疏：以多積財貨，居業豐盈，謂之居士。鄭康成云：道藝處士。",
    "婆羅": "此云堅固。北遠云：冬夏不改，故名堅固。西域記云：其樹類斛，而皮青白，葉甚光潤，四樹特高。華嚴音義，翻為高遠。其林森聳，出於餘林也。後分云：娑羅林間，縱廣十二由旬，天人大眾，皆悉遍滿。尖頭針峰，受無邊眾，間無空缺，不相障蔽。大經云：東方雙者，喻常、無常；南方雙者，喻樂、無樂；西方雙者，喻我、無我；北方雙者，喻淨、不淨。四方各雙，故名雙樹，方面皆悉一枯一榮。後分云：東方一雙，在於佛後；西方一雙，在於佛前；南方一雙，在於佛足；北方一雙，在於佛首。入涅槃已，東西二雙，合為一樹；南北二雙，亦合為一。二合皆悉垂覆如來，其樹慘然，皆悉變白。",
    "鄔波弟鑠": "此云父母。楊子云：父母，子之天地與！無天何以生？無地何以形？摭華云：天懸象，地載形；父受氣，母化成。詩曰：哀哀父母，生我劬勞。無父何怙？無母何恃？出則銜恤，入則靡至。父兮生我，母兮鞠我，撫我育我，長我畜我，顧我復我，出入復我。欲報之恩，昊天罔極！梵網經云：孝順父母，師僧三寶。",
    "阿摩": "此翻云女母。",
    "蘇弗窒利": "此云善女。",
    "波帝": "此云夫主。大論云：一切女身，無所繫屬，則受惡名。女人之體，幼則從父母，少則從夫，老則從子。",
    "婆梨耶": "此云婦。說文：婦與己齊者，婦服也。從女持帚，洒掃也。或稱命婦者，夫尊於朝，妻榮於室。",
    "阿那他": "此云非正使人。帝王略論曰：習與正人居，不能無正，猶生長齊地，不能不齊言也。習與不正人居，不能無不正，猶生長楚地，不能不楚言也。易曰：君子以常德行習教事。譙子曰：夫交人之道，猶素之白也。染之以朱則赤，染之以藍則青。大戴禮曰：與君子游，如入芝蘭之室，久而不聞其香，則與之化矣！與不善人居，如入鮑魚之肆，久而不知其臭，與之變矣！",
    "鳩那羅": "此云惡人，亦云不好人。蜀先主臨終，謂太子曰：勿以惡小而為之，勿以善小而不為。孔子云：見善如不及，見惡如探湯。尚書曰：彰善癉（徒丹切）惡，樹之風聲。曾子云：人之好善，福雖未至，去禍遠矣！人之為惡，凶雖未至，去禍近矣！辨魔書云：見善養育，如雨露之被草木；遇惡剿絕，若鷹鸇之逐鳥雀。罵意經云：人所作善惡，有四神知之：一者地神，二者天神，三者旁人，四者自意。涅槃經明十六種惡：一為利，餧食羔羊，肥已轉賣；二為利，買已屠殺；三為利，餧養豬豚，肥已轉賣；四為利，買已屠殺；五為利，餧養牛犢，肥已轉賣；六為利，買已屠殺；七為利，養雞令肥，肥已轉賣；八為利，買已屠殺；九釣魚；十獵師；十一劫奪；十二魁膾；十三網捕飛鳥；十四兩舌；十五獄卒；十六咒龍。",
    "究磨羅浮多": "應法師云：是彼八歲已上，乃至未娶之者總名。",
    "拘摩羅": "西域記云：唐言童子。釋名云：十五曰童，故禮有陽童。牛羊之無角曰童，山無草木曰童，言人未冠者似之云耳。",
    "般吒": "應言般茶迦，此云黃門。",
    "扇搋": "或扇茶，此云生。天然生者，男根不滿。",
    "留拏": "此云犍（居言切），或作㓺，以刀去勢也。",
    "伊梨沙掌拏": "此云妒，因見他婬，方有妒心婬起。",
    "半擇迦": "此云變，今生變作。",
    "博叉": "此云半月能男，半月不能男，此依四分律出。",
    "扇提羅": "此云石女，無男女根故。",
    "槃太子": "此出楞伽。若大乘入楞伽，則云石女兒。",
    "馱索迦": "此云奴。說文云：男入罪曰奴，女入罪曰婢。風俗通云：古制無奴婢。即犯事贓（則郎切）者，被贓罪，沒入官為奴婢。獲者，逃亡獲得為奴婢。",
    "旃陀羅": "此云屠者，正言旃荼（音途）羅。此云嚴熾，謂惡業自嚴。行時搖鈴持竹，為幖（音標）幟（尺志切。通俗文云，徽號曰幖，私記曰幟。謂以絳帛書著背上曰徽，廣雅云旛也）故。若不爾者，王必罪之。法顯傳云：名為惡人，與人別居，入城市則擊竹自異，人則避之。或帶之，人皆怖畏。",
    "樓由": "此翻云愛，力士名也。",
    "譚婆": "此云食狗肉人。",
    "羯恥那": "此云煮狗人。",
    "薩拘盧楴": "此云賣，姓也。",
    "犍坻": "翻續。",
    "那羅": "翻上伎戲。",
    "因陀羅": "此云帝。正翻天主，以帝代之。謚法曰：德象天地稱帝，仁義所生稱王。漢制，天子稱皇帝，其嫡嗣稱皇太子，諸侯王之嫡嗣稱世子。白虎通曰：皇者天之總，美大之稱也。煌煌，人莫違也。不煩一夫，不擾一士，故為皇。太昊伏羲氏、炎帝神農氏、黃帝有熊氏，此號三皇。少昊金天氏、顓頊高陽氏、帝嚳高辛氏、帝堯陶唐氏、帝舜有虞氏，此名五帝。桓子曰：三皇以道治，五帝為德化；三王由仁義，五霸用權智。王肅云：王者雖號稱帝，而不得稱天帝，而曰天子，乃天之子。子之與父，尊卑相去遠矣！金光明經云：以天護故，復稱天子。莊子云：夫帝王之德，以天地為宗，以道德為主，以無為為常。逸士傳曰：帝堯之時，有老人擊壤於路曰：吾日出而作，日入而息，鑿井而飲，耕田而食，帝何力於我哉？",
    "遮閱那": "或云曷囉闍，此云王。薩遮經云：王者民之父母，以法攝護眾生，令安樂故。白虎通曰：王者，往也，天下所歸往。洪範曰：無偏無黨，王道蕩蕩；無黨無偏，王道平平。孔氏傳曰：辯，治也。吳楚之君，僭號稱王，仲尼正名，以周天子為天王。故春秋云：天王狩於河陽。韓詩外傳曰：君者，群也。能群天下萬物，而除其害者，謂之君也。班固曰：其君天下也，炎之如日，威之如神，涵之如海，養之如春。譬猶草木之植山林，鳥魚之毓川澤，參天地而施化，豈云人事之厚薄哉！釋氏以自在名王。妙玄云：轉輪聖王，四域自在。",
    "斫迦羅伐辣底曷羅闍": "或遮迦越羅，此云轉輪王。俱舍云：從此洲人壽無量歲，乃至八萬歲，有轉輪王生。減八萬時，有情富樂，壽量損減，眾惡漸盛，非大人器，故無輪王。由輪旋轉應導，威伏一切，名轉輪王。施設足說有四種：金、銀、銅、鐵輪，應別如其次，第勝上中下，逆次能王領，一二三四洲（云云）。契經從勝，但說金輪。故契經言：若王生在剎帝利種，紹灌頂位，於十五日，受齋戒時，沐浴首身，受勝齋戒。升高臺殿，臣僚輔翼。東方忽有金輪寶現，其輪千輻，具足轂輞，眾相圓淨，如巧匠成，舒妙光明，來應王所，此王定是轉金輪王。轉餘輪王，應知亦爾。四種輪王，威定諸方，亦有差別。謂金輪者，諸小國王，各自來迎，作如是說：我等國土，寬廣豐饒，安隱富樂，多諸人眾，惟願天尊，親垂教，，我等皆是天尊翼從。若銀輪王，自往彼土，威嚴近至，彼方臣伏。若銅輪王，至彼國已，宣威競德，彼方推勝。若鐵輪王，亦至彼國，現威列陣，剋勝便止。一切輪王，皆無傷害，令伏得勝，各安其所，勸化令修十善業道。故輪王死，定得生天。慈恩云：金輪望風順化，銀輪遣使方降，銅輪震威乃服；鐵輪奮戈始定。",
    "摩訶三摩曷羅闍": "此云大平等王，劫初民主。",
    "首圖䭾那": "或名閱頭檀，此云淨飯，或翻真淨，或云白淨。",
    "途盧檀那": "此云斛飯。",
    "薩縛達": "西域記云：唐言一切施，是如來昔修菩薩行時號。避敵棄國潛行，至此摩訶伐那伽藍。唐言大林。遇貧婆羅門方來乞丐，遂令羈縛，擒往敵王，冀以賞財，回為惠施。",
    "尸毗迦": "西域記云：唐言與。舊曰尸毗，略也。",
    "歌利": "或名迦利，或名迦藍浮。此云惡世，又云惡生，又云無道。西域記云：羯利王，唐言鬥諍。舊云歌利，訛也。",
    "頻婆娑羅": "或名瓶沙王，此云摸實，身摸充實。又翻形牢，亦云影堅。影謂形影，皆取體分強壯之義。頻婆，或云頻毗，此翻顏色。娑羅，此云端正，或翻色像殊妙王。",
    "波斯匿": "或名不黎先尼，此云和悅。西域記云：正名缽邏斯那恃多，唐言勝軍。仁王經云：是波斯匿王，已於過去十千劫，龍光王佛法中，為四地菩薩。",
    "優填": "西域記云：訛也。正名鄔陀衍那王，唐言出受。",
    "毗盧釋迦": "西域記云：舊曰毗流離王，訛也。",
    "鞞羅羨那": "秦言勇軍。",
    "阿闍世": "此云未生怨。妙樂云：母懷之日，已有惡心。於瓶沙王，未生已惡，故因為名。或呼婆羅留支，此云無指。妙樂云：初生，相者云凶。王令升樓撲之不死，但損一指，故為名也。內人將護，呼為善見。",
    "阿育": "或阿輸迦，或阿輸柯，此云無憂王。",
    "補剌拏伐摩": "西域記云：唐言滿胄，無憂王末孫。",
    "尸羅阿迭多": "西域記云：唐言戒日。愛育四生，興崇三寶。象馬飲水，漉而後飼。在位五十餘年，野獸狎人。",
    "儴佉王": "亦云霜佉。此翻云貝，乃珂貝耳。",
    "邏闍伐彈那": "西域記云：唐言王增。",
    "摩訶因陀羅": "西域記云：唐言大帝，無憂王弟，寬刑六日，獲果出家。",
    "祇陀": "或云祇洹，此云戰勝。生時，父波斯匿戰勝外國。西域記云：逝多，唐言勝林。舊曰祇陀，訛也。諸經言祇樹者，西域記云：時，給孤獨願建精舍，佛命舍利子，隨瞻揆焉。唯太子逝多園地爽塏（口亥切），尋詣太子，具以情告。太子戲言：金遍乃賣。善施聞之，心豁如也。即出金藏，隨言布地。有少未滿，太子請留曰：佛誠良田，宜植善種。即於空地建立精舍。世尊即告阿難曰：自今已來，應謂此地為逝多樹給孤獨園。",
    "提黎拏太子": "大論：秦言好愛。西域記云：蘇達拏，唐言善牙，亦云善與。",
    "闡釋迦": "西域記云：舊曰車匿，訛也。亦釋種，太子出家，令車匿牽揵陟。揵陟，馬名，正云建他歌，譯云納。經音義云：車匿本是守馬奴名。淨名疏云：其自恃王種，輕諸比丘。僧法事時，輕笑言：如似落葉，旋風所吹，聚在一處，何所評論？佛去世後，猶自不改。佛令作梵壇，謂默擯也。亦云彼梵天治罪法，別立一壇。其犯法者，令入此壇，諸梵不得共語。",
    "摩訶摩耶": "西域記云：唐言大術，或云大幻。晉華嚴：摩耶夫人答善財言：我已成就大願智幻法門。得此法門故，為盧舍那如來母。於閻浮提迦毗羅城，淨飯王宮，從右[脅]生悉達太子，顯現不可思議自在神力。本行經云：爾時太子誕生，適滿七日，其太子母摩耶夫人，遂便命終。因果經云：太子姨母摩訶波闍波提，乳養太子，如母無異。",
    "瞿夷": "此云明女。五夢經云：是舍夷長者女。長者名水光。其婦名餘明。婦居近城。生女之時，日將欲沒，餘明照其家內皆明，因立字云瞿夷，即是太子第一妃也。第二妃生羅云，名耶檀，亦名耶輸，其父名移施長者。第三妃名鹿野，其父名釋長者，太子以三妃故，白淨飯王為立三時殿。大論云：釋迦文菩薩，有二夫人：一名瞿毗耶，二名耶輸陀羅，羅睺羅母也。瞿毗耶是寶女，故不孕子。",
    "韋提希": "此云思惟。觀經云：惟願世尊，教我思惟，教我正受。",
    "摩利": "或云末利。此云鬘，匿王之后。西域記：譯為奈因，施奈得報也。女名勝鬘，為踰闍王妃。",
    "半尸迦": "此云女。十誦云：有好善容，評堪直半尸迦國，為人欲抄斷故，令遣使僧中代受戒。",
    "須達多": "亦云修達多，或婆須達多。西域記云：唐言善施，或名樂施。舊曰須達，訛也。正名蘇達多，勝軍王大臣，仁而聰敏，積而能散，賑乏濟貧，哀孤卹老。時美其德，號給孤獨。孟子曰：老而無妻曰鰥（古顏切），老而無夫曰寡，老而無子曰獨，幼而無父曰孤。此四者，天下之窮民而無告者。今此長者，給濟孤獨之人，名給孤獨。",
    "邠坻": "正云阿那他擯茶陀揭利呵跛底。阿那他，云無依，亦名孤獨。擯茶陀，此云團施。好施孤獨，因以為名。",
    "耆婆": "或云耆域，或名時縛迦。此云能活，又云故活。影堅王之子，善見庶兄，奈女所生。出胎即持針筒藥囊，其母惡之，即以白衣裹之，棄於巷中。時，無畏王，乘車遙見，乃問之。有人答曰：此小兒也。又問死活耶？答云：故活。王即敕人，乳而養之，後還其母。四分律云：耆婆初詣得叉尸羅國，姓阿提梨，字賓迦羅。而學醫道，經於七年。其師即便以一籠器，及掘草之具，令其於得叉尸羅國，面一由旬，求覓諸草。有不是藥者持來，耆婆如教，即於國內面一由旬，周竟求覓。所見草木，盡皆分別，無有草木非是藥者。師言：汝今可去，醫道已成。我若死後，次即有汝。耆婆經云：耆婆童子，於貨柴人所，大柴束中，見有一木，光明徹照，名為藥王。倚病人身，照見身中一切諸病。",
    "瞿史羅": "此云守護心，舊曰瞿師羅，此譯美音。",
    "郁伽": "此云威德。",
    "珊檀那": "此云護彌。",
    "婆羅門": "普門疏云：此云淨行。劫初種族，山野自閑，故人以淨行稱之。肇曰：秦言外意。其種別有經書，世世相承，以道學為業。或在家，或出家，多恃己道術，我慢人也。應法師云：此訛略也。具云婆羅賀磨拏，義云承習梵天法者。其人種類，自云從梵天口生，四姓中勝，獨取梵名，唯五天竺有，餘國即無。諸經中梵志，即同此名。正翻淨裔，稱是梵天苗裔也。",
    "一闡提": "大眾所問品，純陀問佛：一闡提者，其義云何？佛告純陀：若有比丘，及比丘尼、優婆塞、優婆夷，發麤惡言，誹謗正法，造是重業，永不改悔，心無慚愧，如是等人，名為趣向一闡提道。若犯四重，作五逆罪，自知定犯如是重事，而心初無怖畏慚愧，不肯發露，於佛正法，無護惜建立之心，毀訾輕賤，言多過咎，如是等人，亦名趣向一闡提道。若復說言：無佛、法、眾。如是等人，亦名趣向一闡提道。梵行品云：一闡提者，不信因果，無有慚愧；不信業報，不見現在及未來世；不親善友，不隨諸佛所說教誡。如是之人，名一闡提。德王品云：一闡名信，提名不具，信不具故，名一闡提。入楞伽經曰：一闡提有二種：一者焚燒一切善根；二者憐愍一切眾生，作盡一切眾生界願。大慧！云何焚燒一切善根？謂謗菩薩藏，作如是言：彼非隨順脩多羅毗尼解脫說。捨諸善根，是故不得涅槃。大慧！憐愍眾生作盡眾生界願者，是為菩薩。菩薩方便作願：若諸眾生不入涅槃者，我亦不入涅槃。又，梵語闡底迦，此云多貪。阿闡底迦，此云無欲。阿顛底迦，此云極惡。唯識樞要云：一名一闡底迦，是樂欲義，樂生死故。二名阿闡底迦，是不樂欲義，不樂涅槃故。三名阿顛底迦名為畢竟，以畢竟無涅槃性故。他謂一闡底迦，即焚燒一切善根；二阿闡底迦，即菩薩大悲；三阿顛底迦，即無性闡提。故樞要云：瑜伽唯識，說於無性一種闡提。又云：無種性者，現當畢竟，二俱不成（此依相宗）。",
    "娑毗迦羅": "亦云劫毗羅。此云金頭或云黃髮，食米臍外道。應法師云：舊言食米屑也。外道修苦行，合手大指，及第三指，以物縛之。往至人家舂穀簸（補過切）米處，以彼縛指，拾取米屑。聚至掌中，隨得多少，去以為食。若全粒者，即不取之。亦名䳕（音浮）鳩行，外道拾米，如䳕鳩行也。",
    "瞿伽離": "亦名瞿波利，或名俱迦利，此云惡時者。調達弟子，因謗身子目連，梵王與佛訶之不受，身瘡即死，入大地獄。緣出大論十三。",
    "蘇氣怛羅": "此云善星。羅云庶兄，佛之堂弟庶兒，故說為子。佛與迦葉往善星所，善星遙見，生惡邪心，生身陷人，至阿鼻獄。",
    "離車": "翻為皮薄，又云同皮，或云彌戾車。此翻仙族王。又云邊地主，又云傳集國政。其國義讓，五百長者遞為國主，故云傳集國政。出外為邊地主，又云邊夷無所知者。西記云名栗呫（昌栗切）婆子，舊訛云離車。",
    "彌戾車": "興福曰：惡見也。資中曰：應是邊邪不正見，死墮邊地下賤也。長水曰：此樂垢穢人，亦名蔑戾車、彌離車。",
    "演若達多": "此云祠授。證真曰：此人從神祠乞得，故名祠授。",
    "迦毗羅": "梁言青色，亦名劫畢羅，翻黃色。輔行曰：此云黃頭，頭如金色。又云：頭面俱如金色。造僧佉論：具如下出。",
    "跋闍": "此云避。善見律云：毗舍離王及夫人，未登位時，共牧牛兒出門游戲，乃以腳𨄌牧牛人兒。其兒泣向父母說云：此無父母子，腳𨄌我等。父母答云：汝等各自避去。因此戲處，名為跋闍，故翻為避。滅後百年，跋闍比丘擅行十事，舍那迦那白於七百，往毗舍離重結毗尼，舉跋闍過。",
    "薩遮尼乾": "此云離繫，自我餓外道。尼乾，亦翻不繫，拔髮露形，無所貯畜。",
    "先尼": "亦云西伱迦，此翻有軍外道。",
    "富蘭那迦葉": "什曰：迦葉，母姓也。富蘭那，字也。其人起邪見，謂一切法無所有，如虛空，不生滅也。肇曰：其人起邪見，謂一切法斷滅性空，無君臣父子忠孝之道也。事鈔云：色空外道，以外道用色破欲有，以空破色有，謂空至極。",
    "末伽黎拘賒黎": "末伽黎，此云不見道。什曰：末伽黎，字也。拘賒黎，是其母也。肇曰：其人起見，謂眾生苦樂，不因行得，皆自然耳。淨覺謂計自然者，亦是斷滅。自然，然，是也；自，如是也。婆沙云：法應爾，不可改易，不可徵詰，是法爾義。自然與法爾同。",
    "刪闍夜毗羅胝": "刪闍夜，此云正勝。毗羅胝，此云不作。什曰：刪闍夜，字也。毗羅胝，母名也。其人起見，謂要久逕生死。彌歷劫數，然後自盡苦際也。肇曰：其人謂道不須求，經生死劫數，苦盡自得。如轉縷（力主切）圓於高山，縷盡自止，何假求也？疏又云：八萬劫滿，自然得道。",
    "阿耆多翅舍欽婆羅": "什曰：阿耆多翅舍，字也。欽婆羅，麤衣也。其人起計，非因計因，著麤皮衣，及拔髮煙熏鼻等，以諸苦行為道也。肇曰：翅舍欽婆羅，麤弊衣名也。其人著弊衣，自拔髮，五熱炙身。以苦行為道，謂今身併受苦，後身常樂。",
    "迦羅鳩䭾迦旃延": "迦羅鳩䭾，此云牛領。迦旃延，此云翦髮。肇曰：姓迦旃延，字迦羅鳩䭾。其人謂諸法亦有相、亦無相。",
    "尼犍陀若提子等": "尼犍，此翻離繫。肇曰：尼犍陀，其出家總名也，如佛法出家名沙門。若提，母名也。其人謂罪、福、苦、樂，本自有定因，要當必受，非行道所能斷也。輔行引什肇註與涅槃經，以辨同異。後學詳覽。天台四念處云：阿毗曇中明三種念處，謂性、共、緣。對破此三外道，有人釋性念處，謂觀無生淺名，為相深細。觀無生，見細法，皆生死苦諦，名性念處。有人專用慧，數緣無生空理，發真斷結，得慧解脫羅漢。對破邪因緣、無因緣、顛倒執性、一切智外道也。共念處者，以禪定助道，正助合修。亦名事理共觀，發得無漏。三明六通，成俱解脫羅漢。對破根本愛慢，得五神通外道也。緣念處者，緣佛三藏十二部文言，及一切世間名字。所緣處廣，非如支佛出無佛世，不稟聲教，但以神通以悅眾生，不能說法。緣念處人，了達根性，善知四辯，堪集法藏，成無礙大羅漢。對破世間韋陀外道。",
    "颰陀劫簸": "大論：劫簸，秦言分別時節。颰陀，秦言善。有千萬劫過去，空無有佛。是一劫中，有千佛興。淨居諸天歡喜，故名善劫。此一劫內，有四中劫：成、住、壞、空。義如余撰劫波圖。出大論，問曰：菩薩幾時，能種三十二相？答：極遲百劫，極疾九十一劫。此約大劫也。然種相好，須明四義：一、種相處，準大論云：在欲界中，非色無色；於欲界五道，在人道中；於四天下，閻浮提中；於男子身，非女人種。佛出世時種，佛滅不種。緣佛身種，餘不得種。二、種相業，準大論云：用意業種，非身、口、業。何以故？意業利故。問：意業有六識，為是何識？答：是意識，非五識。五識不能分別故。三、種相初，有言足安立相，先種。有言紺青眼相，初種。大論云：雖有是語，不必爾也。若相因緣和合時，便言初種。四、種相福，一切人破正見，一人能教令得淨戒正見。如是等為一福，具足百福，乃成一相。",
    "剎那": "楞伽云：剎那時不住，名為剎那。俱舍云：壯士一彈指頃，六十五剎那。仁王云：一念中，有九十剎那。一剎那，經九百生滅。毗曇翻為一念。日藏云：我今復說剎那之數，一千六百剎那，名一迦羅。六十迦羅，名模呼律多。三十模呼律多，為一日夜。俱舍云：時之極少，名剎那；時之極長，名為劫。通明極少，凡有三種。俱舍頌曰：極微、字、剎那，色、名、時極少。釋曰：分析諸色，至一極微，為色極少。分析諸名及時，至一字一剎那，為名極少、時極少。",
    "怛剎那": "毗曇翻一瞬。僧祇云：二十念為一瞬，二十瞬名一彈指。",
    "摩睺羅": "毗曇翻為須臾。一日一夜，共有三十須臾。僧祇云：二十羅預，名一須臾。頌云：百二十剎那，為怛剎那量。臘縛此六十，此三十須臾，此三十晝夜，三十晝夜月，十二月為年，於中減半夜。",
    "迦羅": "清涼疏：此云豎，析人身一毛以為百分。",
    "三摩耶": "刊正記云：名假時，亦名短時長時。論云：除邪見故，說三摩耶，不言迦羅。復次，有人言一切天地好醜，皆以時為因。論中廣約三世無相，是故時法無實。是故說三摩耶，令其不生邪見。三摩耶說名時，亦是假名時。亦名長時短時者，不同外人定執，蓋是假說長短，而無其實故。若短若長，悉名三摩耶。見陰界入生滅，假名為時。",
    "阿留那": "或阿樓那，或云薩埵，漢言明相。明了論云：東方已赤。通慧指歸云：此方約日未出前二刻為曉，此為明相也。以觀見掌文為限，是四分明。又別宗名地了時，謂見地色分了故。又云：日出映閻浮樹色，名明相。虛空藏經云：是初行菩薩，明星出時，從座而起，向於明星，說如是言：南無阿嘍那！成就大悲。今者初出閻浮提，願以大悲覆護，我以言說，白大悲虛空藏菩薩，於夜夢中，示我方便。以是緣故，得悔所犯根本重罪。",
    "琰魔": "或云琰羅。此翻靜息，以能靜息造惡者不善業故。或翻遮，謂遮令不造惡故。或閻磨羅，經音義應云：夜磨盧迦，此云雙世，鬼官之總司也。亦云閻羅燄魔，聲之轉也。亦云閻魔羅社，此云雙王。兄及妹，皆作地獄主。兄治男事，妹治女事，故曰雙王。或翻苦樂並受，故云雙也。婆沙、顯揚、并正法念，皆言鬼趣所收。瑜伽，地獄趣收。又瑜伽論問：燄摩王，為能損害，為能饒益，名法王？答：由饒益眾生故，若諸眾生執到王所。令憶念故，遂為現彼相似之身。告言：汝等自作，當受其果。由感那落迦，新業更不積集，故業盡已，脫那落迦。是故燄摩，由能饒益諸眾生，故名法王。論云：此贍部洲下，過五百踰繕那，有琰魔王國，縱廣亦爾。",
    "閃多": "此云鬼。立世論云：鬼道名閃多，為閻摩羅王名閃多故。其生與王同類，故名閃多。",
    "闍黎哆": "此云祖父。文句云：眾生最初生彼道名祖父，後生者亦名祖父。妙樂云：亦是後生者之祖父也。",
    "薜荔多": "應法師云：正言閉麗多，此云祖父鬼。或言餓鬼，餓鬼劣者。孔雀經作俾（卑寐切）禮多。",
    "富單那": "此云臭餓鬼，主熱病鬼也，亦名富多羅。",
    "迦吒富單那": "此翻云奇臭餓鬼。",
    "鳩槃茶": "亦云槃查，亦云俱槃茶，此云甕形。舊云冬瓜，此神陰如冬瓜，行置肩上，坐便踞之，即厭魅鬼。梵語烏蘇慢，此云厭。字苑云：厭，眠內不祥也。蒼頡篇云：伏合人心曰厭。論衡曰：臥厭，不寤者也。字本作厭，後人加鬼。",
    "毗舍闍": "亦云毗舍遮，又云畢舍遮，又云毗舍支，又臂舍柘。此云啖精氣，噉人及五穀之精氣。梁言顛鬼。",
    "毗舍佉": "或鼻奢佉。此云別枝，即是氐宿，以生日所值宿為名。",
    "彌栗頭韋陀羅": "此云妙善，主厭禱鬼。",
    "彌栗頭虔伽他": "此云善品，主蠱毒也。左傳云：血蟲為蠱。說文云：腹中蟲也。",
    "遮文茶": "舊云嫉妒女。又曰怒神，即役使鬼也。",
    "烏芻瑟摩": "資中：此云火頭，此力士觀火性得道，故以名也。",
    "頻那夜迦": "舊云頻那，是豬頭；夜迦，是象鼻，此二使者。",
    "惡祁尼": "或名些（蘇計切）吉利多耶尼，此云火神。書云：燥萬物者，莫熯乎火。然蘊木中，古者不知。至燧人氏，鑽木作火，以教天下變生為熟。",
    "婆庾": "此云風神。書云：撓萬物者，莫疾乎風。俱舍云：安立器世間，風輪最居下，則知世界依風而住。此二神名，出孔雀經。",
    "尸利夜神": "此翻吉祥。",
    "諾健那": "此云露形神，即執金剛力士也。",
    "缽健提": "此云堅固。",
    "婆里旱": "梁云力士。又梵云末羅。此云力。言力士者，梵本無文，譯人義立。",
    "摩尼跋陀": "翻威伏行。",
    "富那跋陀": "翻集至成。",
    "金毗羅": "翻威如王。",
    "賓頭盧伽": "翻立不動。",
    "車缽羅婆": "翻忍得脫。",
    "曇摩跋羅": "翻學帝王。",
    "摩竭羅婆": "翻除曲心。",
    "繡利蜜多": "翻有功勳。",
    "勒那翅奢": "翻調和平。",
    "劍摩舍帝": "翻伏眾根。",
    "奢羅蜜帝": "翻獨處快。",
    "薩多琦黎": "翻大力天。",
    "波利羅睺": "翻勇猛進。",
    "睒摩利子": "翻英雄德。",
    "波訶梨子": "翻威武盛。",
    "鳩羅檀提": "翻戰無敵。",
    "醯摩跋陀": "翻應舍主。",
    "地珂": "梁云長，義淨譯本云地㗚伽，此云長大。",
    "脩涅多羅": "梁言善眼，亦云蘇泥怛羅，此云妙目。",
    "分那柯": "梁言滿。",
    "設睹魯": "或名爍睹嚧，此云怨家。",
    "償起羅": "亦云商企羅，此云螺。",
    "訶利": "亦云𠿒里，此云師子。",
    "訶利枳舍": "亦云歇里雞舍，此云師子髮。",
    "波羅赴": "亦云缽唎部，此翻自在。",
    "陀羅那": "梁言持，亦云喇拏，此云能持。",
    "舜若多": "沇（音兗）疏云：未見誠釋，應是主空神。入楞伽云：剎尼迦者，名之為空。或呿（丘庶切）提，秦云虛空。纂要云：但無麤相之身，亦有微妙之色。故云如來光中，映令暫見。又涅槃明虛空喻，乃立三義：一、無變易，亘古騰今，時移俗化，唯此虛空，常無變易。故南本三十三云：虛空無故，非三世攝；佛性常故，非三世攝。善男子！如來已得三菩提所有佛性，一切佛法，常無變易，以是義故，非三世攝。二、無邊際，物分表空裏，空無內外，故無邊際。三十二云：我為眾生得開解故，說言佛性非內非外。何以故？凡夫眾生，或言佛性住五陰中，如器中有果。或言離陰而有，猶如虛空。是故如來說於中道。眾生佛性，非內六入，非外六入，內、外合故，名為中道。三、無罣礙，物體質礙，空性虛通。故三十三云：如世間中，無罣礙處，名為虛空。如來得三菩提已，於一切法無有罣礙，故言佛性猶如虛空。無著云：喻虛空者，有三因緣：一，遍一切處。謂於住不住相中福生生故。二，寬廣。高大殊勝故。三，無盡。究竟不窮故。淨覺云：應以遍喻於假，寬喻於空，無盡喻中。又楞嚴云：縱令虛空，亦有名貌；虛空是名，顯色是貌。孤山釋曰：如涅槃說空有四名，謂虛空、無所有、不動、無礙也。貌，謂體貌。如雜集論說空一顯色，沇疏釋曰：小乘以明暗為體，大乘以空一顯色，及極迥色為體（上見空名顯色，下見空名迥色）。維摩疏問：此虛空譬，豈有但空，不可得空之殊？答：空尚不一，何得有二？若約緣盡相顯，非不有殊。如大乘經論有破虛空之義，即可以譬但空，顯不可得空。記釋緣盡等者，謂雲霧暗緣盡，虛空明相顯時，或見萬象，或但見空，可以喻但、不但二種真也。今問：虛空、空界，二名同異？答：顯宗論云：內外竅隙，名空界；光暗竅隙，顯色差別，名虛空界。經言：虛空無色、無見、無對，當何所依？然藉光明顯了。又說於色，得離染時，斷虛空界。俱舍云：竅隙名空界，謂人身中諸骨節間，腹藏諸孔穴之空也。成實論云：四大圍空，有識在中，故名為人。此以能依身中，空名空界，所依境內，空名虛空。問：虛空無邊，遍一切處。光明安云虛空分界，尚可盡邊？答：如楞嚴云：當知虛空生汝心內，猶如片雲點太清裏，是則眾生計乎妄想，太虛絕於靈照；既迷妄以成空，故背覺而有限。如天親說有分別，及無分別，皆名為識。有分別名識識，無分別名似塵識。如楞嚴，想澄成國土，即似塵識；知覺乃眾生，即是識識。今述頌曰：虛空生我心，我心廣無際；咄哉迷中人，云何自拘繫！",
    "阿羅難陀": "梁言歡喜。",
    "鬱庾伽波羅": "梁言勤守，亦云溫獨伽波羅，此云勇進勤護。",
    "吉蔗": "或名吉遮，正言訖栗著，此云所作。文句云：起尸鬼，若人若夜叉，俱有此鬼。",
    "伅真": "此云神人。",
    "底栗車": "此云畜生。畜（褚六切），即六畜也。禮記註云：牛、馬、羊、犬、豕、雞。輔行云：攝趣不盡，以五道中皆遍有故，又翻畜（許六切）生。婆沙云：畜謂畜養，謂彼橫生，稟性愚癡，不能自立，為他畜養，故名畜生。",
    "帝利耶瞿榆泥伽": "此云旁行，此道眾生，多覆身行。婆沙云：其形旁故，其行亦旁。刊正云：行行不正，受果報旁，負天而行，故云旁行。",
    "宮毗羅": "此云蛟，有鱗曰蛟龍。抱朴子曰：母龍曰蛟，子曰虯。山海經：蛟似蛇而四腳，小頭細頸。",
    "叔叔邏": "此云虯。符瑞圖云：黃帝時有虯龍，黑身無鱗甲，背有名字。",
    "僧伽彼": "或㕽（詞孕切）多，此云師子。大論云：如師子王，清淨種中生，深山大谷中住。方頰大骨，身肉肥滿，頭大眼長，光澤明淨。眉高而廣，牙利白淨，口鼻方大，厚實堅，齒密齊利。吐赤白舌，雙耳高上，髦髮光潤，上身廣大，膚肉堅著。脩脊細腰，其腹不現，長尾利爪，其足安立。以身大力從住處出，優脊嚬申，以口扣地，現大威勢。食不過時，顯晨朝相，表師子王力。又大論：明佛說本事，有師子至。佛言：是師子，鞞婆尸佛時，作婆羅門師，見佛說法，來至佛所。爾時大眾，以聽法故，無共語者。即生惡念，發惡罵言：此諸禿輩，畜生何異？不別好人，不知言語。以是業故，從毗婆尸佛至今九十一劫，常墮畜生中。此人爾時即應得道，以愚癡故，自作生死長久。今於佛所心清淨故，當得解脫。新華嚴云：譬如大師子吼，小師子聞，悉皆勇健，一切禽獸，遠避竄伏。佛師子吼，諸菩薩等若聞，讚歎菩提心聲，長養法身，妄見眾生，慚伏退散。法界次第云：師子奮迅者，借譬以顯法也。如世師子奮迅為二事故：一為奮卻塵土，二能前走卻走，捷疾異於諸獸。此三昧亦爾，一則奮除障定微細無知之惑，二能入出捷疾無間。廣雅：奮，振也。又梵云嘶（先奚切）字，如師子形相也。",
    "鄔波僧訶": "或云優婆。",
    "伽耶": "此云山城，去菩提道場約二十里。西域記云：城甚險固，城西南五六里至伽耶山，谿谷杳冥，峰巒危嶮。印度國俗，稱曰靈山。自昔君王馭宇承統，化洽遠大，德隆前代，莫不登封而告成功。",
    "堙羅那": "此云香葉，帝釋象王名，身長九由旬，高三由旬。",
    "瞿摩帝": "此云牛。易曰：服牛乘馬，引重致遠。註云：稼穡之資。垂裕記暹云：大論曰：放牛難陀問佛：有幾法成熟，能令牛群蕃息？有幾法不成熟，令牛群不增，不得安隱？佛答：牧牛有十一事，頌曰：解色與相應（一、二），摩刷覆瘡痍（三、四），放煙并茂草（五、六），安隱及度處（七、八），時宜留取餘（九、十），將護於大牛（十一）。比丘亦如是，知四大造色（一）；善別愚智相（二）；摩刷六情根（三）；善覆十善相（四）；傳所誦為煙（五）；四意止茂草（六）；十二部安處（七）；八聖道度處（八）；莫受輕賤請，名曰知時宜（九）；知足為留餘（十）；敬護是將護（十一）。此十一事，即小乘附事觀心。譬喻經云：昔二兄弟，志念各異。兄謂弟曰：卿貪家事，以財為貴；吾好經道，以慧為珍。今欲捨家，歸命福田。兄遂出家，夙夜精進，得成道果。弟貪家事，命終墮牛，肥盛甚大，客買運鹽，往還羸頓，不能復前。兄遊虛空，遙見其牛，即以威神，令弟自知。遂為牛主說其本末，賈客聞之，捨牛入寺，兄常將養，死生忉利。",
    "朅伽": "此云犀牛。爾雅云：南方之美者，梁山之犀象。註曰：犀牛皮角象牙骨。又曰犀似豕，註云：形似水牛。",
    "阿濕婆": "此云馬。漢書西域傳云：大宛國有高山，其上有馬，不可得。因取五色母馬，置其下，與集生駒，皆汗血，因號天馬。李伯樂，字孫陽，行至虞之山坂，遇鹽車至，有一龍馬，而人不識，用駕鹽車。遙見伯樂，乃嘶。伯樂以坐下馬易之，日行千里。淮南子云：秦穆公與伯樂曰：子有使求馬者乎？答曰：馬不在形容筋骨相也。天下之馬，若減若沒，臣之子，皆下材。可告天下之馬，有擔纏束薪者，九方堙，其於馬，非臣之下也。求馬三月而反，曰得馬矣。在沙丘，牡（莫后切）而黃，及馬至，則牝（毗忍切）而驪。公謂伯樂曰：子所求馬者，毛色牝牡，不知販矣。伯樂太息曰：一至此乎！堙之所睹者天機也。得其精而忘其麤，見其內而忘其外，果千里馬也。阿含：佛告比丘：有四馬：一、見鞭影即便驚悚，二、觸毛乃驚，三、觸肉始驚，四、徹骨方覺。初合聞他聚落無常即驚，二如聞己聚落無常生厭，三如聞己親無常生厭，四如己身病苦方厭。涅槃四馬，喻生、老、病、死。或名婆訶羅，此云長毛。",
    "蜜利伽羅": "此云鹿。",
    "磨多": "此云母。",
    "跋羅娑䭾": "此云堂。",
    "悉伽羅": "此云野（音夜）干。似狐而小，形色青黃，如狗群行，夜鳴如狼。郭璞云：射（音夜）干能緣木。廣志云：巢於絕巖高木也。大論云：譬如野干，夜半逾城，深入人舍。求肉不得，僻處睡息，不覺夜竟。惶怖無計，慮不自免，住則畏死，便自定心，詐死在地。眾人來見，有一人云：我須其耳。言已截去。野干自念：截耳雖痛，但令身在。次有人言：我須其尾。便復截去。復有人云：須野干牙。野干自念：取者轉多，或取我頭，則無活路。即從地起，奮其智力，絕踊間關，遂得自濟。行者之心，求脫苦難，亦復如是。生不修行，如失其耳；老不修行，如失其尾；病不修行，如失其牙；至死不修，如失其頭。輔行記云：狐是獸，一名野干，多疑善聽。顏師古註漢書曰：狐之為獸，其性多疑。每渡河冰，且聽且渡，故言疑者而稱狐疑。述征記云：北風勁，河冰合，要須狐行。此物善聽，冰下無聲，然後過河。說文云：狐，妖獸也。鬼所乘，有三德。其色中和，小前大後，死則首丘。郭氏玄中記曰：千歲之狐為婬婦，百歲之狐為美女。然法華云：狐、狼、野干，似如三別。祖庭事苑云：野干形小尾大，狐即形大。禪經云：見一野狐，又見野干，故知異也。",
    "摩斯吒": "或麼（上聲）迦吒，或末迦吒，此云獼猴。本行經云：我念往昔海中，有一大虯，其婦懷妊，思獼猴心食。夫言：此事甚難，我居於海，獼猴在山。汝且容忍，我當求之。時虯出岸，見猴在樹，善言慰問，結為交友：我當將汝，度海彼岸。別有大林，花果豐饒，汝可下來，騎我背上。猴依虯言，俱下於水。虯即報言：我婦懷妊，思食汝心，故將汝來。猴即誑言：何不預說，我心適留娑羅樹上，不持將行，善友還回，放我取心，得已卻來。虯即復岸，獼猴努力跳上大樹。其虯久停，告言速下。猴說偈言：汝虯計較雖能寬，而心智慮甚狹劣，汝但審諦自思忖，一切眾類誰無心。六度經，將虯作鱉。",
    "舍舍迦": "此云兔。韓子曰：宋人耕，田中有株，兔走觸株，折頸而死。因釋耕守株，冀復得之，路人笑矣。西域記言：劫初時有狐、兔、猿，異類相悅。時天帝釋，欲驗修菩薩行者，降跡應化為一老夫。謂三獸曰：二三子善安隱乎？無驚懼耶？曰：涉豐草，游茂林，異類同歡，既安且樂。老夫曰：聞二三子情厚意密，忘其老弊，故此遠尋。今正飢乏，何以饋（渠位切）食？曰：幸少留此，我躬馳訪。於是同心虛己，分路營求。狐沿水濱，銜一鮮鯉。猿於林野采異花果，俱來至止，同進老夫。唯兔空還，游躍左右。老夫謂曰：以吾觀之，爾曹未和。狐、猿同志，各能役心，唯兔空還，獨無相饋。以此言之，誠可知也。兔間譏議，謂狐、猿曰：多聚樵蘇，方有所作。猿、狐競馳，銜草曳木；既已蘊崇，猛燄將熾。兔曰：仁者，我身卑劣，所求難遂。敢以微軀，充此一餐。辭畢入火，尋即致死。是時老夫復帝釋身，除燼收骸，傷歎良久。謂狐、猿曰：一何至此，吾感其心，不泯其跡，寄之月輪，傳於後世。",
    "曷利拏": "總言獐鹿等類。",
    "迦陵頻伽": "此云妙聲鳥。大論云：如迦羅頻伽鳥，在㲉（口角切）中未出，發聲微妙，勝於餘鳥。正法念經云：山谷曠野，其中多有迦陵頻伽，出妙音聲。如是美音，若天若人緊那羅等，無能及者，唯除如來音聲。",
    "迦蘭陀": "善見律，及經律異相云：是山鼠之名也。時毗舍離王入山，於樹下眠，有大毒蛇，欲出害王。於此樹下，有鼠下來，鳴令王覺。王感其恩，將一村食，供此山鼠，乃號此村為迦蘭陀。而此村中有一長者，居金錢四十億，王即賜於長者之號，由此村故，所以名為迦蘭陀長者也。三藏傳云：園主名迦蘭，先以此園施諸外道，後見佛又聞深法，恨不以園得施如來。時地神知其意，為現災怪，怖諸外道，逐之令出。告曰：長者欲以園施佛，汝宜速去。外道含怒而出，長者歡喜，建立精舍，躬往請佛。",
    "拘耆羅": "或拘翅羅，此云好聲鳥，聲好而形醜。又云鶿鷗。",
    "嘶那夜": "此云鷹。爾雅云：鷹，隼醜，其飛也翬（音揮）。註曰：鼓翅翬翬然疾。孔氏志怪曰：楚文王少時，雅好田獵，天下快狗名鷹畢聚焉。有人獻鷹曰：非王鷹之儔。俄而雲際有一物凝翔，飄颻鮮白，而不辨其形。鷹見，於是竦翮（下革切）而升，矗（初六切，聳上貌）若飛電。須臾羽墮如雲，血灑如雨。良久間，有一大鳥墮地而死，其鳥兩翅度廣數十里，喙（許穢切）邊有黃。眾莫能知，時博物君子曰：此大鵬雛也，始飛焉，故為鷹所制。文王乃厚賞獻者。又言隼者，易曰：王用射（是亦切）隼于高墉之上。孔穎達云：隼者，貪殘之鳥，鸇鷂之屬。玉篇云：祝鳩也。顏師古云：隼，騺鳥。即今之鵠（胡骨切）也。劉向以為隼近異祥，貪暴類也。",
    "臊陀": "或叔迦婆嘻，此云鸚鵡。說文云：能言鳥也。山海經曰：黃山及數歷山有鳥焉，其狀如鶚（五各切），青羽赤喙，人舌能言，名鸚鵡。曲禮曰：鸚鵡能言，不離飛鳥；猩猩能言，不離禽獸；人而無禮，不亦禽獸之心乎？雜寶藏經云：過去雪山有一鸚鵡，父母都盲，常取華果，先奉父母。時有田主，初種穀時，願與眾生而共噉食。鸚鵡於田常采其穀，田主案行，見𢶕（子踐切）穀穗，便設羅網，捕得鸚鵡。鳥告主言：先有施心，故敢來采，如何今者而見網捕？田主問鳥：取穀與誰？答言：有盲父母，願以奉之。田主報曰：今後常取，勿復疑難（云云）。佛言：爾時鸚鵡，我身是也；時田主者，舍利弗是。",
    "僧娑": "或亘娑，唐云鴈。禮記云：季秋之月，鴻鴈來賓。詩傳云：大者曰鴻，小曰鴈。成公賦曰：上揮翮於丹霞，下濯足於清泉。西域記云：昔此伽藍，習玩小乘漸教，故開三淨之食。而此伽藍遵而不墜，其後三淨，求不時獲。有苾蒭經行，忽見群鴈飛翔，戲曰：今日眾僧食不充，摩訶薩埵，宜知是時。言聲未絕，一鴈退飛，當其僧前，投身自殪（於計切）。苾蒭見已，具白眾僧。聞者悲感，咸相謂曰：如來設法，導誘隨機，我等守愚，遵行漸教。大乘者，正理也。宜改先執，務從聖旨。此鴈垂誡，為誠明導，宜旌厚德，建𡨧睹波，以瘞鴈焉。或名鳧鴈者，爾雅云：鳧，鴈醜，其足蹼（音卜）。註云：腳指間有幕，蹼屬相著。古今註云：鳧鴈常在海邊沙上，餐沙石，此非隨陽鴈也。李巡曰：野曰鳧，家曰騖（音木）。",
    "迦頻闍羅": "此云雉。爾雅云：雉絕有力，奮，最健鬥。類分六種，四方名異。晉武庫閉甚密，中忽聞雉雊，張華曰：必是蛇化，開視側有蛇蛻焉。大論云：有時閻浮提人，不知禮敬宿舊有德。是時菩薩作迦頻闍羅鳥，有二親友，象與獼猴，共居畢缽羅樹下，自相問言：我等不知誰應為大？象言：我昔見樹在我腹下。獼猴言：我曾蹲地手捉樹頭。鳥言：我於畢缽羅林，食此樹果，子隨糞出，此樹得生。先生宿德，禮應供養。即時大象背負獼猴，鳥在猴上，周遍游行。禽獸人類，見皆行敬。斯乃聖人知道德仁義，非禮不成。故敬事長，為天下之至順也。",
    "究究羅": "此是雞聲。鳩鳩吒，此云雞。易林曰：巽為雞，雞鳴節時，家樂無憂。西京雜記云：成帝時，交趾越裳國獻長鳴雞，以刻漏驗之，與晷（音軌）度無差。田饒夫曰：夫雞戴冠，文也；足特距，武也；敵鬥，勇也；得食相呼，義也；鳴不失時，信也。雞有五德，君猶烹而食之，其所由來近也。楞嚴云：如雞後鳴，瞻顧東方，已有精色。長水釋曰：雞第二鳴，天將曉也。孤山釋云：三德涅槃，名曰義天。前受想盡，似證尚遙，如雞先鳴，天色猶昧。今行陰盡，唯識陰在，明悟非久，如雞後鳴，天有精色。齊顏之推云：梁時有人，常以雞卵白和沐，使髮光黑，每沐輒破二三十枚。臨終，但聞髮中啾啾，數千雞雛之聲。",
    "斫迦邏婆": "此云鴛鴦，匹鳥也。止則相耦，飛則相雙。鳥喻品云：一者迦鄰提，二者鴛鴦。游止共俱，不相捨離。今師釋曰：以雄喻常，雌喻無常。生死有性善故，無常即常，如二鳥在下。涅槃有性惡故，常即無常，如二鳥高飛。是則在高在下，雌雄共俱，雙游並息，其義皆成。",
    "耆婆耆婆迦": "此翻生，勝天王云生生。或翻命，法華云命命。雜寶藏經云：雪山有鳥，名為共命。一身二頭，識神各異，同共報命，故曰命命。佛本行經：佛言：往昔雪山有二頭鳥：一頭名迦嘍茶，一頭名憂波迦嘍茶。其憂波迦嘍茶頭一時睡眠，近彼寤頭有摩頭迦樹，風吹華落，至彼寤頭。其頭自念：雖獨食華，若入腹時，俱得色力，不令彼寤。遂默食華。其睡頭寤，覺腹飽滿，欬噦氣出。問言：何處得此美食？寤頭具答，睡頭懷恨。後時游行，遇毒樹華，念食此華，令二頭死。時憂波迦嘍茶頭語迦嘍茶頭言：汝今睡眠，我當寤住。彼頭纔睡，即食毒華。其迦嘍茶，寤覺毒氣，問何惡食，令我不安？憂波頭言：食此毒華，願俱取死。於是彼頭即說偈言：汝於昔日睡眠時，我食妙華甘美味，其華風吹在我邊，汝返生此大瞋恚。凡是癡人莫願見，亦莫願與癡共居；與癡共居無利益，自損及以損他身。佛言：迦嘍茶鳥，即我身是；憂波鳥者，提婆達是。",
    "舍利": "新云室利羅，或設利羅。此云骨身，又云靈骨。即所遺骨分，通名舍利。光明云：此舍利者，是戒定慧之所熏修，甚難可得，最上福田。大論云：碎骨是生身舍利，經卷是法身舍利。法苑明三種舍利：一是骨，其色白也；二是髮舍利，其色黑也；三是肉舍利，其色赤也。菩薩羅漢皆有三種。若佛舍利，槌擊不破。弟子舍利，槌試即碎。感通傳，天人王璠言是大吳蘭臺臣也，會師初達建業。孫主即未許之，令感希有之事，為立非常之法。於時天地神祇，咸加靈被，於三七日，遂感舍利。吳主手執銅瓶，傾銅盤內，舍利所衝，盤即破裂。火燒椎試，俱不能損，遂興佛法。又多聞長子名那吒，嘗以佛牙贈宣律師。太祖皇帝疑非真牙，以火煆之，了然不動，遂成願文。\n\n　　太宗皇帝聖製頌曰：\n\n　　功成積劫印文端，　　不是南山得恐難；　　眼睹數重金色潤，\n　　手擎一片玉光寒；　　鍊時百火精神透，　　藏處千年瑩彩完；\n　　定果熏修真祕密，　　正心莫作等閑看。\n\n　　真宗皇帝聖製偈曰：\n\n　　西方有聖號迦文，　　接物垂慈世所尊，　　常願進修增妙果，\n　　庶期饒益在黎元。\n\n　　仁宗皇帝御製贊曰：\n\n　　三皇掩質皆歸土，　　五帝潛形已化塵；　　夫子域中誇是聖，\n　　老君世上亦言真；　　埋軀祇見空遺冢，　　何處將身示後人？\n　　惟有吾師金骨在，　　曾經百鍊色長新。\n\n　　徽宗皇帝崇寧三年重午日，當迎請釋迦佛牙，入內祈求。舍利感應，隔水晶匣，出如雨點。神力如斯，嘉歎何已，因以偈贊：\n\n　　大士釋迦文，　　虛空等一塵；　　有求皆赴感，　　無剎不分身；\n　　玉瑩千輪在，　　金剛百鍊新；　　我今恭敬禮，　　普願濟群輪。",
    "舍羅": "四分：此云籌。五分：籌極短並五指，極長拳一肘，極麤不過小指，極細不得減箸。十誦云：為檀越問僧不知數，佛令行籌，不知沙彌數，行籌數之。若人施布薩物，沙彌亦得。雖不往布薩羯磨處，由受籌故。四分：為受供行籌，通畔彌也。若未受十戒，亦得受籌，以同受供故。業疏三種行籌：一頭露，二覆藏（以物覆籌），三耳語（耳畔勸勉）。事鈔云：今僧寺中有差僧次請而簡客者，此僧次翻名越次也。即令客僧應得不得，主人犯重，隨同情者多少，通是一盜。",
    "迦布德迦": "或迦逋，唐言鴿。西域記云：昔佛於此為眾說法。羅者於林網捕羽族，經日不獲。來至佛所，揚言唱曰：今日如來在此說法，令我網捕都無所獲。妻孥飢餓，其計安在？如來告曰：汝今熅火，當與汝食。如來是時化作大鴿，投火而死。羅者持歸，妻孥共食。其後重往佛所，如來方便攝化，羅者聞法，悔過自新，捨家修學，便證聖果，因名所建，號鴿伽藍。",
    "摩由邏": "此云孔雀，又孔雀綷羽而翱翔。俱舍云：於一孔雀倫，一切種因相，非餘智境界，唯一切智知。證真釋云：有情無始熏造一切界趣種子，在本識中，唯佛能了，且舉孔雀一類，尚已難知。",
    "阿梨耶": "起信云：以依阿梨耶識故，說有無明，不覺而起（一、業識相），能見（二、轉識相），能現（三、現識相），能取境界，起念相續，故說為意。此明無明為緣生三細，號無明惑；境界為緣生六麤（一、智相，二、相續相，三、執取相，四、計名字相，五、起業相，六、業繫苦相），名見思惑。無明是根本惑，障中道理，當修中觀，破此別惑。見思是枝末惑，障真諦理，當修空觀，破此通惑。通、別之惑如亡，真、中之理自顯。",
    "姞栗陀": "此云鷲，底揭羅闍。此云鵰鷲。山海經曰：景山多鷲。說文：鷲鳥黑色多子。師曠云：南山有鳥，名曰羌鷲，黃頭赤咽，五色皆備。西域多此鳥，蒼黃目赤，食死屍。",
    "毗囉拏羯車婆": "此云龜。爾雅明十種之龜。莊子曰：宋元君夢人被髮曰：予為清江使者河伯，被漁者預且得予。元君使人占之曰：此神龜也，乃召預且。預且釣得白龜五尺，使獻之，乃刳（音枯）之以卜，七十鑽而無遺策。仲尼曰：龜能夢於元君，不能避預且之網；智能七十鑽而無遺策，不能避刳腸之患。如是則智有以神，智有所不及也。法句經云：昔有道人，河邊學道，但念六塵，心無寧息。龜從河出，水狗將噉龜，龜縮頭尾四腳，藏於甲中，不能得便。狗去還出，便得入水。道人因悟：我不及龜，放恣六情，不知死至。",
    "摩竭": "或摩伽羅，此云鯨魚。雄曰鯨，雌曰鯢，大者長十餘里。大論云：五百賈客入海採寶，值摩竭魚王開口，船去甚疾。船師問樓上人，何所見耶？答曰：見三日及大白山，水流奔趣，如入大坑。船師云：三日者，一是實日，二是魚目。白山是魚齒，水奔是入魚口，我曹死矣！時船中人各稱所事，都無所驗。中有優婆塞語眾人言：吾等當共稱佛名字，佛為無上救苦厄者。眾人一心共稱南無佛。是魚先世，曾受三戒，得宿命智，聞佛名字，即自悔責，魚便合口，眾人命存。莊子云：吞舟之魚失水，則螻蟻而能制之。",
    "坻彌": "具云帝彌祗羅。此云大身魚，其類有四，此最小者。京房易傳云：海數（所魚切）見巨魚，邪人進，賢人疏。",
    "失收摩羅": "善見云：鱷魚長二丈餘，有四足，似鼉，齒至利，禽鹿入水，齧腰即斷。又翻殺子魚，廣州有之。（收，或作守）。",
    "臂卑履也": "此云蟻子。晉書：殷仲堪父患耳聰，聞床下蟻動，謂之牛鬥。賢愚經云：長者須達，共舍利弗往圖精舍。須達自手捉繩一頭，舍利弗自捉一頭，共經精舍。時舍利弗欣然含笑，須達問言：尊者何笑？答言：汝始於此經地，六欲天中宮殿已成。即借道眼，悉見六天嚴淨宮殿（云云）。復更徙繩。時，舍利弗慘然憂色，即問尊者：何故憂色？答言：汝今見此地中蟻子耶？對曰已見。舍利弗言：汝於過去毗婆尸佛，亦於此地起立精舍，而此蟻子在此中生。乃至七佛已來，汝皆為佛起立精舍，而此蟻子亦在中生，至今九十一劫，受一種身，不得解脫。生死長遠，唯福為要，不可不種。爾雅云：有足謂之蟲，無足謂之豸（直爾切），二足而羽謂之禽，四足而毛謂之獸。蟲魚鳥獸，種類何窮？山水空陸，境界無際。循環荏（如枕切）苒（音染，展轉也），逐物狂愚。一念如明，萬類俱息，宜照本性，勿起異意也。",
    "那落迦": "此翻惡者。那落，是者義；迦，是惡義。造惡之者，生彼處故。此標正報也。",
    "𭡠落迦": "或那落迦，此云不可樂，亦云苦具，亦云苦器。此標依報也。",
    "泥犁耶": "文句云：地獄此方名。梵稱泥犁，秦言無有，無有喜樂、無氣味、無歡、無利，故云無有。或言卑下，或言墮落，中陰倒懸，諸根皆毀壞故。或言無者，更無赦處。",
    "阿鼻": "此云無間。觀佛三昧經云：阿言無，鼻言救。成論明五無間：一趣果無間，捨身生報故；二受苦無間，中無樂故；三時無間，定一劫故；四命無間，中不絕故；五形無間，如阿鼻相縱廣八萬由旬，一人多人皆遍滿故。五無間業，瑜伽第九云：一害父，二害母，三害羅漢，四破僧，五出佛身血。",
    "頞部陀": "俱舍云疱，寒觸身分，皆悉生皰。",
    "尼剌部陀": "此云疱裂。嚴寒所逼，身疱裂也，此二從相。",
    "頞哳吒嚯嚯婆虎虎婆": "義府云：以寒增甚，口不得開。但得動舌，作哳吒之聲。此三約受苦聲以立名。",
    "嗢缽羅": "此云青蓮華。",
    "缽特摩": "此云紅蓮華。",
    "摩訶缽特摩": "此云大紅蓮華。大論問：諸床可坐，何必蓮華？答：床為世間白衣坐法。又以蓮華軟淨，欲現神力，能坐其上，令不壞故。又以莊嚴妙法座故（云云）。又如此華，華臺嚴淨，香妙可坐。",
    "賓吒羅": "此云集欲。適入尋出，雖復在中，而無痛苦。",
    "阿波那伽低": "經音義：此云惡趣。有三惡趣，亦名三塗。言三塗者，摭華云：塗，道也。論語云：遇諸塗。按四解脫經云：地獄名火塗道，餓鬼名刀塗道，畜生名血塗道。塗有二義：一取殘害義，塗謂塗炭，如尚書曰：民墜塗炭。二取所趣義，塗謂塗道。如易云：同歸而殊塗。然春秋言四岳三途。應法師云：春秋有三塗，危險之處，借此為名。通慧云：有本作途，非也。須作塗泥之塗。後人妄云畜生、餓鬼、地獄名三塗，當知此單指地獄也。然此指歸之說，非但違於吾教四解脫經，刀血火三之文，又復誣其應師音義。後學尋檢，自見妄立。又諸教典明八難者，三惡道為三，四、北洲，五、長壽天，六、佛前佛後，七、世智辯聰，八、諸根不具。今述頌曰：三塗北洲長壽天，諸根不具并世智，佛前佛後共八難。受此果不得聖化，故名難處。或以世智辯聰，名為生邪見家。淨名疏明二種八難：一者凡夫住事八難，二者二乘住理八難。事即界內八難，理乃界外八難。荊溪云：若欲略明，則有餘中三十心人，為三惡道；住無我法，名為北洲；地前法愛，如長壽天；未有初地十種六根，名諸根不具；地前智淺，如世智辯聰；不窮中理，如佛前後。若實報中，位位相望，節節作之，此並障於中道理也。成論明菩薩說四輪，摧八難。一、生中國輪，能摧五難，謂三塗北洲及長壽天；二、修正願輪，摧世智辯聰；三、植善因輪，摧聾盲瘖啞；四、近善人輪，摧佛前佛後。欲摧八難，當習四輪。故今示之，令思修耳。",
    "他那": "秦言處。大品他字門，入諸法處不可得故。論曰：即知諸法無住處。華嚴吒字時，名隨願普見十方諸佛。疏云：即積集性。",
    "須摩題": "大論云：此云妙意，亦好智，亦好意。彌陀經云：阿彌陀佛所居國土，名須摩題。",
    "索訶": "西域記云：索訶世界三千大千國土，為一佛之化攝也。舊曰娑婆，又曰娑訶，皆訛。楞伽翻能忍。悲華云：何名娑婆？是諸眾生，忍受三毒，及諸煩惱，能忍斯惡，故名忍土；如來獨證自誓。三昧經云：沙訶，漢言忍界。真諦三藏云：劫初梵王名忍，梵王是世界主，故名忍土。一云雜會世界。長水云：大千界之都名。感通傳云：娑婆則大千總號。孤山云：舉其通名，非指大千也。",
    "東弗于逮": "西域記云：海中可居者，大略有四焉。東毗提訶洲，舊曰弗婆提，又曰弗于逮，訛也。此云勝，勝南洲故。又云前，一在諸方之前也。又翻為初，謂日初出處也。俱舍云：東毗提訶洲，其相如半月，身長八肘，壽二百五十。",
    "閻浮提": "訛云剡浮，此云勝金。大論云：閻浮，樹名。其林茂盛，此樹於林中最大，提名為洲。此洲上有此樹林，林中有河，底有金沙，名閻浮檀金。以閻浮樹故，名為閻浮洲。此洲有五百小洲圍繞，通名閰浮提。刊正云：此則河因樹立稱，金因河得名。長水云：或云閻浮果汁，點物成金，因流入河，染石為金。其色赤黃，兼帶紫燄。西域記云：南贍部洲，舊曰閻浮提洲，又曰剡（以冉切）浮洲，訛也。藏鈔云：贍部，此土無相當，故不翻。唯西域記音中，翻為穢樹。南贍部洲，北廣南狹，三邊量等，其相如車。俱舍云：贍部洲人身，多長三肘半，人壽無定限。",
    "西瞿耶尼": "此云牛貨，亦翻取與。藏疏云：以彼多牛，以牛為貨。俱舍鈔云：劫初時，因高樹下，有一寶牛，為貨易故。西域記云：西瞿陀尼洲，舊曰瞿那尼，又云劬伽尼，訛。俱舍云：西牛貨洲，壽五百歲，相圓無缺，長十六肘。",
    "北鬱單越": "或鬱怛越，此云勝處，亦云勝生。於四洲中，有情處貨，皆最勝故。亦云高上，出餘三方故。形如方座，四面量等，長三十二肘，壽滿一千歲。故俱舍云：諸處有中夭，除北俱盧洲，以壽定故、以樂極故、以執堅故，聖人不生，八難中一；若論值佛聞法，南洲最上。故大論云：南洲三事，尚勝諸天，況北洲乎！一能斷婬，二識念力，三能精進。所以諸佛唯出南洲。西域記云：北拘盧洲，舊曰鬱丹越，又曰鳩樓，訛也。金輪王乃化被四天下，銀輪王則政隔北拘盧，銅輪王則除北拘盧及西瞿陀尼，鐵輪王則唯贍部洲。夫輪王者，將即大位，隨福所感，有大輪寶浮空來應，感有金銀銅鐵之異。",
    "印度": "西域記云：天竺之稱，異議糾紛，舊云身篤，或曰賢豆。今從正音，宜云印度（云云）。印度者，唐言月，月有多名，斯其一稱（云云）。良以其土聖賢繼軌，導凡御物，如月照臨，由是義故，謂之印度（云云）。五印度之境，周九萬餘里。三垂大海，北背雪山，北廣南狹，形如半月。劃野區分，七十餘國。時特暑熱，地多泉濕。成光子曰：中天竺國，東至震旦，五萬八千里；南至金地國，西至阿拘遮國；北至小香山阿耨達，亦各五萬八千里，則知彼為中國矣。梁傳云：何承天以博物著名？乃問慧嚴曰：佛國將用何厤？云：天竺夏至之日，日正中時，豎晷無影，所謂天中。於五行土德，色尚黃，數尚五，八寸為尺，十兩當此土十二兩。建辰之月為歲首，及討覈分至，推校薄蝕，顧步光景，其法甚詳。宿度章紀，咸有條例，承天無所措難。後婆利國人來，果同嚴說。",
    "婆羅痆斯國": "西域記云：舊曰波羅柰，訛也。中印度境，婆沙云：有河名波羅柰，去其不遠，造立王城。或翻江遶城，亦云鹿苑。",
    "迦毗羅皤𡨧都": "迦毗羅，此云黃色。皤𡨧都，此云所依處。上古有僊曰黃頭，依此修道。西域記云：劫比羅伐𡨧堵，舊曰迦毗羅衛，訛也。或名迦維衛。或名迦夷，此云赤澤。或名婆兜釋翅搜，此云能仁住處，音訛也。竺法蘭對漢明云：迦毗羅衛者，大千之中也。宋沙門慧嚴，與南蠻校尉何承天共論華梵中邊之義，乃引周公測景之法，謂此土夏至之日，猶有餘陰，天竺則無也。言測景者，周公攝政四年，欲求地中而營王城。故以土圭測景，得潁川陽城，於是建都。土圭，長尺有五寸。夏至日晝漏半，立八尺之表，表北得景尺有五寸，景與土圭等，此為地中。鄭司農云：凡日景於地，千里而差一寸。當知陽城，蓋就此土自為中耳。既有表景，豈非餘陰耶？況此土東垂大海，三方且非，由是觀之，邊義彰矣。",
    "舍婆提": "西域記云：室羅筏悉底，舊訛云舍衛。此云聞物，寶物多出此城。亦翻豐德，一具財寶，二妙五欲，三饒多聞，四豐解脫。義淨譯金剛，云名稱大城。摭華云：但得聞義，而缺物義。此乃憍薩羅國都城之號。檇李證真鈔云：為簡南憍薩娑國，故廢國名，而標城號。發軫問：諸經中，說佛生迦毗羅國，何以論云生舍婆提耶？答：迦毗羅與舍婆提相鄰，同是中印土境，故此言之。",
    "摩竭提": "此云善勝，又云無惱。西域記云：摩竭陀，舊曰摩伽陀，又曰摩竭提，皆訛也。中印度境。文句記云：此云不害，劫初已來，無刑害故。至阿闍世，截（五結切）指為刑，後自齧指痛，復息此刑。佛當生其地，故吉兆預彰，所以先置不害之名，亦名無害。文句曰：此云天羅，天羅者王名，以王名國，城名王舍。",
    "羅閱祇伽羅": "西域記名曷羅闍姞（渠乙切）利呬（火利切）。此云王舍城。應法師云：羅閱，義是料理。以王代之，摩伽陀國中城名也。大論云：昔有須陀須摩王，是王精進持戒，常依實語。晨朝乘車，將諸婇女，入園游戲。出城門時，一婆羅門來乞，而語王言：王是大福德人，我身貧窮，當見愍念，賜自少多。王言：敬如來告，當相布施，須我出還。作此語已，入園澡浴嬉戲。時兩翅王，名曰鹿足，空中飛來，於婇女中，捉王將去。諸女啼哭，號慟一園，驚城內外，搔擾悲惶。鹿足負王，騰躍虛空，至所住處，置九十九王中。須陀須摩王言：我不畏死，自恨失信。我從生來初不妄語。今日晨朝出門時，一婆羅門來從我乞，我時許言，還當布施。不慮無常，辜負彼心，自招欺罪。是故啼耳。鹿足王言：汝意欲爾，畏此妄語，聽汝還去。七日布施婆羅門訖，當便來還。若過七日，有我翅力，取汝不難。須陀須摩王得還本國，恣意布施，立太子為王，大會人民，懺謝之，言：我智不周，初治多不如法，當見忠恕。如我今日，身非己有，正爾還去。舉國人民及諸親戚，叩頭留之：願王留意慈蔭此國，勿以鹿足鬼王為慮。當設鐵舍奇兵，鹿足雖神，不畏之也。王言不得，而說偈言：實語第一戒，實語升天梯，實語為大人，妄語入地獄。我今守實語，寧棄身壽命，心無有悔恨。如是思惟已，王即發去，到鹿足所。鹿足遙見，歡喜而言：汝是實語人，不失信要。一切人皆惜身命，汝從死得脫，還來赴信，汝是大人（云云）。鹿足又言：汝好說此，今相放捨，九百九十九王，亦布施汝，隨意各還本國。由此千王共居，故名王舍。",
    "拘尸那": "此云角城。輔行云：其城三角，故云角也。",
    "毗耶離": "亦名維耶離，鞞舍隸，吠舍離。此云廣嚴。西域記云：吠舍釐國，舊訛曰毗舍離。什師云：毗言稻，土之所宜也。離耶言廣嚴，其地平正莊嚴。淨名略疏云：此云廣博嚴淨，其國寬平，名為廣博。城邑華麗，故名嚴淨。有師翻為好稻，出好粳糧，勝於餘國故也。有言好道，國有道砥直（砥，音旨，平直也）。有言好道，其國人民，好樂正道，自敦仁義，不須君主，五百長者共行道法，率土人民莫不歸悅。",
    "矩奢褐羅補羅城": "西域記云：唐言上茅宮城，多出勝上吉祥香茅。摩竭陀國之正中，古先君王之所都。",
    "拘蘇摩捕羅城": "西域記云：唐言香華宮城。穀梁曰：城以保民為之。華嚴寶眼城天，告善財言：應守護心城，離生死故。",
    "羯若鞠闍": "西域記云：唐言曲女城，中印度境。大樹仙人，棲神入定，經數萬歲，從定而起。見王百女，詣宮來請。唯幼稚女，而充給使。仙人懷怒，便惡咒曰：九十九女，一時腰曲。從是之後，名曲女城。",
    "蘇伐剌拏瞿呾羅": "西域記云：唐言金氏，出上黃金，世以女為王，因以女為國。",
    "烏仗那": "奘傳：唐言苑，昔阿輸迦王之苑囿也。舊曰烏場，或曰烏茶，皆訛也。北印度境。",
    "憍賞彌": "西域記云：舊云拘睒彌，訛也。中印度境。",
    "罽賓": "此云賤種。西域記云：迦濕彌羅，舊曰罽賓，訛也。北印度境。末田底迦既得其地，立五百伽藍，於諸異國，買鬻（音育）賤人以充役使，用供眾僧。末田底迦入寂滅後，彼諸賤人自立君長，鄰境諸國，鄙其賤種，莫與交親，謂之訖利多。唐言買得。",
    "劫布俎那": "西域記云：曹國。",
    "赭時": "西域記云：唐言石國。",
    "颯秣建": "西域記云：唐言康國。（秣，音末）。",
    "弭秣賀": "西域記云：唐言米國。",
    "屈霜伱迦": "西域記云：唐言何國。（霜，去聲呼）。",
    "阿踰闍": "此云不可戰國。",
    "喝捍": "西域記云：唐言東安國。",
    "捕哺": "或名捕揭。西域記云：唐言中安國。",
    "戊地": "西域記云：唐言西安國。",
    "羯霜那": "西域記云：唐言史國。",
    "阿耆尼": "西域記云：舊曰烏耆，訛也。",
    "屈支": "西域記云：舊曰龜茲，又音丘慈。",
    "健䭾邏": "西域記云：舊曰乾陀衛，訛也。隋云香行國。",
    "曷部多": "西域記云：唐言奇特。",
    "佉沙": "西域記云：舊謂疏勒者，乃稱其城號，言猶訛也。正音云室利訖栗多底。",
    "至那僕底": "西域記云：唐言漢封。河西蕃維質（音致）子所居，因為國號。",
    "瞿薩怛那": "西域記云：唐言地乳。王未有胤（羊晉切），禱毗沙門像，額上剖出嬰兒，不飲人乳。神前之地，忽然隆起，其狀如乳。神童飲吮，遂至成立。即其俗之雅言也。俗語謂之渙那國，匈奴謂之于遁，諸胡謂之豁且，印度謂之屈丹。舊曰于闐，訛也。",
    "薄佉羅": "應是月支，在雪山西北，或云月氏。",
    "僧伽羅": "西域記：唐言執師子，非印度境，是南海路。其祖擒執師子，父殺應王慕，王畏暴逆，重賞遠放，船漂寶渚，遂立此國。",
    "震旦": "或曰真丹，或云旃丹。琳法師云：東方屬震，是日出之方，故云震旦。華嚴音義翻為漢地，此不善華言。樓炭經云：蔥河以東，名為震旦。以日初出，耀於東隅，故得名也。",
    "脂那": "婆沙二音：一云支那，此云文物國，即讚美此方，是衣冠文物之地也。二云指難，此云邊鄙，即貶挫此方非中國也。西域記云：摩訶至那，此曰大唐。",
    "伊沙那": "清涼疏云：此云長直，謂里巷徑永。表知三際故言長，表知勝義故言直。",
    "蔑戾車": "奘傳：唐言邊地。北印度功境，皆號蔑戾車。",
    "乾闥婆城": "大論云：日初出時，見城門樓櫓宮殿，行人出入，日轉高轉滅，但可眼見，而無有實，名犍闥婆城。靜苑華嚴音義云：西域云樂人為乾闥婆。彼樂人多幻作城郭，須臾如故，因即謂龍蜃所現。輔行云：乾城，俗云蜃氣。蜃，大蛤也。朝起海洲，遠視似有，近看即無。",
    "勢羅": "西域記：唐言山，鄔波世羅，翻為小山。廣雅云：山，產也，能產萬物。高者名岳，小者名丘。",
    "蘇迷盧": "西域記云：唐言妙高。舊曰須彌，又曰須彌樓，皆訛。四寶合成，在大海中，據金輪上，日月之所迴泊，諸天之所游舍。七山七海，環峙環列，四面各有一色。東黃金，南瑠璃，西白銀，北頗梨。隨其方面，水同山色。毗曇俱舍云：妙高，七寶所成，故名妙；出七金山，故名高。觀經疏云：舉高三百三十六萬里，縱廣亦爾。",
    "彌樓": "有人謂，彌樓此云光明，七金山也，金色光明故。若準第一義法勝經云須彌樓山，則彌樓是須彌山舊譯。俱舍：須彌亦云彌樓，是則梵音有異。若據法華云：內外彌樓山，須彌及鐵圍。是則山體亦異。",
    "柘迦羅": "或云灼羯羅，又云斫迦羅。應法師云：此翻云輪山，舊云鐵圍。圍即輪義，譯人義立。",
    "耆闍崛": "大論云：耆闍名鷲，崛名頭。是山頂似鷲。增一：佛告諸比丘：此山久遠，同名靈鷲。觀經疏云：諸聖僊靈依之而住。西域記云：宮城東北行三四里，至姞（渠乙切）栗陀羅矩吒。此云鷲峰，亦云鷲臺。舊云耆闍崛，訛也。既棲鷲鳥，又類高臺。應法師云：案梵本無靈義，此鳥有靈，知人死活，故號靈鷲。婆沙云：其山三峰，如仰雞足，似狼之跡，亦名狼跡，又名普賢山、白墡山、仙人山、負重山。",
    "目真鄰陀": "或云目脂鄰陀，此云石山。",
    "缽羅笈菩提": "淨名疏云：此云安明。垂裕云：入水最深，故名安；出諸山上，故曰明。西域記云：唐言前正覺山，如來將證正覺，先登此山。",
    "屈屈吒播陀": "西域記云：唐言雞足山，亦名窶盧播陀，唐言尊足。峻起三峰，迦葉既入，三峰斂覆。三會說法之後，餘有無量憍慢眾生，慈氏將登此山，彈指峰開，迦葉授衣，火化入滅。",
    "因陀羅執羅窶訶": "西域記云：唐言帝釋窟。西峰南巖間，有大石室，廣而不高，佛常中止。時天帝釋，以四十二疑事，書石請問，佛為演釋，其跡猶在。",
    "䮚迦": "西域記云：僧伽羅國，東南隅有䮚迦山，巖谷幽峻，神鬼游舍，昔佛於此說䮚迦經。舊曰楞伽經，訛也。",
    "補陀落迦": "或名補涅洛迦，此云海島，又云小白花。西域記云：有呾落迦山，南海有石天宮，觀自在菩薩游舍。",
    "優留曼陀": "亦云優留曼茶，此云大醍醐。",
    "軻地羅": "此譯軻，空也；地羅者，破也。名破空山。",
    "比羅娑落": "西域記云：唐言象堅山，神作象形，故曰象堅。",
    "彈多落迦": "西域記云：舊曰檀特山，訛也。",
    "逾健達羅": "此云雙跡。此山之峰，有二隴道，似車跡故。",
    "由乾": "此譯云雙。",
    "陀羅": "此云持，名雙持山。",
    "伊沙䭾羅": "此云持軸，形如車軸故。",
    "朅地洛迦": "此云檐木山，本樹名也。",
    "蘇達梨舍那": "此云善見，見者稱善。",
    "頞溫縛拏": "此云馬耳山，狀如彼故。",
    "毗摩恆迦": "此云有障礙神山。",
    "尼民達羅": "此云地持，山形似海中魚故。",
    "摩黎": "或云摩羅耶。在南天竺，多出旃檀。",
    "尼民陀": "此云持邊。七金外邊，護持圍繞餘六山故。",
    "阿伽": "此云水。釋名云：水，準也，準平物也。稱讚淨土佛攝受經，明八功德水：一、澄淨；二、清冷；三、甘美；四、輕軟；五、潤澤；六、安和；七、飲時除飢渴等一切過患；八、飲已，定能長養諸根四大。淨覺云：清是色入，不臭是香入，輕冷軟是觸入，美是味入，調適是法入。",
    "阿耨達": "西域記云：贍部洲之中地者，阿那婆答多池，唐言無熱惱。舊曰阿耨達，訛也。在香山之南，大雪山北。周八百里，金、銀、銅、鐵、瑠璃、頗胝飾其岸焉。金沙彌漫，清波皎鏡，大地菩薩以願力故，化為龍王，於中潛宅，出清冷水。是以池東面銀牛口，流出殑伽河，繞池一帀，入東南海。池南面金象口，流出信度河，繞池一帀，入西南海。池西面瑠璃馬口，流出縛芻河，繞池一帀，入西北海。池北面頗胝師子口，流出徙多河，繞池一帀，入東北海。或曰潛流地下，出積石山，即徙多河之流，為中國之河源。孝經緩神契曰：河者，水之伯。",
    "信度": "舊云辛頭，此云驗河。",
    "殑伽": "此云天堂來，見從高處來故。又云河神之名，以為河名。西域記：舊曰恆河，又曰恆沙，訛也。章安云：諸經多以恆河沙為量者，有四義故：一、人多識之，二、入者得福，三、八河中大，四、是佛生處。此即四悉檀也。",
    "縛芻": "此云青河。西域記云：舊曰博叉，訛也。",
    "徙多": "此云冷河。西域記云：舊曰私陀，訛也。",
    "阿恃多伐底河": "西域記云：唐言無勝。舊曰阿利羅跋提河，訛也。典言㕧（許梨切）剌（力葛切）拏伐底河，譯曰有金河，是產閻浮金處。梁宗法師云：佛來此河邊，入滅有意，河流奔注，若生死遄速。金砂不動，喻佛性常住。又因地在此捨身，故今至彼入滅。章安云：相傳熙連，祗是跋提。今言不爾，跋提大，熙連小。或言廣四丈，或八丈，在城北，跋提量在城南，相去百里，佛居其間。熙連禪尼，此云不樂著河，度一切諸佛境界經：佛言四流：欲流、有流、見流、無明流。涅槃經說六河：謂生死河、涅槃河、煩惱河、佛性河、善法河、惡法河。",
    "娑竭羅": "或娑伽羅，此云鹹海。書曰：江漢朝宗于海。莊子曰：溟海者，天池也。淮南子曰：海不讓水積，以成其大。孫卿子曰：不積細流，無以成海。老子曰：江海所以能為百谷王者，其善下也。潮有朝夕之期，故吳都有朝夕之池。新華嚴云：譬如大海，以十種相得大海名，不可移奪。一、次第漸深；二、不受死屍；三、餘水入中，皆失本名；四、普同一味；五、無量珍寶；六、無能至底；七、廣大無量；八、大身所居；九、潮不過限；十、普受大雨，無有盈溢。金剛三昧不壞不滅經云：以沃燋山，大海不增；以金剛輪故，大海不減；此金剛輪隨時轉故，令大海水同一鹹味。華嚴云：其娑竭羅龍王宮殿中水，涌出入海，復倍於前。其所出水，紺瑠璃色，涌出有時，是故大海潮不失時。大集云：如閻浮提一切眾生身，及與外色，大海中皆有印象，故名海印。菩薩亦爾，得大海印三昧已，能分別一切眾生心行，於一切法門皆得慧明。華嚴云：海有奇特殊勝法，能為一切平等印，眾生寶物及川流，普能包容無所拒。無盡禪定解脫者，為平等印亦如是，福德智慧諸妙行，一切並修無厭足。",
    "賀邏䭾": "此云池。停水曰池，廣雅曰沼也。",
    "提": "大論翻洲。爾雅：水中可止曰洲。大品云：須菩提！若江河大海，四邊水斷是為洲。須菩提！色亦如是，前後際斷。大論云：世間洲者，如洲四邊無地。色等法亦如是，前後皆不可得，中間亦如。或言洲潬（徒亶切）者，爾雅謂水內沙堆也。渚者，爾雅小洲曰渚。大涅槃云：譬如商人，欲至寶渚，不知道路，有人示之，即至寶渚，乃獲諸珍。大般涅槃，喻之為寶也。",
    "婆那": "正言飯那，此云林，叢木曰林。雜阿含：佛告阿難：汝遙見彼青色叢林否？唯然已見。是處名曰優留曼茶山。如來滅後百歲，有商人子名曰優波掘多，當作佛事，教授師中，最為第一。",
    "菩提樹": "西域記云：即畢缽羅樹也。昔佛在世，高數百尺，屢經殘伐，猶高四五丈。佛坐其下，成等正覺，因而謂之菩提樹焉。莖幹黃白，枝葉青翠，冬夏不凋，光鮮無變。每至涅槃之日，葉皆凋落，頃之復故。法苑云：釋迦道樹，多阿沛多羅。",
    "畢利叉": "亦名畢落叉，此云高顯。佛於下降誕，則為高勝；名顯天人，故曰高顯。本行經云：是時摩耶夫人立地，以手執波羅叉樹枝，即生菩薩。",
    "阿輸迦": "或名阿輸可，大論翻無憂華樹。因果經云：二月八日，夫人往毗藍尼園，見無憂華，舉右手摘，從右[脅]出。後漢法本內傳云：明帝問摩騰法師曰：佛生日月可知否？騰曰：昭王二十四年，甲寅之歲，四月八日，於毗嵐園內，波羅樹下，右[脅]而誕。故普耀云：普放大光，照三千界。即周書異記云：昭王二十四年，甲寅之歲，四月八日，江河泉池，忽然泛漲，井皆溢出。宮殿人舍，山川大地，咸悉震動。其夜即有五色氣，入貫太微，遍於西方，盡作青紅之色。昭王即問太史蘇由，是何祥耶？蘇由曰：有大聖人生於西方，故現此瑞。昭王曰：於天下何如？蘇由曰：即時無他，至千年外，聲教被此。昭王即遣鐫（子泉切）石記之，埋在南郊天祠前。周第六主穆王滿，五十二年，壬申之歲，二月十五日，佛年七十九，方始滅度。故涅槃經云：二月十五日，臨涅槃時，出種種光，大地震動，聲至有頂，光遍三千。即周書異記云：穆王即位五十二年，壬申之歲，二月十五日旦。暴風忽起，發損人舍，傷折樹木，山川大地，皆悉震動。午後天陰雲黑，西方有白虹十二道，南北通貫，連夜不滅。穆王問太史扈（音戶）多曰：是何徵也？扈多對云：西方有大聖人滅度，魂相現耳。魏曇謨最，及唐法琳，北山神清，法上答高麗問，朝代並同。荊溪輔行亦云：當此周昭王甲寅之歲。第二，齊王簡栖述頭陀寺記云：周魯二莊，親昭夜景之鑒。洎隋翻經學士費長房，撰開皇三寶錄，佛以周莊王他十年，即春秋左傳云：魯莊公七年，歲次甲午，四月八日也。生相既顯，故普耀云：普放大光，照三千界。即左傳說，恆星不現夜明也。瑞應經云：沸星下現，侍太子生。故左傳云：星隕如雨。本行經說虛空無雲，自然而雨。左傳又稱與雨偕也。又云：成道即當第十八主，惠王十九年癸亥也。示滅即第二十一主，匡王五年癸丑，二月十五日也，時年八十矣。孤山注四十二章，淨覺造通源記，依此費氏朝代。由淨名疏云：周時佛興，星隕如雨故也。法琳評曰：但據恆星為驗，而云佛生，未悟恆星，別由他事。案文殊師利般涅槃云：佛滅度後二百五十年，文殊至雪山化五百仙人訖，還歸本土，放大光明，遍照世界，入於涅槃。恆星之瑞，即其時也。又長房言：佛以周惠王十九年癸亥成道者，亦有大過。何者？案劉向古舊二錄云：周惠王時已漸佛教，一百五十年後，老子方說五千文。若以惠王之時始成佛者，不應經教已傳洛矣。第三，後周道安法師述二教論云：慧光遐照，莊王因睹夜明；靈液方津，明帝以之神夢。注云：春秋左傳云：魯莊公七年，歲次甲午，四月辛卯夜，恆星不現，星隕如雨，即周之莊王十年也。莊王別傳曰：遂即易筮之云：西域銅色人出也，所以夜明，非中夏之災也。又依什法師年紀，及石柱銘，並與春秋符同。如來，周桓王五年歲次乙丑生；佛，襄王十五年歲在甲申而滅度。法琳評曰：安之為論，據羅什記；羅什記者，承安世高；安世高者，以漢桓帝時在洛陽翻譯，信執筆者，據桓帝時。但羅什秦時始來，世高漢朝先至，二師相去，垂三百年。信彼相承，依而為記，非是安論，造次繆陳，並由當時傳者之過。又法顯傳云：聖出殷世，武乙二十六年甲午時生者。辨正評曰：雖外游諸國，傳未可依。年月時乖，殊俗實為河漢。又像正記定平王時戊午歲，法琳評曰：依像正記，罕見依憑。案通慧鷲嶺聖賢錄，說佛生時，凡有八別：一、夏桀時，二、商末武乙時，三、西周昭王時，四、穆王時，五、東平王時，六、桓王時，七、莊王時，八、趙伯休梁大周元年。於廬山遇弘度律師，得佛滅後，眾聖默記，推當前周二十九主，貞定王亮，二年甲戌。前後所指，時既紛雜，故唐貞觀十三年，敕遣刑部尚書劉德威等，問法琳法師，何故傳述乖紊，無的可依？由是琳師先列其真，後陳其妄。遂定周昭丙寅歲生，周穆壬申，世尊示滅。從此起算，至今紹興十三年，歲次癸亥，總計二千九十四年（此依賾禪師清規集算，若依文律師年譜，少十三年）。西域記云：自佛涅槃，諸部異議。或云已過九百，未滿千年；或云一千二百餘年；或云一千三百餘年；或云一千五百餘年。然既古今緜遠，東西杳邈，不宜確執，是一非諸。故南山律師問天人云：此土常傳佛是殷時、周昭、魯莊等，互說不同，如何定指？答曰：皆有所以。弟子夏桀時生天，具見佛之垂化。且佛有三身。法報二身，則非人見，並化登地已上。唯有化身，普被三千百億天下。故有百億釋迦，隨人所感，前後不定。或在殷末，或在魯莊，俱在大千之中。前後咸傳一化，感見隨機前後，法報常自湛然，不足疑也。辨朝代竟，若論月分，如浴佛經云：一切佛皆四月八日生也。瑞應亦云四月八生，薩婆多云二月八生，費長房云仲春二月八夜生，神清云二月八日大聖誕於迦維。洎乎示滅之辰，涅槃經曰二月十五日臨涅槃時。然此諸文，出有異者，蓋西域以寅月十六為歲首，以寅月十五為歲終。彼分三際之殊，此立四時之別，加復震旦立正，三代有異。夏正建寅，殷正建丑，周正建子。佛之生滅，既準周書，日月之數，當依姬世。三寶紀定四月為二月，故北山云：周之二月，今十二月也。而大聖在乎周年，故得以十一月言正，異今之世也。是月也，天地否閉，龍蛇斯蟄，微陽潛布於下泉，勾萌未達於上土。以茲而生者，應氣運而來；以茲而滅者，應代謝而去。然考二月涅槃，屬十二月，此盡美矣。其定誕生，亦十二月，未盡善也。故二教論云：周以十一月為正，春秋四月，即夏之二月也。依天竺用正與夏同。又僧史略云：江表以今四月八日為佛生日者，依瑞應經也。如周用正，合是今二月八日，今用建巳，乃周之六月也。詳此濫用建巳月者，由聞聲便用，不摭實求時也。又二教論云：杜預用晉厤算，辛卯二月五日，安共董供奉。用魯厤算，即二月七日；用前周厤，即二月八日也。又今北地，尚臈八浴佛，乃屬成道之節。故周書異記云：周穆王二年癸未，二月八日，佛年三十成道，正當今之臈八也。西域記云：菩薩以吠舍佉月後半八日，當此三月八日。上座部，則以吠舍佉月後半十五日，當此三月十五日。聞諸先記曰：佛以生年八十，吠舍佉月後半十五日，入涅槃，當此三月十五日也。說一切有部，則佛以迦剌底迦月後半八日，入涅槃，當此九月八日也。今詳西域，如奘師云：建寅為歲首，二月則當建卯，四月乃屬建巳。況涅槃瑞應，翻傳到此，適當漢魏之後，皆遵夏厤。所以天下相傳，以卯月為涅槃，以巳月為降生者，殊有由也。諸文所載年月日異，故附此集，錄示後世。",
    "尼拘律陀": "又云尼拘盧陀，此云無節，又云縱廣。葉如此方柹葉，其果名多勒，如五升瓶大，食除熱痰。摭華云：義翻楊柳，以樹大子小，似此方楊柳，故以翻之。宋僧傳云：譯之言易也，謂以所有，譯其所無。如拘律陀樹，即東夏楊柳，名雖不同，樹體是一。",
    "多羅": "秦言岸。大品吒字門，入諸法驅不可得故。論曰：若聞多字，即知一切法此彼岸不可得。華嚴唱侘（恥加切）字時，名以無我法開曉眾生。疏云：即相驅迫性。謂無我曉之，即為驅迫。",
    "尸陀": "正云尸多婆那，此翻寒林，其林幽邃而寒也。僧祗云：此林多死屍，人入寒畏也。法顯傳：名尸摩賒那。漢言棄死人墓田。四分：名恐畏林。多論：名安陀林，亦名晝暗林。",
    "曳瑟知林": "西域記：唐言杖林。其林脩勁，被滿山谷。先有婆羅門，聞釋迦佛身長丈六，常懷疑惑，未之信也。乃以丈六竹杖，欲量佛身。恆於丈端，出過丈六，如是增高，莫能窮實，遂投杖而去，因植根焉。",
    "鞞鐸佉": "西域記云：象堅𡨧堵波北山巖下，有一龍泉，是如來受神飯已，及阿羅漢於中漱口嚼楊枝，因即植根，今為茂林，後人於此建立伽藍，名鞞鐸佉。唐言嚼楊枝。毗奈耶云：嚼楊枝有五利：一口不臭，二口不苦，三除風，四除熱，五除痰癊。四分：不嚼楊枝有五過：口氣臭，不善別味，熱癊不消，不引食，眼不明。",
    "彈多抳瑟搋": "彈多，此云齒；搋，此云木。謂齒木也。長者十二指，短者六指，多用竭陀羅木。此方無故，多用楊枝。寄歸傳云：大如小指，一頭緩嚼，淨刷牙關。用罷，擘（博厄切）破，屈而刮舌。五分：嚼已，應淨洗棄，以蟲食死故。",
    "波吒釐": "西域記云：舊云巴連弗邑，訛也。謂女楈（私呂切，又音胥）樹也。",
    "阿梨": "或云：此方無，故不翻。其樹似蘭，枝若落時，必為七分。義淨譯孔雀經：頭破作七分，猶如蘭香蕱。復自解曰：梵云頞杜迦曼折利。頞杜迦，蘭香也。曼折利，蕱頭也。舊云阿梨樹枝。既不善本音，復不識其事，故致久迷。然問西方，元無阿梨樹也。",
    "尸利沙": "或云尸利灑，即此間合昏樹。有二種：名尸利沙者，葉實俱大。名尸利駃者，葉實俱小。又舍離沙，此云合歡。",
    "荃提": "荃，謂荃草，出崑崙山。提，謂可遷徙提挈也。見經音義。",
    "伊蘭": "觀佛三昧海經云：譬如伊蘭，與旃檀生末利山中。牛頭旃檀，生伊蘭叢中，未及長大，在地下時，牙莖枝葉，如閻浮提竹筍。眾人不知，言此山中純是伊蘭，無有旃檀。而伊蘭臭，臭若肨屍，熏四十由旬。其華紅色，甚可愛樂，若有食者，發狂而死。牛頭旃檀，雖生此林，未成就故，不能發香。仲秋月滿，卒從地生，成旃檀樹。眾人皆聞牛頭旃檀上妙之香，永無伊蘭臭惡之氣。",
    "頗羅": "秦言果。大品頗字門，入諸法遍不可得故。論曰：即知一切法，因、果空故。華嚴唱娑（蘇紇切）頗字，名化眾生究竟處。疏云：即遍滿果報。",
    "庵羅": "正云庵沒羅，或庵羅婆利。肇注：此云柰也。柰女經云：維耶梨國，梵志園中，植此柰樹。樹生此女，梵志收養。至年十五，顏色端正，宣聞遠國，七王爭聘。梵志大懼，乃置女高樓，謂七王曰：此非我女，乃樹所生。設與一王，六王必怒。今在樓上，請王平議，應得者取之，非我制也。其夜瓶沙王從伏竇中入，登樓共宿，謂女曰：若生男，當還我。即脫手金鐶之印，付女為信。便出語群臣言，我已得女。瓶沙軍皆稱萬歲，六王罷去。後女生故活，至年八歲，持環印見瓶沙王，王以為太子。至二年，會闍王生，因讓曰：王今嫡子生矣，應襲尊嗣。遂退其位。肇師注云：其果似桃而非桃。略疏云：柰樹，定非柰也。又翻為難分別，其果似桃而非桃，似柰而非柰。此與大經意同。經云：如庵羅果，生熟難分，具有四句，釋難分別：一內外俱生，二外熟內生，三外生內熟，四內外俱熟。纂要云：舊譯為柰，誤也。此果多華，子甚少，其葉似柳，而長一尺，廣三指。果形似梨，而底鉤曲。生熟難知，可以療疾。彼國名為王樹，謂在王城種之。",
    "庵摩勒": "肇曰：形似檳榔，食之除風冷。時手執此果，故即以為喻。西域記云：庵沒羅果，而有兩種，小者生青熟黃，大者始終青色。",
    "阿摩勒": "樹葉似棗，華白而小，果如胡桃，味酸甜，可入藥。",
    "訶梨勒": "新云訶梨怛雞，此云天主持來。此果為藥，功用至多，無所不入。",
    "頻婆": "此云相思果，色丹且潤。",
    "阿摩落迦": "西域記云：印度藥果之名也。",
    "播囉師": "此云胡桃。",
    "鎮頭迦": "此云柿。",
    "篤迦": "此云栗。",
    "居𠻱迦": "此云李。（𠻱音陵）。",
    "曷樹迦": "此云鬱勃。",
    "惡叉聚": "資中曰：此云綖貫珠。無始無明，熏習成種，種必有果，子子相生，熏習不斷。真際云：惡叉，樹名。其子似沒石子，生必三顆同蔕，喻惑、業、苦三，同時具足。言惑、業、苦者，惑乃煩惱道，業即業道，苦謂苦道。而此三道，通於三土。故輔行云：分段三道，謂見思惑為煩惱道；煩惱潤業為業道；感界內生為苦道。方便三道，謂塵沙惑為煩惱道；以無漏業名為業道；變易生死名為苦道。實報三道，謂無明惑為煩惱道；非漏非無漏業為業道；彼土變易名為苦道。",
    "摩那陀": "此云醉果。",
    "布瑟波": "此云華。",
    "弗把提": "此云天華。",
    "須曼那": "或云須末那，又云蘇摩那，此云善攝意，又云稱意華。其色黃白而極香，樹不至大，高三四尺，下垂如蓋。須曼女，生於須曼華中。",
    "那羅陀": "那羅，正云捺羅，此云人也。陀，謂陀羅，此云持也。其華香妙，人皆佩之，故名人持華也。",
    "末利": "亦名摩利，此云柰，又云鬘華，堪作鬘故。善見律云：廣州有，其華藤生。此翻黃色華，華如黃金色。",
    "巨磨": "此方翻為牛糞中生華。",
    "闍提": "此云金錢華。",
    "波羅羅": "此云重生華。",
    "婆利師迦": "亦云婆師迦，又云婆使迦，此云夏生華。又翻雨華，雨時方生，故曰雨華。",
    "那婆": "此云雜華。",
    "優曇缽羅": "此云瑞應。般泥洹經云：閻浮提內有尊樹王，名優曇缽，有實無華。優曇缽樹有金華者，世乃有佛。施設論云：繞贍部洲有輪王路，廣一踰繕那。無輪王時，海水所覆，無能見者。若轉輪王出現於世，大海水減一踰繕那，此輪王路，爾乃出現，金沙彌布，眾寶莊嚴，旃檀香水以灑其上。轉輪聖王巡幸洲渚，與四種兵俱游此路，此華方生。新云烏曇缽羅。",
    "分陀利": "此云白蓮華。叡師云：未敷名屈摩羅；將落名迦摩羅；處中盛時，名分陀利。體逐時遷，名隨色變，故有三名。",
    "優缽羅": "或漚缽羅，或嗢缽羅。此云青蓮華。優缽羅盤那女，生青蓮華中。",
    "拘勿投": "亦云拘勿頭，此云地喜華；亦云拘某陀，此云黃蓮華。",
    "曼殊沙": "此云柔軟，又云赤華。",
    "何羅歌": "或阿迦，此云白華。",
    "阿提目多伽": "舊云善思夷華，此云苣蕂（苣，勤似切。蕂，音勝）。子，胡麻也。又云此方無故不翻。或翻龍舐華，其草形如大麻，赤華青葉，子堪為油，亦堪為香。宗鏡引攝論云：苣蕂本來是炭，多時埋在地中，變為苣蕂。西方若欲作塗身香油，先以華香，取苣蕂子，聚為一處，淹令極爛。後取苣蕂壓油，油遂香也。",
    "婆訶迦羅": "大論云：赤華樹。",
    "阿樓那": "或阿盧那，此云紅赤色香華。如日出前紅赤相，梵呼彼相為阿樓那。",
    "育坻": "此云相應華。",
    "波羅奢華": "章安云：此是樹名。其葉青色；華有三色：日未出時，則黑色；日正照時，華赤色；日沒時，華黃色。今取赤色如血義耳。經音義云：此華樹汁，其色甚赤，用染皮㲲，名曰紫礦。",
    "俱蘭吒": "此云色，質礙曰色。",
    "乾陀羅耶": "正言健達，此云香。張華博物志云：有西國使獻香者，漢制不滿斤，不得受。使乃私去，著香如大豆許在宮門上，香聞長安四面十里，經月乃歇。華嚴云：善法天中，有香名淨莊嚴，若燒一圓而以熏之，普使諸天心念於佛。",
    "多阿摩羅跋陀羅": "多，此云性；阿摩羅，此云無垢；跋陀羅，此云賢。或云藿葉香，或云赤銅葉。",
    "牛頭旃檀": "或云此方無故不翻。或云義翻與藥，能除病故。慈恩傳云：樹類白楊，其質涼冷，蛇多附之。華嚴云：摩羅耶山，出旃檀香，名曰牛頭。若以塗身，設入火坑，火不能燒。正法念經云：此洲有山，名曰高山，高山之峰，多有牛頭旃檀。若諸天與脩羅戰時，為刀所傷，以牛頭旃檀塗之即愈。以此山峰，狀如牛頭，於此峰中生旃檀樹，故名牛頭。大論云：除摩梨山，無出旃檀。白檀治熱病，赤檀去風腫。摩梨山，此云離垢，在南天竺國。",
    "瞻蔔": "或詹波，正云瞻博迦，大論翻黃華。樹形高大。新云苫末羅，此云金色。西域近海岸樹，金翅鳥來，即居其上。",
    "多伽羅": "或云多伽留，此云根香。大論云：多伽樓，木香樹也。",
    "波利質多羅": "此云圓生。大經云：三十三天有波利質多羅樹，其根入地深五由旬，高百由旬，枝葉四布五十由旬。其華開敷，香氣周遍五十由旬。又翻間錯莊嚴，眾雜色華，周帀莊嚴。法華文句指此為天樹王也。",
    "拘鞞陀羅": "此翻云大游戲，地樹香也。",
    "阿伽樓": "大論云：蜜香樹。",
    "兜樓婆": "出鬼神國，此方無故不翻。或翻香草，舊云白茅香也。",
    "迦箄": "此云藿（呼郭切）香。",
    "畢力迦": "或云即丁香。",
    "咄嚕瑟劍": "此云蘇合。珙鈔引續漢書云：出大秦國，合諸香煎其汁，謂之蘇合。廣志亦云出大秦國。或云：蘇合國，國人采之，笮其汁以為香膏，乃賣其滓。或云：合諸香草，煎為蘇合，非一物也。",
    "杜嚕": "此云熏陸。南洲異物志云：狀如桃膠。西域記云：南印度阿吒釐國，熏陸香樹，葉似棠梨。亦出胡椒樹，樹葉若蜀椒也。南方草物狀曰：出大秦國，樹生沙中，盛夏樹膠流沙上。",
    "突婆": "此云茅香。",
    "嗢尸羅": "此云茅香根。",
    "先陀婆": "此云石鹽，其香似之，因以為名。華嚴云：兜率天中，有香名先陀婆。於一生所繫菩薩座前，燒其一圓，興大香雲，遍覆法界。涅槃云：鹽水器馬，一名四實，智臣善知。謂洗時奉水；食時奉鹽；飲時奉器；游時奉馬。皆但云先陀婆來。章安云：此之四義，亦與四教四門四句意同，皆應次第對鹽等四。",
    "羯布羅": "此云龍腦香。羯，或作劫。三藏傳云：私身異葉，華果亦殊。初采，木濕未有香，乾則順理析之，中有香，狀如雲母，白如冰雪也。",
    "莫訶婆伽": "此云麝。",
    "多揭羅": "此云零陵。南越志云：土人謂之鷰草芸香。說文云：芸香似苜（莫六切）蓿。淮南云：芸可以死而復生。",
    "呵伽嚧": "或云惡揭嚕，此云沈香。華嚴云：阿那婆達多池邊，出沈水香，名蓮華藏。其香一圓，如麻子大。若以燒之，香氣普熏閻浮提界。異物誌云：出日南國。欲取，當先斫樹壞，著地積久，外朽爛。其心堅者，置水則沈，曰沈香。其次在心白之間，不甚精堅者，置之水中，不沈不浮，與水平者，名曰𣝕香。",
    "拙具羅": "或窶具羅，或求求羅，此云安息。",
    "茶矩磨": "此云鬱金。周禮春官鬱人采取以鬯（音悵）酒。說文云：鬱金草之華，遠方所貢方物。鬱人合而釀之，以降神也，宗廟用之。",
    "雞舌": "五馬洲出，南洲異物志曰：是草萎可合香箋。外國胡人說：眾香共是一木，華為雞舌香。",
    "薩闍羅婆": "或薩折羅婆，此翻白膠香。",
    "蘇伐羅": "或云修跋拏，此云金。大論云：金出山石沙赤銅中。許慎云：金有五色，黃金為長，久埋不變，百陶不輕。真諦釋金四義：一、色無變，二、體無染，三、轉作無礙，四、令人富。以譬法身常淨我樂四德耳。",
    "跋折羅": "亦云斫迦羅，大論云越闍，新云縛左羅。西域記云：伐羅闍，此云金剛。起居注云：晉武帝十三年，燉煌有人獻金剛寶。生於金中，色如紫石英，狀如蕎麥，百鍊不消，可以切玉如泥。什師云：如有方寸金剛，數十里內石壁之表，所有形色，悉於是現。大經云：如金剛寶，置之日中，色則不定。金剛三昧亦復如是，若在大眾，色則不定。大論云：金剛寶者，帝釋所執，與脩羅戰，碎落閻浮。薩遮尼乾經云：帝釋金剛寶，能滅阿脩羅，智碎煩惱山，能壞亦如是。無常經云：金剛智杵碎邪山，永斷無始相纏縛。",
    "爍迦羅": "乃堅固義，此同金剛。",
    "阿路巴": "或惹多，此云銀。大論云：銀出燒石中。爾雅云：白金謂之銀，其美者謂之鐐。",
    "瑠璃": "或作琉，此云青色寶，亦翻不遠。謂西域有山，去波羅奈城不遠，山出此寶，因以名焉。應法師云：或加吠字，或加毗字，或言毗頭梨，從山為名，乃遠山寶也。遠山，即須彌山也。此寶青色，一切寶皆不可壞，亦非煙燄所能鎔鑄，唯鬼神有通力者能破壞。又言金翅鳥卵殼，鬼神得之，出賣與人。或名紺琉璃。釋名云：紺，含也，青而含赤色也。古字但作流離，左太沖吳都賦云：致流離與珂𭸿（皆寶名）。後人方加其玉。",
    "珊瑚": "梵語缽攞娑福羅。外國傳曰：大秦西南漲海中，可七八百里，到珊瑚洲。洲底盤石，珊瑚生其上，人以鐵網取之。任昉述異記曰：珊瑚樹碧色，生海底。一株數十枝，枝間無葉，大者高五六尺，小者尺餘。應法師云：初一年青色，次年黃色，三年蟲食敗也。大論云：珊瑚出海中石樹。",
    "阿隰摩揭婆": "此云虎珀，其色紅瑩。博物誌云：松脂入地千年，化為茯苓；茯苓千年，化為虎珀。廣誌云：生地中，其上及傍，不生草木。深者八九尺，大如斛，削去上皮，中是琥珀。",
    "牟婆洛揭拉婆": "或云牟呼婆羯落婆，此云青白色寶，今名車渠。尚書大傳云：大具如車之渠，渠謂車輞，其狀類之，故名車渠。渠，魁也。後人字加玉石。",
    "摩羅伽隸": "此云碼瑙，此寶色如馬之腦，因以為名。赤白色，琢成器，有文如纏絲焉。梵名謨薩羅揭婆。謨薩羅，此云杵；揭婆，此云藏。或言胎者，取馬腦堅實為名也。",
    "頗梨": "或云塞頗胝迦，此云水玉，即蒼玉；或云水精，又云白珠。刊正記云：正名𡨧坡致迦，其狀似此方水精，然有赤有白。大論云：譬如過千歲冰，化為頗梨。",
    "釋迦毗楞伽": "此云能勝。",
    "摩尼": "或云踰摩。應法師云：正云末尼，即珠之總名也。此云離垢，此寶光淨，不為垢穢所染。或加梵字，顯其淨也。又翻增長，有此寶處，增長威德。大品云：如摩尼寶，若在水中，隨作一色。以青物裹，水色即青；若黃赤白紅縹（敷沼切）物裹，隨作黃赤白紅縹色。又大品，阿難問憍尸迦：是摩尼寶，為是天上寶？為是閻浮提寶？釋提桓因言：是天上寶。閻浮提人亦有是寶，但功德相，少不具足。大論云：有人言此寶珠，從龍王腦中出。人得此珠，毒不能害，入火不燒。輔行曰：亦云如意。似如唐梵，不同大論。華嚴云：如意摩尼，似如並列二名。若法華云：摩尼珠等，似如體別。大莊嚴論：有摩尼珠，大如膝蓋。大論云：如意珠，狀如芥粟。又云：如意珠，出自佛舍利。若法沒盡時，諸舍利皆變為如意珠。觀經指如意為摩尼。天台云：摩尼者，如意也。",
    "摩羅伽陀": "大論云：此珠金翅鳥口邊出，綠色，能辟一切毒。",
    "因陀尼羅": "大論：此云天赤珠。",
    "缽摩羅伽": "大論：此云赤光珠。佛地論云：赤蟲所出，或珠體名為赤珠。智論云：真珠出魚腹中、蛇腦中。漢書云：蛛蚌中陰精，隨月陰盈虛。",
    "甄叔迦": "此云赤色寶。西域傳：有甄叔迦樹，其華色赤，形大如手。此寶色似此華，因名之。慈恩上生經疏云：甄叔迦，狀如延珪，似赤瑠璃。",
    "摩訶尼羅": "大論云：此翻大青珠。",
    "金銀生像": "沙彌十戒第十，不捉金銀生像。南山云：胡漢二彰，謂胡言生像。此翻金銀也。善見云：生色似色。似，即像也，謂金則生是黃色，銀則可染似金，故云生像。指歸云：況于闐語，與五印語不同。若四分到于闐，自經一番翻了，經本到唐，則為重也。",
    "吉由羅": "或枳由邏，此云瓔珞。",
    "彌呵羅": "此云金帶。",
    "曷剌怛那揭婆": "此云寶臺，亦云寶藏。",
    "洛叉": "或落沙，此云十萬。",
    "俱胝": "或拘致，此云百億。",
    "那由他": "或云阿庾多，或云術那，或那術，此云萬億。",
    "阿僧祗": "或阿僧企耶，此云無央數。楚詞云：時猶未央。王逸曰：央，盡也。大論云：僧祗，秦言數；阿，秦言無。問：幾時名阿僧祗？答：天人中能知算數者，極數不能知，是名一阿僧祗。如一一名二，二二名四，三三名九，十十名百，十百名千，十千名萬，十萬名億，千萬億名那由他，千萬那由他名頻婆，千萬頻婆名迦他，過迦他名阿僧祗。菩薩地持經云：一者，日月晝夜歲數無量，名阿僧祗；二者，大劫無量，名阿僧祗。",
    "歌羅分": "經音義云：如以一毛析為百分，一分名歌羅分。論以義翻，名為力勝，以無漏善法，勝有漏也。",
    "褒羅那地邪": "此云舊第二。",
    "佉盧": "十佉盧為一佉梨。",
    "佉梨": "此云斛。律歷志云：量者，龠（音藥）、合（音閤）、升、斗，斛也，所以量多少也。本起於黃鐘之龠，用度數審其容，以子穀秬（音巨）忝中者，千有二百實其龠；以井水準其槩（孟康曰：槩欲其直，故以水平之。井水清，清則平也），合龠為合，十合為升，十升為斗，十斗為斛，而五量嘉矣。量多少者，不失圭撮（應邵云：圭，自然之形，陰陽之始也。四圭曰撮，三指撮之也）。",
    "婆訶": "此云篅（音垂），盛穀圓𥫱也，篅受二十斛。俱舍云：頞部陀壽量，如一婆訶麻，百年除一盡，此言一篅二十斛麻。百年之間，除去一升，除盡麻時，頞部壽滿也。",
    "迦利沙缽拏": "八十枚貝珠，為一缽拏。十六缽拏，為迦利沙缽拏。",
    "踰繕那": "此云限量，又云合應（計應合爾許度量）。業疏云：此無正翻。乃是輪王巡狩一停之舍，猶如此方館驛。西域記云：夫數量之稱踰繕那者，舊曰由旬，又曰踰闍那，又曰由延，皆訛略也。踰繕那者，自古聖王一日軍行，舊傳一踰繕那四十里，印度國俗乃三十里，聖教所載唯十六里。大論云：由旬三別，大者八十里，中者六十里，下者四十里。謂中邊山川不同，致行里不等。窮微之數，分一踰繕那為八拘盧舍，分一拘盧舍為五百弓，分一弓為四肘，分一肘為二十四指，分一指節為七宿麥，乃至虱蟣隙塵，牛毛羊毛兔毫同水。次第七分以至細塵，細塵七分為極細塵，極細塵者不可復析，析即歸空，故曰極微也。俱舍頌曰：極微微至水，兔羊毛隙塵，蟣虱麥指節，後後增七倍。二十四指肘，四肘為弓量，五百俱盧舍，此八踰繕那。",
    "一箭道": "嘉祥云二里，或云取射垛一百五十步，或云百三十步，或云百二十步。漢書律歷志曰：度長短者，不失毫釐（孟康曰：毫，兔毫也，十毫曰釐）。又曰：度者，分、寸、丈、尺、引也，所以度長短也。本起黃鐘之長，以子穀秬黍中者（師古曰：子穀，猶言穀子耳。秬即黑黍。先取北方為號，一黍之廣，度之九十分。中者不大不小，言黑黍穀子大小中者，率為分寸）。黃鐘之長，一為一分，十分為寸，十寸為尺，十尺為丈，十丈為引，而五度審矣。",
    "一磔手": "通俗文云：張申曰：磔（陟格切）周尺，人一尺，佛二尺。唐於周一寸上增二分，一尺上增二寸，蓋周尺八寸也。賈逵曰：八寸曰咫（音紙）。言膚寸者，四指曰膚，兩指曰寸；言一指者，佛指闊二寸。",
    "一肘": "人一尺八寸，佛三尺六寸。言一圍者，莊子音云：徑尺曰圍。言一仞者，說文云：仞謂申臂一尋也。史記并鄭玄，皆云七尺者仞。小雅：四尺謂之仞，倍謂之尋，尋舒兩肱。或曰：五尺曰尋，倍尋曰常。",
    "拘盧舍": "此云五百弓，亦云一牛吼地，謂大牛鳴聲所極聞。或云一鼓聲。俱舍云二里，雜寶藏云五里。",
    "槃陀": "此云二十八肘，華嚴大數增至百二十五。見阿僧祗品。",
    "佉啁羅": "此云小長床。",
    "蔡": "指歸云：那爛陀僧。吉祥月云：西域立表量影。影，梵云蔡。此云影，朝蔡倒西去，便以腳足前後步之，數足步影也。新毗柰耶云：佛言：應作商矩法。取細籌長二尺許，折一頭四指，豎至日中，度影長短，是謂商矩。一說商矩二尺，屈折頭轉，如人腳影，故人濫用。",
    "毗嵐": "亦云隨藍，此云迅猛風。大論云：八方風不能動須彌山，隨嵐風至，碎如腐草。佛地論：明八風，得可意事名利，失可意事名衰；不現誹撥名毀，不現讚美名譽；現前讚美名稱，現前誹撥名譏；逼惱身心名苦，適悅身心名樂。淨名疏云：行堅固慈者，則心如金剛，成真慈心，不為界內外八風之所毀損。荊溪云：外無八相，祗是違順真中不同，故與內別。",
    "差羅波尼": "或纖羅半尼，此云灰水。",
    "朱利草": "大論云：秦言賊。",
    "阿伽陀": "此云普去，能去眾病，又翻圓藥。華嚴云：阿伽陀藥，眾生見者，眾病悉除。律鈔云：報命支持，勿過於藥。藥名乃通，要分為四：一、時藥者，從旦至中，聖教聽服，事順法應，不生罪累；二、非時藥者，諸雜漿等，對病而設，時外開服，限分無違；三、七日藥者，約能就法，盡其分齊，從以日限，用療深益；四、盡形藥者，勢力既微，故聽久服，方能除患。形有三種：一、盡藥形，二、盡病形，三、盡報形。",
    "薩裒煞地": "西域記云：唐言蛇藥。佛昔為帝釋，時遭飢歲，疾疫流行，醫療無功，道殣（渠吝切。左傳：路死也）以相屬。帝釋悲慜，思所救濟，乃變其形為大蟒身，殭屍川谷（死不朽也），空中遍告。聞者感慶，相率奔赴，隨割隨生，療飢療疾。",
    "優檀那": "妙玄云：此云印，亦翻宗印，是揩定不可改易。釋名云：印，信也。所以對物為驗也。說文云：執政所持信。",
    "婆利": "或盎句奢，翻曲鉤。",
    "亟縛屣": "或名革屣，此云靴。佛昔於阿軬（部本切）茶國，聽著亟縛屣（所綺切）。說文：皮作曰履，麻作曰屨（音句）。",
    "富羅": "正言腹羅，譯云短靿（於教切）靴。",
    "舍樓伽": "此云藕根是也。",
    "佉勒迦": "此云著穀麥篅。",
    "勿伽": "此云胡豆，即綠豆也。",
    "塞畢力迦": "此云苜蓿。漢書云：罽賓國多苜蓿。",
    "興渠": "訛也。應法師：此云少，正云興宜。出烏茶娑他那國，彼人常所食也。此方相傳為芸臺者，非也。此是樹汁，似桃膠，西國取之，以置食中，今阿魏是也。慈愍三藏云：根如蘿蔔，出土辛臭，慈愍冬到彼土，不見其苗。蒼頡篇：葷，辛菜也。凡物辛臭者，皆曰葷。",
    "葷辛": "葷而非辛，阿魏是也；辛而非葷，薑芥是也；是葷復是辛，五辛是也。梵網經云：不得食五辛，言五辛者：一䓤、二薤（下戒切）、三[韭]（音九）、四蒜、五興渠。準楞嚴經：食有五失：一生過，二天遠，三鬼近，四福消，五魔集。一生過者，經云：是五種辛，熟食發婬，生啖增恚。二天遠者，經云：食辛之人，縱能宣說十二部經，十方天仙，嫌其臭穢，咸皆遠離。三鬼近者，經云：諸餓鬼等，因彼食次，舐（甚爾切）其唇吻，常與鬼住。四福消者，經云：福德日消，長無利益。五魔集者，經云：是食辛人，修三摩地，菩薩天仙十方善神，不來守護。大力魔王得其方便，現作佛身來為說法，非毀禁戒，讚婬怒癡，命終自為魔王眷屬，受魔福盡，墮無間獄。又楞伽經，大慧問曰：彼諸菩薩等，志求佛道者，酒肉及與䓤，飲食為云何？惟願無上尊，哀愍為演說。佛告大慧：有無量因緣，不應食肉，然我今當為汝略說。謂一切眾生從本已來，展轉因緣常為六親，以親想故，不應食肉。驢騾駱駝、狐狗牛馬、人獸等肉，屠者雜賣故，不應食肉。不淨氣分所生長故，不應食肉。眾生聞氣，怒生恐怖，如旃陀羅及譚婆等，狗見憎惡，驚怖群吠故，不應食肉。又令修行者慈心不生故，不應食肉。凡愚所嗜，臭穢不淨，無善名稱故，不應食肉。令諸咒術不成就故，不應食肉。以殺生者見形起識，深味著故，不應食肉。彼食肉者，諸天所棄故，不應食肉。令口氣臭故，不應食肉。多惡夢故，不應食肉。空閑林中虎狼聞香故，不應食肉。又令飲食無節量故，不應食肉。令修行者不生厭離故，不應食肉。我常說言，凡所飲食，作食子肉想，作服藥想故，不應食肉。聽食肉者，無有是處。復次大慧：過去有王，名師子蘇陀婆，食種種肉，遂至食人。臣民不堪，即便謀反，斷其俸祿。以食肉者有如是過故，不應食肉。一切肉與䓤，及諸[韭]蒜等，種種放逸酒，修行常遠離。善見論云：食大蒜，咽咽得提餘，細薤䓤不犯。西域記云：菜則有薑芥苽瓠（胡護二音），葷陀菜等，䓤蒜雖少，噉食亦希。家有食者，驅令出郭，佛設漸化。通食三種淨肉，所謂一不見殺，二不聞殺，三不疑殺。或言五淨，加自死肉，及鳥殘肉。楞伽梵網，並皆斷制。",
    "印": "大論云：佛法印三種：一者，一切有為法，念念生滅皆無常；二者，一切法無我；三者，寂滅涅槃。行者知三界皆是有為生滅作法，先有今無；今有後無；念念生滅，相續相似生故，可得見知。如流水燈燄長風，相似相續故，人以為一。眾生於無常法中，常顛倒故，謂去者常住，是名一切作法無常印。一切法無我，諸法內無主，無作者，無知無見，無生者，無造業者。一切法皆屬因緣，屬因緣故不自在，不自在故無我，我相不可得故，如破我品中說，是名無我印（云云）。寂滅者，是涅槃，三毒三衰火滅故，名為寂滅印。問曰：寂滅印中，何以但一法，不多說？答曰：初印中說五眾，二印中說一切法皆無我，第三印中說二印果，是名寂滅印。一切作法無常，則破我所外五欲等。若說無我，破內我法，我、我所破故，是寂滅涅槃。論又問曰：摩訶衍中說，諸法不生不滅，一相所謂無相。此中云何說一切有為作法無常，名為法印？二法云何不相違？答曰：觀無常即是觀空因緣，如觀色念念無常，即知為空。過去色滅壞不可見，故無色相；未來色不生，無作無用，不可見，故無色相；現在色亦無住，不可見，不可分別知，故無色相。無色相即是空，空即是無生無滅。無生無滅及生滅，其實是一，說有廣略。問曰：過去、未來色不可見，故無色相；現在色住時可見，云何言無色相？答曰：現在色亦無住時。如四念處中說，若法後見壞相，當知初生時壞相，以隨逐微細故不識。如人著屐，若初日新而無故，後應常新，不應有故。若無故，應是常，常故無罪無福。無罪無福故，則道俗法亂。復次生滅相，常隨作法，無有住時。若有住時，則無生滅。以是故，現在色無有住。",
    "伊尼延": "或伊泥延，此云金色，正言黳（烏奚切）尼延。大論明三十二相，第八名伊泥延鹿膊（乳兗切）相，隨次𦟛（丑凶切。均也，直也，齊等也）纖（思廉切。微也，細也）。",
    "蘇樓波": "此云妙色。經云：妙色湛然常安住，不為生老病死遷。",
    "尼羅": "此云青色，東方甲乙，歲星屬木。",
    "阿盧那": "此云赤色，南方丙丁，熒惑屬火。",
    "盧醯咀迦": "西域記云：唐言赤色。",
    "迦沙野": "此云赤色，梵音呼異，今具錄之。",
    "叔離": "此云白色，西方庚辛，太白屬金。",
    "訖里瑟拏": "此云黑色，北方壬癸，辰星屬水。",
    "迦茶": "或迦羅，此云黑色。",
    "揵陀羅": "或劫賓那，此云黃色，中央戊己，鎮星屬土。",
    "羅差": "或名勒叉，此云紫色。",
    "冰伽羅": "梁言蒼色。凡夫沈迷，為物所轉，聽不出聲，見不超色，今列經綸，令透聲色。如智論問：心心數法無形故，可言無邊。色是有形可見，云何無邊？答：無處不有，色不可得。壽量遠近輕重，如佛說四大無處不有，故名為大。不可以五情得其限，不可以㪷秤量其多少輕重，是故言色無邊。復次，是色過去時，初始不可得，未來世中，無有恆河沙劫數限當盡，是故無後邊。初後邊無，故中亦無，無復邊名色相，是色分別破散，邊不可得，無有本相。又摩訶衍寶嚴經云：譬如畫師，作鬼神像，即自恐懼。如是迦葉，諸凡夫人，自造色、聲、香、味、細滑之法，輪轉生死，亦復如是。又智論云：大歡喜菩薩作是念：眾生易度耳！所以者何？眾生所著，皆是虛誑無實故。譬如人有一子，喜不淨中戲，聚土為穀，以草木為鳥獸，而生愛著，人有奪者，瞋恚啼哭。其父知已，此子今雖愛著，此事易離耳，長大自休。何以故？此物非真故。菩薩亦如是，觀眾愛著不淨臭穢，身及五欲，是無常種種苦因，如是眾生，得信等五根成就時，即能捨離。若小兒所著，實是真物，雖復年至百歲，著之轉深，亦不能離。以諸法皆空，虛誑不實故，得無漏清淨智慧眼時，即能遠離所著，大自慚愧。譬如狂病，所作非法，醒悟之後，羞慚無顏。傾望後賢，觀色如幻，於內外境，無取著焉。",
    "脩多羅": "此云契經，有通有別。通則脩多羅聖教之都名；別則妙玄云：直說法相者，是別脩多羅，如說四諦等也。所言別者，雜集論云：謂長行綴葺略，說所應說義。",
    "毗柰耶": "或毗尼。什師云：毗尼，秦言善治。謂自治婬怒癡，亦能治眾生惡也。圓覺鈔云：此云調伏，謂調練三業，制伏過非。調練通於止作，制伏唯明止惡。就所詮之行，彰名調伏之藏。四教義云：此翻滅，謂佛說作無作戒，能滅身口之惡，是故云滅。圓覺略鈔云：滅有三義：一滅業非（論第一云：滅惡故名曰毗尼），二滅煩惱（律云：世尊謂調伏貪瞋癡令盡故，制增上戒學），三得滅果（戒經云：戒淨有智慧，便得第一道）。南山云：毗尼翻滅，從功能為名，非正譯也。正翻為律，律者，法也。從教為名，斷割重輕，開遮持犯，非法不定。俗有九流，法流居一，故世律法，皆約刑科。道與俗違，刑名乃異，至於處斷，必依常法。谷響云：以此方法律之名，翻彼土柰耶之語。律者，詮也。詮量輕重犯不犯等。風俗通曰：皋陶謨虞造律。律，訓詮、訓法。尚書大傳曰：丕天之大律。注云：奉天之大法。法，亦律也。此方律名，起於舜世，漢蕭何以為九章，漸分輕重委悉也。西域記云：毗柰耶藏，舊訛云毗那耶。",
    "阿毗曇": "或云阿毗達磨，此云無比法，謂無漏法慧為最勝故。四教義曰：無比法，聖人智慧，分別法義也。新云阿毗達摩，此云對法。對有二種：一者，對向，謂向涅槃，以乘無漏聖道之因，感趣涅槃圓極之果。二者，對觀，對觀四諦，謂以淨慧之心，觀察四諦之法，故名對也。法有二種：一者，勝義法，謂擇滅涅槃（云云）。二，法相法，即通四聖諦（云云）。問：若據此義，合云對法藏。今隱對法之名，但云慧論者如何？答：此乃隨方之聲也。梵語奢薩怛羅，此云論。梵語摩怛理迦，此云本母。本母能生妙慧，妙慧因論而生，故展轉翻為論也。瑜伽論云：問答決擇諸法性相，故名論。奘師傳云：舊曰優波提舍，訛也。正云鄔波弟鑠。後分經云摩達磨。",
    "俱舍": "或云比吒，或云摘迦，此翻為藏。即包含攝持之義。非藏無以積錢財，非藏無以蘊文義。故攝論云：何名為藏？答：由能攝故，謂攝一切所應知義，無令分散，故名為藏。四教義云：今言三名，各含一切文理，故名藏也。阿含即定藏，毗尼即戒藏，阿毗曇即慧藏。今問：經云貪著小乘三藏學者，且三藏之名，既通大小二教，何故法華判局小乘？答曰：三藏屬小，凡有二義：一者，小乘三藏，皆佛所說。如出曜經云：佛在波羅柰仙人鹿野苑中，告五比丘：此苦原本，本所未聞，本所未見。廣說此法，為契經藏。佛在羅閱城，時迦蘭陀子，名須陳那，出家學道，最初犯律，故說戒藏。佛在毗舍離，見跋耆子本末因緣，告諸比丘，諸無五畏恚恨之心者，便不墮惡趣，亦復不生入地獄中，廣說如阿毗曇。是知小乘俱是佛說，斯異大乘論藏，自屬菩薩之所造也。二者，小乘三藏，部帙各別，大乘經律二藏混同，是故法華判其三藏屬小乘也。又大論處處以摩訶衍，斥三藏法非大菩薩，先德妄破天台立教，此由失究經論所以。問：法華既云三藏學者，大論安云佛在世時無三藏名？答：佛滅度後，阿難結集脩多羅藏，優波離結集毗柰耶藏，迦葉結集阿毗曇藏。是則法華梵本，恐無此名，多是譯師加三藏名，顯小乘教。如今經自餘諸品，皆是結集者所置也。問：今列三藏，依何詮次？答：四教義云：說時非行時，教起之次，阿含為先；修行之初，木叉為首。故出曜經說教次第，先經次律而後論也。四教儀以論居中者，以經是所解，論是能釋，故先經而次論。然觀諸文，前後非一，亦各隨人，不可確執。苟以義局，徒自矛盾。或標四藏者，大論：四名雜藏。或言五藏者，西域記云：四名雜集藏，五名禁咒藏。以上座部唯結三藏，若大眾部別為五藏。又經音義列八藏：一、胎化藏，二、中陰藏，三、摩訶衍方等藏，四、戒律藏，五、十住菩薩藏，六、雜藏，七、金剛藏，八、佛藏。",
    "祗夜": "此云重頌。妙玄云：重頌上直說脩多羅也。亦曰應頌，頌長行也。",
    "和伽那": "此云授記。達磨鬱多羅云：聖言說與，名授；果為心期，名記。妙玄云：說九道劫數，當得作佛。首楞嚴經明四種記：一、未發心記，或有流轉六道，往於人間，好樂佛法；過百千萬億劫，當發心；過百千萬億阿僧祗劫，行菩薩道，供佛化人；皆若干劫，當得菩提（淨名疏云：雖未發心，而與記也。如佛祗洹林邊，為鴿雀授記。又云：約四教位者，雖是具縛凡夫，及二乘方便，若有四教大乘機，雖未發心而記）。二、適發心與記，是人久種善根，好樂大法，有慈悲心，住不退地，故發心與記（淨名疏云：現前即內凡，適發心與記）。三、密為記，有菩薩未得記，而行六度功德滿足。天龍八部皆作是念：此菩薩幾時當得菩提？劫國弟子眾數如何？佛斷此疑，即與授記。舉眾皆知，此菩薩獨不知（淨名疏問：何故密記？答：有菩薩心行未熟，若聞授記，心則放逸，不得現前受記。又云：密記即三教外凡位）。四、無生現前記，於大眾中，現前得無生，顯露與記（淨名疏云：無生，取三教見真位）。",
    "伽陀": "秦言底。大品伽字門，入諸法去者不可得故。論曰：即知一切法底不可得故。華嚴唱伽（上聲輕呼）字時，名普安立。疏云：即一切法行取性。",
    "優陀那": "天台禪門曰：此云丹田，去臍下二寸半。大論云：如人語時，口中風出，名優陀那。此風出已，還入至臍。偈云：風名優陀那，觸臍而上去。是風觸七處，頂及齗（音銀，齒根肉也）齒唇，舌喉及以胸，是中語言生。論云：出入息是身加行，受想是心加行，尋伺是語加行。大集經云：有風能上，有風能下。心若念上，風隨心牽起，心若念下，風隨心牽下。運轉所作，皆是風隨心轉。作一切事，若風道不通，手腳不遂，心雖有念，即舉動無從。譬如人牽關捩（音麗，撥也），即影技種種所作。捩繩若斷，手無所牽，當知皆是依風之所作也。",
    "尼陀那": "此云因緣。什曰：力彊為因，力弱為緣。肇曰：前緣相生，因也；現相助成，緣也。生曰：因謂先無其事，而從彼生也；緣謂素有其分，而從彼起也。故因親而緣疏，緣覺根利，通觀三世有因有緣，是名因緣。初觀過去，無明緣行。言無明者，不了法界，邪見妄執，常在闇冥，故曰無明。因煩惱惑，起於三業，造作諸法，故名為行。由茲惑業，感現五果，識緣名色，六入觸受，所謂從行生心。投入母腹，流愛為種，納想在胎，分別諸法，此名曰識。識但有名，凝滑屬色，四七漸堅，故號名色。六根開張，名為六入。從出母胎，至三四歲，對緣取塵，未別苦樂，名之為觸。從五六歲，至十二三，受覺苦樂中庸三境，既能了別，故名為受。復從果報，起愛取有三支惑業，成現在因。從十四五，至十八九，貪種種境，如渴求飲，故名為愛。十九已後，年既長大，貪欲轉盛，不藉身命，能有所取，故名為取。愛取體同，勝劣有異，馳求諸境，起善惡業，牽生三有，故名為有。由此因故，感於未來二種果報，謂生老死。後陰始起，故名為生；住世衰變，故名為老；最後敗壞，故名為死。是十二法，展轉能感果故，名因。互相由藉而有，曰緣。因緣相續，則往還無際；若了無明，生死自息，是為緣覺出世之要術也。",
    "阿波陀那": "此云譬喻。文句云：譬者，比況也；喻者，曉訓也。至理玄微，抱迷不悟，妙法深奧，執情奚解。要假近以喻遠，故借彼而況此。涅槃經說：喻有八種：一順喻，二逆喻，三現喻，四非喻，五先喻，六後喻，七先後喻，八遍喻。順喻者，天降大雨，溝瀆皆滿，溝瀆滿故，小坑滿等。如來法雨亦復如是。眾生戒滿，戒滿足故，不悔心滿等。逆喻者，大海有本，所謂大河；大河有本，所謂小河等。以喻涅槃有本，謂解脫等。現喻者，眾生心性，猶如獼猴。非喻者，如來曾對波斯匿王說：有四山從四方來，欲害於人。王若聞者，當設何計？王即答云：唯當專心持戒布施。四山即是生老病死，常來切人，故云非喻。先喻者，譬如有人貪著妙華，欲取之時，為水所漂。眾生亦然，貪著五欲，為生老病死之所漂沒。後喻者，莫輕小惡，以為無殃。水渧雖微，漸盈大器。先後喻者，譬如芭蕉，生果則死。愚人得養亦如是，如騾懷妊，命不久全。遍喻者，三十三天，有波利質多樹。其根深入有五由旬，枝葉四布，葉熟則黃。諸天見已，心生歡喜。其葉既落，復生歡喜。枝變色已，又生歡喜等。我諸弟子亦如是。葉色黃者，喻我弟子念欲出家。其葉落者，喻我弟子剃除鬚髮等。經中具說，以此樹等，遍喻佛弟子等，故云遍喻。又第五卷明分喻云：面貌端正，如盛滿月。白象鮮潔，猶如雪山。滿月不可即同於面，雪山不可即是白象。不可以喻，喻真解脫。為眾生故，故作是喻（雪山比象，安責尾牙；滿月況面，豈有眉目）。",
    "伊帝目多伽": "此云本事。妙玄云：此說他事。如佛將淨飯五百人歸國，說三因緣之偈也。",
    "闍陀伽": "此云本生。此說菩薩行，因本曾為事也。顯揚論云：本事者，謂如來說聖弟子前世等事。本生，謂如來說菩薩本所修行相應等事。",
    "毗佛略": "此云方廣。妙玄云：此從所表為名，方廣之理。正理為方，包富名廣。",
    "阿浮達摩": "此云未曾有。妙玄云：佛現種種神力，眾生怪未曾有。",
    "優婆提舍": "此云逐分別所說，義翻論義。妙玄云：答其問者，釋其所以。西域記云：鄔波弟爍，舊訛云優波提舍。今問：如法華云：我此九部法，隨順眾生說，入大乘為本。何故小教唯九部耶？答：此以大教而形小宗，則奪小乘，義唯九部。故妙玄云：小乘灰斷，無如意珠身，故無方廣。小乘根鈍，說必假緣，非天鼓任鳴，少無問自說。雖有授記，記作佛少；別論雖無，通說亦有。故妙玄云：小有託前六道因果。阿含亦授彌勒佛記，亦有自唱善哉，無問自說。聲聞經以法空為大空，斯乃小乘亦通十二。復次，若以小教而顯大乘，則彰大乘，義亦唯九。以無因緣、譬喻、論義三部。故妙玄云：有人云大乘根利，不假此三，斯亦別論。通語大乘，何得無此三經？然此十二分經，舊名十二部者，妙玄云：部別各有類從也，新譯恐濫部帙，改名為分。二教論云：窮理盡性之格言，出世入真之軌轍。論其文，則部分十二；語其旨，則四種悉檀。理妙域中，固非名號所及；化擅繫表，又非情智所尋。至於遣累亡筌，陶神盡照，近超生死，遠證涅槃，播闡五乘，接群機之深淺，該明六道，辨善惡之升沈。敻（付正切）期出世而法無不周，邇比王化而事無不盡。能博能要，不質不文，自非天下之至慮，孰能與於斯教哉！",
    "阿含": "正云阿笈多，此云教。妙樂云：此云無比法，即言教也。唯識論云：謂諸如來所說之教。長阿含序云：阿含者，秦言法歸，所謂萬法之淵府，總持之林苑也。法華論解其智慧門，為說阿含義甚深。涉法師云：阿含，此云傳所說義。是則大小二教，通號阿含。而小乘中別開四部：謂增一阿含，明人天因果；又二、長阿含，破邪見；三、中阿含，明諸深義；四、雜阿含，明諸禪法。以四阿含為轉法輪設教之首，別得其名。嵩輔教編，由昧通別，猶預不決，其詞則枝。",
    "首楞嚴": "大論：秦言健相。分別知諸三昧行相多少深淺，如大將知諸兵力多少也。菩薩得是三昧，諸煩惱魔及魔人，無能壞故。譬如轉輪聖王主兵寶將，所住至處，無能壞伏，故名健相三昧也。大經云：首楞者，一切事竟；嚴，名堅固。一切畢竟而得堅固，名首楞嚴。是故首楞嚴定，名為佛性。慈恩翻為金剛藏。此諸菩薩證此定故，以是為名。",
    "楞伽": "正言䮚（力鄧切）迦。佛住南海濱，入楞伽國摩羅耶山，而說此經。梵語楞伽，此云不可往，唯神通人方能到也。阿跋多羅，此云入，謂入此山中，而說此寶。或翻無上，謂此經法是無上寶。",
    "薩達磨芬陀利": "此云妙法蓮華。天台云：妙名不可思議；法謂十界十如權實之法；蓮華者，喻權實之法也。慈恩云：藻宏綱之極唱，旌一部之都名。法含軌持，綰群祥以稱妙；華兼秀發，總眾美而彰蓮。",
    "般舟": "此云佛立，亦名十方現在佛悉在前立定經。經云：持佛威神，於三昧中立者，有三事：持佛威神力、持佛三昧力、持本功德力。用是三事，故得見佛。",
    "摩訶袒持": "止觀翻大祕要。遮惡持善，祕要祗是實相。輔行云：顯非偏小，故名為大。一切法即一法，故名祕；一法攝一切法，故名要。",
    "盂蘭盆": "盂蘭，西域之語，轉此翻倒懸。盆是此方貯食之器。三藏云：盆羅百味，式貢三尊。仰大眾之恩光，救倒懸之窘急。義當救倒懸器（如孟子云：當今之時，萬乘之國，行仁政，民之悅之，如解倒懸。）。應法師云：盂蘭言訛，正云烏藍婆拏，此云救倒懸。",
    "修跋拏婆頗婆鬱多摩": "修跋拏，此言金；婆頗婆，此言光；鬱多摩，此言明。天台言法性之法，可尊可貴，名法性為金。此法性寂而常照，名為光。此法性大悲，能多利益，名為明。此三字題，玄義別釋，乃立五科。文雖明著，人自固迷，或言從法而立號，或曰單譬以為題，或文義以兩存，欲利鈍而䨥（所江切）濟。宮商各奏，丹素競舒，既惑異端，孰能一貫。余因臨講，遂輒議之。觀此題之旨也，依文正意，唯在於法；就名旁通，乃該於喻。所謂佛入禪那，妙契原寂，遂唱真號，以赴利機。欲令安住於其中，故從當體而立稱。是以依文唯在於法，雖義推譬喻，無有一文。而名通世象，似與喻同，無妨鈍根而作譬解。是故就名旁通於喻，雖利鈍兼攝，法喻咸通，佛元意故，文之旨故，七種立題，當單法也。問：搜玄錄據玄義云：若利根人，即法作譬。既云作譬，豈是單法？此之一難，詎可通乎？答曰：根鈍者，以金光明為物象之號；根利者，以金光明是法性之名。此則即用顯體，金寶是真如，乃知全性成相；真如為金寶，故云即法作譬。既解即法作譬，則了全事是理，所以利人不假譬喻。故妙玄曰：利根即名解理，不假譬喻。但作法華而解，茲意幽深，逐語奚曉。問：邇來匠者，解此經題，分文義之二途，定法喻之兩向。人既僉允，獨何不從？答：文是能顯，義是所詮。能詮之文，必召所詮之義；所詮之義，必應能詮之文。今若抗分，則成水火，余不用者，由過在斯。問：先達立隨機之義，以伸此題，待人問云法耶喻耶？乃應之曰：為問利根？為問鈍根？若問利根，即是單法；若問鈍根，即是單譬。此義通方，何藉重釋？答：隨機雖爾，其如佛唱此名，為依法立，為作喻陳。是則祗圖答問縱橫，不顧釋名淆混。問：四明記文，據經定題，言從法立，及乎釋義，云被二根。淨覺謂自語相違，前後矛楯（乳尹切），未知此斥，義實然乎？答曰：此不可也。何哉？言從法立者，依文之正意也；云被二根者，就名之旁通也。祗由題旨含蘊，遂致釋義通方。其有瑕者，但不合云順古作譬。不知其喻，出自題名，由是輒伸管見，麤述大綱。欲以塵霧之微，少益山海之廣。遂附此集，流布四方，冀觀覽者，塞世情焉。",
    "樓炭": "此翻成敗。",
    "曇無德": "亦名曇摩毱多，此翻云法密。隱覆即密義，又翻云法藏。大集云：我涅槃後，我諸弟子受持如來十二部經，書寫讀誦，顛倒宣說。以倒說故，隱覆法藏。人名曇摩毱多，法名四分，天音折埵理。",
    "薩婆多": "此云一切有，此部計三世有實，三性悉得受戒。大集云：而復讀誦書寫外典，受有三世，及以內外。破壞外道，善能論義，說一切性悉得受戒。凡所問難，悉能答對，是故名為薩婆多，法名十誦。",
    "迦葉遺": "此云重空觀。大集云：說無有我及以受者，轉諸煩惱猶如死屍，是故名為迦葉遺，法名解脫。此有戒本，相同五分。",
    "彌沙塞": "此云不著有無觀。大集云：不作地相、水火風相、虛空識相，名彌沙塞，法名五分。",
    "婆蹉富羅": "婆蹉，翻犢；富羅，翻子。上古有仙，染犢生子，自後種姓，皆名犢子。此部計我，非是即蘊，亦不離蘊，而有實我，律本不來。大集云：皆說有我，不說空相，猶如小兒，是故名為婆蹉富羅。",
    "摩訶僧祗": "此云大眾。大集云：廣博遍覽五部經書，是故名為摩訶僧祗。此有律本。首疏云：總別六部，僧祗是總，前五是別。此僧祗部眾，行解虛通，不生偏執，遍順五見，以通行故，故知是總，遺教三昧。下卷經云：佛在世時，眾僧唯著死人雜衣。因羅旬喻，分衛空還，佛知其宿行，使眾僧分律為五部，服色亦五種。令其日隨一部中行，遂制儀則，各舉所長，名其服色。曇無屈多迦部，通達理味，開導利益，表發殊勝，應著赤色衣，非南方之赤。薩婆多部，博通敏達，導以法化，應著皁衣，非北方之黑。迦葉遺部，精勤勇猛，𢗲（音夫）攝眾生，應著木蘭色衣。彌沙塞部，思入玄微，究暢幽密，應著青色衣，非東方之青。摩訶僧祗部，勤學眾經，宣講真義，以處本居中，應著黃色衣，非中方之色。自爾之後，便得大食。斯以五色之衣，用彰五部之相。",
    "揵度": "正音婆犍啚，此云法聚。如八犍度，以分一部為八聚，故以氣類相從之法，聚為一段。一、業犍度，明三業；二、使犍度，明百八煩惱；三、智，明十智；四、定，明八定；五、根，明根性；六、大，明四大；七、見，破六十二見；八、雜，謂小乘法。大論問：八犍度誰造？六分阿毗曇從何處出？答：佛在無失，滅後百年，阿輸柯王會諸論師，因生別部。有利根者，盡讀三藏，欲解佛經，作八犍度。後諸弟子，為後人不能全解，作略毗曇。其初造者，即迦旃延。",
    "瑜伽師地": "此云相應，謂一切乘境行果等所有諸法，皆曰相應。師，謂三乘行者，由聞思等，次第習行，如是瑜伽一十七地。",
    "毗婆沙": "此云廣解，正云鼻婆沙，此云種種說，又云分分說。總有三義：廣說、勝說、異說。",
    "毗勒": "此云篋藏。大論云：毗勒有三百二十萬言，佛在世時，大迦旃延之所造。佛滅度後，人壽轉減，憶識力少，不能廣誦。諸得道人，撰為三十八萬四千言，論未到此土。",
    "毗婆闍婆提": "此云分別論。",
    "育多婆提": "此云相應論。",
    "摩得勒伽": "此云智母，以生智故。菩薩入此三昧，作論申經。儒家以析理精微名論，釋氏申通辨論宗旨，收束所說，立為十支：一、略陳名數支，即百法論；二、麤釋體義支，即五蘊論，此二天親所造；三、總包眾義支，即顯揚論；四、總攝大乘義支，即攝大乘論，皆無著造；五、分別名數支，即雜集論；六、離僻處中支，即辨中邊論；七、摧破邪山支，即二十唯識論；八、高建法幢支，即三十唯識論；九、莊嚴體義支，即大莊嚴論；十、攝散歸觀支，即瑜伽論。以茲十義，疏條諸論，各有流類，斷可見矣。是以宗極絕於稱謂，賢聖以之沖默，玄旨非言不傳，釋迦以之致教。約身口，防之以律禁；明善惡，導之以契經；演幽微，辨之以法相。此即明戒定慧之三學也。",
    "波羅提木叉": "戒疏云：此翻解脫。如論所引，道戒名解脫也，事戒名別脫也。隨分果德，寄以明之。道性虛通，舉法類遣，不隨緣別，但名解脫。事戒不爾，緣別而生，緣通萬境，行亦隨遍，據行淩犯，即名得脫。餘非未行，不名解脫。又律云：木叉者，戒也。據能克果，用目本因，因實是戒，非木叉也。故經云：戒是正順解脫之本，故名波羅提木叉。明知是果，故五分說，分別名句木叉者，舉果目教也。記云：道戒名解脫者，即七支無表思也，由斷惑得名故。若戒事名解脫者，則僧尼受戒，隨對殺等事不作，別別無因，別別無果，故名別別解脫。摭華曰：此云別解脫，謂三業七支，各各防非，別別解脫故。",
    "三昧": "此云調直定，又云正定，亦云正受。圭峰疏云：不受諸受，名為正受。遠法師云：夫稱三昧者何？專思寂想之謂也。思專則志一不分，想寂則氣虛神朗；氣虛則智恬其照，神朗則無幽不徹。斯二乃是自然之玄符，用一而致用也。是故靖恭閑宇，而感物通靈，御心惟正，動必入微。此假修以凝神，積功以移性（云云）。又諸三昧，名質甚多，功高易進，念佛為先。故天台止觀略明四種：一常坐，二常行，三半行半坐，四非行非坐。一、常坐者，出文殊說。文殊問兩般若，名為一行三昧。身開常坐，遮行住臥，或可處眾，獨居彌善。居一靜室，安一繩床，九十日為一期，結加正坐。二、常行，出般舟三昧。唯專行旋，九十日為期。三、半行半坐。方等云：旋百二十帀，卻坐思惟。法華云：其人若行、若立，讀誦此經；是人若坐，思惟此經。四、非行非坐，實通行坐，南岳呼為隨自意。就此為四：一約諸經，二約諸善，三約諸惡，四約諸無記。輔行云：所言常坐，乃至非行非坐者，約身儀為名。若從法為名者，常坐名一行，常行名佛立，半行半坐名方等法華，非行非坐名隨自意等。然此四種三昧，先達以事理二觀，分四三昧，義亦殊途。四明法師因奉先清師，謂光明玄十種三法，純明理觀，不須附事而觀。法智破曰：荊溪云：如常坐等，或唯觀理，隨自意從末從事。既云純明理觀，乃是三種三昧，專今於識陰修十乘也。此文則顯四明以上三三昧為理觀。又指要云：隨自意中，修唯識觀。觀於起心，即約變造事用而說。此文則四明以第四三昧修事觀也。問：準妙宗云：常坐一種，縱直觀理。餘三三昧，豈不兼事？據此，則顯四明，以餘三三昧修事觀耶？今謂此文，非是正分，占察事理二觀，蓋為孤山定義例三種觀法，皆是理觀。十六觀法，乃是事觀。遂不以義例三種收十六觀，四明遂約四種三昧，無不歷事觀三諦理。乃顯從行觀中，尚有歷事之相，此非占察事觀也。問：如妙宗云：若常坐等，直於三道之事。而觀三諦，不兼修善，及縱惡事，故受理名。據此莫顯四明唯許常坐為理觀耶？今謂餘三三昧，歷外境事，故受事名（非占察事觀）。常坐三昧，唯觀內心，故受理名（非占察理觀）。問：第四三昧，橫開四科，一諸經行法，此須具收占察二觀。何故四明定隨自意唯修事觀？答：占察事理二觀，前三三昧，既修理觀，是故第四，唯修事觀，或云常坐是理，餘三是事。謂常行歷念佛事，方等歷持咒事，隨自意歷三性事。或云上三三昧，并諸經行法，通理通事，唯縱任三性，專修事觀。準荊溪云：如常坐等，或唯觀理，則顯上三三昧，通修事觀。此乃由昧二觀之相，遂迷四種之行。或問止觀，正宗法華，何故行相卻通眾經？答：別明行相，雖通眾典，行者造修，開歸法華。故義例云：是知四種三昧，皆依實相，實相是安樂之法，四緣是安樂之行。證實相已，所獲依報，名為大果。起教，只是為令眾生開示悟入；指歸，祗是歸於三軌妙法秘藏。所以始末皆依法華，即法華三昧之妙行也。",
    "末底": "秦言慧。",
    "若那": "或闍那，秦言智。大品若字門，入諸法智不可得故。論云：即知一切法中無智相。華嚴唱壤字時，名作世間智慧門。疏云：即能所知性。佛地經明四智：一、大圓鏡智者，如依圓鏡，眾像影現。如是依止如來智鏡，諸處境識眾像影現（佛地論云：大圓鏡智，離一切我我所執，乃至能現能生一切境界。又云：此智是如來第八淨識。資中云：離倒圓成，周鑒萬有，名大圓鏡智）。二、平等性智者，證得一切領受緣起，平等法性，圓滿成故。三、妙觀察智者，住持一切陀羅尼門、三摩地門，無礙辯才，說諸妙法故。四、成所作智者，勤身化業，示現種種，摧伏諸伎，引諸眾生，令入聖教，成解脫故（然涅槃云：依智不依識。在聖名成所作智，在凡名五識。在聖名妙觀察智，在凡名六識。在聖名平等性智，在凡名七識。在聖名大圓鏡智，在凡名八識。雖聖凡體一，而迷悟名異。故令依智，誡不依識。傳燈智通禪師，不會三身四智，遂謁六祖求解其義。祖曰：三身者，清淨法身，汝之性也；圓滿報身，汝之智也；千百億化身，汝之行也。若離本性，別說三身，即名有身無智。若悟三身無有自性，即名四智菩提。聽吾偈曰：自性具三身，發明成四智，不離見聞緣，超然登佛地。吾今為汝說，諦信永無迷，莫學馳求者，終日說菩提。通曰：四智之義，可得聞乎？祖曰：既會三身，便明四智，何更問耶？若離三身，別談四智，此名有智無身也。即此有智，還成無智。復說偈曰：大圓鏡智性清淨，平等性智心無病，妙觀察智見非功，成所作智同圓鏡。五八六七果因轉，但用名言無實性，若於轉處不留情，繁興永處那伽定。六七因中轉，五八果上轉。釋籤云：庵摩羅是第九，本理無染，以對真性。阿梨耶是第八，無沒無明，無明之性，即是智性，故對般若。末那識即是第七，執持藏識所持諸法，即此執持，名為資成，以助藏識持諸法故。第六但能分別諸法，故與第七同為資成。是故今文不論第六。若準唯識論，轉於八識以成四智，又束四智以成三身者，則轉第八為大圓鏡智，轉第七為平等性智，轉第六為妙觀察智，轉五識為成所作智。大圓鏡智成法身，平等性智成報身，成所作智成化身，妙觀察智遍於三身。此中不取第九，乃是教道一途，屬對不與今同。何者？彼居果位，三身仍別；此在因位，三身互融。即此三身，祇是三德。三德據內，三身約外。今從初心常觀三德，故與彼義不可儡同。寶藏論云：智有三種：一曰真智，謂體解無物，本來寂靜，通達無涯，淨穢不二。二曰內智，謂自覺無明，割斷煩惱，心意寂靜，滅無有餘。三曰外智，謂分別根門，識了塵境，博鑒古今，皆通俗事。又大品明三智，見薩婆若）。",
    "檀那": "法界次第云：秦言布施。若內有信心，外有福田、有財物，三事和合，心生捨法，能破慳貪，是為檀那。布施有二種：一者財施，二者法施。財施者，所謂飲食衣服、田宅六畜、奴婢珍寶、一切己之所有資身之具，及妻子，乃至身命屬他，為他財物，故云捨身猶屬財施。有所須者，悉能施與，皆名財施也。法施者，若從諸佛及善知識，聞說世間出世間善法，若從經論中聞，若自以觀行故知，以清淨心，為人演說，皆名法施。",
    "尸羅": "此云清涼。大論云：秦言性善。好行善道，不自放逸，是名尸羅。經音義云：此義譯也，正翻止得，謂止惡得善也。又古師翻戒，戒以防止為義，能防惡律儀無作之非，止三業所起之惡，故名防止。大論曰：云何為戒？若惡止不更作，若心生、若口言、若從他受，息身口惡，是為戒。經音義：梵言三婆羅，此云禁戒。戒疏云：戒，義訓警也。警策三業，遠離緣非，明其因也。優婆塞戒經云：戒者，名制。能制一切不善法故。又，戒是約義、訓義、勒義。纂要云：約二百五十戒，各有四威儀，合為一千，循三世轉為三千；將三千威儀，分配身口七支，為二萬一千；復約對治三毒及等分，成八萬四千。",
    "毗梨耶": "法界次第云：秦言精進欲樂。勤行善法，不自放逸，謂之精進。精進有二種：一者身精進，二者心精進。若身勤修善法，行道、禮誦、講說、勸助、開化，是為身精進。若心勤行善道，心心相續，是為心精進。復次勤修施戒善法，是為身精進。勤修忍辱禪定智慧，是為心精進。止觀引舊云：精進無別體，但督眾行。義而推之，應有別體。例無明通入眾使，更別有無明，今且寄誦經勤策其心，以擬精進，晝夜不虧，乃得滑利，而非三昧慧。唯識論云：勇捍為性。疏云：勇而無怯，自策發也；捍而無懼，耐勞倦也。陳氏云：精其心，進其志。大集：佛言：精進有二種：一始發精進，二終成精進。菩薩以始發精進，習成一切善法：以終成精進，分別一切法不得自性。法句經云：若能心不起，精進無有涯。",
    "禪那": "即息二邊分別止，名出楞嚴。資中云：準圓覺經，奢摩他以寂靜為相，三摩提以幻化為相，禪那俱離靜幻二相。然此二經，天台出時，經皆未到。而止觀中預立其義，故止觀二字各開三義：一體真止，二方便隨緣止，三息二邊分別止。又云：此三止名，雖未見經論，映望三觀，隨義立名。其相云何？體無明顛倒，即是實相之真，名體真止；如此實相遍一切處，隨緣歷境安心不動，名隨緣方便止；生死涅槃，靜散休息，名息二邊止。孤山釋曰：今阿難雖專請於止，以即一而三，故此止即觀，亦即平等。三一互融，是以稱妙，妙故方曰楞嚴大定。今於一止復有三名奢摩他，即體真止，止於真諦（翻奢摩他為止者，定之異名，寂靜義也。謂於染淨等境，心不妄緣故）。三摩提，亦曰三摩缽底，此云等持。即方便隨緣止，止於俗諦（三摩提，智論云：一切禪定攝心，皆名三摩提。秦言正心行處，是心從無始來，常曲不端，得是正心行處，心則端直，譬如蛇行常曲，入竹筒則直。翻等持者，謂離沈掉曰等，令心住一境性曰持）。禪那，此云靜慮，即息二邊分別止，止於中道（淨覺云：孤山專用天台三止，配今三名者，得經之深也。何則？止屬於定，觀屬於慧。阿難本以多聞小慧自咎，正以楞嚴大定為請，非三止而何。三摩禪那顯是定名，雖此定即慧，而所主從別）。次明三觀。",
    "般若": "法界次第云：秦言智慧，照了一切諸法皆不可得，而能通達一切無閡，名為智慧。大論云：般若定實相甚深極重，智慧輕薄。是故不能稱此生善，故不翻。此六度法，祖引經論以辨其相，共立五義。一，對治。善戒經云：謂慳、惡、瞋、怠、亂、癡，是所破之蔽。二，相生。善戒經云：謂捨家，持戒，遇辱須忍，忍已精進，精進已調五根，根調故知法界。又解深密經云：能為後後引發故，謂諸佛菩薩。若於身財無所顧吝，便能受持清淨禁戒。為護戒故，便修忍辱，修忍辱已，能發精進；發精進已，能辦靜慮；辦靜慮已，便能獲得出世間慧。是故我說波羅蜜多如是次第。三，果報。善戒經云：富具色力壽安辯。又餘經云：施報富，戒報善道，忍報端正，進報神通，禪報生天，智破煩惱。無著論云：有二種果，謂未來、現在。未來果者，檀得大福；尸羅得自身具足，謂釋梵等；羼提得大伴助大眷屬；毗黎耶得果報等不斷絕；禪得生身不損壞；般若得諸根猛利，及多諸悅樂，於天人大眾中得自在等。現在果者，得一切信敬供養，及現法涅槃等。四，互攝者。彌勒頌云：檀義攝於六，資生無畏法，是中一二三，名為修行住，此檀攝六度也。又菩提資糧論云：既為菩薩母，亦為諸佛母，般若波羅蜜，是覺初資糧（覺是菩提，六度是菩提資糧，般若為初耳）。施、戒、忍、進、定，及此五之餘，方便願智力，皆由智度故，波羅蜜所攝，此乃般若攝於六度，初後既爾，中四例知。五，譬喻。華嚴云：菩薩摩訶薩，以般若波羅蜜為母，方便善巧為父，檀波羅蜜為乳母，尸羅波羅蜜為養母，忍波羅蜜為莊嚴具，勤波羅蜜為養育者，禪波羅蜜為浣濯人，善知識為教授師，一切菩提分為伴侶，一切善法為眷屬，一切菩薩為兄弟，菩提心為家，如理修行為家法，諸地為家處，諸忍為家族，大願為家教，滿足諸行為順家法，勸發大乘為紹家業，法水灌頂一生所繫菩薩為王太子，成就菩提為能淨家族。六分開者，六度通大小，十度唯在大。一往亦通藏通兩教，以權立三智故。言十度者，於禪中有願智力，故開願度。有神通智，開出力度，根本定，守禪度名。般若中有道種智，開出方便度；有一切種智，開出智度；一切智，守本般若名。什曰：窮智之原故稱度。梵音中有母義。",
    "波羅蜜": "大論：又云阿羅蜜，秦言遠離；波羅蜜，秦言度彼岸。此二音相近，義相會故，以阿羅蜜，釋波羅蜜。天台禪門云：一者諸經論中，多翻到彼岸，生死為此岸，涅槃為彼岸，煩惱為中流。菩薩以無相智慧，乘禪定舟航，從生死此岸，到涅槃彼岸，故知約理定以明波羅蜜。二者大論別翻事究竟，即是菩薩大悲，為眾生遍修一切事行滿足故。三瑞應經翻度無極，通論事理，悉有幽遠之義。合而言之，故云度無極，此約事理行滿，說波羅蜜。",
    "波羅伽": "大論：秦言度彼岸。華嚴云：以波羅蜜船，於生死流中，不依此岸，不著彼岸，不住中流，而度眾生，無有休息。",
    "豆佉": "或伊禰，晉云苦。法界次第云：苦以逼惱為義。一切有為心行，常為無常患累之所逼惱，故名為苦。苦有三種：一苦苦，二壞苦，三行苦。今明三苦，有別有通。別者，三苦即別對三受。苦受，從苦緣生，情覺是苦，即苦苦也；樂受，樂壞時生苦，即是壞苦；不苦不樂受，常為無常遷動，即是行苦。若通論三苦，則三受通有三苦。所以然者，三受之心即是苦，通從苦緣生故，通是苦苦。三受之心通為壞相所壞故，通是壞苦。三受之心通是起役運動不停之相故，通是行苦。行以遷流為義，故楞嚴云：譬如瀑流，波浪相續，前際後際，不相踰越。古德頌行苦密遷云：如以一睫毛，置掌人不覺；若安眼睛上，違害極不安。愚人如手掌，不覺行苦遷；智者如眼睛，違極生厭患。智論云：無量眾生，有三種身苦：老、病、死；三種心苦：貪、瞋、癡；三種後世苦：地獄、餓鬼、畜生。法句經云：昔四比丘論世苦事：一云婬欲惱人；一云飢渴逼體；一云瞋恚擾亂；一云驚怖恐懼。各執己是，競謂他非。佛知遂問，比丘具答。佛言：汝等所論，不究苦義。身為諸苦之本，眾患之原，當求寂滅，此最為樂。",
    "三牟提耶": "或彌禰，晉云集。法界次第云：集以招聚為義，若心與結業相應，未來定能招聚生死之苦，故名為集。",
    "尼樓陀": "或娑陀，晉言滅。法界次第云：滅以滅無為義，結業既盡，則無生死之患累，故名為滅。",
    "末伽": "或槃那，晉云道。法界次第云：道以能通為義，道有二種：一正道，實觀三十七道品，三解脫門，緣理慧行，名為正道。二助道者，得解觀中，種種諸對治法，及諸禪定，皆是助道。此二相扶，能通涅槃，故名為道。此四華梵，出賢愚經。毗曇云：佛為四王，作聖語說四諦，二解二不解；又作毗陀語，一解一不解；又作梨車語說，四王俱解。故知四諦，名非一槩。此四諦法，若以藥病區揀，苦集是世間因果，此屬於病；道滅是出世間因果，此當乎藥。若以真俗甄別，則有三義：一者四諦俱真，如涅槃云：我昔與汝等，不見四真諦，是故久流轉生死大苦海。二者四諦俱俗，止觀云：滅尚非真，三諦焉是。三者一真三俗。勝鬘云：此四聖諦，三是無常，一是常。又云：是故苦諦集諦道諦，非第一義諦，非常、非依。一苦滅諦，離有相者，是常。又涅槃經明於四諦，凡有四種：一生滅四諦，二無生四諦，三無量四諦，四無作四諦。勝鬘經中亦明四種：一有作四諦，二有量四諦，三無作四諦，四無量四諦。但此二經詮次少異。荊溪問曰：何故立此四種四諦之殊？答：諦本無四，諦只是理。理尚無一，云何有四？故知依如來藏同體權實大悲願力，隨順物機不獲己而用之。機宜不同，致法差降。從一實理，開於權理，權實二理，能詮教殊，故有四種差別教起：三藏詮生滅，通教詮無生，別教詮無量，圓教詮無作。是故天台明四種四諦之法也。",
    "奢摩他": "此云止。涅槃經云：奢摩他，名為能滅，能滅一切煩惱結故；又名能調，能調諸根惡不善法故。又曰寂靜，能令三業成寂靜故。又曰遠離，能令眾生離五欲故。又曰能清，能清貪欲瞋恚愚癡三濁法故。以是義故，故名定相。",
    "毗婆舍那": "此云觀。涅槃云：毗婆舍那，名為正見，亦名了見。名為能見，名曰遍見，名次第見，名別相見，是名為慧。",
    "憂畢叉": "此云止觀平等。涅槃云：憂畢叉者，名曰平等，亦名不諍。又名不觀，亦名不行，是名為捨。止觀云：若用兩字共通三德者，止即是斷，斷通解脫；觀即是智，智通般若。止觀等者名為捨相，捨相即是通於法身。起信論云：所言止者，謂止一切境界相，隨順奢摩他觀義故。所言觀者，謂分別因緣生滅相，隨順毗缽舍那觀義故。永嘉集云：以奢摩他故，雖寂而常照；以毗婆舍那故，雖照而常寂；以優畢叉故，非照而非寂。照而常寂，故說俗而即真；寂而常照，故說真而即俗。非寂而非照，故杜口於毗耶。長者子六過出家經，佛告僧伽摩羅比丘：汝當行二法，止、觀是也。僧伽摩羅白佛言：甚解，世尊。佛言：我取要而說，云何言甚解耶？僧伽摩羅言：止者，諸結永盡。觀者，觀一切法。佛言：善哉！二明各開，初列三止。",
    "妙奢摩他": "即體真止。",
    "三摩": "即方便隨緣止。",
    "謂空假中": "荊溪臨終顧命眾曰：一念無相謂之空，無法不備謂之假，不一不異謂之中。章安云：天台傳南嶽三種止觀：一漸次，二不定，三圓頓，皆是大乘，俱圓實相，同名止觀。漸則初淺後深，如彼梯隥，不定前後更互，如金剛寶置之日中，圓頓初後不二，如通者騰空，為三根性，說三法門。雖曰師資相傳，原本皆出佛經。故次第三觀，如瓔珞上云：從假入空觀，亦名二諦觀；從空入假觀，亦名平等觀。因是二空觀為方便，得入中道第一義諦觀，此名次第三觀。又下卷云：時佛頂髮放一切光，復集十方百億佛土佛菩薩眾。即於眾中，告文殊：普賢、法慧、功德林、金剛幢、金剛藏、善財童子，汝見是眾中敬首菩薩，問三觀法界，諸佛自性清淨道，一切菩薩所修三觀法門不？汝等各領百萬大眾，皆應修學如是法門。又中論云：因緣所生法，我說即是空，亦名為假名，亦是中道義。此皆一心三觀之明文也。（余昔學肆有吳教授垂訪，問曰：經云作是觀〔音官〕者，名為正觀〔音貫〕。呼此二音，義云何辯？余即答曰：觀〔去聲〕呼詮其體，獨標能想之心。觀〔平呼〕聲顯其用，帶召所對之境。故曰以觀觀昏，即昏而朗。）然此各開三義，全異涅槃共通三德，由昔混同，故今分列。",
    "悉檀": "南岳師以悉檀，例大涅槃，華梵兼稱。悉是華言，檀是梵語。悉之言遍，檀翻為施，佛以四法，遍施眾生，故名悉檀。妙玄云：世界悉檀歡喜益，為人悉檀生善益，對治悉檀破惡益，第一義悉檀入理益。妙樂云：則前二教，及別地前，但屬三悉。引入今經，第一義悉。",
    "僧那": "此云弘誓。肇論云：發僧那於始心，終大悲以赴難。此名字發心也。仁王云：十善菩薩發大心，長別三界苦輪海。此相似發心也。華嚴云：初發心時，便成正覺。此分證發心也。言弘誓者，天台云：廣普之緣謂之弘，自制其心謂之誓，志求滿足乃稱願。大士曠懷，運心廣普。依無作四諦之境，起四種弘誓之心。初依瓔珞，未度苦諦，令度苦諦。六道受分段之苦，三乘沈變易之苦，當了陰入皆如，無苦可捨。口發言曰：眾生無邊誓願度。次依瓔珞，未解集諦，令解集諦。四住煩惱，潤有漏業；無明煩惱，潤無漏業。當了塵勞本淨，無集可除。口發言曰：煩惱無數誓願斷。三依瓔珞，未安道諦，令安道諦。智慧越苦海之迅航，戒定通祕藏之要道。當了邊邪是中，無道可修。口發誓言：法門無盡誓願學。四依瓔珞，未得滅諦，令得滅諦。佛陀是無上之世尊，涅槃乃最勝之妙法。當了生死即是涅槃。口發誓云：佛道無上誓願成。仰觀大覺，積劫度生，都無懈倦者，為滿本地之願也。",
    "僧涅": "一云僧那大誓，僧涅自誓。一云僧那言鎧，僧涅言著。名著大鎧，亦云莊嚴。故大品云大誓莊嚴。正言𦙽（蘇干切）那訶，此云甲；𦙽捺陀，此云被。或云衣（於既切），謂被甲衣甲也。",
    "毗跋耶斯": "此云四念處。念即是觀，處即是境。智論釋曰：初習善法，為不失故，但名念；能轉相轉心，故名為想；決定智無所疑，故名智。大經云：更有新醫，從遠方來，曉八種術，謂四枯四榮。言四枯者，人於五陰起四倒見，於色計淨，於受計樂，想行計我，心起常見。故令修四念處，破其四倒。初觀身不淨，一切色法，名之為身，己名內身，眷屬及他名外身，若己若他名內外身。此三種色，大論明五種不淨：一、生處，是身為臭穢，不從蓮華生，亦不從薝蔔，又不出寶山。二、種子不淨，是身種不淨，非餘妙寶物，不由淨白生，父母邪想有。三、自性不淨，地水火風質，能變為不淨，傾海洗此身，不能令香潔。四、自相不淨，種種不淨物，充滿於身內，常流出不止，如漏囊盛物。五、究竟不淨，審諦觀此身，終必歸死處，難御無反復，背恩如小兒。二、觀受是苦，意根受名內受，五根受名外受，六根受名內外受。於一根有順受、違受、不違不順受。於順生樂受，於違生苦受，於不違不順生不苦不樂受。樂受是壞苦，苦受是苦苦，不苦不樂受是行苦。諸受麤細，無不是苦。三、觀心無常。心王不住，體性流動，今日雖存，明亦難保。山水溜，斲石光；若不及時，後悔無益。四、觀法無我。法名軌則，有善法、惡法、無記法，人皆約法計我，我能行善、行惡、行無記。此等法中，求我決不可得。龜毛兔角，但有名字，實不可得。故經云：起唯法起，滅唯法滅。但是陰法起滅，無人無我，眾生壽命，是名無我。此說別相念處，總相念處者，緣一境總為四觀，此中應四句料簡，一、境別觀別（如上別說），二、境別觀總，三、境總觀別（此二是總相念處之方便），四、境觀俱總，是總相念處。若作一身念處觀，或總二陰，乃至總五陰，是名境總觀別也。受心法念，亦復如是。阿毗曇中，明三種念處，謂性、共、緣，對破三種外道。四教義云：一、性念處。智論云：性念處是智慧性；觀身智慧是身念處，受心法亦如是。解者不同，有但取慧數為智慧性，即是性念處。南岳師解觀五陰理性，名性念處。故雜心偈：是身不淨相，真實性常定，諸受及心法，亦復如是說。二、共念處。智論云：觀身為首，因緣生道，若有漏、若無漏；受心法念處亦如是。解者不同，有師解云：共善五陰，諸善心數法，合明念處。若南岳師解，即是九想、背捨、勝處，諸對治觀門，助正道開三解脫故，名為共念處。故經云：亦當念空法，修心觀不淨，是名諸如來，甘露灌頂藥。三、緣念處。有師解通一切所觀境界，皆名緣念處觀；有言十二因緣境；有言慈悲所緣境。若南岳師解：緣佛教說，所詮一切陰入界，四諦、事理、名義、言語、音詞、因果、體用，觀達無礙，能生四辯。於一切法，心無所礙，成無疑解脫，是緣念處觀也（明小乘境）。若依大乘以明四榮。如後分云：阿難！如汝所問佛涅槃後依何住者？阿難！依四念處嚴心而住。觀身性相同於虛空，名身念處；觀受不在內外，不住中間，名受念處；觀心但有名字，名字性離，名心念處；觀法不得善法，不得不善法，名法念處。華手經云：一切諸法皆名念處，何以故？一切諸法常住自性，無能壞故。斯乃即法是心，即心是法，皆同一性，性豈能壞乎？",
    "馝柯摩羅阿佚多": "此云正勤。斯有四法，法界次第云：一、已生惡法為除斷，一心精勤。四念處觀時，若懈怠心起，五蓋等諸煩惱覆心，離信等五種善根時，如是等惡若已生，為斷故，一心勤精進，方便除斷令盡也。二、未生惡法不令生，一心勤精進。四念處觀時，若懈怠心，及五蓋等諸煩惱惡法，雖未生，恐後應生，遮信等五種善根，今為不令生故，一心勤精進，方便遮止，不令得生也。三、未生善法為生，一心勤精進。四念處觀時，信等五種善根未生，為令生故，一心勤精進，方便修習，令信等善根生也。四、已生善法為增長，一心勤精進。若四念處觀時，信等五種善根已生，為令增長故，一心勤精進，方便修習信等善根，令不退失，增長成就。此四通名正勤者，破邪道，於正道中勤行，故名正勤也。",
    "摩奴是若": "此云如意。法界次第明四如意足：一、欲如意足。欲為主，得定斷行成就，修如意足分，是為欲如意足。二、精進如意足。精進為主，得定，斷行成就，修如意分，是為精進足。三、心如意。心為主，得定，斷行成就，修如意足。四、思惟如意足。思惟為主。通言如意者，四念處中實智慧，四正勤中正精進，精進智慧增多，定力小弱，得四種定攝心故，智定力等，所願皆得，故名如意足。智定若等，能斷結使，故云斷行成就也。",
    "娑羅": "此云力。陰持入經云：彼力應以何為義？答：無能得壞為力義；有所益為力義；有膽為力義，能得依為力義。增一阿含說六種力：小兒以啼為力，女人以瞋為力，沙門婆羅門以忍辱為力，阿羅漢以精進為力（云云）。又因人五力，佛果十力。因人五力者：一信力，二精進力，三念力，四定力，五慧力（五根，七覺支，八正道，見法界次第）。大論釋曰：信根得力，則能決定受持不疑。精進力故，雖未見法，一心求道，不惜身命，不休不息。念力故，常憶師教，善法來聽入，惡法來不聽入，如守門人。定力故，攝心一處不動，以助智慧。智慧力故，能如實觀諸法實相。佛果十力者，今述頌曰：是處非處二業力，定根欲性至處道，宿命天眼十漏盡，具釋大論八十八。論問：佛十力者，若總相說，佛唯一力，所謂一切種智力；若別相說，則千萬億種力，隨法為名。今何以但說十力？答：佛實有無量智力，但以眾生不能得、不能行，故不說。是十力，可度眾生事辦，故說十力。論問：佛有十力，菩薩有不？答：有。何者？一、發一切智心堅固力；二、不捨眾生大慈力；三、具足大悲力；四、信一切佛法精進力；五、思行禪定力；六、除二邊智慧力；七、成就眾生力；八、觀法實相力；九、入三解脫門力；十、無礙智力。",
    "尼坻": "此云願。志求滿足曰願。智論有二種願：一者可得願，二者不可得願。不可得願者，有人欲量虛空盡其邊際，及求時方邊際，如小兒見水中月、鏡中像，如是等願，皆不可得。可得願者，鑽木求火，穿地得水，修福得人天中生，及得阿羅漢、辟支佛果，乃至得諸佛法王，如是等，皆名可得願。願有下、中、上：下願今致今世樂因緣；中願後世樂因緣；上願與涅槃樂因緣。智論問：佛在世時，眾生尚有飢餓，天不降雨，眾生困弊；佛不能滿一切眾生之願，云何菩薩能滿其願？答：菩薩住於十地，入首楞嚴三昧，於三千大千世界，或時現初發意，行六波羅蜜，乃至或現出家成佛，利益如是，何況於佛！而佛身有二種：一者真身，二者化身。眾生見佛真身，無願不滿。智論問：諸菩薩行業清淨，自得淨報。何以要須立願，然後得之？譬如田家得穀，豈復待願？答：作福無願，無所樹立，願為導御，能有所成。譬如銷金，隨師而作，金無定也。又莊嚴佛界事大，獨行功德，不能成故，要須願力。譬如牛力，雖能挽車，要須御者能有所至。淨世界願，亦復如是。故古德曰：有行無願，其行必孤；有願無行，其願必虛。",
    "薩婆迦摩": "翻樂欲，好樂希須也。淨名疏云：根是過去，欲是現在，性是未來。若過去善根牢固成就，今生對緣則起，此是因根成欲。若過去善根未牢，今生遇緣起欲，數習成性，故云性以不改為義。荊溪釋云：習欲成性，性在未來；由性成欲，性在過去。智論云：隨所欲說法，所謂善欲，隨心為說，如船順流。惡欲，以苦切語教，如以榍出榍（先結切），是故智中，佛悉遍知，無能壞無能勝。事鈔云：凡作法事，必須身心俱集，方成和合。設若有緣，不開心集，則機教莫同，將何拔濟？故聽傳心口應僧前事，方能彼此俱辦。緣此故聞與欲，說云：大德一心念，某甲比丘，如法僧事，與欲清淨（使說一止）。其受欲者，應至僧中，羯磨者言，不來者說欲，即具修威儀。說云：大德僧聽，某甲比丘，我受彼欲清淨。彼如法僧事，與欲清淨。",
    "浮曇末": "此云至誠。十六觀經云：發三種心，即便往生。何等為三？一者至誠心，二者深心，三者回向發願心。疏釋至誠心云：即實行眾生，至之言專，誠之言實。禮記曰：志之所至，至者，到也。易注曰：存其誠實，故曰至誠，贊天地之化。書曰：至治馨香，感于神明，黍稷非馨，明德惟馨。釋深心云：佛果高深，發心求往，故云深心。亦從深理生，亦從厚樂善根生。妙宗云：今初至誠，疏以專實釋之。非念真如，豈名專實，解於深心？疏雖三義，而不相捨。求高深果，須契深理；善契深理，須厚樂善根。此乃立行依理求果也，不出彼論樂集一切諸善行也。經回向發願心，義當彼論大悲拔苦。起信云：信成就發心者，略說有三種：一直心，正念真如故；二深心，樂集一切諸善行故；三大悲心，欲拔一切眾生苦故。",
    "懺摩": "此翻悔過。義淨師云：懺摩，西音忍義。西國人誤觸身云懺摩，意是請恕，願勿瞋責，此方誤傳久矣，難可改張。應法師云：懺，訛略也。書無懺字，正言叉摩。此云忍，謂容恕我罪也。天台光明釋懺悔品，不辨華梵，但直釋云：懺者，首也；悔者，伏也。如世人得罪於王，伏款順從，不敢違逆。不逆為伏，順從為首。行人亦爾，伏三寶足下，正順道理，不敢作非，故名懺悔。又懺名白法，悔名黑法。黑法須悔而勿作，白法須企（去智切，望也）而尚之。取捨合論，故言懺悔。又懺名修來，悔名改往。往日所作不善法，鄙而惡之，故名為悔。往日所棄一切善法，今日已去，誓願勤修，故名為懺。棄往求來，故名懺悔。又懺名披陳眾失，發露過咎，不敢隱諱。悔名斷相續心，厭悔捨離，能作所作合棄，故言懺悔。又懺者名慚，悔者名愧。慚則慚天，愧則愧人。人見其顯，天見其冥，冥細顯麤，麤細皆惡，故言懺悔。淨名疏云：今明罪滅有三：一作法懺，二觀相懺，三觀無生懺。作法懺，滅違無作罪，依毗尼門；觀相懺，滅性罪，此依定門；觀無生懺，滅妄想罪，此依慧門。復次，違無作罪障戒，性罪障定，妄想罪障慧。作法懺者，如律所明，作法成就，能滅違無作罪，而性罪不滅。大論云：如比丘斬草害命，二罪同篇，作法懺二，無作滅，害命不滅；雖違無作滅，性罪未滅。觀相懺者，如諸方等經，所明行法，見罪滅相。菩薩戒云：若見光華種種好相，罪便得滅；若不見相，雖懺無益。若見好相，無作及性二罪俱滅。觀無生懺者，此觀成時，能除根本妄惑之罪。如拔樹根，枝葉自滅。普賢觀云：一切業障海，皆從妄想生。若欲懺悔者，端坐念實相。眾罪如霜露，慧日能消除。",
    "地底迦": "此云有愧。涅槃經云：諸佛世尊常說是言：有二白法能救眾生：一慚；二愧。慚者自不作罪，愧者不教他作。慚者內自羞恥，愧者發露向人。雜阿含經云：世間若無有慚愧二法者，違越清淨道，向生老病死。百法疏云：慚者，依自法力，崇重賢善為性，對治無慚，止息惡行為業；愧者，依世間力，輕拒暴惡為性，對治無愧，止息惡行為業。阿毗達磨論云：慚者，謂於諸過惡自羞為體；愧者，於惡羞他為體。涅槃經云：智者有二：一者不造諸惡，二者作已懺悔；愚者亦二：一作罪，二覆藏。",
    "波娑提伽": "或云梵摩，此云清淨。葛洪字苑：梵，潔也。取其義耳。大論云：雖為一切眾生，是心不清淨。不知己身無吾我，不知取者無人無主，不知所施物實性。不可說一，不可說異。於是三事心著，是為不清淨。寶性論云：一、自性清淨，謂性淨解脫；二、離垢清淨，謂障盡解脫。大論云：畢竟空，即是畢竟清淨；以人畏空，故言清淨。",
    "羯磨": "南山引明了論疏，翻為業也，所作是業，亦翻所作。百論云：事也，若以義求，翻為辦事。謂施造遂法，必有成濟之功焉。天台禪門，翻為作法。一切羯磨，須具四法：一法、二事、三人、四界。第一法者，羯磨三種：一、心念法，發心念境，口自傳情，非謂不言，而辦前事。二、對首法，謂各共面對，同秉法也。三、眾法。四人已上秉於羯磨，以三羯磨通前單白，故云白。四律云：若作羯磨，不如白法作白，不如羯磨法作羯磨。如是漸漸令戒毀壞，以滅正法。隨順文句，勿令增減。僧祇云：非羯磨地，不得行僧事。",
    "布薩": "大論：秦言善宿。南山：此云淨住，淨身口意，如戒而住。六卷泥洹，翻云長養。長養二義：一、清淨戒住，二、增長功德。雜含云：布薩婆陀，若正本音優補陀婆。優言斷，補陀婆言增長。國語不同，律云布薩法，一處名布薩犍度，即說戒也。應法師云：此名訛略，應言缽囉帝提舍耶寐。此云我對說，謂相向說罪也。舊云淨住，乃義翻也。事鈔云：若眾大聲小，不聞說戒，令作轉輪高座，立上說之，此則見而不聞也。又如多人說戒，何由併得見作法者面，此則聞而不見也。善見曰：云何得知正法久住？若說戒法不壞是。摩得伽云：布薩者，捨諸惡不善法，及諸煩惱有受，證得白法，究竟梵行事，故名也。又云：半月半月自觀身。從前半月，至今半月，中間不犯戒耶！若有犯者，於同意所懺悔。毗尼母云：若犯七眾不淨人前，應止不說戒。即律文云：犯者不得聞戒，不得向犯者說等。四分：若說戒日，無能誦者，當如布薩法，行籌告白，差一人說法誦經，餘諸教誡，誦遺教亦得。若全不解者，律云下至一偈：諸惡莫作，眾善奉行，自淨其意，是諸佛教（阿含具解）。如是作已，不得不說。若不解者，云謹慎莫放逸便散。並是佛之囑累。僧祗云：欲得五事利益，當受持此律。何等為五？一、建立佛法；二、令正法久住；三、不欲有疑悔，請問他人；四、僧尼犯罪者為依怙；五、欲遊化諸方，而無有礙。四分：持律人得五功德：一戒品牢固；二善勝諸怨；三於眾中決斷無畏；四有疑悔者能開解；五善持毗尼，令正法久住（明了論解云：本音毗那耶，略言毗尼）。摩耶經云：樂好衣服，縱逸嬉戲，奴為比丘，婢為比丘尼。不樂不淨觀，毀謗毗尼，袈裟變白，不受染色，貪用三寶物等，是法滅相。",
    "安居": "南山云：形心攝靜曰安，要期住此曰居。靜處思微，道之正軌，理須假日追功，策進心行，隨緣託處，志唯尚益，不許馳散，亂道妨業。故律通制三時，意存據道。文偏約夏月，情在三過：一、無事游行，妨修出業；二、損傷物命，違慈實深；三、所為既非，故招世謗。以斯之過，教興在茲。然諸義不無，指歸護命，故夏中方尺之地，悉並有蟲。故正法念經云：夏中除大小便，餘則加趺而坐。事鈔問：何為但結三月者？一、生死待形，必假資養，故結前三月，開後一月，為成供身衣服故；二、若四月盡結，則四月十六日得成，若有差脫，便不得結。教法太急，用難常準。故如來順物，始從十六日，至後十六日，開其一月續結令成。今但就夏，亦有三時，初四月十六日，是前安居。十七日已去，至五月十五日，名中安居。五月十六日，名後安居。故律中有三種安居，謂前、中、後也。在處須無五過：一、太遠聚落，求須難得；二、太近城市，妨修道業；三、多蚊螘（魚倚切）難，或噆（音帀）齧（五結切）人，踐傷彼命；四、無可依人，其人具五德，謂：求聞令聞，已聞令清淨，能為訣疑，能令通達，除邪見，得正見；五、無施主施飲食湯藥。無此五過，乃可安居。鈔云：凡受日緣務，要是三寶請喚，生善滅惡者，聽往；若請喚為利，三寶非法，破戒有難，雖受不成。五百問云：受七日行，不滿七日還本界。後更行，不須更受。滿七日已，乃復重受。鈔云：縱令前事唯止一日，皆須七日法。律云：不及即日還，聽受七日去，夏末一日在，亦作七日法。對首受法應具儀，對比丘言：大德一心念，我某甲比丘，今受七日法，出界外，為某事故，還來此中安居（三說）。若事是半月、一月者，方應羯磨（上之四卷具羯磨法）。若受日者多，同緣受者二人、三人，應一時羯磨。西域記云：睹貨邏國，舊訛曰吐火羅國。東阨（音厄，限也）䓤嶺，西接波剌斯，南大雪山，北據鐵門。氣序既溫，疾疫眾多，冬末春初，霖雨相繼。而諸徒僧，以十二月十六日入安居，三月十日解安居，斯乃據其多雨，亦是設教隨時也。又云：印度僧徒，依佛聖教，坐雨安居，或前三月，或後三月。前三月，當此從五月十六日，至八月十五日；後三月，當此從六月十六日，至九月十五日。前代譯經律者，或云坐夏，或云坐臘，斯皆邊裔殊俗，不達中國正音，或方言未融，而傳譯有謬。又曰：印度僧徒，依佛聖教，皆以室羅伐拏月。前半一日，入雨安居，當此五月十六日。以頞濕縛庾闍月，後半十五日，解雨安居，當此八月十五日。印度月名，依星而建，古今不易，諸部無差。良以方言未融，傳譯有謬。分時計月，致斯乖異。故以四月十六日入安居，七月十五日解安居也。",
    "缽剌婆剌拏": "音義指歸云：譯為隨意。寄歸傳云：凡夏罷歲終之時，此日應名隨意，即是隨他於三事之中，任意舉發，說罪除愆之義。舊云自恣者，是義翻。然則自恣之言，涉乎善惡，今局善也。故事鈔曰：九旬修道，精練身心。人多迷己，不自見過，理宜仰憑清眾，垂慈誨示。縱宣己罪，恣僧舉過，內彰無私隱，外顯有瑕疵，身口託於他人，故云自恣。摩得勒伽論云：何故令自恣？使諸比丘不孤獨故。各各憶罪，發露悔過故。以苦言調伏，得清淨故。自意喜悅，無罪故也。所以制在夏末者，若論夏初創集，將同期款，九旬立要，齊修出離。若逆相舉發，恐成怨諍，遞相沿及，廢道亂業故。制在夏末者，以三月策修，同住進業，時竟云別，各隨方詣。必有惡業，自不獨宣，障道深過，義無覆隱，故須請誨，良在茲焉。故律聽安居竟，自恣，此是自言恣他舉罪，非為自恣為惡。前明時節，謂有閏月者，依閏安居，七月十五日自恣。不依閏者，依摩得伽中，數滿九十日自恣。若閏七月者，取前月自恣。非前夏安居者，過閏已，數滿九十日自恣。若修道安樂，延日自恣，得至八月十五日。然律中但明十四日，十五日，自恣。及至給施衣中，次第增中，十六日自恣。增三中，三日自恣。四分中云：安居竟自恣，則七月十六日為定。律又云：僧十四日自恣，尼十五日自恣，此謂相依問罪，故制異日。及論作法，三日通用。克定一期，十六日定。若有難者，如五百門中，一月自恣。事鈔問：十五日自恣已，得出界不？答：不得破夏離衣，由夜分未盡故。問：此界安居，餘處自恣，得不？答：僧祗不問結罪。又安居篇云：四月十六日結者，至七月十五日夜分盡，訖名夏竟，至明相出。又四分云：若後安居人，從前安居者自恣，住待日足。事鈔問：自恣竟，得說戒不？答：依明了論，先說戒，後自恣。四分云：自恣即是說戒。問：自恣得在未受具戒人前作不？答：律中令至不見不聞處，作羯磨自恣。若不肯避去，僧自至不見聞處作之。問：安居竟，須離本處不？答：安居竟，不去犯罪。毗尼母云：比丘安居已，應移餘處。若有緣不得去，不犯。若無緣者，出界一宿，還來不犯。大集經云：我滅度後，無戒比丘，滿閻浮提，預出家者，宜警察之。摭華鈔云：諸經律中，以七月十六日，是比丘五分法身生來之歲。則七月十五日，是臘除也。比丘出俗，不以俗年為計，乃數夏臘耳。增輝云：臘，接也；謂新故之交接。",
    "唄匿": "或梵唄，此云止。若準律文，唄匿。如法出要律儀云：如此鬱鞞國語，翻為止斷也。又云止息，由是外緣已止已斷，爾時寂靜，任為法事也。或婆陟，訛也。梵音婆（蒲賀切）師，此云讚歎，梵天之音。善見云：聽汝作唄。唄，言說之詞也。法苑云：尋西方之有唄，猶東國之有讚。讚者，從文以結章；唄者，短偈以流頌，比其事義，名異實同。婆沙億耳，以三契聲頌所解法，佛讚善哉，珠林，齊僧辯，能作梵契等。音義云：契之一字，猶言一節一科也。弘明集頌經三契，道安法師集契梵音。佛道論衡云：陳思王幼含珪章，十歲能文，每讀經文，流連嗟玩，以為至道之宗極也。遂製轉讀七聲，昇降曲折之響，世之諷誦，咸憲章焉。嘗遊魚山，忽聞空中梵天之響，清颺哀婉，其聲動心。獨聽良久，而侍御莫聞。植深感神理，彌悟法應，乃摹其聲節，為梵唄，撰文。",
    "婆闍尼娑婆啉": "此云聲音。法界次第云：音者，詮理之聲謂之音。佛所出聲，凡有詮辯，言辭清雅，聞者無厭，聽之無足。能為一切，作與樂拔苦因緣。莫若聞聲之益，即是以慈修口。故有八音：一、極好音，二、柔軟音，三、和適音，四、尊慧音，五、不女音，六、不誤音，七、深遠音，八、不竭音。楞嚴經云：此方真教體，清淨在音聞；欲取三摩提，實以聞中入。大論云：菩薩音聲，有恆河沙等之數。佛音聲所到，無有限數。如密跡經中所說，目連試佛音聲，極至西方，猶聞佛音，若如對面。問：若爾者，佛常在國土聚落，說法教化。而閻浮提內人，不至佛邊，則不得聞。何以知之？多有從遠方來，欲聽說法者故。答：佛音聲有二種：一為口密音聲，二為不密音聲。密音聲先已說，不密音聲，至佛邊乃聞。是亦有二種弟子：一為出世聖人，二為世間凡夫。出世聖人，如目犍連等，能聞微密音聲。凡夫人，隨其所近乃聞。大論云：是佛菩薩音聲有三種：一者，先世種善音聲因緣故，咽喉中得微妙四大，能出種種妙好遠近音聲，所謂一里、二里、三里、十里、百千里，乃至三千大千世界，音聲遍滿。二者，神通力故，咽喉四大出聲，遍滿三千大千世界，及十方恆河沙世界。三者，佛音聲，常能遍滿十方虛空。問：若佛音聲常能遍滿，今眾生何以不得常聞？答：眾生無量劫以來，所作惡業覆，是故不聞。譬如雷電霹靂，聾者不聞，雷聲無減。佛亦如是，常為眾生說法，如龍震大雷聲，眾生罪故，自不得聞。聲有八轉：一體，二業，三具，四為，五從，六屬，七於，八呼。七轉常用，呼聲用稀，故但云七也。西域國法，欲尋讀內外典籍，要解聲論八轉聲，方知聞義分齊；一、補沙，此是直指陳聲，如人斫樹，指說其人，即今體聲。二、補盧衫，是所作業聲，如所作斫樹，故云業也。三、補慮崽（山佳切）挐，是能作具聲，如由斧斫，故云具也。四、補盧沙耶，是所為聲，如為人斫，故云為也。五、補盧沙䫂（都我切），是從聲，如因人造舍等，故云從也，從即所因故。六、補盧殺娑，是所屬聲，如奴屬主，故云屬也。七、補盧鎩（音戒），是所於聲，如客依主，故云於也，於即依義。八、稧（胡計切）補盧沙，是呼召之聲，故云呼也。又諸咒中，若二字合為一聲，名為二合，如云娑他，及怛多等。或以三字連聲，合為一字急呼之，名為三合，如㪍魯奄，及拘盧奢等。漢書曰：聲者，宮、商、角、徵、羽也。鉤隱圖云：聲屬陽，律屬陰。楊子云：聲生於日，律生於辰也。",
    "缽底婆": "此云辯才。辯，說也，展轉無滯故。辯，別也，分明訣了故。輔行明辯有四種：謂義、法、詞、樂說也。義，謂顯了諸法之義；法，謂稱說法之名字；詞，謂能說名之語言。雖有此三，必須樂說，說前三也。大品云：從諸佛所，聽受法教，至薩婆若，初不斷絕，未曾離三昧時，當得捷疾辯、利辯、不盡辯、不可斷辯、隨應辯、義辯、一切世間最上辯。智論釋曰：於一切法無礙故，得捷疾辯。有人雖能捷疾，鈍根故，不能深入。以能深入故，是利辯。說諸法實相，無邊無盡故，名樂說無盡。般若中無諸戲論故，無能問難斷絕者，名不可斷辯。斷法愛故，隨眾生所應，而為說法，名隨應辯。說趣涅槃利益之事故，名義辯。說一切世間第一之事，所謂大乘，是名世間最上辯。梁僧傳云：唱導所貴，事有四焉：一、聲也，非聲則無以警眾；二、辯也，非辯則無以適時；三、才也，非才則言無可采；四、博也，非博則語無依據。事鈔曰：古云：博學為濟貧。會正記云：故往之言也。僧傳云：學不厭博，博則通矣！子曰：君子博學於文，約之以禮，亦可以弗畔矣夫（鄭曰：弗畔，不違道也）。苟生而貧於學者，懦（奴亂切。又音儒，弱也）夫也；死而富於道者，君子也。是知博學，濟識見之貧。思益經云：於墮邪道眾生，生大悲心，令入正道，不求恩報，故名導師。",
    "槃那寐": "名出聲論，或名槃談，訛云和南，皆翻我禮。或云那謨悉羯羅，此云禮拜。今謂禮之與拜，名有通局長短。經曰：禮者，履也。進退有度，尊卑有分，謂之禮。禮記云：禮也者，猶體也。體不備君子，謂之不成人。故孔子云：非禮勿視，非禮勿聽，非禮勿言，非禮勿動。是則凡所施為，皆須合禮，此顯禮名通也。白虎通云：人之相拜者何？所以表情見意，屈節卑禮尊事者也，拜之言服也。故周禮明九拜，此顯拜名局也。若依釋氏，如南山云：四儀若無法潤，乃名枯槁眾生。故天台明四種三昧之法，是知四儀法則名禮，身業恭敬名拜，此亦禮通拜局。今此翻譯，禮即是拜。故大論云：禮有三種：一者口禮；二者屈膝，頭不至地；三者頭至地，是為上禮。一、口禮者，如合掌問訊也。觀音義疏云：此方以拱手為恭，外國以合掌為敬。手本二邊，今合為一，表不散誕，專至一心。僧祗律云：禮拜不得如啞羊，當相問訊。爾雅云：訊，言也。地持論云：當安慰舒顏，先語平視，和色正念，在前問訊。善見論云：比丘到佛所，問訊云：少病少惱，安樂行不？二、屈膝者，即互跪也。音義指歸云：不合云胡跪。蓋梵世遺種，居五竺間，䓤嶺之北，諸戎羌胡。今經律多翻互跪，以三處翹（渠遙切）聳，故名互跪，即右膝著地也。涅槃疏明三義：一、右膝有力，跪能安久；二、右膝有力，起止便易；三、右膝躁動，著地令安。若兩膝著地，則名長跪。毗奈耶云：尼女體弱，互跪要倒，佛聽長跪。三、頭至地者，即五體投地。故大論云：人之一身，頭最為上，足最為下。以頭禮足，恭敬之至。輔行云：準地持阿含，皆以雙膝、雙肘及頂至地，名五體投地，亦名五輪，五處圓故。又勒那三藏，明七種禮：一、我慢禮，謂依位次，無恭敬心；二、唱和禮，高聲喧雜，詞句混亂；三、恭敬禮，五輪著地，捧足殷勤；四、無相禮，深入法性，離能所相（空觀）；五、起用禮，雖無能所，普運身心，如影普遍，禮不可禮（假觀）；六、內觀禮，但禮身內法身真佛，不向外求（中觀）；七、實相禮，若內若外，同一實相（三諦一境）。西域記云：致敬之式，其儀九等：一、發言慰問，二、俯首示敬，三、舉手高揖，四、合掌平拱，五、屈膝，六、長跪，七、手膝踞地，八、五輪俱屈，九、五體投地。凡斯九等，極唯一拜，跪而讚德，謂之盡敬。舍利弗問經，佛言：作供養，應須偏袒，以便作事。福田時，應覆兩肩，現田紋相。不拜王論：有五戒信士，見神不禮。王曰：何為不禮？曰：恐損神故。王曰：但禮。信士乃禮，其神形儀粉碎。又迦昵色迦王，受佛五戒，曾神祠中禮，神像自倒。後守神者，作佛形像，在神冠中。王禮不倒，怪而問之，曰：冠中有佛像。王大喜，知佛最勝而恕之。又感通錄云：唐蜀川釋寶瓊，出家齋素，讀誦大品，本邑連比什邡（音方，縣名）並是米族。初不奉佛，沙門不入其鄉，故老女婦，不識者眾。瓊思拔濟，待其會眾，便往赴之，不禮而坐。道黨咸曰：不禮天尊，非沙門也。瓊曰：邪正道殊，所奉各異，天上禮我，我何得禮老君乎？眾議紛紜，瓊曰：吾若下禮，必貽辱也。即禮一拜，道像連座動搖不安。又禮一拜，反倒狼藉在地。遂合眾禮瓊，一時回信。梵網經云：出家人法，不向國王禮拜，不向父母禮拜，六親不敬，鬼神不禮。西域記云：昔有德光論師，天軍接見慈氏，謂非出家之形，長揖不理。問：何緣不輕比丘，普禮四眾？荊溪釋曰：菩薩化緣，法無一準，唯利是務，故設斯儀，是眾生理，與果理等。故禮生禮佛，其源不殊，欲令眾生，生慕果願。果願者何？我等但理，彼尚故禮，況證果理，而不尊高。又云：汝等皆行菩薩道，當得作佛，豈非擊我？令修圓因，此約現在順從者也。問：內懷不輕之解，外敬不輕之境，安棄飛禽之真性，而忽走獸之本源乎？答：人識義方，可以擊發，異類無知，徒勞勸信。不禮之旨，其在茲歟，不輕禮俗，謹聞命矣！何故方丈僧拜維摩？故彼經曰：維摩居士即入三昧，令此比丘自識宿命，發菩提心。於是諸比丘稽首禮維摩詰足。天台問曰：出家何以禮俗？答：入道深恩，碎身莫報，此諸比丘，方行大道，豈存小儀？又涅槃云：有知法者，若老若少，故應供養恭敬禮拜。入大乘論云：被法服菩薩，方便隨順，得禮白衣，敬之如佛。是則法非一槩，可否在人，有益須禮，當亡身以奉法。有損宜止，應逆命以利君。何哉？赫連㪍㪍，據有夏州，凶暴無厭，以殺為樂。繪像服身，抑僧令拜，遂為上天雷震而死。斯乃暴虐之主，誠非聖明之君。不遵付囑之言，故違委寄之道。寧知千聖立法，萬古同風，安以朝覲之禮，而責山林之士。恐後進以未知，遂濡毫而錄示。",
    "南無": "或那謨，或南摩，此翻歸命。要律儀翻恭敬，善見論翻歸命覺，或翻信從。法華疏云：南無，大有義。或言度我，可施眾生。若佛答諸佛，度我義不便。五戒經稱驚怖。驚怖，正可施佛也；生死險難，實可驚怖。大品云：佛言：若有一人稱南無佛，乃至畢苦，其福不盡。智論問曰：云何但空稱名字，便得畢苦，其福不盡？答：是人曾聞佛功德，能度人老病死苦，若多若少供養，及稱名字，得無量福（此說稱佛功德）。華嚴云：寧受地獄苦，得聞諸佛名；不受無量樂，而不聞佛名。所以於往昔，無數劫受苦，流轉生死中，不聞佛名故。大品云：我得阿耨多羅三藐三菩提時，十方過如恆沙等世界中眾生，聞我名者，必得阿耨多羅三藐三菩提。智論問曰：有人生佛世，在佛法中，或墮地獄，如提婆達多、俱迦梨訶多釋子等，三不善法覆心，故墮地獄。此中云何言如恆河沙等世界，但聞佛名，便得道耶？答：有眾生福德淳熟，結使心薄，應當得道。若聞佛名，即持得道。又復以佛威力故，聞即得度。譬如熟癰，若無治者，得小因緣，而便自潰。亦如果熟，若無人取，微風因緣，便自墮落。如新淨白㲲，易為受色（此說聞佛名福）。",
    "彌羅": "此云慈。淨覺云：慈名愛念。觀音玄義云：以觀性德善，愛樂歡喜，起大慈心，欲與其樂。大經明慈有三種：一、緣眾生，觀一切眾生，如父母親想；二、緣於法，見一切法，皆從緣生；三者、無緣，不住法相，及眾生相。智論明三種慈：一、生緣慈者，十方五道眾生中，以一慈心視之，如父如母，如兄弟、姊妹、子姪、知識，常求好事，欲令得利益安樂。如是心遍滿十方眾生中，如是慈名眾生緣，多在凡夫人行處，或有學人未漏盡者。二、行法緣者，諸漏盡阿羅漢、辟支佛，是諸聖人，破吾我相，滅一異相故。但觀從因緣相續生諸欲心，慈念眾生時，從和合因緣相續生。但空五眾，即是眾生。念是五眾，以慈念眾生，不知是法空而常一，心欲得樂，聖人愍之，今隨意得樂，為世俗法故，故名為法緣。三、無緣者，是慈但諸佛有，何以故？諸佛心，不住有為、無為性中；不依止過去世，未來、現在世；知諸緣不實，顛倒虛誑，故心無所緣。佛以眾生不知諸法實相，往來五道，心著諸法，分別取捨，以是諸法實相智慧，令眾生得之，是名無緣。",
    "迦樓那": "此云悲。淨覺記云：悲曰愍傷。觀音玄義云：以觀性德惡毒，惻愴憐愍，起大悲心，欲拔其苦。悲亦三種，名同三慈。觀音玄義云：若就言說為便，初慈後悲。亦是就菩薩本懷，欲大慈與樂。既不得樂，次大悲拔苦。故初慈後悲。若從用次第者，初以大悲拔苦，方以大慈與樂。又就行者先脫苦，後蒙樂，欲先悲後慈。",
    "阿檀": "或阿捺摩，此云無我。說文云：我，施身自謂也。華嚴云：凡夫無智，執著於我。智論明二種：一者邪我，二者慢我。言邪我者，如輔行云：未得禪來，縱起宿習，所有煩惱，及因現陰，起於我見，仍屬鈍使，初果所斷。此推理見，及發得見，皆名邪我。二慢我者，如止觀云：如諸蠕（音軟）動，實不推理，而舉𧑃（音敖，蟹屬）張鬐（音耆），怒目自大。底下凡劣，何嘗執見？行住坐臥，恆起我心，此是慢我。大寶積經：佛言：迦葉！譬如咽塞病，即能斷命。如是迦葉，一切見中，唯有我見，即時能斷於智慧命。地持經云：世間受生，皆由著我；若離著我，則無世間受生身處。無著論云：取自體相續，為我想；我所取，為眾生想；謂我乃至壽住，為命想；展轉趣於餘趣，為人想。大論云：我者，於陰界入計我我所，若即若離。人者，謂於陰界入中，謂我是行人。眾生者，於陰界入和合之中，計有我生。壽者，於陰界入中，計一期報，若長若短。輔行云：我以計內；人以計外；眾生以續前為義；壽者以趣後為能。凡夫既執我倒，佛為二乘說無我法。故智論號名字我，如大乘入楞伽云：自心所現身器世間，皆是藏心之所顯現，剎那相續，變壞不停。如河流，如種子，如燈燄，如迅風，如浮雲。躁動不安如猿猴，樂不淨處如飛蠅，不知厭足如猛火。無始虛偽習氣為因，諸有趣中流轉不息，如汲井輪。種種色身威儀進止，譬如死屍咒力故行，亦如木人因機運動。若能於此善知其相，是名人無我智。大論云：但於五眾取相故，計有人相，而生我心；以我心故生我所。我所心生故，有利益我者生貪欲，違逆我者而生瞋恚。此結使不從智生，從狂惑生，是名為癡。三毒為一切煩惱之根本，悉由吾我。故作福德，為我後當得。亦修助道法，我當得解脫。初取相故，名為想眾。因吾我起結使，及諸善行，是名行眾。是二眾，則是法念處。於想行眾法中，求我不可得。何以故？是諸法皆從因緣生，悉是作法，而不牢固，無實我法。行如芭蕉，葉葉求之，中無有堅。想如遠見野馬，無水有水想，但誑惑於眼。我本空寂，二乘既執四枯，故佛於無我中而示真我。故涅槃經明八自在：一、能示一身多身，數如微塵；二、以塵身滿大千界；三、以大身輕舉遠到；四、現無量類，常居一國；五者、諸根互用；六、得一切法，如無法想；七、說一偈，經無量劫；八、身如虛空，存沒隨宜不窮。",
    "阿蘭那": "肇翻無諍，又云寂靜。坐禪三昧經云：無諍者，將護眾生，不令起諍也。什注淨名：無諍有二：一、以三昧力，將護眾生，令不起諍心。二、隨順法性，無違無諍。",
    "䭾那演那": "此云靜慮。婆沙論：此定，定慧平等。餘定缺少，不名靜慮。靜，即定也；慮，即慧也。",
    "末陀摩": "本經注云：末者，莫義；陀摩者，中義。莫著中道也。",
    "毗怛迦": "此云尋。",
    "毗遮羅": "此云伺（相吏切）。藏疏云：尋謂尋求，伺謂伺察。心之麤性，名之為尋；心之細性，名之為伺。論云：入三摩地有三種：一、有尋伺，謂初禪及未至定也；二、無尋唯伺，謂中間禪也。大梵六天，即中間定力所感。三、無尋無伺，謂二禪近分，乃至非非想天。尋伺亦名覺觀。智論問：有覺有觀，為一法，為是二法耶？答：二法。麤心初念，是名為覺；細心分別，是名為觀。譬如撞鐘，初聲大時名為覺，後聲細欲名為觀。問曰：如何毗曇說：欲界乃至初禪，一心中覺觀相應。今云何言：麤心初念名為覺，細心分別名為觀。答曰：二法雖在一心，二相不俱。覺時觀不明了；觀時覺不明了。譬如日出，眾星不現。一切心心數法，隨時受名，亦復如是。",
    "三跋羅": "此翻護，即是無表思，第六識相應善思也。又名無表色，有止惡防非功能，故云護。故金剛鈔，明戒體，克出體性，即無表思一法也。",
    "三跋致": "晉言發趣，或云至奏。奏，為也，進也。",
    "達嚫": "尊婆須密論作檀嚫，此云財施。解言報施之法，名曰達嚫，導引福地，亦名達嚫。字或從手。西域記：正云達嚫拏者，右也。或云䭾器尼，以用右手受人所施，為其生福故。肇云：夫以方會人，不可以一息期；以財濟物，不可以一時周。是以會通無隅者，彌綸而不漏；法澤冥被者，不易而普覆。",
    "周羅": "立世毗曇云：閻浮人衣服莊嚴不同，或有頂留一髻，餘髻皆除，名周羅髻。應法師云：此譯為小，謂小髻也。弘明集云：削髮毀容，事存高素，辭親割愛，歸趣聖方。祛嗜欲於始心，忘形骸於終果，何乃戀於三界，豈留連於六道哉？薩婆多云：剃髮翦爪，是佛所制。律云：半月一剃，此是恆式。涅槃云：惡比丘相，頭鬚爪髮，悉皆長利，是破戒之相。式觀應世，廣說萬行之綱目，緬（懷也）想契理，唯唱四句之綱要。故十二年說教戒曰：諸惡莫作，眾善奉行，自淨其意，是諸佛教。妙玄釋曰：諸惡即七支過罪，輕重非違，如是等惡，戒所防止（戒分性遮，亦名主客，又號新舊）。諸善乃善三業，若散若靜，前後方便，支林功德，悉是清升，故稱為善。自淨其意者，破諸邪倒，了知世間出世因果，正助法門，能除心垢，淨諸瑕穢，豈過於慧。佛法曠海，此三攝盡。但由觀機樂欲，為善不同，應物隨宜，示行有異。或辨根性，則分信法之殊；或陳行相，則列別圓之異。且根性信法者，薩婆多云：因聞入者，是為信行；因思入者，是為法行。曇無德云：位在方便，自見法少，憑聞力多，後時要須聞法得悟，名為信行。憑聞力少，自見法多，後時要須思惟得悟，名為法行。天台遠討根源，久劫聽學，久劫坐禪，得為信法種子。其次行相別圓者，妙玄引涅槃明五行：一、聖行，謂戒定慧，為自行因；二、梵行，謂慈悲喜捨，為因中化他，此二是地前修因行也。垂裕記問：諸文或云聖梵是因，今何以梵行在果？答：聖梵二行，並通因果，對於天行，以二為因。今云在果，何所疑也。三、天行，謂初地已上，證第一義天，天然之理，由理成行，故名天行。垂裕記問：天既是證，何名為行？答：從天起行，故名天行。故天行位，在於地住。四、嬰兒行，謂示同三乘七方便所修之行也；五、病行，謂示同九道之身，現為三障之相。此二皆是從果起應之行。淨名疏云：嬰兒行從大慈善根而起，病行從大悲善根而起。四教義云：同生善邊，名嬰兒行；同煩惱邊，名為病行。然此五行，若會三諦，聖行是真諦；梵行、嬰兒、病行是俗諦；天行是中諦。又依法華釋圓五行，經云：如來莊嚴而自莊嚴，即圓聖行；如來室，即圓梵行；如來座，即圓天行。如來衣，有二種：柔和，即圓嬰兒行；忍辱，即圓病行。大經云：復有一行，是如來行。所謂大乘大般涅槃。此示行法之綱要也。",
    "摩訶般涅槃那": "此云大滅度。大即法身，滅即解脫，度即般若。大經云：涅言不生，槃言不滅；不生不滅，名大涅槃。楞伽經云：我所說者，妄想識滅，名為涅槃。肇師涅槃論曰：秦言無為，亦名滅度。無為者，取其虛無寂寞，妙絕於有為；滅度者，言其大患永滅，超度四流。斯蓋鏡像之所歸，絕稱謂之幽宅也。法華、金剛，皆云滅度。奘三藏翻為圓寂。賢首云：德無不備稱圓，障無不盡稱寂。圭峰正名寂滅。準肇公云：泥洹盡諦者，豈直結盡而已！則生死永寂滅，故謂之盡矣。或翻安樂。凡聖大小，皆有涅槃。或名彼岸。肇師云：彼岸，涅槃岸也。彼涅槃岸，豈崖岸之有。以我異於彼，故借我謂之耳。智論云：槃名為趣，涅名為出。永出諸趣，故名涅槃。或名泥曰，如嚴佛調云：佛既泥曰，微言永絕。新云：梵本正名波利昵縛喃，此云滅度。二教論云：涅槃者，常恆清涼，無復生死。心不可以智知，形不可以像測，莫知其所以名，強謂之寂。其為至也，亦以極哉！縱其雙林息照，而靈智常存；體示闍維，而法身恆在。然涅槃法，若辨其義，應分有餘無餘之殊，當揀少分究竟之異。言有餘無餘者，光明玄義云：若三界煩惱盡，證有餘涅槃；焚身灰智，入無餘涅槃。言少分者，勝鬘經云：知有餘苦，斷有餘集，證有餘滅，修有餘道，是名得少分涅槃。得少分涅槃者，名向涅槃界。究竟涅槃者，大法鼓經云：乃至得一切種功德，一切種智，大乘涅槃，然後究竟。法華經云：不令有人獨得滅度，皆以如來滅度而滅度之。初發大心，當期究竟。故輔行云：菩薩初心常觀涅槃，自行初修也。亦令眾生常觀涅槃，化他初修也。安置諸子祕密藏中，化他後入也。我亦不久自住其中，自行後入也。故知自他初心，無不皆修；自他後心，無不皆入。若欲修入，當依四法。故涅槃云：有四法為涅槃近因：一、近善知識；二、聽聞正法；三、思惟其義；四、如說修行。若言勤修苦行，是涅槃近因緣者，無有是處。一、近善知識者，止觀釋曰：大品云：佛菩薩羅漢，是善知識。六波羅蜜、三十七品，是善知識。法性實際，是善知識。佛菩薩等威光覆育，即外護也。六度道品，入道之門，即同行也。法性實際，諸佛所師，即教授也。二、聽聞正法等三句，即三慧也。華嚴云：我或為眾生說聞慧法，或為眾生說思慧法，或為眾生說修慧法。故楞嚴云：從聞思修，入三摩地。真諦云：散心名覆器，無聞慧故。忘心名漏器，雖得而失，無思慧故。倒心名穢器，非而謂是，無修慧故。淨名疏云：聞若不聽，無受潤因；聽而不思，無深旨趣；思而不修，終無證理。三慧若備，入道不疑。荊溪釋云：念前聞思所依之境，當如聞思而修行之。應知三慧有橫有豎，橫則名字已上，位位有之；豎則名字為聞，觀行為思，相似為修，三慧具足，能得相似分真之定，名入祕藏。",
    "達摩": "此翻為法。唐明濬（音信）云：契之於心，然後以之為法。在心為法，形言為教。法有自相共相，教乃遮詮表詮。天台明法，廣有八種：一教，二理，三智，四斷，五行，六位，七因，八果。略言三義，謂教、行、理。如闡義云：以約修行始終，三義收盡，謂依教修行，行成契理。若以位分，約教屬名字位，人稟教生解故；約行屬觀行相似，依解修行故；約理在初住，分證本理故。然於約行，復須從容。若論造修，猶居名字，的取行成，方名觀行。凡當辨位，須知此旨。若約能詮所詮，但明教理二教。論曰：教者何也？詮理之謂也。理者何也？教之所詮。教若果異，理豈得同？理若必同，教寧得異？筌不期魚，蹄不為兔，將謂名乎！妙樂云：教有二種，詮理之教無二，表行之教自分。詮理之教者，平等真法界，佛不度眾生。表行之教者，祗由忘智親疏，致使迷成厚薄。青龍疏云：有教行證，名為正法。有教有行無證，名像法。像者，似也。但有於教而無行證，名為末法。行事鈔云：顯理之教，大分為二：一謂化教，此則通於道俗。二謂行教（亦名制教），唯局於內眾。大乘入楞伽云：教由理故成，理由教故顯，當依此教理，勿更餘分別。",
    "達磨䭾都": "此云法界。妙樂云：所詮無外，故名法界。賢首云：依生聖法，故云法界。清涼云：法界者，一切眾生身心之本體也。起信云：心真如者，即是一法界大總相法門體。所謂心性不生不滅，一切諸法，唯依妄念而有差別。淨名云：從無住本，立一切法。天台釋云：若迷無住，則三界六道，紛然而有，則立世間一切諸法。若解無住，即是無始無明，返本還源，發真成聖。故有四種出世聖法。普門玄云：世者為三，一五陰，二眾生，三國土（云云）。世是隔別，即十法界之世，亦是十種五陰，乃至依報隔別不同也。間是間差，三十種世間差別，不相謬亂，故名為間。各各有因，各各有果，故名為法。各各有界畔分齊，故名為界。今就一法界，各有十法。所謂如是性相等，十界即有百法，十界互相有，則有千法。如是等法，皆因緣生法。六道是惑因緣生法，四聖是解因緣法（云云），是諸因緣法，即是三諦。因緣所生法，我說即是空，亦名為假名，亦名中道義。清涼新經疏云：統唯一真法界，謂總該萬有，即是一心。然心融萬有，便成四種法界。一、事法界，界是分義，一一差別，有分齊故。二、理法界，界是性義，無盡事法，同一性故。三、理事無礙法界，具性分義，性分無礙故。四、事事無礙法界，一切分齊事法，一一如性融通，重重無盡故。",
    "阿耨多羅三藐三菩提": "肇論曰：秦言無上正遍知。道莫之大，無上也。其道真正，無法不知，正遍知也。苑師云：阿，此云無；耨多羅，翻上；三藐，翻正也；三，遍也，等也；菩提，覺也。孤山疏云：極果超因，故云無上。正則正觀中道，等則雙照二邊，蓋果上三智也。發軫云：無上，是理；正等覺，是智。正謂正中，即一切種智寂滅相也。等謂平等，即行類相貌如實知也。裴相國云：是諸佛所證最上妙道，是眾生所迷根本妙源。故凡夫流浪六道，由不發此菩提心故。今得人身，起慶幸意，當須秉心，對佛像前，燒香散華，三業供養，立四弘誓，發成佛心。故華嚴云：菩提心者，名為種子，能生一切諸佛法故。發此心者，須識其體。體有二種，一曰當體，二曰所依體。其當體者，所謂悲心、智心、願心，此三種心，乃是當體。所依體者，自性清淨圓明妙心，為所依體。性自具足，號如來藏。惑不能染，智無所淨，虛寂澄湛，真覺靈明，能生萬法，號一大事。但由群生久迷此信，唯認攀緣六塵影像，乍起乍滅虛妄之念，以為自心。一迷為心，決定惑為色身之內。不知色身外洎山河，虛空大地，咸是妙明真心中物。此之心體，如肇師云：微妙無相，不可為有；用之彌勤，不可為無。度一切諸佛境界經，文殊言：菩提者，無形相、無為。云何無形相？不可以六識識故。云何無為？無生住滅故。裴相國云：性含萬德，體絕百非，如淨月輪，圓滿無缺。惑雲所覆，不自覺知，妄惑既除，真心本淨。性含萬德故，在聖不為得；體絕百非故，居凡不為失。然欲發此心者，當運慈悲而為宗要。故華嚴海雲比丘告善財言：發菩提心者，所謂發大悲心，普救一切眾生故；發大慈心，等祐一切世間故。一切群彙（音謂），本無生死，妄風飄鼓，汨（音骨）沒苦海。今發大願，黑暗崖下，誓作明燈；生死波中，永為船筏。此起悲心拔眾生苦。一切凡夫，本性具足性淨功德，今迷寶藏，貧窮孤露。今啟洪願，誓與群萌無上佛果究竟之樂，如一眾生未成佛，終不於此取泥洹，願舉修途之初步，宜運成山之始簣（求位切）。崇德廣業，不倦終之（余昔住大覺時，有王仁林垂訪，問曰：佛道若云易成，經云佛道長遠，久受勤苦，乃可得成。若云難成，安云一稱南無佛，皆已成佛道？余即答曰：了性，則見本是佛，依自圓修乃易。昧性，則欲求作佛，依他別修乃難。慕圓宗者，起信樂心，纔舉念時，已作如來真子；如回向際，便成無上菩提）。",
    "菩提": "肇師云：道之極者，稱曰菩提。秦無言以譯之。後代諸師，皆譯為道，以大論翻為佛道故。今問：如周易曰：立人之道，曰仁與義。此則儒宗仁義為道。莊子曰：虛靜恬淡，寂寞無為者，天地之平，而道德之至。此則道家以虛無為道。今釋氏宗以何為道？答曰：般舟經云：諸佛從心得解脫，心者清淨名無垢，五道鮮潔不受色，有解此者大道成。是知吾教以心為道，心乃自性清淨心也。其體湛寂，其性靈照，無名無相，絕有絕無；心不能思，口不能議，褒美稱為第一義諦。或者問曰：如淨名云：菩提者，不可以身得，不可以心得。今安以心而為道耶？答：究乎菩提非身心者，如肇師云：無為之道，豈可以身心而得乎？故度一切佛境界經云：菩提者，不可以身覺，不可以心覺。何以故？身是無知，如草木故；心者虛誑，不真實故。是故菩提非身心也。然淨名中卻云：諸佛解脫，當於眾生心行中求者。天台釋云：今觀眾生心行，入本性清淨智。窮眾生心源者，即顯諸佛解脫之果。如勸求水，不得離冰，寒雖結水成冰，暖則釋冰為水。故華嚴云：若能善用其心，則獲一切勝妙功德。凡夫由昧心源，故隨妄念。能於妄念深照性空，名解大道。故華嚴云：體解大道，發無上心，此心智發，能為佛母，號曰智度。是故智度亦名大道。故大論云：智度大道佛善來，如用此智修習萬行，其所修法亦名大道。故法華云：為滅諦故，修行於道。由道是心，其性虛通，遍一切法，無非是道。如金色女問文殊：云何謂為道？答曰：汝則為道。又喜根云：婬欲即是道，恚癡亦復然。如此三事中，無量諸佛道。今問：婬事穢污，佛道清淨。安指穢事，名為淨道？答：觀婬怒癡，相同水月，了染淨體，性如虛空。遇順無著，逢違不瞋，於惡境界，得解脫門。乃行非道，通達佛道。是名無礙人，一道出生死。若起凡見，成地獄業。如熱金圓，取必燒手。如是無為，名道人也。",
    "阿婆磨": "大論翻云無等等。佛名無等，般若波羅蜜利益眾生，令與佛相似，故名無等等。",
    "目帝羅": "此云解脫。荊溪淨名記云：若正用功，上可作古買切，下作恥活切。功成之日，上應作戶賈切，下應作徒活切。智論云：解脫知見者，用是解脫知見，知是二種解脫相，有為、無為解脫。知諸解脫相，所謂時解脫、不時解脫、慧解脫、俱解脫、壞解脫、不壞解脫、不可思議解脫、無礙解脫等。分別諸解脫相牢固，是名解脫知見無減（云云）。問曰：解脫知見者，但言知。何以復言見？答：言知言見，事得牢固。譬如繩二合，為一則牢堅。復次：若但說知，則不攝一切慧。如何毗曇所說：慧有三種：有知非見，有見非知，有亦知亦見。有知非見者：盡智、無生智、五識相應智。有見非知者：八忍、世間正見、五邪見。有亦知亦見者：餘殘諸慧。若說知，則不攝見；若說見，則不攝知。是故說知見，則具足。肇曰：縱任無礙，塵累不能拘，解脫也。什曰：亦名三昧，亦名神足。或令脩短改度，或巨細相容；變化隨意，於法自在，解脫無礙，故名解脫。又曰：心得自在，不為不能所縛，故曰解脫。淨名疏云：一真性，二實慧，三方便。故經云：諸佛菩薩有解脫，名不思議。若菩薩住此解脫者，能以須彌之高廣，內芥子中，乃至種種變現莫測，即是三種解脫不思議義。何者？諸菩薩有解脫，即是真性。若菩薩住此者，即是實慧。能以須彌內於芥等，即是方便。大品云：心得好解脫，慧得好解脫。垂裕云：心脫是俱，慧脫是慧。",
    "阿惟顏": "應法師引十地經，謂一生補處。",
    "阿鞞跋致": "亦名阿惟越致。此云不退轉。不退有三義：入空位不退；入假行不退；入中念不退。妙樂云：般若是位，離二死故；解脫是行，諸行具故；法身是念，證實境故。智論云：無生忍法，即是阿鞞跋致地。",
    "膩地": "此云依。法華疏云：利物以慈悲入室為首，涉有忍辱為基，濟他以忘我為本。能行三法，大教宣通，即世間依止，名為法師。垂裕記云：皆言依者，以內有道法，可為人天依止。依者，憑也。於佛滅後，憑此四人取解故也。涅槃四依品云：有四種人，能護正法，為世所依。初依示為小乘內凡像，故經云：具煩惱性，能知如來祕密之藏。二依示為須陀洹像，三依示為斯陀含、阿那含像，四依示為阿羅漢像。智者云：涅槃四依，義通別圓。若作別義者，如古師云：地前名初依，登地至三地名須陀洹；五地名斯陀含，是第二依；七地名阿那含，是第三依；八地至十地名阿羅漢，是第四依。若作圓義者，準望別教，以住前為初依，十住為二依。又始終判者，五品六根為初依，十住為二依，行向為三依，十地等覺為四依。四果配位，例別可見。此人四依。二行四依。律明：糞掃衣、長乞食、樹下坐、腐爛藥，此四種行，上根利器所依止故。三法四依，涅槃云：依法不依人；依義不依語；依智不依識；依了義經，不依不了義經。",
    "摩訶衍": "大論云：摩訶，此含三義，謂大、多、勝。衍是乘也。勝鬘云：摩訶衍者，出生一切聲聞緣覺世出世間善法。世尊，阿耨大池，出四大河。起信云：摩訶衍者，總說有二種：一者法，二者義。所言法者，謂眾生心，是心則攝一切世間出世間法。依於此心，顯示摩訶衍義（云云）。",
    "陀羅尼": "大論：秦言能持。集種種善法，能持令不散不失。譬如好器盛水，水不漏散。惡不善根心生，能遮令不生。若欲作惡罪時，持令不作，是名陀羅尼。肇翻總持，謂持善不失，持惡不生。又翻遮持。輔行云：體遮三惑，性持三智。熏聞云：遮二邊之惡，持中道之善。此從慧性立名。闡義云：然則陀羅尼，既是梵語，咒字即當華言，經題華梵雙標，故云陀羅尼咒。若亦何故云陀羅尼翻遮持耶？答：古人見祕密不翻。例如此土禁咒等法，便以咒名往翻。然亦不失遮持之義。何者？咒既訓願，如菩薩四願：二願拔苦，即遮惡義；二願與樂，即持善義。大論明三陀羅尼：一、聞持陀羅尼。得此陀羅尼者，一切語言諸法，耳所聞者，皆不忘失，即是名持。二、分別知陀羅尼。得是陀羅尼諸眾生，諸法大小好醜，分別悉知，故分別陀羅尼，即是義持。三、入音聲陀羅尼。得此陀羅尼者，聞一切語言音聲，不喜不瞋；一切眾生如恆沙等劫壽，惡言罵詈，心不憎恨；一切眾生如恆沙等，以讚歎供養，其心不動，不喜不著，是為入音聲陀羅尼，即是行持也。法華明三陀羅尼：一、旋陀羅尼，二、百千萬億旋陀羅尼，三、法音方便陀羅尼。淨名疏釋云：旋者，轉也。轉假入空，得證真諦。百千萬億者，即是從空入假，旋轉分別，破塵沙惑，顯出恆沙佛法。法音方便者，即是二觀方便，得入中道。",
    "薩怛多般怛羅": "資中曰：相傳云是白傘蓋，喻如來藏，性本無染，遍覆有情也。",
    "蘇盧都訶": "此云梵音決定。毗婆尸佛說此一咒，治一萬八千種病。",
    "胡蘇多": "此云除一切鬱蒸熱惱。式棄佛所說咒也。",
    "蜜奢兜": "此云金鼓。隨葉佛所說咒，四拘留秦佛說金剛幢咒，五拘那含牟尼佛說名聲振十方咒，六迦葉佛說拯濟群生咒，七釋迦世尊說金光照輝咒。",
    "阿牟伽皤賒": "此云不空罥索。",
    "呾伱也他": "或呾姪他，此翻所謂。",
    "娑婆訶": "或莎訶。此翻善說，又云散去。",
    "薩婆若多": "般舟經名薩雲若。大論云：秦言一切智相。因名般若，果名薩婆若。大品云：薩婆若，是聲聞辟支佛智；道種智，是菩薩摩訶薩智；一切種智，是諸佛智。經曰：欲以一切智斷煩惱習，常習行般若波羅蜜。論問：一心中得一切智，一切種智，斷煩惱習。今云何言以一切智具足，得一切種智；以一切種智，斷煩惱習？答：實一切智一時得，此中為令人信般若波羅蜜，故次第差別品說。",
    "爾燄": "或名爾炎，此云所知，又云應知，又云境界。問：如大論云：是時過意地，住在智業中。華嚴安云：普濟諸含識，令過爾燄海。答：由此能知之智，照開所知之境，是則名為過爾燄海。故楞伽經第一曰：智爾燄得向。此乃全由其境，以成其智，名智業中。",
    "多伽梢": "或多伽羅，此翻根智。維摩云：智度菩薩母。淨名疏云：智度即是實智，實智有能顯出法身力故，如母能生。實智，亦名如理智。正觀真諦，如理而知，則無顛倒。攝論云：順理清淨，名如理智。十八空論云：如理智，即無分別智，亦名正智，又名真智，又名根本智。",
    "漚和俱舍羅": "此云方便。維摩云：方便以為父。肇師云：方便即智之別用耳。智以通幽窮微，決定法相，無知而無不知，謂之智也。雖達法相，而能不證，處有不失無，在無不捨有，冥空存德，彼我兩濟，故曰方便。什曰：智度雖以明照為體，成濟萬行，比其功用，不及方便為父。梵音中有父義。方便有二種：一、解深空而不取相受證，二、以實相理深莫能信受。要須方便誘引群生，令其漸悟。方便義深而功重，故為父也。淨名疏云：方便是權智，權智外用，能有成辦，如父能營求長成。所言權智，亦名如量智，遍觀俗諦，如事數量，則攝一切。又云：方是智所詣之偏法，便是菩薩權巧用之能。巧用諸法，隨機利物，故云方便。十八空論云：如量智，即無分別後智，亦名遍智，又名俗智，又名後得智。佛性論云：又此二智，有二種相：一者無著，二者無礙。言無著者，見眾生界自性清淨，是如理智相也。言無礙者，能通達觀無量無邊諸世界故，是如量智相也。又如理智為因，如量智為果。言為因者，能作生死及涅槃因；言為果者，由此理故，知於如來真俗等法。又如理智，是清淨因；如量智者，是圓滿因。清淨因者，由如理智，三惑滅盡。圓滿因者，由如量智，三德圓滿。又如理智，即一心之體為因；如量智，即一心之用為果。二教論云：釋氏之教，理富權實。有餘不了，稱之為權；無餘了義，號之為實。由此權實二智，而設權實二教也。北山云：真道焉，可以修身；權道焉，可以御化。真道不可以暫廢，故混而不滓；權道不可以久立，故捨而合道也。荊溪云：法華疏中，為顯實故，分為三釋：謂法用、及門、并祕妙也。今此廢二，但取法用者，門論趣入，祕妙開權。今未開權，故缺後釋。不取門者，菩薩可入，二乘缺之。於菩薩中，且約當分，復置傳入，故且不云。據理亦合用門，一意以當分入，與法用同，故且唯用法用。一意又通祕教，亦可具足用彼三意。論法華方便品：儒詩六義，以思無邪為指歸。釋教五時，開佛知見是究竟。誠一化之高會，真諸佛之宗極，似太虛而含眾色，若渤澥（胡買切）以納群流。由是管窺義天，蠡（音螺）酌法海，麤研味乎真詮，豈塵露於達士。初辨品題，次論品義。初辨品題者，經云：諸佛法久後，要當說真實。文既斥其方便，題應號為真實，安以權名而立今品？如將縣額以牓州門。又佛起定，即自唱言：諸佛智慧，甚深無量。此乃雙歎權實。先達遂云：此華不有則已，有則華果雙含；此經不說則已，說則權實雙辨。經既雙明權實，題那單標方便。由此疑興，先達相繼，共立七義，以伸題意。一，權有顯實之功。法在初化，機緣未熟，隱實施權，權掩於實。靈山妙唱，普會權乘，決了聲聞法，是諸經之王。彼秘被開，於今成妙，此權既有顯實之功，故結集家號善權品。二，名偏義圓。若標真實，則違方便。今品權名雖偏，其實法體圓具，乃彰權實之雙美。三，名體俱不轉。此有四句，一名轉體不轉，如云正直捨方便，但說無上道。乃至第四，名體俱不轉，如云我等今者真是聲聞。名不轉故，名方便品。四，顯開權絕待。法華開權顯實，權外無實。法用能通，當體祕妙。若標真實，但成相待，為彰絕待之功，號方便品。五，彰詮迷之教。祖云：自非今經，誰肯歎此詮迷之教？由指迷染之心，即是自行方便。則知此權，大有詮迷之力。六，施開一致。昔時所施，既施即實之權。今日所開，還開權即是實，乃見施開之不二也。七，揀異昔經。淨名報恩，雖皆立方便之名。既是體外之權，豈同今品同體方便。自昔所說，不出此七。先師謂舊覼（落戈切，委曲也）縷，義失至當。自立附文、原意二義，以伸品題：一、附文者，經家立品附文旨趣，總別須分。何哉？五字首題，法則權實總標，喻乃華果雙舉。所以三周開顯本跡二門，一部之文，並皆不出權實之法。今品若更雙立權實之目，則與總題無異。二、原意者，言者所以在意，此經開權顯實，意在於權。故云過去諸佛，以無數方便，種種因緣，種種譬喻，而為眾生演說諸法，是法皆為一佛乘故，非權無以明實。故令機緣，即於權法以曉真實，故曰不指所開，無由說實，具述施權，意在開也。故記主釋開方便，門示真實相云。示，謂指示，指其見實之處。且見實之處在何？在前偏權方便。今日說此方便有真實相，此既即實之方便，乃異昔經之方便，故得祕妙之名。是故經家題名方便。纔言方便，即是真實。故身子疑云：何故殷勤稱歎方便？則知方便，真開權之總號，誠顯實之大名矣！或者問日：今由開權稱方便者，淨名既未開權，安稱方便？既稱方便，權何不開？答：彼經言方便者。疏云：此品正明助佛闡揚，善巧權謀，隨機利物，令入慧起根，故名方便。雖言方便，機緣當座，烏知所證，亦方便焉。故昔方便之名，權未開矣。次論品義者，吾祖預釋品題，乃立法用、能通、祕妙三種方便，今先通示，然後別解。且通示者，此三方便，初二從昔教，後一屬今經。初明法用者，疏曰：方者，法也；便者，用也。法有方圓，用有差會。三權是矩是方，一實是規是圓。記云：初約能用三教得名，法是所用，用是能用，雖法之與用，俱通四教，但有方圓差會之殊，故方便之稱，從權立名。權不即實，故對昔辨，成體外權，非今品意。文中舉圓，即屬真實，相對來耳。二名能通者，疏云：又方便者，門也。門名能通，通於所通。方便權略，皆是弄引，為真實作門，真實得顯，功由方便，從能顯得名。記曰：次第二釋，權屬能通，三教亦得名為方便。然雖不即以能為圓，作遠詮故，所詮之圓，亦帶能詮為方便故。故知並非今品意也。又云：今以三詮一，三為一實作詮，故三名能詮，是則前之三教，教行人理，悉為能詮。又云：不破不即，從權入實，故得修名。若於爾前，二味三教，利根菩薩，有顯露得；兩教二乘，唯祕密得。由得入故，即稱為門。三名祕妙者，疏云：方者，祕也；便者，妙也。妙達於方，即是真祕。點內衣裏無價之珠，與王頂上唯有一珠，無二無別；指客作人是長者子，亦無二無別。如斯之言，是祕是妙，如經：唯我知是相，十方佛亦然，止止不須說，我法妙難思。故以祕釋方，以妙釋便，正是今品之意。記云：至第三釋，方乃三權，即是一實。指此即實之權，方名今經方便。又云：第三釋者，即今品意。但前二釋，於昔但得名偏名門，祕而不說。今開其偏門，即圓行也，故云祕妙。顯露彰灼，故云真祕。或問：妙樂記云：即權而實，為所依體；即實而權，為當體體。不審第三祕妙之名，為從所依立號，為從當體得名？答：此由當體，即所依體。故云彼祕被開，於今成妙。又云：第上文者，亦開前三，非能非所。及以能通，並開成所。所中善巧，名為方便。故妙方便，異於方法，及能通門。又云：故隔偏之圓，亦有體內方便，故名祕妙。祕妙之名，似同第三，然其意則別。何者？第三乃以開顯為妙，此中乃以獨圓為妙。此揀今昔，祕妙義異。諦思吾祖，崇建三釋，若無初二，豈彰為蓮？故華以施權，苟缺第三，烏顯華開蓮現而顯實。禮遍一化，妙彰七軸。非發總持，誰唱斯義？鑽（借官切）仰堅高，嗟歎不足。次別釋者，若約部教，初二屬昔教，法用能通，皆異體權。後一屬今經，祕妙方便，名同體權。定此祕妙方便破顯之相。先德彝（音夷）訓，或定為所破，或執是所顯。天竺一宗，論同體權，定為所破。一據蓮華開喻，原佛出世，意為顯實。由機未堪，權施昔教，此譬桃李華也。及至法華，法既純圓絕妙，遂指蓮華而立三喻：一、為蓮故華，譬為實施權。蓋四時未說施權，此名異體。今無量義，既言從一清淨道，施出二三四。收昔異體，為今同體。權既從實而施，故譬為蓮故華。第二、華開蓮現，此開初句之權華，乃顯次句之蓮實。故五佛章中，各有開權、顯實二科。開權是文敘昔教，以為顯實之所。故無量義經之同體，為今法華之所破。第三、華落蓮成，此譬廢權立實。都廢序分即實之權，獨立正宗即權之實。次憑權暫用義，權名權暫，用已還廢；實名實錄，究竟指歸。則知十隻之權，皆為所破。如心意識既是事權，豈屬所顯矣！三、準祖師定解，如輔行云：解同體之權髻，與實相之明珠。又義例云：如引法華，部唯一實。文敘昔教，以為所開。既云部唯一實，故同體權，為所破也（近人又謂：從名雖開，從義不開，如圓家破即法性之無明。例今品開即實之權耳）。余觀先德破同體權，一、迷立喻，二、昧開權。初、迷立喻者，為蓮故華。如大師云：為十妙故，開出十麤。如為蓮故華，此約法體，用在於昔，皆屬麤法。云何一槩以為蓮故華？俱喻妙法，乃見能譬，立喻淆混。其次、所況為實施權，始自華嚴，終乎般若，皆是隔歷三諦，俱為法華之實，而施四時三教之權，故名為實施權。若獨以此句，喻無量義經，則彰所喻，法缺略矣。二、昧開權者，四時三教，體外化他，機未純淑，覆權言實，故非究竟，屬異體麤。至今方指昔未真實，執教偏情既遣，即知當體本妙。開此化他之法，全是自行之權。權實不二，乃名同體。故祖師云：既顯實已，全權是實，不可謂之權非究竟。況祖師云：誰肯以三界有漏識心，而為佛所稱讚。既佛所讚，安非所顯。次定所顯者，南屏一宗，皆謂世尊疇昔久轉法輪，所化之機既雜，所施之教不一。雖說三教，不言此是即實之權。雖演圓乘，未云斯是即權之實。權實各逗，大小相隔，是故昔教名異體權。後會靈山，宣妙法華，開昔隱祕之法，為今微妙之教，權實圓融，故名同體。法既麤妙相即，佛化事理俱圓。若為所破，乃成開妙。故記文云：第三釋者，即開前二，非能非所，及以能通。並開成所，可證祕妙，非所開矣！其如蓮華三喻，輔行等文，復有五師，消釋義異：一云對論、自論有殊。若約偏圓相對，異體是所破，同體是所顯。例前三教三惑須斷，圓教三惑不斷。就圓自論，須斷四十二品。故同體權，亦屬所破。今謂偏圓對論，前三名權，圓教屬實，那得對論，卻以圓教名同體權，不須破耶？又今開權顯實，開偏是圓，正當偏圓對論，反以蓮華三喻，謂之圓教自論，破同體權，卻顯今經都無開權之力乎？二云機情佛意。機情雖開異體，佛意即是同體。今謂誇節唯在今經，佛意非適今也。據此祖意，對機開顯，唯局法華，原佛密意，俱遍四時。是則機情佛意，正約昔說。若約昔義，以斷今經，其猶欲至湖南，面行塞北，其心雖切，路逾遠矣。三云法本自妙，麤由物情。雖開異體之權，其實法體本自微妙，即是同體。今謂如記主云：但開其情，理自復本。又云：開何所開，即彼能覆。既但破能覆之情，奚嘗開所迷之法？四云約開竟說，以輔行解同體之權髻，既點跡門流通之經，此約已開異體，成同體竟。今謂安樂行品，文雖在後，喻乃顯前。特點正宗，開麤顯妙，斯言無旨，徒虛語耳。五云同體為所開者，意彰異體亦不可破。此語孟浪，吾驚怖其言，猶河漢而無極也。今覈昔人，由昧山家諸部文義，致論開權，詞繁理寡。今鱗比諸文，令冰解凍釋，殊塗同歸。初釋喻，舊辨蓮華，或專喻妙，或兼比麤（餘華對辨，則蓮華俱妙。就蓮自分，華亦兼麤）。今究所喻既有權實，乃顯能喻亦通麤妙。今先分所喻權實，後辨能喻麤妙。分權實者，提挈綱要，大有五義：一、因果，二、九一，三、今昔，四、真俗，五、本跡。初，因果分者。以十界中，前七如是屬因，是權。果報二如是為實。二，九一分權實。妙玄云：餘華麤，喻九法界十如是因果。此華妙，喻佛法界十如是因果。三，約今昔分者。以昔為權，將今為實。故妙玄云：一為蓮故華，譬為實施權；雖說種種道，其實為佛乘。四，約真俗分者。空智照真為實，假智照俗為權，中智雙照為亦權亦實，中道雙亡為非權非實。故妙樂云：以對昔故，須為四句。通論大綱，法相雖爾，別論今品，唯在第三，亦權一半，名方便品。五，約本跡分者。如私序云：指久遠之本果，喻之以蓮；會不二之圓道，譬之以華。權實雖通五義，今唯約界，及與部教，以論開權矣。次明能喻麤妙者，玄義序乎蓮華：一、為蓮故華，譬為實施權；二、華敷譬開權，蓮現譬顯實；三、華落譬廢權，蓮成譬立實。當歷三喻，引而伸之。且夫蓮華之喻，唱出今經，本況妙法。而天台以初為蓮故華一句，既譬為實施權。約此法體，用在昔時，華喻麤法。故妙玄云：又諸教權實未融，為權；既融開權顯實，為實。由昔赴機，權掩於實，乃名異體。由是今經破此偏情，乃云：雖說種種道，其實為佛乘。世尊既談為實施權，吾祖遂立為蓮故華之喻。據此說，在今經纔唱為實施權，利根便知此權即實。由無量義，曾聞此權從實生故，已破異體之見，但未開顯。鈍根須假第二句，華敷譬開權，蓮現譬顯實。故曰：開方便門，示真實相。記主釋曰：指實為權，權掩於實，名方便門閉。今指權為實，於權見實，名方便門開。此點法用能通，俱成祕妙。三、華落譬廢權，蓮成譬立實。又云：正值捨方便，但說無上道。此由四時三教，當體祕妙，開已無外，麤法不存，義當於廢。約法雖開廢同時，約喻乃先開後廢。故分三句，彰始終之有序。二、釋經云：開方便門，示真實相。昔人引證，開同體權，須曉祖師二處引用，疏證能通方便，此取門義，從前三教能通之門，入於圓所，故曰開方便門。記主遂云：於昔但得名偏名門，非謂於彼己明開門。若玄義中證開權者，既於方便即見真實，故以此證開權相焉。三、釋輔行解同體之權髻，與實相之明珠。由安樂行，約王賞賜，喻佛授道。昔機與魔共戰，微有其功，但賜禪定解脫之法，如賞田宅。法華大破魔網，至一切智，如王解髻明珠賜之。昔時權掩於實，如髻覆珠，就機不知是權，喻異體閉。今經赴機，指昔三教權法，全是祕妙方便。故決聲聞之法，即是諸經之王。經既以王喻佛，約佛開異體時，無非同體，故曰解同體之權髻矣。四、釋義例。如引法華，部唯一實，文敘昔教，以為所開。天竺引此部唯一實，證破同體。今謂所敘麤法，既點為妙，權實相即，能所圓融，故謂法華唯一實耳。五、釋科目。五佛章門，皆有開權顯實二科。前四則先開權，次顯實。今佛乃先顯實，次開權。天竺乃謂開權是文敘昔教，顯實乃破同體權。今謂纔開權時，意已顯實。但約說次第，開權言未顯實，顯實方曉開權。立言垂範，遂分二科。故法明講主云：言無並出，語不頓施，殊有旨哉！余慕法王之遺教，學而時習之。遂括古今之論，以究權實之道。雖不足品藻淵流，庶亦無乖商搉。編贈後賢，願開佛慧。",
    "阿提阿耨波陀": "阿提，秦言初；阿耨波陀，秦言不生。大品云：阿字門，一切法初不生。智論云：得是字阿羅尼菩薩，若一切語中聞阿字，即時隨義。所謂一切法從初來不生。二教論曰：萬化本於無生而生，生者無生。三才肇於無始而始，始者無始；然則無生無始，物之性也。有化有生，人之聚也。中論云：諸法不自生，亦不從他生。不共不無因，是故說無生。止觀云：若心具者，心起不用緣；若緣具者，緣具不關心；若共具者，未共各無，共時安有？若離具者，既離心離緣，那忽心具？今問：佛教因緣為宗，論遣共生，應屬所破耶？答：單真不立，獨妄難成。因緣和合，從顛倒說。今觀實相，豈可順迷？故曰：應照理體，本無四性。又復自行雖離四執，化他無妨四說。經說自生云：三界無別法，唯是一心作。經說他生云：善知識者，是大因緣。或云：五欲令人墮惡道。或說共生云：水銀和真金，能塗諸色像。或說離云：十二因緣，非佛所作，其性自爾！華嚴云：唱阿字時，入般若波羅蜜門。名以菩薩威力，入無差別境界。疏云：阿者，入無生義，無生之理，統該萬法。菩薩得此無生，達諸法空，斷一切障。",
    "羅闍": "大論：秦言垢。大品云：羅字門，一切法離垢故。華嚴經云：唱多字門，入無邊差別門。疏云：彼經第二當囉字，是清淨無染離塵垢義。今云多者，應是譯人之誤。",
    "遮梨夜": "秦言行。大品云：遮字門，一切法終不可得故。論曰：若聞遮字，即知一切諸行皆非行。今加釋曰：行始名因，行終名果。弘明集云：纖芥之惡，歷劫不亡，毫釐之善，積世長存。福成則天堂自至，罪積則地獄斯臻。此乃必然之數，無所容疑。若造善於幽，得報於顯，世謂陰德，人咸信矣！造惡於顯，得報於幽，斯理灼然，寧不信耶？又云：聖人陳福以勸善，示禍以戒惡。小人謂善無益而不為，謂惡無傷而不悔。夫殃福蓋有其根，不可無因而妄致。善惡當收其報，必非無應而徒已。又云：然則法王立法，周統識心。三界牢獄，三科驗定：一罪、二福、三道。罪則三毒所結，繫業屬於鬼王；福則四弘所成，我固屬於天主；道則虛通無滯，據行不無明昧；昧則乘分大小，智涉信法；明則特達理性，高超空有。又云：福者何耶？所謂感樂受以安形，取歡娛以悅性也。今論福者，悲敬為初。悲則哀苦趣之艱辛，思拔濟而出離；敬則識佛法之難遇，弘信仰而澄神。緣境乃涉事情，據理惟心為本，虛懷不繫，其福必回於自他。倒想未移，作業有乖於事用。今觀弘明，所立三科，其名雖美，所釋三義，其旨猶失。以論十界，淆混不分。今謂十使十惡，此屬乎罪，名為黑業，報四惡趣。五戒十善，四禪四定，此屬於福，名曰白業，報處人天。三乘摩訶衍，此屬乎道，感報四聖，此則凡聖界分，因果事定。以此三科，收行盡矣。大論云：或說三行：身行、口行、意行。身行者，出入息，所以者何？息屬身故。口行者，覺觀，所以者何？先覺觀，然後語言。意行者，受想，所以者何？受苦樂，取相心發，是名意行。心數法有二種：一者屬見，二者屬愛。屬愛主名為受；屬見主名為想。以是故，說是二法為意行。華嚴唱者字門，名普輪斷差別。疏云：者字，諸法無有，諸行既空，遍摧差別。",
    "那": "秦言不。大品云：那字門，諸法離名性相，不得不失故。論曰：即知一切法，不得不失，不來不去。華嚴唱那字門，名得無依門，名得無依無上。疏云：那者，諸法無有性相，言說文字，性相雙亡，故無依。能所詮泯，謂無上。",
    "邏求": "秦言輕。大品邏字門，諸法度世門故。亦愛枝因滅故。論曰：若聞邏字，即知一切法離輕重相。華嚴唱邏字門，名離依止無垢。疏云：邏字，悟一切法離世間故。",
    "陀摩": "秦言善。大品陀字門，諸法善心生故，亦施相故。論曰：即知一切法善相。華嚴唱柁（輕呼）字門，名不退轉方便。疏云：悟一切法，調伏寂靜，真如平等，無分別故，方為不退轉方便。南山云：策勤三業，修習戒行。有善起護，名之為作；作而無犯，稱之曰持。音義指歸云：持者，執也。執持所受之法，猶若捧珠執玉也。犯者，干也。謂干犯所受之法，略無護惜，如珠落玉墮也。善者，順也。起信云：以知法性體無慳貪故，隨順修行檀波羅蜜；以知法性無染，離五欲過，隨順修行尸波羅蜜；乃至以知法性體明，離無明故，隨順修行般若波羅蜜。以善是順義，積善之家，必有餘慶。故太戊之時，桑穀生朝，一暮大如栱，王懼。伊陟曰：臣聞妖不勝德，帝德有闕。太戊從，而桑穀枯死，殷道中興。積不善之家，必有餘殃。故帝辛之時，有雀生烏，在城之隅。太史占曰：以小生大，國家必昌。帝辛驕暴，不修善政，殷國遂亡。經云：勿謂小罪以為無殃，水滴雖微，漸盈大器。然或執自然之道，專非報應之說，蓋為善而召禍，此亦多矣！為惡以致福，斯不少焉！故佛名經云：行善者觸事轗軻，行惡者是事諧偶。致使世間愚人，謂之善惡不分。如堯帝德化而值洪水，湯王善政而遭久亢，閔損行孝以家貧，顏回修仁而壽夭。遂謂貴賤自因命致，愚智盡由天賦，妍醜本出自然，貧富非是業感。乃曰：誰尖荊棘畫禽獸？誰鑿江海與川源？暴風卒起還自止，萬物須知是自然。不省聲和響順，奚曉影直形端；不了三種之報差殊，焉悟萬劫之行有異？故云：行惡得樂，為惡未熟，至其惡熟，自見受苦。修善遇苦，為善未熟，至其善熟，自見受樂。故大涅槃經明三種報：一，順現報。明主孝慈訓世，則祥雲布，壽星現。仁君恩德及物，則醴（音禮）泉涌，嘉苗秀。善既有徵，惡亦可驗。樵客指熊而臂落，酒客啖炙以皮穿。二，順生報。今世雖行善惡之因，次生方受苦樂之果。缾沙轉報於四天，有相改生於六欲。三，順後報。因造今身，報終後世。伽吒七反而享餘慶，那律久劫以受遠福。此三種報，皆名定業。又涅槃云：未入我法，名決定業；若入我法，則不決定。大品云：菩薩行般若故，所有重罪，現世輕受。智論釋云：又如王子雖作重罪，以輕罰除之，以是王種中生故。菩薩亦如是，能行般若得實智慧故，即入佛種中生。雖有重罪，云何重受？青龍疏云：不定有三：謂時定報不定，報定時不定，時報俱不定。此中所轉，是第二句。何者？由報定故，轉重令輕。由時不定故，墮惡道業，人間現受。其餘二句，一切都滅。是故釋氏，指虛空世界，悉我自心。考善惡報應，皆我自業。則知三界循環，斯皆妄識；四生磐泊，並是惑心。故古德云：皆本一心，而貫諸法也。",
    "婆陀": "秦言縛。大品婆字門，諸法婆字門離故。論曰：即知一切法無縛無解。華嚴唱婆（蒲我切）字門，名金剛場。疏云：悟一切法離縛解故，方入金剛場。",
    "茶闍他": "秦言不熱。大品茶字門，諸法茶字淨故。論曰：即知諸法無熱相。華嚴唱茶（徒解切）字門，名曰普輪。疏云：悟一切法離熱矯穢，得清涼故，是普摧義。",
    "沙": "秦言六。大品云，沙字門，諸法六自在王性清淨故。論曰：即知人身六種相。華嚴云：唱沙（史我切）字門，名為海藏。疏云：悟一切法無罣礙，如海含像。",
    "和波陀": "秦言語言。大品和字門，入諸法言語道斷。論云：知一切法離語言相故。華嚴唱縛字門，名普生安住。疏云：悟一切法言語道斷故。",
    "多他": "秦言如。大品多字門，入諸法如相不動故。論云：諸法在如中不動故。華嚴唱哆（都我切）字時，名圓滿光。疏云：悟一切法真如不動故。",
    "夜他跋": "秦言實。大品夜字門，入諸法如實不生故。論云：諸法入實相中不生不滅。華嚴唱也（以可切）字時，名差別積聚。疏云：悟如實不生故，則諸乘積聚皆不可得。",
    "吒婆": "秦言障礙。大品吒字門，入諸法制伏不可得故。論云：知一切法無障礙相。華嚴唱瑟吒字時，名普光明，息煩惱。",
    "迦邏": "秦言作者。大品迦字門，入諸法作者不可得故。論云：知諸法中無有作者。華嚴唱迦字時，名無差別雲。疏云：作業如雲，皆無差別。",
    "娑娑": "秦言一切。法苑云：一以普及為言，切以盡際為語。大品娑字門，入諸法時不可得故，諸法時來轉故。論云：即知一切法，一切種不可得。一切有二種：一者名字一切，如云：一切皆懼死，無不畏刀杖；無色無身，不畏刀杖。此名字一切也。二者實一切。大品云：一切者，所謂內外法是，二乘能知不能用，一切道起一切種。華嚴唱娑（蘇我切）字時，名降霔大雨。疏云：即平等性。",
    "磨磨迦羅": "秦言我所。大品磨字門，入諸法我所不可得故。論曰：若聞磨字，即知一切法離我所故。肇曰：我為萬物主，萬物為我所。又生公曰：有我之情，自外諸法，皆以為我之所有。淨名疏云：內心法想為我，計十法界為所。華嚴唱磨字時，名大流湍激，眾峰齊峙。疏云：即我所執性，我慢高舉，若眾峰齊峙。我慢則生死長流，湍馳奔激。",
    "多他阿伽陀": "秦言如去。大品他字門，入諸法處不可得故。論曰：即知四句如去不可得。華嚴唱他（他可切）字時，名真如平等藏。疏云：即是杜處所性。",
    "闍提闍羅": "秦言生。大品闍字門，入諸法生不可得故。論曰：即知諸法生老不可得聞。華嚴唱社字時，名入世間海清淨。疏云：即能所生起。（闍音社）。",
    "簸": "大品簸字門，入諸法簸字不可得故。論曰：若聞濕波字，即知一切法如濕波字不可得。濕波字無義，故不釋。華嚴唱鎖字時，名念一切佛莊嚴。疏云：即安隱性。",
    "䭾摩": "秦言法性。大品䭾字門，入諸法性不可得故。論曰：即知一切法中法性不可得。唯識論明三性：一、遍計所執性，六七二識，遍於染淨一切法上，計實我法，名遍計所執，如繩上蛇。頌曰：由彼彼遍計，遍計種種物。此遍計所執，自性無所有。二、依他起自性，染淨諸法，依他眾緣而得生起，故云依他，如麻上繩。頌云：依他起自性，分別緣所生。諸心心所依他起故，亦如幻事非真實有。為遣執心心所外實有境故，說唯有識。若執唯識真實有者，亦是法執。三、圓成實性，唯一真空圓滿成實，唯麻獨存。唯識頌云：圓成實於彼，常遠離前性。證真云：言於彼者，即於彼依他法上，遠離遍計所執，便名圓成實性。古師總釋云：圓成是真，遍計是妄；依他淨分同真，染分同妄。頌曰：白日見繩繩是麻，夜間見繩繩是蛇。麻上生繩猶是妄，那堪繩上更生蛇！性宗釋圓成云：本覺真必始覺顯現，圓滿成實真實常住。三法皆具空有，初則情有理無；次則相有性無；三則情無理有，相無性有。南岳云：心體平等，名真實性。心體為染淨所熏，依隨染淨二法，名依他性。所現虛相果報，名分別性。唯識云：即依此三性，說彼三無性。初則相無性，次無自然性，後由遠離前，所執法我性。故佛密意說：一切法無性。又云：若時於所緣，智都無所得（能所一如，無有二相）。爾時住唯識，離二取相故。華嚴唱䭾字時，名觀察揀擇一切法聚。疏云：即能持界性。",
    "賒多": "秦言寂滅。大品賒字門，入諸法定不可得故。論曰：即知諸法寂滅相。妙樂云：此唱寂滅，是滅生之滅，非即生之滅。即生之滅，是不滅故。如淨名云：法本不然，今則無滅，是寂滅義。華嚴唱奢（尸荷切）字時，名隨順一切佛教輪光明。疏云：即寂靜性。",
    "呿": "秦言虛空。大品呿字門，入諸法虛空不可得故。華嚴唱佉字時，名修因地智慧藏。疏云：即如虛空性。",
    "叉耶": "秦言盡。大品叉字門，入諸法盡不可得。華嚴云：唱叉字時，名息諸業海藏。疏云：即盡性。",
    "迦哆度求那": "秦言是事邊得何利。大品哆字門，入諸法有不可得故。論曰：即知諸法邊得何利。華嚴唱娑（蘇紇切）多（上聲）字時，名蠲諸惑障，開淨光明。疏云：即任持處非處，令不動性。",
    "阿施": "秦言義。大品施字，經本作施字門，入諸法施字不可得故。論曰：若聞他字，即知一切法義不可得。華嚴唱曷攞多（上聲）字，名生死境界智慧輪。疏云：即執著義性，執著為生死境，義即智慧輪。",
    "婆伽": "秦言破。大品婆字，入諸法破壞不可得故。論曰：知一切法不可得破相。華嚴唱婆（蒲餓切）字時，名一切智宮殿圓滿莊嚴。疏云：即可破壞性圓滿之言，不空譯為道場。",
    "伽車提": "秦言去。大品車字門，入諸法欲不可得故。如影五眾，亦不可得故。論曰：即知一切法無所去。華嚴車（上聲）字時，名修行方便藏，各別圓滿。疏云：即欲樂覆性。",
    "阿濕麼": "秦言石。大品魔字門，入諸法魔字不可得故。論曰：即知諸法牢堅如金剛石。華嚴唱娑（蘇紇切）麼字時，名隨十方現見諸佛。疏云：即可憶念性。",
    "火夜": "秦言喚來。大品火字門，入諸法喚不可得故。論曰：即知一切法無音聲相。華嚴唱訶（上聲）婆（上聲）字時，名觀察一切無緣眾生，方便攝受，令出生無礙力。疏云：即可呼召性，無緣召令有緣故。",
    "末嗟羅": "秦言慳。大品嗟字門，入諸法嗟字不可得故。論曰：嗟字，即知一切法無慳無施相。華嚴唱縒（七可切）字時，名修行趣入一切功德海。疏云：即勇健性。",
    "伽那": "秦言厚。大品伽字門，入諸法厚不可得故。論曰：即知諸法不厚不薄。華嚴唱伽（上聲）字時，名持一切法雲堅固海藏。疏云：即厚平等性。",
    "拏": "秦言不。大品拏字門，入諸法不來、不去、不立、不坐、不臥。論曰：眾生空法空。華嚴唱拏（妳可切）字時，名觀察字輪有無盡諸億字。疏云：即離諸喧諍，無往，無來、行住坐臥，謂以常觀字輪故。",
    "歌大": "秦言眾。大品歌字門，入諸法聚不可得。論曰：即知一切五眾不可得。華嚴唱娑（同前）迦字，名廣大藏無礙辯光明輪遍照。疏云：即積聚蘊性。",
    "醝": "大品醝字門，入諸法醝字不可得故。論曰：即知醝字空，諸法亦爾。華嚴唱也（夷舸切）娑（蘇舸切）字，名宣說一切佛法境界。疏云：即衰老性相。",
    "遮羅地": "秦言動。大品遮字門，入諸法行不可得故。論曰：即知一切法不動相。華嚴唱室者字時，名於一切眾生界法雷遍吼。疏云：即聚集足跡。謂聚集一切眾生法雷，即是足跡。",
    "彼茶": "秦言必。大品茶字門，入諸法邊竟處不終不生，過茶無字可說。論曰：即知一切法必不可得。華嚴唱陀字時，名一切法輪差別藏。疏云：此究竟含藏一切法輪。新譯乃是茶字。大品云：一字皆入四十二字，四十二字亦入一字。南岳大師用表四十二位，初阿字門，表初住；後茶字門，表妙覺。故曰：過茶無可說；字為世執謂之法，眾聖所由謂之門。",
    "便善那": "此云文身。慈恩疏云：文身者，為名句依，而顯所表。顯有四義：一扇，二相好，三根形，四鹽。如次能顯風涼大人男女味故，故名為顯。即喻此文身，能顯於理。若依古譯，翻文為味，但是所顯非能顯也。大乘入楞伽云：文身者，謂由於此，能成名句。楞伽云：形身者，謂顯示名句，是名形身。又形身者，謂長短高下。注曰：形身，即字也。入楞伽云：字身者，謂聲長短，音韻高下，名為字身。今問：文與於字，為異為同？答：若未改轉，斯但名字；若已改轉，文即是字。是則依類像形為字，形聲相稱曰文。",
    "那摩": "此云名。楞伽云：名身者，謂依事立名，是名名身。",
    "波陀": "秦言句，句謂句逗。逗，止也，住也。大論云：天竺語法，眾字和合成語，眾語和合成句。如菩為一字，提為一字，是二不合則無語，若和合名為菩提。大乘入楞伽云：句身者，謂能顯義決定究竟。成唯識論云：句詮差別，如名為眼，即詮自性。若言佛眼、天眼，乃顯句詮差別也。",
    "阿耨𡨧睹婆": "或輸盧迦波。天竺但數字滿三十二即為一偈，號阿耨𡨧睹婆偈。",
    "蘊䭾南": "此云集施頌。謂以少言攝集多義，施他誦持。",
    "跋渠": "法華文句云：中阿含翻品。品者，義類同者聚在一段，故名品也。或佛自唱品，如梵網；或結集所置，如大論（大品一部，結集之家，本唯三品）；或譯人添足，如羅什（什師以類加之，成九十品）。",
    "彌底": "此云正量。相宗明三種量：一現量，唯約佛果，起後得智，見實相理。有二：一、定位，定心澄湛，境皆明證，故名現量。現者，明也。二、散心現量，如五識緣色等時，親明而取，局附境體，分明顯現。現者，親也。二比量，通約凡夫至等覺，比量生解。如遠見煙，比知有火，雖不見火，言非虛故。三證言量，諸佛經教，以為證準。因明論云：能立與能破，及似唯悟他；現量與比量，及似唯自悟。明義有八：一能立三支，譬喻宗因，由此譬況，喻曉宗因。宗者，所宗所主之義；因者，所以義、建立義。世親已前，宗等皆為能立。陳那已後，唯以一因二喻為能立，宗是所立。二能破，三似能立，四似能破，五現量，六比量，七似現量，八似比量。因明疏云：刊定法體，要須二量。現量則得境親明，比量亦度義無謬，度共相境無邪謬矣！宗鏡云：教無智而不圓，木匪繩而靡直。比之可以生誠信，量之可以定真詮。杜狂愚之妄說，故得正法之輪永轉。唯識之旨廣行，則事有顯理之功，言有定邪之力。",
    "都羅": "此云喜。釋論云：五塵中，生樂名樂；法塵中，生樂名喜。先求樂願令眾生得，從樂因令眾生得喜。又云：麤樂名樂，細樂名喜。譬如初服藥時名樂，藥發遍身時名喜。智論明示、教、利、喜。示人好醜、善不善、應行不應行、生死為醜、涅槃安隱為好、分別三乘、分別六波羅蜜，名示。教者，教言：汝捨惡行善。利者，未得善法味故，心則退沒。為說法引導令出：汝莫於因時不求果。汝今雖勤苦，果報出時，大得利益，令其心利，故名利。喜者，隨其所行而讚歎之，故名為喜。以此四事莊嚴說法。智論明三事具足，故大歡喜：一能說人清淨，二所說法清淨，三依法得果清淨。論又問：是諸羅漢，已證實際，無復憂喜。小喜尚無，況大歡喜？答：羅漢離三界欲，未得一切智慧，故於諸甚深法中，猶疑不了。是般若中，了了解說，斷除其疑。故大歡喜。",
    "摩訶羅": "此云無知。律中，阿難攝眾無法，迦葉訶言年少。阿難言：我今頭白，何故名年少？答云：汝不善察，事同年少；老年愚法，豈不例之？",
    "梵壇": "此云默擯，梵壇令治惡性車匿。五分云：梵壇法者，一切七眾，不來往交言。若心調伏，為說那陀迦旃延經，令離有無，即入初果。文見闡釋迦注。",
    "唱薩": "此言訛也。正言娑度，此云善哉。",
    "阿呼": "此云奇哉。",
    "闍維": "或耶旬，正名茶毗。此云焚燒。西域記云：涅疊槃那，舊闍維，訛也。通慧音義云：親問梵僧，未聞闍維之名。",
    "陀呵": "云燒。纂要云：用照則暗不生，用燒則物不生。",
    "僧柯慄多弭": "此云有為。大品云：一者、有為法相，謂十八空智，乃至八聖道智，十力、四無所畏，世間法、出世間法等。二者、無為法相，無生無滅，無住無異，無垢無淨，無增無減，諸法自性。大論釋曰：有為法相，是作相。先無今有，已有還無故。無上相違，即無為法相。然此二法，若約相即，如般若云：佛告善現：不得離有為，說無為；不得離無為，說有為（宗鏡云：或事理相即亦得，此理是成事之理，此事是顯理之事）。若約俱立，如華嚴云：於有為界，示無為理，不滅有為之相（宗鏡云：或理事不即亦得，以全理之事，非理能依，非所依不壞俗諦故）；於無為界，示有為之法，不壞無為之性（宗鏡云：以全事之理，非事所依，非能依，不隱真諦故）。若約俱泯，道智經云：所謂一心本法，非有為故，能作有為；非無為故，能作無為。",
    "般遮于瑟": "或般遮跋利沙。此云五年一大會。",
    "般遮于旬": "此云五神通人。經云：般遮于旬，乃以其瑟歌頌佛德。",
    "四毗舍羅": "念佛三昧經云：度脫五道，四毗舍羅。注云：此或言施戒法，此無慳義。",
    "沒栗度": "此云耎，物柔曰耎。",
    "麗掣毗": "此云細滑。",
    "諄那": "此云碎末。",
    "四摩": "此云別住。此處作法，餘不相通。",
    "嗢瑟尼沙": "此云髻。無上依經云：鬱尼沙，頂骨涌起，自然成髻，故名肉髻。",
    "烏瑟膩沙": "此云佛頂。",
    "母陀羅": "檇李曰：結印手也。",
    "迦私": "或迦尸。此云光，能發光故。釋迦世尊圓光一尋，阿彌陀佛光明無量。智論云：無量有二種：一者實無量，二者有量之無量。見第七卷。",
    "摩奴末那": "此云意生身。楞伽經明三種意生身。山家法華玄、淨名疏、輔行記，伸明此義，其名互出。後學披卷，罔曉厥旨，由是不揆庸淺，輒開二門：初釋通號，次辯別名。原夫通號意生者，意謂作意，此顯同居之修因。生謂受生，此彰方便之感果。故曰：安樂作空意，三昧作假意，自性作中意。又意者，如意。故魏譯入楞伽經云：隨意速去，如念即至，無有障礙，名如意身。又意者，意憶。故唐譯大乘入楞伽經（文有七卷），佛告大慧：意生身者，譬如意去，速疾無礙，名意生身。此即從譬號意生身。彼經兩義，釋此通名：初云大慧，譬如心意，於無量百千由旬之外，憶先所見種種諸物，念念相續疾詣於彼，非是其身及山河石壁所能為礙。意生身者，亦復如是。次云如幻三昧力，神通自在，諸相莊嚴，憶本成就眾生願故。猶如意去，生於一切諸聖眾中。輔行釋云：初云憶處，次云憶願。二義並是意憶生故，名為意生。然此通名，先達釋云：生方便已，憶先同居所見凡境，智願熏修，作意來生，神通化物。今謂此解，違文失旨。且違文者，淨名疏云：三種意生身所不能斷，故生有餘，受法性身。是則祖師釋名，從下以生上，先達解義；自上而來下，顛倒談之，違於文矣。其失旨者，經中憶先所見，本是喻文，先賢迷之，而作法解。故知舊釋，未善通名也。然智者疏，稱意生身，以依宋譯楞伽故（楞伽阿跋多羅寶經，文有四卷）。荊溪記中，名意成身，以準唐譯楞伽故。雖二經名殊，而義歸一揆。以後譯經，取成就義，號意成身。故記主云：成之與生，並從果說。是則意之一字，乃順於因；生之一字，則從於果。故知此名，因果雙立也。次辯別名者，初法華玄義，一，安樂法意生身。此欲擬二乘人，入涅槃安樂意也。二，三昧意生身。此擬通教出假化物，用神通三昧也。三，自性意生身。此擬別教修中道自性意也。今釋曰：初名安樂者，以舊經云：安住心海，識浪不生，故智者立為安樂法也。此乃用經義以立名。二名三昧意生身者，以舊經云：得如幻三昧，無量相力，具足莊嚴，隨入佛剎，故智者立為三昧意生也。然則今宗三諦，俱受三昧之名。此文既以神通而釋，則當俗諦三昧。如釋籤云：若於諸知識所，但得俗諦三昧，但破無知，名為無明。今此三昧，與彼文同。三曰自性者，以舊經云：覺一切佛法緣，自得樂相，故智者立為自性意生。以別教中道，是諸法之自性故。淨名記云：若不見中，則不見於諸法自性。然此玄義，不用被接解釋。唯約前之三教以伸者，斯則順乎教旨也。良以作意之名，從偏教立，由無照性之功，遂有別修之行。所以圓教無此意耳。故輔行云：玄文不云攝入三者，以觀勝故，且置不論。又意生之名，宜在教道。二淨名疏云：一、三昧正受意生身，恐是通教，同入真空寂定之樂。故涅槃云：聲聞定力多故，不見佛性。二、覺法性意生身，恐是別教。菩薩雖證偏真，而覺知有中道法性。三、無作意生身，此恐是圓教。菩薩觀於中道，無作四諦，圓伏無明。今釋曰：初名三昧，吾祖既以真空寂定而釋，此則屬乎真諦三昧。以此之定，心寂不動，故名正受。位次言之，如記主云：若約通教，七地已上，或至九地。此之初名，全依經立（經如下引）。二名覺法性者，覺謂覺知，法性乃是但中之理。以位言之，如記文曰：言自性者，別住同通應取十行。此之一名，亦依經立。三名無作者，圓中稱性，修德行亡，故云無作。以位言之，如記主云：圓教既云伏於無明，即知七信也。然茲疏文，若約正接甄明。此用通教一正，以釋初名，復以別圓兩接，銷後二義。若望玄文，前則無於三藏，後乃加乎圓教。而此文中前無三藏者，乃順教旨。以界外之土，小乘未詮，故談意生，不用三藏。復加圓者，此順位義，以由別圓似解，未發真修，皆名作意。然淨名疏，明意生身，雖指勝鬘，及乎釋義，全用楞伽。當知勝鬘，但有通名，無別號矣。三輔行記云：一、入三昧樂意成身，亦云正受，即三四五地，心寂不動故。二、覺法自性意成身，即八地中，普入佛剎故，以法為自性。三、種類俱生無作意成身，謂了佛證法。今釋曰：初之一名，既指通教三地已去，與前二文名義大同。如唐譯經云：三四五地，入於三昧，離種種心，寂然不動，心海不起轉識浪波，了境心現皆無所有，是名入三昧樂意成身（宋譯魏譯，則名三昧樂正受意生身）。二、名覺法自性意成身者，與妙玄第二名異義同。然記文中，既指八地入假，乃以覺了如幻之法，通達自在，名為覺法自性。故唐譯經云：謂八地中，了法如幻，皆無有相。心轉所依，住如幻定，及餘三昧，能現無量自在神通。如華開敷，速疾如意，如幻如夢，如影如像，非造所造，與造相似。一切色相，具足莊嚴，普入佛剎，了諸法性，是名覺法自性意成身（宋譯名覺法自性性意生身，魏譯名如實覺知諸法相意生身）。三、名種類俱生無作行意成身者，種以能生為義，類從流類立名。中道之觀，能生佛界故。此因位與果為類，故曰種類俱生也（經中亦名聖種類身）。言無作者，別十回向，了佛證法，故名無作。故唐譯經云：了達諸法自證法相，是名種類俱生無作行意成身（宋魏二譯，此名皆同）。然第三名雖三文立名俱異，而同對中觀，復與淨名第二之名義亦同矣。然荊溪師自斷記文則云：此約通教，及以別接，豎判次位，故知輔行用通一正，及別接也。問曰：凡作記者，本扶於疏。何緣此記釋意生身，但用通教豎論位次，有異智者二疏之義？答曰：準記示云：故知今判，與經意同，經文未攝，別位為異。是知荊溪異智者者，為順本經故。問曰：準經判位，既唯在通，何緣智者，用四教釋耶？答曰：祗由意生之義，該乎九人（藏教二乘，通教三乘，別三十心，圓十信位）。所以吾祖就義釋之，適時有異。問曰：天台頓悟，法相朗然，淨名疏內，焉稱恐是？法華玄中，安言欲擬乎？答曰：淨名記云皆言恐者，尊重聖典，兼示無執。三重階降，經文義含，為是何教，所以立名既通，解義難局，或以偏圓而釋，或約正接而伸。不固執之，乃云欲擬。問曰：小教不談界外，二乘但謂無生，何嘗要心生方便耶？答曰：法性之土，雖昔未聞；變易之身，在後當受。何者？期心趣果，秉志修因。欲出煩惱之方，願入涅槃之境。未亡取捨，還有死生。如是之懷，寧逃作意歟？人不曉之，卻云約大乘判，謬之甚矣。問曰：是時過意地，住在智業中。是則大論，明於實報，既是智生，何故淨名，定於十地，猶通意生耶？答曰：淨名記云：一者但是未極名意，二帶教道挫之言意。問曰：寶性論云：二乘於無漏界，生三種意陰，未審意生意陰，同異云何？答曰：釋籤解云：二乘在彼三中之一。今通言之，故云三種，非謂二乘盡具三也。言意陰者，由意生陰，名為意陰。又作意生陰，名為意陰。又意即是陰，名為意陰。前之兩釋，從因得名，後之一釋，從果立號。荊溪既云二乘在彼三中之一，此乃當於安樂法意。是則經與論文，名雖小異，義實大同。昔因講次，聊述梗槩。今附此集，刊助來哲。",
    "斫訖羅": "此土翻輪。淨名云：三轉法輪於大千，其輪本來常清淨。言三轉：一曰示轉，二曰勸轉，三曰證轉。所云法者，軌持名法。軌謂軌則，令物生解。持謂任持，不捨自體。輔行云：輪具二義：一運轉義，二摧碾義。文句云：轉佛心中化他之法，度入他心，名轉法輪。輔行云：以四諦輪，轉度與他，摧破結惑。如王輪寶，能壞能安。法輪亦爾，壞煩惱怨，安住諦理。智論云：諸佛法輪有二種：一者顯，二者密。顯謂顯露，言顯義露，號顯露教。如在鹿苑，顯為五人說小，密為八萬說大。密謂祕密。先達釋祕，乃分二種：一者隱祕，在昔四時，權謀隱覆曰祕，神用潛益曰密。二者真祕，在今法華，昔所未說為祕，開已無外為密。今論祕密，復有二種：一者，至理祕密。阿含云：甚深之理不可說，第一義諦無聲字。故楞伽云：我於某夜成道，某夜入般涅槃，中間不說一字。依何密語，作如是說？佛言：依二密語，謂緣自得法，及本住法。發軫釋云：自得法者，修德也；本住法者，性德也。是則如來道場所得實智，是法非思量分別之所能解，亦不可以容聲矣。故法華云：止止不須說，我法妙難思。言語道斷，故不須說。心行處滅，故妙難思。所以掩舌摩竭，用啟息言之津，杜口毗耶，以通得意之路。故達磨西來，少林面壁。神光往彼，晨夕參承。夜遇大雪，堅立不動，遲明過膝。師憫問曰：當求何事？光悲淚曰：惟願和尚慈悲，開甘露門。師曰：諸佛無上妙道，曠劫精勤，難行能行，難忍而忍。豈以小德小智，輕心慢心，欲冀真乘，徒勞勤苦。光聞師誨，潛取利刀，自斷左臂，置於師前。師知是法器，乃曰：諸佛最初求道，為法忘形。汝今斷臂吾前，求亦可在。遂與易名慧可。光曰：諸佛法印，可得聞乎？師曰：諸佛法印，匪從人得。光曰：我心未寧，乞師與安。師曰：將心來與汝安。光曰：覓心了不可得。師曰：我與汝安心竟。據此，達磨但為除病，道絕言說。二者，言詞祕密。如諸神咒，雖立語言，詞句義密，人不能解。究此密談之法，意在遮惡持善。故陀羅尼，翻為遮持。遮謂遮惡，持謂持善。此釋龍樹二種法輪。若依天台，乃辨八教，頓、漸、祕密、不定，示佛設化之儀式，名化儀四教。藏、通、別、圓，釋佛化物之法門，號化法四教。方味具足，應病授藥，煩惱惡疾，自然消伏。宗鏡問：達磨以心傳心，不立文字，何用廣引佛菩薩教，借蝦為眼，無自己分？答：木匪繩而靡直，理非教而不圓。以聖言為定量，邪偽難移；用至教為指南，依憑有據。圭峰云：經是佛語，禪是佛意。諸佛心口，必不相違。忠國師云：應依佛語一乘了義，契取本源心地，轉相傳授，與佛道同。五祖莊嚴大師，一生訓徒。常舉維摩曰，不著世間如蓮華；常善入於空寂行，達諸法相無罜礙，稽首如空無所依。時有人問：此是佛語，欲得和尚自語。師云：佛語即我語，我語即佛語。願諸智者，勿分別焉。",
    "一門": "法華云：是舍唯有一門，而復狹小。天台釋曰：別者。一謂一理，一道清淨。門謂正教，通於所通。小謂不容斷常七方便等。教理寬博，則非狹小；眾生不能以此理教自通，將談無機，故言狹小耳。通者，理純無雜故言一，即理能通故言門，微妙難知故言狹小。教者，十方諦求，更無餘乘，唯一佛乘，故言一。此教能通故言門。",
    "二翼": "亦喻二輪，又譬二門。故止觀云：馳二輪而致遠，喻止觀以橫周；鼓兩翅以高飛，譬定慧之豎徹。故荊溪咨左溪曰：疇昔之夜，夢披僧服，腋二輪，游大河之中。左溪曰：噫！汝當以止觀二法，度群生於生死之淵乎！大品：佛告須菩提：譬如有翼之鳥，飛騰虛空而不墮墜。雖在空中，亦不住空。須菩提！菩薩摩訶薩亦復如是。學空解脫門，學無相無作解脫門，亦不作證，故不墮聲聞辟支佛地。譬二門者，智論云：欲成佛道，凡有二門：一者福德，二者智慧。行、施、戒、忍，是為福德門。知一切諸法實相，摩訶般若波羅蜜，是為智慧門。菩薩入福德門，除一切罪，所願皆得；若不得願者，以罪垢遮故。入智慧門，則不厭生死，不樂涅槃，二事一故。今欲出生摩訶般若波羅蜜，要因禪定門，禪定門必須大精進力。此以六度，合譬二門，免踟躕於小逕，令優游於通衢也。寶積喻二種縛：一、見縛，二、利養縛。又喻二種癰瘡：一者見求他過，二者自覆己罪。又喻二種毒箭，雙射其心：一、邪命為利，二、樂好衣缽。此三雙喻，覽宜自照。中繩之謂君子，不中繩之謂小人焉。",
    "三目": "涅槃云：如摩醯首羅，面上三目。章安涅槃疏云：摩醯首羅，居色界頂。統領大千，一面三目。三目一面，不可單言。一三縱橫，若並若別，能嚴天顏，作世界主。徹照三千，不縱不橫，嚴主照世，一切皆成。三德亦爾，縱橫並別，祕藏不成，不縱不橫，祕藏乃成。天台云：備說三德為涅槃，雖三點上下而無縱，表裏而無橫。一不相混，三不相離。釋籤云：上一是縱義，雖一點在上，不同點水之縱，三德亦爾，法身本有，不同別教為惑所覆。表裏是橫義，雖二點居下，不同烈火之橫，三德亦爾，二德修成，不同別人理體具足而不相收。故借縱橫之譬，顯非並別之法。斯可通喻十種三法，如光明玄，學者覽之。",
    "四蛇": "金光明經云：猶如四蛇，同處一篋，四大蚖蛇，其性各異。天台釋云：二上升是陽，二下沈是陰。何故相違？猶其性別，性別那能和合成身？故大集云：昔有一人，避二醉象（生死），緣藤（命根）入井（無常）。有黑白二鼠（日月），囓藤將斷，旁有四蛇欲螫（四大），下有三龍吐火，張爪拒之（三毒）。其人仰望二象，已臨井上，憂惱無託。忽有蜂過，遺蜜滴入口（五欲），是人唼蜜，全亡危懼。",
    "四喻": "金光明經：四佛同舉山斤海滴，地塵空界，尚可盡邊，無有能計釋尊壽命。天台釋云：若從信相所疑，應言壽有量。若從四佛釋疑，應言壽無量。孤山索隱，未善此文。執能喻之有量，迷所況之無量。以下三無常之數，釋上三常壽之身。報應淆混，疑釋顛倒，垂裕後昆，當詳察焉。",
    "五味": "聖行品云：譬如從牛出乳，從乳出酪，從酪出生酥，從生酥出熟酥，從熟酥出醍醐。譬從佛出十二部經，從十二部經出九部脩多羅，從九部出方等，從方等出摩訶般若，從摩訶般若出大涅槃。此喻一取相生次第，牛譬於佛，五味譬教。乳從牛出，酥從乳生，二酥醍醐，次第不亂。二喻濃淡，此取一番下劣根性。所謂二乘在華嚴座，不信不解，不變凡情，故譬其乳。次至鹿苑，聞三藏教，二乘根性，依教修行，轉凡成聖，譬轉乳成酪。次至方等，聞彈斥聲聞，慕大恥小，得通教益，如轉酪成生酥。次至般若，奉敕轉教，心漸通泰，得別教益，如轉生酥成熟酥。次至法華，三周說法，得記作佛，如轉熟酥成醍醐。此乃約教豎辨，其如約教橫辨。兼但對帶，多少可知。晉華嚴云：譬如日出，先照一切諸大山王，次照一切大山，次照金剛寶山，然後普照一切大地。又云：譬如日月出現世間，乃至深山幽谷，無不普照。此喻先照高山，次照幽谷，後照平地。天台準涅槃五味，演第三平地，開為三時。方等如食時，般若如禺中，法華如正午。釋籤問曰：應還取涅槃本文，何以卻取華嚴文耶？非但數不相當，亦恐文意各別。答：涅槃五味轉變，而祗是一乳。華嚴三照不同，而祗是一日。今演平地之譬，以對涅槃後之三味。數雖不等，其義宛齊。又，涅槃以牛譬佛，乳從牛出，譬佛初說大。乳出已後，其味轉變，猶成分譬。故此下文，義立五味，皆從牛出。未若華嚴，日譬於佛，光譬說教，日無緣慈，非出而出，眾機所扣，非照而照。致使高山幽谷平地不同，同稟教光，終歸等照。故用兩經，二義相成。佛出娑婆，慈濟群彙，經五十年，普潤無方。而此二喻，粲然可觀，乃使感應之道彰矣！華嚴五喻，別況五蘊，文見心經輔中記也。",
    "六賊": "原性明靜，因情昏散。狂心若歇，真佛自彰。當知塵識是賊，止觀是兵（禪止心散，觀照心昏）。喻雖遣兵而討賊，法要即賊以成兵。如楞嚴曰：眼耳鼻舌及與身心，六為賊媒，自劫家寶（媒訓謀，謀合二姓名媒。六根能生六識，令著六塵所以六根如媒人也）。金光明云：猶如世人，馳走空聚，（六根虛假，如空聚落。）六賊所害，愚不知避（六塵污染，害智慧命，劫功德財，故名六賊）。亦名六衰。妙樂云：衰祗是賊，能損耗故。法句經云：昔佛在時，有人河邊樹下，學道二十年，但念六塵（色聲香味觸法），心無寧息。佛知可度，化作沙門，樹下共宿。其夜月明，龜從河出，野干欲噉，龜縮其頭尾及四足，藏於甲中。狗不得便，須臾遠去，龜還入水。道人見此，語沙門曰：龜有護命之鎧，野干不能得便。沙門對云：世人不如此龜，放恣六情，外魔得便。復說偈曰：藏六如龜，防意如城。慧與魔戰，勝則無患。須知無為，能殺其賊。故安般守意經云：有外無為，有內無為。外無為者，眼不視色（色壞我眼，為恩愛奴。一角大仙，因著色故，頸騎婬女）；耳不聽聲（鼓樂歌笑，聞生惑著，五百仙人，聞女歌聲，皆失禪定）；鼻不受香（種種香氣，動諸結使，愛蓮華香，池神訶責）；口不味味（沙彌味酪，為酪中蟲。何況貪食酒肉蔥薤）；身離細滑（智論明術婆伽，欲火內發，燒身為灰）；意不妄念（楞嚴云：縱滅一切見聞覺知，內守幽閑，猶為法塵分別影事。惟無念三昧經云：人生世間，所以不得道者，但坐思想穢念多故。一善念者，得善果報。惡念者，得惡果報。如響應聲，如影隨形，若攝念者，心不放逸）。內無為者，數息相隨，止觀還淨（此名六妙門：一數息，二隨息，三止，四觀，五還，六淨）。經又問曰：現有所念，何以無為？答：身口為戒，意向道行。雖有所念，本趣無為也。無行經云：觀身畢竟無，觀受內外空，觀心無所有，觀法但有名。古德云：見聞覺知本非因（見色聞聲，覺香味觸，心知六塵），當體虛玄絕妄真，見相不生癡愛業，洞然全是釋迦身。無機子復述短頌普勸：人間壽短，地獄苦長，惡須日息，善要時揚。",
    "六喻": "秦金剛云：一切有為法，如夢幻泡影，如露亦如電，應作如是觀。初、喻夢者，寐中神游也。列子分六夢：一、正夢（平居自夢），二、愕夢（驚愕而夢），三、思夢（思念而夢），四、寤夢（覺而道之而夢），五、懼夢（恐懼而夢），六、喜夢（喜悅而夢）。周禮占六夢之吉凶。善見律，明四種夢：一、四大不和夢，夢見山崩飛騰虛空，或見虎狼獅子賊逐；二、先見故夢，晝見白黑及男女相，夜剋夢見；三、天人與夢，若善知識，天人示善得善，若惡知識，示惡得惡；四、想心故夢，前身修福，今感吉夢。先世造罪，今感凶夢。石壁法師釋夢喻云：如有一人（真如一心），忽然睡著（不覺無明忽起），作夢（最初業識相）見（轉識相）種種事（現識相），起心分別（六麤初智相），念念無間（二相續相）。於其違順，深生取著（三執取相），為善為惡，是親是疏（四計名字相），於善於親，則種種惠利；於惡於疏，則種種淩損（五起業相）。或有報恩受樂，或有報怨受苦（六業計苦相）。忽然覺來，上事都遣（覺唯心故，佛如夢覺，如蓮華開）。釋籤辨夢三觀云：如於夢中，修因得果，夢事宛然，即假也。求夢不可得，即空也。夢之心性，即中也。止觀云：若體知心性非真、非假，息緣真假之心，名之為正。諦觀心性非空、非假，而不壞空假之法。若能如是照了，則於心性通達中道，圓照三諦。二、喻幻者，楞伽云：如工幻師，依草木瓦石作種種幻。起一切眾生若干形色，起種種妄想。釋籤云：燄幻之名，通於偏圓。今從圓說，一心三幻。淨名記云：具如幻化，俗同真異，一俗三真。指要立三種幻：以性奪修幻；但理隨緣幻；緣生無體幻。故指要云：性本圓具，遍發由熏，以性奪修，故修如幻。又云：然此尚非但理隨緣之幻，豈同緣生無體之幻？方知如幻名同，幻義各異。三、喻泡者，淨名疏云：上水渧下水，上水為因，下水為緣，得有泡起，斯須即無。四、喻影者，顏氏家訓云：影字，當為光景之景。凡陰景者，因光而生，即謂景也。尚書云惟景響。晉葛洪字苑，傍加彡於景切。梵云頻婆帳，此云身影。淨名疏云：有物遮光，則有影現。物異影異，物動影動。無明行業，遮理智光，則有三事，報身影現業異，從生至死，流動非一。五、喻露者，大戴禮云：露，陰陽之氣也。夫陰氣勝，則凝為霜雪。陽氣勝，則散雨露。朝陽纔照，薤露即晞，人生處世，奄忽何期？六、喻電者，經律異相明四電師。或云電是龍瞬眼生光。五經通義曰：電，雷光也。顧凱之曰：電，陰陽相觸為雷電。經取疾速之象，令悟無常之法。性通達者，當起信志。（此釋六種能喻）其所譬法，今述頌曰：\n\n　　世界變成如幻化，受想行起似浮泡；法塵緣慮同觀影，身似露珠垂樹梢；\n　　過去翻思事若夢，現前如電耀荒郊；須知畢竟常空寂，自是無端與物交。",
    "六輪": "本業瓔珞經云：鐵輪十信位，銅輪十住位，銀輪十行位，金輪十向位，琉璃輪十地，摩尼輪等覺、妙覺。",
    "七華": "維摩經云：無漏法林樹，覺意淨妙華。天台釋云：覺意，即七覺支（一擇法，二精進，三喜，四除，五捨，六定，七念）。七覺調停，生真智因華。故智論云：無學實覺，此七能到，故以為華。又云：定水湛然滿，布以七淨華。天台釋云：一、戒淨（是正語業命），二、心淨（是精進念定），三、見淨（是正見正思惟），四、斷疑淨（是見道），五、分別淨，六、行淨（是修道），七、涅槃淨（是無學道）。又涅槃云：譬如有人，而有七子，是七子中，一子遇病。父母之心非不平等，然於病者心則偏重。章安釋云：或以七方便根性為七子，謂人天二乘三教菩薩。是七子中，有起過者，心則偏重。又智論云：智度大道佛善來，智度大道佛窮底，智度相義佛無礙，稽首智度無子佛。古人立四義釋無子：一者無等，一切眾生，無與佛等。二云無礙，佛是法王，於法自在。三云無子，復有二義：一者就理，佛能體悟無生真理，名為無子；二者就事，如來生死種子已盡，故名無子。四者無子亦有二義：一者般若名為佛母，母有七子，謂佛、菩薩、及辟支佛，并四果人。此七子中，佛最居長，故云無子；二者無明蔽中，無有智慧種子，故云無子。",
    "八筏": "郭璞云：水中𥴖筏。功德施論云：如欲濟川，先應取筏，至彼岸已，捨之而去。智論引筏喻經云：汝等若解我筏喻法，是時善法宜應棄捨，況不善法。斯乃無所得之要術，俾不凝滯於物矣。故德王品曰：譬如有王（智論王喻魔王），以四毒蛇盛之一篋，令人贍養，若令一蛇生瞋恚，我當準法，戳之都市。其人怖畏，捨篋逃走。王時復遣五旃陀羅，拔刀隨後。一人藏刀，詐為親善。其人不信，投一聚落，欲自隱匿。既入聚中，不見人物，即便坐地。聞空中聲云：今夜當有六大賊來。其人恐怖，復捨而去。路值一河，其水漂急。即取草木筏，截流而去。既達彼岸，安隱無患。菩薩亦爾，聞涅槃經，觀身如篋，四大如蛇，五旃陀羅即是五陰，詐親即貪愛，空聚即六入，六賊即外六塵，河即煩惱，筏即道品（智論云：筏是八正道），到於常樂涅槃彼岸。又喻八輪。正理論云：如世間輪，有輻轂輞。八支聖道，似彼名輪：正見、正思惟、正勤、正念似輻，正語、正業、正命似轂，正定似輞。三事具足，可乘轉於通衢也。",
    "九喻": "方等如來藏經，佛為金剛藏菩薩，說一法九喻，具有十文。經云：我以佛眼，觀一切眾生。諸煩惱中，有佛智眼，有如來身，結跏趺坐，儼然不動，下有九翻長行偈頌（寶性論，佛性論，具釋，圭山疏引，今略錄示）。一偈云，譬如萎變華（論云：貪煩惱亦爾，初樂後不樂），其華未開敷，天眼者觀見，如來身無染（此法身體）。二云，譬如巖樹蜜（說一味法），無量蜂圍繞（論云：群蜂為成蜜，瞋心齧諸人），善方便取者，先除彼眾蜂。三云，譬如彼粳糧（說種種法），穅𥢶未除蕩（論云：如是癡心纏，不見內堅實），貧者猶賤之，謂為可棄物。四云，如金在不淨（真如不變），隱沒莫能見（論云：增上貪瞋癡。圭山云：上三種子，今喻麤顯現行，發身口意，造一切業，故云增上），天眼者乃見，即以告眾人。五云，譬如貧人家（根本無明無覆無記，未有愛惡之相，名無明住地），內有珍寶藏（法身為萬德所依），王既不知見，寶復不能言。六云，譬如菴羅果（此喻見惑），內實不毀壞（報化身佛性），種之於大地，必成大樹王。七云，譬如持金像（出纏法身），行詣於他方，裹以穢弊物（此喻思惑），棄之於曠野。八云，譬如貧女人，色貌甚醜陋（喻八不淨地垢），而懷貴相子，當為轉輪王（喻成報身）。九云，譬如大冶鑄，無量真金像（喻成化身），愚者自外觀，但見焦黑土（八九十淨地諸垢）。又魏譯金剛云：一切有為法，如星翳燈幻，露泡夢電雲，應作如是觀。彌勒頌曰：見相及於識，器身受用事；過去現在法，亦觀未來世。論釋曰：譬如星宿，為日所映，有而不現。能見心法，亦復如是（此譬見分）。又如目有翳，則見毛輪等色，觀有為法，亦復如是，以顛倒見故（此譬相分，大雲釋曰：此喻若執在意，見實我法，此翳配在第七，以常行故。圭山云：既在第七，即知是見分。毛輪喻我法，我法即第七家，相分是第八也）。又如燈，識亦如是，依止貪愛法住故（此喻識體）。又如幻，所依住處，亦復如是，以器世間種種差別，無一體實故（此譬器）。又如露，身亦如是，以少時生故（此譬身）。又如泡，所受用事亦如是，以受想因三法不定故（此喻受用事故）。又如夢，過去法亦如是，以惟念故（此喻過去法）。又如電，現在法亦如是，以剎那不住故（譬現在法）。又如雲，未來法亦如是，以於子時阿梨耶識，為一切法為種子根本故（此譬未來）。",
    "十寶": "光明經云：我當安止住於十地，十種珍寶以為腳足。天台釋云：珍寶者，十地因可貴，諸地即是珍寶也。腳足者，十地是果家之基，故言腳足。又十度，是十地之腳足。於餘功德，非為不修，隨力隨分。正以檀為初地之足，檀足若滿，得入初地，乃至智度足滿，得入十地。又如法華十喻況勝，文見彼經。",
    "離佉": "此云書。釋名曰：書，庶也，紀庶物也。春秋左傳序云：大事書之於策，小事簡牘而已。文選註云：大竹名策，小竹名簡，木板名牘。尚書序云：伏羲神農皇帝之書，謂之三墳，言大道也。少昊顓頊高辛唐虞之書，謂之五典，言常道也。世歷明三古，伏羲為上古；文王為中古；孔子為下古。司馬遷史記辨六宗：一、陰陽，使人拘而多所畏；然其序四時之大順，不可失也。二、儒者，博而寡要，勞而少功，是以其事難盡從；然其序君、臣、父、子之禮，不可易也。三、墨者，儉而難遵，是以其事不可遍循；然其強本節用，不可廢也。四、名者，使人儉而善失真；然其正名實，不可不察也。五、法者，嚴而少恩；然其正君、臣、上、下之分，不可改矣。六、道德者，使人精神專一，動合無形。其為術也，明陰陽之大順，采儒墨之善要，與時遷移，應物變化，立俗施事，無所不宜。指約而易操，事少而功多。班固漢書明九流：一、儒流，順陰陽，陳教化，述唐虞之政，宗仲尼之道焉。二、道流，守弱自卑，陳堯舜揖讓之德，奉周易之謙恭也。三、陰陽流，順天歷象，敬受民時矣。四、法流，明賞敕法，以順禮制耳。五、名流，正名列位，言順事成矣。六、墨流，清廟宗祀，養老施惠也。七、縱橫流，謂受明使，專對權事焉。八、雜流，兼儒墨之銓，含名法之訓，知國大體，事無不貫矣。九、農流，勸勵耕桑，備陳食貨耳。彌天云：史遷六氏，道家為先；班固九流，儒宗為上。",
    "悉曇章": "西域悉曇章本，是婆羅賀磨天所作。自古迄今，更無異書。但點畫之間，微有不同。悉曇，此云成就所生。悉曇章是生字之根本，說之為半，餘章文字具足，說名為滿。又十二章，悉名為半，自餘經書記論為滿，類如此方。由三十六字母，而生諸字。澤州云：梵章中，有十二章，其悉曇章以為第一，於中合五十二字。悉曇兩字，是題章總名，餘是章體，所謂惡阿乃至魯流盧樓。",
    "毗伽羅": "章安疏曰：此云字本。河西云：世間文字之根本，典籍音聲之論。宣通四辯，訶責世法，讚出家法。言詞清雅，義理深邃。雖是外論，而無邪法，將非善權大士之所為也。故以此論，喻方等經。三藏傳云：其音不正，正云毗耶羯剌諵（女感切）。此翻為聲名記論，以其廣紀諸法能詮，故名聲名記。成劫初，梵王說百萬頌。住劫初，帝釋略為十萬頌。",
    "攝拖苾䭾": "此云聲明。西域記云：開蒙誘進，先遵十二章。七歲之後，漸授五明大論。言五明者，一曰聲明，釋詁訓字，詮目流別；二工巧明，伎術機關，陰陽厤數；三醫方明，禁咒閑邪，藥石針艾；四因明，考定正邪，研覈真偽（外道言論）；五曰內明，究暢五乘因果妙理。大般若云：五地菩薩覺五明。此內五明也。外五明者，前四明同，五曰符印。",
    "韋陀": "亦名吠陀。此云智論；知此生智，即邪智論。亦翻無對。舊云毗陀，訛也。韋陀有四：一、阿由，此云方命，亦曰壽，謂養生繕性。二、殊夜，謂祭祀祈禱。三、婆磨，謂禮儀占卜，兵法軍陣。四、阿達婆，謂異能技數，禁咒醫方。索隱引摩蹬伽經云：初人名梵天，造一韋陀。次有仙名白淨，變一有四：一名讀誦，二名祭祀，三名歌詠，四名禳災。次名弗沙，有二十五弟子，各一韋陀，能廣分別。或云韋陀是符檄。漢書高紀曰：檄以木簡為書，長尺二寸，用徵召也；其有急事，則加鳥羽插之，示疾速也。",
    "佉路瑟吒": "或佉樓。謂北方邊處人書。",
    "僧佉論": "正云僧企耶。此云數術，又翻數論。輔行云：迦毗羅說經十萬偈，名僧佉論。用二十五諦，明因中有果，計一為宗。言二十五諦者，一者從冥初生覺，過八萬劫前，冥然不知。但見最初中陰初起，以宿命力恆憶想之，名為冥諦，亦云世性。謂世間眾生，由冥初而有，即世間本性也。亦曰自然，無所從故。從此生覺，亦名為大，即中陰識也。次從覺生我心者，此是我慢之我，非神我也，即第三諦。從我心生色聲香味觸，從五塵生五大，謂四大及空。塵細大麤，合塵成大，故云從塵生大。然此大生，多少不同。從聲生空大；從聲觸生風大；從色聲觸生火大；從色聲觸味生水大；五塵生地大。地大藉塵多故，其力最薄；乃至空大藉塵少故，其力最強。故四輪成世界，空輪最下，次風，次火，次水，次地。從五大生十一根，謂眼等根，能覺知故，故名為根，名五知根。手足口大小遺根，能有用故，名五業根。心平等根，合十一根。心能遍緣，名平等根。若五知根，各用一大。謂色塵成火大，火大成眼根，眼根還具色，空塵成耳根，耳根還聞聲；地成鼻，水成舌，風成身，亦如是。此二十四諦，即是我所，皆依神我，名為主諦。能所合論，即二十五。",
    "衛世師": "正云鞞崽（所皆切）。此云無勝。優樓僧佉，計六遍造，但眼根火多，乃至身根風多。文見金七十論。輔行云：優樓僧佉，此云休留仙。其人晝藏山谷，以造經書。夜則遊行，說法教化。猶如彼鳥，故得此名，亦名服足。其人在佛前八百年出世，亦得五通，說論十萬偈，名衛世師。",
    "勒沙婆": "此云苦行。以算數為聖法，造經十萬偈，名尼乾子。此三仙說，無漏盡通，故唯五通。宗鏡云：迦毗羅計因中有果；僧佉計因中無果；勒沙婆計因中亦有果，亦無果。",
    "毗世": "此云勝異論。即六句義，於實句中有九法，地水火風空時方等。計積極微以成器世間，此外道計極微常住不滅。",
    "尼羅蔽茶": "西域記云：唐言青藏，記言書事，各有司存。史誥總稱，謂尼羅蔽茶。善惡見舉，災祥備著。前漢書明劉歆七略：輯略，輯與集同，師古曰：謂諸書之總要；六藝略，六經也；諸子略；詩賦略；兵書略；術數略，占卜之書；方技略，醫藥之書。說苑明人臣之行，有六正六邪：一者萌兆未現，見存亡之機，名為聖臣。二者進善通道，功歸於君，名為大臣。三者卑身進賢，稱古行事，以勵主意，名為忠臣。四者明察畢見，終無憂患，名為智臣。五者守文奉法，飲食廉節，名為貞臣。六者國家昏亂而不諭，犯主嚴顏，言主之過，身死國安，名為直臣。阮瑀論通士，以四奇高人，必有四難之思：言多方者，中難處也；術饒津者，要難求也；意弘博者，情難足也；性明察者，下難事也。阮瑀論質士，以四短遣人，必有四安之報：少言詞者，政不煩也（孟僖所以不能答郊勞也）；寡知見者，物不擾也（慶氏所以困相鼠也。左傳云：齊慶封來聘，叔孫與慶食不敬，為賦相鼠，亦不知也）；專一道者，思不散也；混濛薎者，民不備也。",
    "路伽耶": "應法師譯云順世，本外道縛摩路迦也。天台曰：此云善論，亦名師破弟子。慈恩云：此翻惡對答，是順世者，以其計執，隨於世間之情計也。劉虯云：如此土禮義名教。",
    "逆路伽耶陀": "應師云：逆路底迦。此云左世。天台曰：此惡論，亦名弟子破師。慈恩云：此翻惡徵問。左道惑世，以其所計，不順世間故也。劉虯云：如此土莊老玄書。故楊雄斥老子曰：槌提仁義，絕滅禮學，吾無取焉。斥莊子曰：齊生死，同富貴，等貴賤，其有懼乎。然此半滿兩乘，東夏偏弘。邪正二教，西域各習。世尊預鑒，以誡學焉。故十誦云：好作文誦，莊嚴章句，是可怖畏，不得作。五分云：為知差次會等學書，不得為好廢業，不聽卜相，及問他吉凶。四分開學誦學書，及學世論，為伏外道故。雜法中，新學比丘開學算法。智論云：習外典，如以刀割泥，泥無所成，而刀自損。言內外典者，二教論云：救形之教稱為外，濟神之典號為內。又智度有內外兩經；仁王辨內外二論；方等明內外兩律；百論言內外二道。通源記簡兩重內外：一約域，二約教。約域，即以世間為內，出世為外。約教，即以治心為內，治身為外。是則儒道之教，縱曰治心，且無出世之理，俱屬域內。釋氏之教，雖有治身，亦為出世之因，俱屬域外。梁陳留處士阮孝緒，字士宗，撰七錄十二卷：一、經典，二、傳說，三、子兵書，四、文集，五、術伎。此五名為內篇。六、佛法，七、仙道。此二名為外篇。南山以佛道為方外之篇，起於是矣。莊子大宗師，孔子曰：彼游方之外者也，而丘游方之內者也。通源記問：彼既以道為外，今何判屬內耶？答：彼且以神仙道德之說，非如周孔治世之教，名為外篇。今以佛教望之，其實域內之談耳。言儒教者，范曄云：碩德為儒。楊雄云：通天地人曰儒。孔子姓孔名丘，字仲尼，魯國鄒邑平昌闕里人。為魯司寇，自衛反魯，刪詩書，定禮樂，修春秋，贊易道，以六經為教也。言道教者，隨書經籍志云：蓋萬物之奧，聖人之賾也。老子姓李名耳，字伯陽，諡曰聃，楚苦縣厲鄉曲仁里人。為周守藏室之吏。西入流沙，為函谷關吏尹喜，說五千言，即道德二經為教也。言釋教者，老子西昇經云：吾師化游天竺，善入泥洹。符子云：老子之師，名釋迦文。釋迦所說之法，謂之釋教。後漢郊祀志云：佛教以修善慈心為主，不殺生類，專務清尚。又以人死，精神不滅，隨復受形，所行善惡，後生皆有報應。所貴行善以練其精神，練而不已，以至無生，而得為佛也。有經書數千卷，以虛無為宗，包羅精麤（七胡切），無所不統。善為宏闊勝大之言，所求在一體之內，所明在視聽之表，玄微深遠，難得而測。故王公大人，觀生死報應之際，無不懅然自失也。寶王論曰：三教之理，名未始異，理未始同。且夫子四絕中一無我者，謙光之義，為無我也。道無我者，長而不宰，為無我也。佛無我者，觀五蘊空，為無我也。上二教門，都不明五蘊，孰辨其四諦？六度萬行，聖賢階級，蔑然無聞。但和光同塵，保雌守靜，既慈且儉，不敢為天下先，各一聖也，安用商搉其淺深歟？三教無我明矣！弘明集云：秦景西使，摩騰東來，道暢皇漢之朝，訓敷永平之祀。竺法蘭之入洛，康僧會之游吳。顯舍利於南國，起招提於東都。南山云：自教法東漸，亟涉窊（烏瓜切）隆，三被屏除，五遭拜伏。此非休明之代，乃是暴虐之君，故使布令，非經國之謨；乖常，致良史之誚。事理難反，還習舊津。初東晉成帝咸康六年，庾冰輔政，帝在幼沖，為帝出詔，令僧致拜。時尚書令何充、謝廣等，建議不合拜。往反三議，當時遂寢。安帝元初中，太尉桓玄，上書令拜。尚書令桓謙、中書王謐等，抗諫曰：今沙門雖意深於敬，不以形屈為禮。跡充率土，而趣超方內。是以外國之君，莫不降禮。良以道在則貴，不以人為輕重。尋大法東流，為日諒久。雖風移政變，而弘之不易。豈不以獨絕之化，有日用於陶漸，清約之風，無時害於隆平者乎？玄又致書遠法師，遠著沙門不敬王者論五篇，其事由息。及安帝返政，還崇信奉。有宋劉氏，雖孝武大明六年，暫制拜君，尋依先政。中原元魏太武真君七年，道士寇謙、司徒崔皓，讒於佛法。帝然之。遂滅佛法。逃僧梟斬。後延曇始，頂禮悔過，廢經五載，帝被癘疾，遂誅崔氏，還興佛法。自晉失御中原，國分十六，斯諸偽政，信法不虧。唯赫連㪍㪍，據有夏州，兇暴無厭，以殺為樂。背像背上，令僧禮之。後為天震而死。及葬，又震出之。其子昌襲位，破長安，滅佛法，逢僧斬戮。沙門曇始，被刀不傷，因爾改心。尋為北朝後魏所滅。周武帝初信佛法，後納道士張賓，及前僧衛元嵩之讒，將除佛教。安師著二教論，抗元九流之教，教止其身，名為外教。三乘之教，教靜其心，名為內教。老非教主，易謙所攝。帝聞之，存廢理乖，遂雙除屏。不盈五載，身歿移隋。煬帝嗣錄，改革前朝。雖令致敬，僧竟不屈。唐祖太武出沙汰佛道詔。太宗制拜君親敕，威秀、道宣等上表，及臣僚書，國議不行。武宗會昌五年，道士劉玄靜、趙歸真，非毀釋氏，沙汰佛寺。六年帝崩。宣帝立，復佛寺，誅劉玄靜毀罪。通源記云：或責梁武崇佛，卒有侯景之敗者；蓋不知業通三世，因緣會遇報還受之義。故文中子曰：詩書盛而秦世滅，非仲尼之罪也；玄虛長而晉室亂，非老莊之罪也；齋戒修而梁國亡，非釋迦之罪也。此說明矣（吳書云：吳主問三教，尚書令闞澤對曰：孔老設教，法天制用，不敢違天；佛之設教，諸天奉行）。",
    "卍": "熏聞曰：志諴纂要云：梵云室利靺瑳。此云吉祥海雲。如來[胸]臆有大人相，形如𭮐字，名吉祥海雲。華嚴音義云：案卍字，本非是字。大周長壽二年，主上權制此文，著於天樞，音之為萬，謂吉祥萬德之所集也。經中上下，據漢本總一十七字，同呼為万。依梵文，有二十八相云云。",
    "𭮐": "苑師云：此是西域万字，佛[胸]前吉祥相也。[ㄙ/(刃*工*刃)/一/(、*、*、)/口],音万，是吉祥勝德之相，由髮右旋而生，似[ㄙ/(刃*工*刃)/一/(、*、*、)/口]字，梵云塞縛悉底迦。此云有樂。有此相者，必有安樂。若卍、旡、萬、万字，是此方字。宋高僧傳明翻譯四例：一、翻字不翻音，諸經咒詞是也；二、翻音不翻字，如華嚴中旡字是也，以此方万字翻之，而字體猶是梵書；三、音字俱翻，經文是也；四、音字俱不翻，西來梵夾是也。",
    "��": "章安疏云：言伊字者，外國有新舊兩伊。舊伊橫豎，斷絕相離，借此況彼。橫如烈火，豎如點水，各不相續。不橫，不同烈火。不豎，不同點水。應如此方草下字相。細畫相連，是新伊相。舊伊可譬昔教三德，法身本有。般若修成，入無餘已，方是解脫，無復身智。如豎點水，縱而相離。又約身約智，分得有餘解脫。橫一時有，三法各異，如橫烈火，各不相關。新伊者，譬今教三德。法身即照，亦即自在。名一為三，三無別體，故不是橫。非前非後，故是非縱。一即三，如大點；三即一，如細畫。而三而一，而一而三。不可一三說，不可一三思，故名不可思議者。不可思議者，即非三非一，名祕密藏，如世伊字。谷響云：西方字有新舊，亦猶此土之篆隸也，莫不以篆為舊，以隸為新。",
    "殺三摩娑": "此云離合。欲顯三點非縱橫相，當示修性有離合法。三道至迷，理性之法法圓具；二因開悟，修習之事事融通。開則各離為三，對乃共合成一。論此三點，試開十門：初本文、二消名、三釋義、四定體、五示相、六究意、七判教、八定位、九決疑、十指訛。初本文者，大經云：一切諸法本性自空。亦用菩薩修習空故，見諸法空。起信論云：以知法性體無慳貪，隨順修行檀波羅蜜。天台別行玄云：原此因果根本，即是性德緣了也。此之性德本自有之，非適今也。又云：以此二種方便修習，漸漸增長，起於毫末，得成修德合抱大樹。荊溪不二門云：性德祗是界如一念。此內界如，三法具足；性雖本爾，藉智起修。此皆修性之明文。大經云：解脫之法，亦非涅槃；如來之身，亦非涅槃；摩訶般若，亦非涅槃。章安涅槃玄釋：文云法身亦非，那可單作三身釋大？文云解脫亦非，那可單作三脫釋滅？文云般若亦非，那可單作三智釋度？故知單釋非今經意。三德中各各求，皆不可得；三法合求，亦不可得。智者妙玄云：此之妙行，與前境智，一而論三，三而論一。荊溪云：又了順修對性，有離有合。離謂修性各三，合謂修二性一。永嘉云：偏中三，應須簡。一、有般若，無解脫法身；二、有解脫，無法身般若；三、有法身，無解脫般若。有一無二故不圓，不圓故非性。又，偏中三，應須揀。一、有般若解脫，無法身；二、有解脫法身，無般若；三、有法身般若，無解脫。有二無一故不圓，不圓故非性。圓中三，應須具。一、法身不癡即般若；般若無著即解脫；解脫寂滅即法身（二三例爾）。此皆離合之本文。二、消名者，修謂立行進趣，起正助之二因；性謂本自體性，即界如之一念。凡夫迷故，從真起妄，猶鏡塵翳。緣了之明性自存，故具理性之德。行人悟故，背塵合覺，似鑑揩磨，妍醜之影像遂現，故有修成之德。三、釋義者，離合之法，南屏法師嘗立三義，以伸明之：一、離是各也，離謂修性各三；合是共也，合謂修二性一。二、離乃開也，約性恆開；合乃對也，對修方合。三、離即與義，與而言之，一性本具於二修，二修常即乎一性；合即奪義，理即雖具緣了，奪而言之，由不發心，未曾加行，故性緣了，祗名正因。二修雖具法身，因智照故，但名了因。由起行故，合名緣因。四、定體者，欲示離合教相，須劾修性法體，良以若性若修，皆以三千總相以為其體。故起信云：心真如者，即是一法界大總相法門體，所謂心性不生不滅；心雖本真，不覺起妄。經云：心如工畫師。造種種五陰，一切世間中，無不從心造。由此無明為緣，成眾生法。維摩詰言：譬如幻師見所幻人，菩薩觀眾生為若此。由悟斯理，故有佛法。法華云：唯佛與佛，乃能究盡諸法實相。而此三法，既互具於三千，亦各攝乎百界。體其本寂，乃名理具；照於起心，則名事造；修性雖二，三千體一。故妙樂云：祗緣理一，是故修性相對離合。五、示相，孤山顯性錄示離相曰：一家修性正義，即約玄文前三妙也。境即性三，智即智三，行即行三。行之所階，即有諸位。若至初住，名隨分果，則分證三法也；若就合說，即合性為一，合修為二。合理性三為一正因，法身德也；合智三為一了因，般若德也；合行三為一緣因，解脫德也。故開雖具九，九只是三，三九雖殊，其理常一。今詳此說，文會義便，以釋離義。文會釋籤：境即理性三德，智即三德之解，行即三德之觀。洎明合義，文會釋籤：一謂涅槃，三謂三德。言義便者，離合既是迷悟，與奪當在住前。若至初住，修性一合，無復分張，奚論與奪之別歟！二四明指要鈔云：如光明玄十種三法，采取經論修性法相，故具離合兩說。如三德三寶，雖是修德之極，義必該性；三身三智，文雖約悟，理必通迷；三識三道，既指事即理，必全性起修。此六豈非修性各三？三因，既以一性對智行二修；三菩提、三大乘、三涅槃，並以一性對證理起用二修。此四豈非修二性一？今謂修性一門，本依智行二妙。對境妙在迷之理，相對與奪，而論離合，十種三法乃顯。果人所證三德，並屬於悟，棄親本文，遠取他部，此迷文矣。又，山家離合，大有二義：一、約修性相成，在性則全修成性，性自有三。起修則全性成修，修自具三。二、約修性相對，離謂修性各三，合謂修二性一。今用修性各三，而解修六性三，此混相成相對之門，復亂六法九法之數，斯皆義焉！三、淨覺雜編云：予嘗有文心解，具引玄籤注之，大意與孤山不異（說離同也）。但取境智行三，圓對三德（此說合異）。故雜編云：如三身中，法身可解，報即般若，應即解脫。三般若中，實相即法身，觀照即般若，文字即解脫。三解脫中，性淨即法身，圓淨即般若，方便淨即解脫。此似合掌合矣，亦如川字合焉。若以性、德、緣了，歸修報應。修中法身，合性正因，此失與奪之義，又違金錍，故性、緣了，同名正因。四、南屏斷於離合，大有四種：一者三一。釋籤云：一謂涅槃，三謂三德。二者三六，金錍本有三種，三理元遍，達性成修，修三亦遍，離雖有六，合則但三。三者三九，離謂修性各三（此成九法），合謂修二性一（此成二法）。四者性九修十八，如光明夢見金鼓之文。今謂三一三九，是離合之正義。修三性三，屬全性以起修，非對辨於離合。五、先稟清辨老師，嘗分二義：一、修性各論離合，二、修性對論離合。且各論者，如金錍云：本有三種，三理元遍，此乃在性，則全修成性。性自離九，自合成三，達性成修，修三亦遍，此乃起修，則全性成修。修亦離九，亦合成三。斯約橫論兩重離合。若對論者，如釋籤云：離謂修性各三，性無所移，修常宛爾，故有九法。合謂修二性一，此約功力，與奪，相對論合。性中緣了無功，斥為一性，修德法身受熏，奪名二修。茲約豎論一番離合。六、究意者，今宗示此離合之法，為顯法體不思議故，何哉？雖論合三為一，一不定一，一自常三；雖示離一為三，三不定三，三自常一。故章安曰：橫之彌高，豎之彌廣，會之常分，泒之常合。七、判教者，如金錍云：論生兩教，似等明具，別教不詮種具等義，非此可述。故別佛性，滅九方見。圓人則達九界三道，即見圓伊三德體遍。別教不談乎種具，遂說修性之縱橫。圓宗由示於體遍，故演修性之離合。此顯共而不雜，復彰離亦不分。八、定位者，教既唯圓，位須簡濫。初局住前，二通初後，三示極果。初、局住前者。不二門云：如鏡本來具三，依理生解，故名為智。智解導行，行解契理。初住既三法相符，與奪離合，局住前也。二、通初後者。顯性錄云：一家緣了之位，深淺與奪，非止一途。若法華壽量疏文：則住前通是緣因，初住真正顯了，乃是了因。以約聲聞聞經得記，即入初住。此約真似分緣了。若藥草喻疏：至於究竟，名為智三，中間四即，悉為行三。以順經文，究竟至於一切智故。此以分極分緣了。若法師品疏：道前真如即是正因；道中真如即為緣因，亦名了因；道終真如即是圓果。記云：此以修德，對彼正因。正中緣了，同成正因；修中正因，同成緣了。又云：此以博地為道前，發心已後為道中，位分之為二。住前為緣，登住已去為了。此之三因，該通一教。三、示極果者。涅槃玄釋大滅度：文云法身亦非，那可單作三身釋大？文云解脫亦非，那可單作三脫釋滅？文云般若亦非，那可單作三智釋度？先達乃謂大滅度三，既各開九，乃成離為二十七法。今謂章安玄云：雖一而三，雖三而一；雖復三一，而非三一；雖非三一，而三而一，不可思議，攝一切法。祖師為顯三德圓融，異乎縱橫並別，後裔分析為二十七法，去道遠矣。九、決疑者，或人問曰：性中三法，若起二修，乃顯祗有一法。安言合三為一耶？南屏釋云：祗一三德，說有開合。若從迷論，則合三為一；若就悟言，則起修為二。如身與臂，縛則合為一身，解則開成三處。先師解曰：終日隨緣雖起二修，何妨性中終日不變。所謂性無所移，修常宛爾。十、指訛者，光明懺悔品：夢中見聞有二：一夢見金鼓，二夢擊鼓聲。見鼓又三：一、正見鼓（鼓體睹法身），二、見鼓光（光智睹報身），三、見光中佛（佛即應身）。二、夢見擊鼓又為三：一、見擊鼓，二、出大音聲，三、聲所詮辨（鼓是法身，桴鼓合是報身，擊出是應身）。舊謂夢見金鼓，三身各三，是性中九法。夢見擊鼓，是修中九法，遂說三九二十七法。新記斥曰：前文見鼓，是法身之三，即境三也。鼓光之三，即智三也。見佛之三，即用三也。今文但明能擊之人，用智擊鼓，何曾論於修性二十七法耶？又如四明記曰：上鼓表三光三佛，三祗是一三。今對信相機智所觀，合三為一，但名法身，此乃修性融即之明鑑。學斯宗者，當了世伊三點，天主三目。異別教之縱橫，建圓宗之離合。顯修性之一致，會生佛以同原。絕思議之門，非數量之法。故淨名詞喪於毗耶，釋迦言罄於摩竭，故名不思議之法矣。",
    "薩迦耶": "竦疏，具云薩迦耶達利瑟致。此云身見。百法論疏云：謂於五蘊執我、我所，一切見趣所依為業。",
    "達梨舍那": "此云見。見有五種：一、身見（執我我所為身見），二、邊見（邊見隨身計斷常），三、見取（見取執劣以為勝），四、戒取（戒取於非因計因），五、邪見（邪見撥無因果法）。具此五種，名曰見惑。止觀云：見則見理，見實非惑。見理之時，能斷此惑，從解得名，名為見惑。復次：見惑非但隨解得名，亦當體受名，稱之為假。假者，虛妄顛倒，名之假耳。當知見惑，乃有三種：一、俱生見，二、推理見，三、發得見。一、俱生見者，止觀云：五鈍何必是貪瞋，如諸蠕動，實不推理，而舉𧑃張鬐，怒目自大。底下凡夫，何嘗執見？行住坐臥，恆起我心。故知五鈍，非無利也（記云：鈍中有利，如虫獸凡夫亦能起我，我即是利，雖利屬鈍。又云：底下之人雖起於利，此利屬鈍，從於鈍使背上而起）。二、推理見，止觀云：今約位分之，令不相濫，未發禪來。雖有世智推理辯聰，見想猶弱，所有十使，同屬於鈍（記云：未得禪來，縱起宿習，所有煩惱，及因見陰，起於我見，仍屬鈍使，初果所斷，凡夫共有，冥伏在身，障真無漏。若見諦理，此惑自除。故名此惑以之為見，故不同於禪後所起）。三、發得見，止觀云：從因定發見，見心猛盛，所有十使，從強受名，皆屬於利（記曰：若諸外道，由未見諦，得禪定已，雖斷鈍使，仍未曾斷一毫見惑。見惑現前，故不同於未發禪來所有見惑，及冥伏者，是故不以八十八使中見惑為例。故八十八使義屬陰境攝）。略言三結，廣說八十八使（今述頌曰：苦具十使集滅七，身邊戒取三使無，道諦但去身邊二，上不瞋成八十八）。略言三結者，一身見，二戒取，三疑使。更加貪瞋，名五下分。如妙樂云：言下分者，貪雖通上，不是唯上。瞋一唯下，更不通上，餘三遍攝一切見惑。今問：見通五利，何故俱舍但言三結？答：如論頌曰：攝根門故。言根門者，身見即苦門。戒禁取，即苦道二門。疑通四門，謂四諦也。所言攝根者，邊見依身見轉，見取依戒禁轉，邪見依疑轉，故此三結，即攝五見。問：見惑既歷三界四諦，安云餘三遍攝一切見惑？雖復通上，而復牽下耶？答：所迷之諦，雖通三界，能牽之惑，正在欲界。故云縱斷貪等至無所有，由身見等還來欲界。問：如妙玄云：斷見諦惑，而復兼除四思。未審何法為思耶？答：此以四趣之思，為四思也。以妙玄因明因益，是故凡位持戒，則伏四趣之業。初果修觀，則斷四趣之思。以俱生推見二思，隨見落故，乃曰兼除。應知思惑乃有三種。一、俱生思，與形俱生，如男女託胎，妄於父母起愛惡心，斯是邪思，還歸見惑。二、依見思。止觀云：五利豈唯見惑，何嘗無恚欲耶（記云：利中有鈍，如諸外道，依於諸見而起瞋恚）？問：止觀云：若利中有鈍，見諦但斷於利，鈍猶應在？答：準止觀云，毗曇謂利上之鈍，名背上使。見諦斷時，正利既去，背使亦去。三、界繫思，即是三界九品思惑。此名鈍使，亦名事障，號正三毒（俱生如杜牧云）。夫七情愛怒二者，生而自能，是二者，性之根，惡之端也。乳兒見乳必拏，求不得即啼，是愛與怒與兒俱生也。問：五上分者：一掉舉（高舉，是貪家等流），二慢，三無明，四色染，五無色染（由貪重故，兩界別說）。何故上界而無疑耶？答：疑隨見落，故無此惑。淨名疏以五蓋配四分，貪欲瞋恚，睡疑屬癡（記云：由癡故睡，由癡故疑），掉散是我取（記云：以我取心，遍起三毒，故名掉散）。止觀云：掉有三種：一身掉，身好游走，諸雜戲謔，坐不暫安。二口掉，好喜吟詠，競爭是非，無益戲論，世間語言等。三者心掉，心情放逸，縱意攀緣，思惟文藝，世間才技，諸惡覺觀等，名為心掉。此四各出二萬一千。新華嚴云：貪行多者二萬一千，瞋行多者二萬一千，癡行多者二萬一千，等分行者二萬一千，了知如是悉是虛妄。垂裕釋十纏是思惑：忿恚曰瞋；隱藏自罪曰覆；意識昏迷曰睡；五情暗冥曰眠；嬉遊曰戲；三業躁動曰掉；屏處起罪不自羞曰無慚；露處起罪不羞他曰無媿；財法不能惠施曰慳；他榮心生熱惱曰嫉。俱舍頌曰：纏八無慚愧，嫉慳并悔眠；及掉舉昏沈，或十加忿覆。楞嚴明十習：一、婬習（節疏云：婬習即所發之業，具足貪癡），二、貪（即是愛根本之數），三、慢（恃己陵他，高舉為性），四、瞋（熱惱居懷，性不安隱故），五、詐習（詐謂諂曲，罔冒於他，矯設異儀，諂曲為性），六、誑（誑謂矯誑，心懷異謀，多現不實，矯現有德，詭詐為性，邪命為業），七、怨（即恨也，由忿為先懷惡不捨，結冤為性，不能含忍，常熱惱故），八、見（即五種見。輔行云：大經二十三云，謂離五事，即五見也。因是五見，生六十二。章安云，此有二意：一者、我見有五十六，謂欲界五陰，各計四句，合為二十；色界亦爾，無色除色，但有十六。故知三界合為五十六。邊見有六，三界各二，謂斷常，添前合成六十二見。二者、三世五陰，各計斷常，用有無二見而為根本。此準大論六十八文。謂色如去等四句，四陰亦然。合二十句，此即計過去世也。又計色常等四句，四陰亦然。合二十句，此即計現在世也。又計色有邊等四句，四陰亦然。合二十句，即計未來也。三世六十，并有無二），九、枉（謂逼壓良善，害所攝也，亦瞋之類），十、訟習（謂相論得失，忿恨為先，惱之一法，性相應故）。",
    "尼延底": "此云深入，貪之異名。樂著名貪。能貪之人有二種：一者有力，二者無力。所貪之境，禪門明三種：一、外貪欲，男子緣女人，女人緣男子。二、內外貪欲，外緣男女身相，復緣內身形貌。三、遍一切處貪欲，眾生處處著。俱舍明四種：一顯色，謂青黃赤白也。二形色，謂長短方圓等。三妙觸，四供奉。大論明六種：一著色，若赤若白，若黃若黑。二或著形容，細膚纖指，脩目高眉。三或著威儀進止，坐起行住，禮拜俯仰，揚眉頓𥇒，親近按摩。四或著言語，軟聲美詞，應意承旨。五或著細滑，柔膚軟肌，熱時身涼，寒時體溫。六或著人相，若男若女。",
    "羯吒斯": "此云愛之別名。涅槃云：愛河泂澓沒眾生，無明所盲不能出。貪與於愛，圭峰圓覺約四句釋：一、貪非愛（如人貪忙，非乃是愛忙），二、愛非貪（如人愛看相打相殺，誰肯貪求），三、亦貪亦愛（即名利財色），四、非貪非愛（即違情之境）。管子云：利之所在，雖千仞之山，無所不上，深源之下，無所不入。商人通賈，倍道兼行，夜以續日，千里不遠，利在前也。漁人入海，海水百仞，衝波迸流，宿夜不出，利在水也。漁父：，人有八疵：非其事而事之，謂之總（總，濫也。非是己事，而強知之，謂之叨濫也）。莫之顧而進之，謂之佞（強進忠言，人不采顧，謂之佞）。希意導言，謂之諂（希望前人意氣，而導達其言）。不擇是非而言，謂之諛（調苟順物，不簡是非）。好言人之惡，謂之讒（聞人之過，好揚顯之）。析交離親，謂之賊（人有親情交故，輒欲離而析之，斯助害也）。稱譽詐偽，以販惡人，謂之匿（與己親者，雖惡而譽；與己疏者，雖善而毀）。不擇善否，兩容顏適，偷拔其所欲，謂之險（否，惡也。善惡二邊，兩皆容納。和顏悅色，偷拔其意之所欲，隨而佞之，斯險詖之人也）。此八疵者，外以亂人，內以傷身。君子不友，明君不臣。漁父：事有四患：好經大事，變更易常，以掛功名，謂之叨（伺候安危，經營大事，變改之際，建立功名，謂叨濫之人）。專知擅事，侵人自用，謂之貪（專己獨擅，自用陵人，謂之貪）。見過不更，聞諫愈甚，謂之狠（有過不改，聞諫彌增，謂之狠戾之人）。人同於己則可，不同於己，雖善不善，謂之矜（物同於己者，雖惡而善；物異乎己者，雖善而惡。謂之矜夸之人）。",
    "提鞞沙": "此云瞋恚。恚，怒恨也。禪門明三種瞋：一、非理瞋，他不來惱，而自生瞋。二、順理瞋，外人來惱，爾乃生瞋。亦如淨土，有正三毒。三、諍訟瞋，著己之法謂是，在他之法言非，由茲不順，而生惱覺。",
    "慕何": "此云癡。禪門明三種癡：一、計斷常，過去諸法為滅有耶，現在諸法不滅有乎？推尋三世，若滅即斷，不滅乃常。二、計有無，我及陰等，有耶無耶？如是乃至非有非無。三、計世性，作是念言：由有微塵，即有實法；有實法故，乃有四大；有四大故，乃有假名。眾生世間，因茲思念，而行邪道。阿含正行經：佛坐思念，人癡故有生死。何等為癡？本從癡中來，今生為人復癡。心不解，自不開，不知死當所趣向。見佛不問，見經不讀，見沙門不承事。不信道德，見父母不敬，不念世間苦，不知泥犁中拷治劇，是名癡，故有生死。不止生死，如呼吸間，膬（音脆）不過於人命。然此貪瞋癡，名為三毒。中陰經云：三毒之重者，癡病是其原。又，此三毒，須分二種：一者、三毒惑。別行記云：任運起者名為煩惱。止觀云：昏煩之法，惱亂心神，與心作煩，令心得惱。二者、三毒業，別行記云：卒起決定，能動身口，名三毒業。瑞應云：貪欲致老，瞋恚致病，愚癡致死，義推等分致生。又復須知業有多種。如智論云：黑業者，是不善業。果報地獄等受苦惱處，是中眾生以大苦惱悶極故，名為黑。受善果報處，所謂諸天，以其受樂，隨意自在、明了故，名為白業。是業是三界天。善不善受果報處，所謂人、阿脩羅等八部，此處亦受樂亦受苦故，名白黑業。問：無漏業應是白，何以言非白非黑？答：無漏法，雖清淨無垢，以空無相無作故，無所分別，不得言白。黑白是相待法，此中無相待故，不得言白。復次：無漏業，能滅一切諸觀，觀中分別，故有黑白。此中無觀，故無白（云云）。然遺教云：我如良毉，知病說藥。妙玄云：作大醫王，須解脈種種病，識種種藥，精種種治，得種種差。仁王云：佛知眾生有三種病：一者貪病，二者瞋病，三者癡病。既知此病，當投於藥。故仁王云：治貪瞋癡三不善根，起施慈慧三種善根。治貪則教布施。故光明云：捨諸所重肢節手足。治瞋則教行慈悲。故法華云：常柔和能忍，慈悲於一切。治癡則教修智慧。故遺教云：實智慧者，則是度老病死海堅牢船也，亦是無明黑暗大明燈也。雖有此藥，服與不服，非毉咎也。故華嚴云：譬如善方藥，自疾不能除；於法不修行，多聞亦如是。",
    "阿耆毗伽": "此云邪命，以邪法活命根也。智論云：如經中說，舍利弗入城乞食，得已，向壁坐食。時，梵志女，名曰淨目。見而問曰：沙門，汝食耶？答言：食。淨目問：下口食耶？仰口食耶？方口食耶？四維口食耶？俱答云：不。淨目言：食法四種。我問汝，汝言不，我不解。汝當說。舍利弗言：有出家人，合藥種穀植樹，不淨活命，名下口食。有出家人，觀視星宿，日月風雨，雷電霹靂，不淨活命，名仰口食。有出家人，曲媚豪勢，通使四方，巧言多求，不淨活命，名方口食。有出家人，學種種咒術，卜算吉凶，如是活命，名四維口食。姊！我不墮是四不淨食，我用清淨乞士活命。是時淨目聞說清淨法食，歡喜信解。舍利弗因為說法，得須陀洹。又智論釋八正道云：五種邪命，以無漏智慧捨離，是為正命。問：何等是五種邪命？答：一為利養故，詐現奇特；二為利養故，自說功德；三為利養故，占相吉凶；四為利養故，高聲現威，令人畏敬；五為利養故，稱說所得供養，以動人心。邪因緣活命故，是為邪命。",
    "阿羅伽": "此云欲，希須為義。五情之所欲，是名五欲。大論云：哀哉眾生！常為五欲所惱，而欲求之不已。此五欲者，得之轉劇，如火炙疥。五欲無益，如狗齧骨。五欲增爭，如烏競肉。五欲燒人，如逆風執炬。五欲害人，如踐惡蛇。五欲無實，如夢所得。五欲不久，假借須臾。世人愚惑，貪著五欲，至死不捨，為之後世受無量苦。譬如愚人貪著好果，上樹食之，不肯時下。人伐其樹，樹傾墮落，身首毀壞，痛惱而死。然此五欲分界內外。如大論云：二乘但斷界內五欲，故世間五欲所不能動。別惑未除，故為界外上妙色聲之所染汙。故迦葉云：三界五欲，我已斷竟，不能動心。此是菩薩淨妙五欲。吾於此事不能自安。此是迦葉為界外之聲動。天女散花，身子除去，此為界外之色動。又分別生死、涅槃有異，分別亦是別見，斯為法塵所惑也。",
    "奢他": "此云諂曲。罔冒他故，矯設異儀，曲順時人。",
    "汙栗䭾": "此方稱草木心。",
    "矣栗䭾": "此方名積聚精要心。",
    "紇利陀耶": "此云肉團心，即意根所託也。故云：意如幽室見。夫言根者，義有二種：一者浮塵外根，二勝義內根。言浮塵者，四大是能造，四微是所造；色、香、味、觸四微和合，乃得成根。故楞嚴云：我今觀此浮根四塵，只在我面。資中云：浮虛不實，昏翳真性，故曰浮塵。此浮塵外根也。言勝義者，即清淨四大。洪敏鈔云：此勝義根，雖用能造所造八法為體，是不可見。有對色能，照境發識，乃聖人所知之境。其義深遠，非同塵境麤淺，故名清淨。此是染中說淨，非無漏妙明之淨。此勝義內根也。大論問：何故三識所知合為一，鼻舌身識名為覺；三識所知別為三，眼名見，耳名聞，意知名為識？答：是三識助道法多，是故別說；餘三識不爾，是故合說。是三識但知世間事，是故合為一；餘三識亦知世間，亦知出世間，是故別說。復次，是三識但緣無記法，餘三識或緣善，或緣不善，或緣無記。復次，是三識能生三乘因緣，如眼見佛及弟子，耳聞法，心籌量正憶念，如是等種種差別。勝天王經，佛告天王：菩薩摩訶薩，以方便力，行般若波羅蜜，於一切法心緣自在。緣一切色，願得佛色無所得故；心緣眾聲，願得如來微妙音聲；心緣眾香，願得如來清淨戒香；心緣諸味，願得如來味中第一大丈夫相；心緣諸觸，願得如來柔軟手掌；心緣諸法，願得如來寂靜之心；心緣自身，願得佛身；心緣自口，願得佛口；心緣自意，願得如來平等之意。天王！菩薩摩訶薩，行般若波羅蜜，無有一心一行空過，不向薩婆若者。遍緣諸法，而能不著；觀見諸法，無不趣向菩提之道。菩薩修習諸行，皆因外緣而得成立。又如大地住在水上，若鑿池井，即得水用。其不鑿者，無由見之。如是聖智境界遍一切法，若有勤修般若方便，則便得之。其不修者，云何能得？",
    "蜱羅尸": "或閉尸，此云肉團。見經音義。",
    "質多耶": "或名質帝，或名波茶。此方翻心。黃庭經五藏論目之為神。西域外道計之為我。此土佛教翻緣慮心。此通八識，謂眼緣色，乃至第八緣根身種子器世間。故云：集起以解心，第八獨名心，緣慮以解心（緣謂緣持，慮即思慮），八識總名心。然此緣慮亦名慮知（宗鏡云：無幽不矚，有法皆知，察密防微，窮今洞古，故謂之靈臺。司馬彪云：心為神靈之臺。莊子云：萬惡不可內於靈臺）。百法論疏：心法有六種義：一、集起名心，唯屬第八，集諸種子，起現行故。二、積集名心，屬前七轉，能熏積集諸法種故。或初集起，屬前七轉，現行共集，熏起種故。或後積集名心，屬於第八，含藏積集，諸法種故。此上二解，雖各有能集所集之義，今唯取能集名心，如理應思。三、緣慮名心，俱能緣慮自分境故。四、或名為識，了別義故。五、或名為意，等無間故。六、或第八名心，第七名意，前六名識。入楞伽云：藏識說名心，思量性名意，能了諸境相，是故名為識。然第六意識，具有五種：一、定中獨頭意識，緣於定境，定境之中，有理有事。事中有極略色，極迴色，及定自在所生法處諸色。二、散位獨頭，緣受所引色，及遍計所起諸法處色，如緣空華鏡像彩畫所生者，並法處攝。三、夢中獨頭，緣夢中境。四、明了意識，依五根門，與前五識同緣五塵。五、亂意識，是散意識，於五根中狂亂而起，如患熱病，青為黃見，非是眼識，是此緣故。宗鏡第六識具十名：一、從根得名，名為六識；二、能籌量是非，名為意識；三、能應涉塵境，名攀緣識；四、能遍緣五塵，名巡舊識；五、念念流散，名波浪識；六、能辨前境，名分別事識；七、所在壞他，名人我識；八、愛業牽生，名四住識；九、令正解不生，名煩惱障識；十、感報終盡，心境兩別，名分段死識。",
    "末那": "唯識翻意。或云執我，亦云分別。唯識宗云：具足應言訖利瑟吒耶末那。此翻染汙意。謂我癡、我見、我慢、我愛，四惑常俱，故名染汙。常審思量，名之為意。思慮第八，度量為我，如是思量，唯第七有，餘識所無，故獨名意。復能了別，名之為識。前之六識，從根得名；此第七識，當體立號。識論頌云：次第二能變，是識名末那。依彼轉緣彼，思量為性相。四煩惱常俱，謂我癡、我見，并我慢、我愛，及餘觸等俱，有覆無記攝。大乘入楞伽：大慧問佛：云何但說意識滅，非七識滅？佛言：大慧，以彼為因，及所緣故，七識得生。大慧，意識分別境界，起執著時，生諸習氣，長養藏識。由是意俱，我我所執，思量隨轉，無別體相，藏識為因，為所緣故。執著自心，所現境界，心聚生起，展轉為因。大慧，譬如海浪，自心所現境界，風吹而有起滅，是故意識滅時，七識亦滅。然楞伽經唯明三識，不辨七識者，準此文云無別體相，所以唯說八六二識。起信亦然。通源問：現識屬第八，事識屬前六，何故不言第七識耶？答：七識名染汙意，常時執取第八為我。是則若言第八，必兼第七。故瑜伽論云：賴耶識起，必二識相應。又，事識緣外境時，必依第七。是故不說。宗鏡問：第六能斷惑成無漏，第七不能斷惑，何故亦成無漏？答：謂第七識，是第六所依根，第六是能依識。能依識既成無漏，第七所依亦成無漏。謂第六入生法二空觀時，第七識中俱生我法二執現行，伏令不起，故第七成無漏。問：何故第八是有漏耶？答：第八是總報主，持種受熏。若因中便成無漏，即一切有漏雜染種子，皆散失故，即便成佛。何用更二劫修行耶？問：前五既非是總報主，何故不成無漏？答：前五根是第八親相分，能變第八，既是有漏，所變五根，亦有漏。五根是所依，尚有漏，能依五識，亦成有漏也。宗鏡七識十名：一、六後得名，稱為七識；二、根塵不會，名為轉識（宗鏡云：轉為改轉是不定義，即三性三量三境，易脫不定，方名轉識）；三、不覺習氣忽然念起，名妄想識；四、無間生滅，名相續識；五、障理不明，名無明識；六、返迷從正，能斷四住煩惱，名為解識；七、與涉玄途，順理生善，名為行識；八、解三界生死，盡是我心，更無外法，名無畏識；九、照了分明，如鏡顯像，故名現識；十、法既妄起，恃智為懷，令真性不顯，名智障識。",
    "阿賴耶": "或阿梨耶。起信云：以依阿梨耶識，說有無明，不覺而起。能見能現，能取境界。真諦就名翻名無沒識，取不失之義。奘師就義翻為藏識，能含藏諸法種故。又，此識體，具三藏義：能藏，所藏，執藏。故名為藏。謂與雜染互為緣故，有情執為自內我故，復能了別種子、根身、及器世間，三種境故，名之為識。古釋云：一、能藏者，即能含藏義。猶如庫藏，能含藏寶貝，故得藏名。此能含藏雜染種故，名之為藏，亦即持義。二、所藏者，即是所依義。猶如庫藏，是寶等所依故。此識是雜染法所依處故。三、執藏者，堅守不捨義。猶如金銀等藏，為人堅守，執為自內我，故名為藏。此識為染末那堅執為我，故名為藏。起信鈔釋云：能藏、所藏者，且所藏義。謂此識體藏，是根身種子器世間所藏處也。以根等是此識相分故。如藏中物像，如身在室內，欲覓賴耶識，祗在色心中；欲覓摩尼珠，祗是青黃內。次能藏義，謂根身等法，皆藏在識身之中。如像在珠內，欲覓一切法，總在賴耶中，欲覓一切像，總在摩尼內，與前義互為能所，故云能藏自體。於諸法中，能藏諸法於自體內。或名宅識（一切種子之所棲處），或名心，由種種法，熏習種子，所積集故（積集義故名心，集起義故名心）；或名阿陀那，執持種子，及諸色根，令不壞故（宗鏡云：又將死時，唯異熟心，由先業力，恆遍相續，執受身分，捨執受處，冷觸便生，壽燸識三，不相離故，冷觸起處，即是非情）。宗鏡問：諸根壞日，識遷離時，捨此故身，別受餘質，去來之識，相狀云何？答：顯識經：佛告賢護：識之運轉，遷滅往來，猶如風大，無色無形，不可顯現，而能發動萬物，示眾形狀。或搖振林木，摧折破裂，出大音聲。或為冷為熱，觸眾生身，作苦作樂。風無手足面目形容，亦無黑白黃赤諸色。賢護，識界亦爾。無色無形，無光明顯現，所熏因緣故，顯示種種功用殊勝。或名所知依，能與染淨所知諸法為依止故（即三性與彼為依，名所知依）。或名種子識（梵語阿世耶，此云種子），能遍住持世出世間諸法種子故（古德云：從無始時來，此身與種子，俱時而有，如草木等種）。唯識論云：一切種子，皆本性有。不從熏生，由熏習力，但可增長。如契經說：一切有情，無始時來，有種種界。如惡叉聚，法爾而有。界即種子差別名故，有如外草木等種。護法意云：有漏無漏種子，皆有新熏本有，合生現行，亦不雜亂。若新熏緣，即從新熏生；若本有遇緣，即從本有生。攝論云：此阿賴耶識與種子如此共生，雖有能依所依，不由體別故異。乃至能是假無體，所是依是實有體。假實和合異相，難可分別，以無二體故。此識先未有功能，熏習生後，方有功能，故異於前。前識但是果報，不得名一切種子；後識能為他生因，說名一切種子。前識但生自相續，後識能生自他相續，故勝於前。攝論云：第八識從種子生，故稱果報識。能攝持種子故，亦名種子識。宗鏡云：本識是體，種子是用。種子是因，所生是果。問：熏、生何別？答：熏是資熏，擊發之義。生是生起，從因生出之義。謂本識等，雖無力資熏擊發自種之義，而有親生自種之義。如本有無漏種子，雖有生果之能，若不得資加二位，有漏諸善，資熏擊發，即不能生現。又如本識中善染等種，能引次後自類種子，雖有生義，無自熏義。如穀麥等種，雖有生芽之能，若不得水土等資熏擊發，亦不能生其現行。本識雖有生種之能，然自力劣，須假六七與熏方生。由是義故，本識等雖非能熏，而能生種，故與親種得為因緣。又，熏者，發也，致也；習者，生也，近也，數也。即發致果於本識內，令種子生近生長故。熏有二種：一、熏習，謂熏心體成染淨等事；二、資熏，謂現行心境及諸惑相資等。攝論云：傳依名法身，由聞熏四法得成：一、信樂大乘，是大淨種子；二、般若波羅蜜，是大我種子；三、虛空品三昧，是大樂種子；四、大悲，是大常種子。此聞熏習四法，為四德種子。四德圓時，本識都盡。四德本來是有，不從種子生。從因作名，故稱種子。然善染如沈麝[韭]蒜等，故不受熏；無記如素帛，故能受熏。如善不容於惡，猶白不受於黑，若惡不容於善，如臭不納於香。唯本識之含藏，同太虛之廣納矣。或名異熟識，能引生死善不善業異熟果故（宗鏡云：又第八識，本無阿賴耶名，由第七執第八見分為我，令第八得阿賴耶名。若不執時，但名異熟識者，此是善惡業果位。以善惡業為因，即招感得此引果故。前世業為因，因是善惡。今世感第八識，是無記，異熟即果，果異於因，故名異熟。又具四義：一實，二常，三遍，四無雜，是名真異熟識。問：第八真異熟識，如何名引果？答：為善惡業為能引，第八為所引，是能引家之果，故名引果，故是總報主。前六識名為滿果，有一分善惡別報來滿故，此滿業所招。名異熟生，非真異熟也。不具四義。唯第八是引果真異熟識，真異熟心。一切時相續酬牽引業，非同滿業有間斷故。以餘轉識不能引業，但來滿善惡之業果。引果之識，遍三界有，六識不遍，無色界無心定等）。或名現識（宗鏡云：具三顯義，一顯現，此簡十識果不顯現故。二現在，簡非前後。三現有，此簡假法。體是實有，方成種子）。故唯識論云：如瀑流水上下，魚草等物，隨流不捨。此識亦爾，與內習氣外觸等法，恆相續轉（唯識論云：常與觸作意受想思相應，阿賴耶識，無始時來，乃至未轉，於一切位，恆與此五心所相應）。天台名無沒識（釋籤云：無始時有，未曾斷絕，故云無沒。宗鏡問云：祖先終歿，後嗣資悼，違三界之惟心，乖萬法之唯識。答：有五力，唯識不判：一定力，二通力，三借識力，四大願力，五法威德力。道氤法師對唐明皇云：佛力法力，三賢十聖亦不能測）。或名隨眠（顯宗論云：相續中眠，故名隨眠。即順流者身中安住，增昏滯義，或隨勝者相續中眠，即是趣入如實解位，為昏迷義。或有獄中，長時隨逐，覆有情類，故名隨眠。又瑜伽云：煩惱麤重，隨附依身，說名隨眠，能為種子，生起一切煩惱故也）。菩薩處胎經云：爾時世尊，將欲示現識所趣向，道識、俗識、有為識、無為識、有漏識、無漏識、華識、果識、報識、無報識、天識、龍識，鬼神阿脩羅迦樓那緊那羅摩睺羅伽人非人識，上至二十八天識，下至無救地獄識。爾時世尊，即於胎中，現勾鏁骨，遍滿三千大千世界（云云）。佛告彌勒：汝觀勾鏁骸骨，令一切眾知識所趣，分別決了，令無疑滯。爾時彌勒菩薩，即從座起，手執金剛七寶神杖，攪勾鏁骨，聽彼骨聲。即白佛言：此人命終，瞋恚結多，識墮龍中。次復攪骨：此人前身十戒行具，得生天上。次復攪骨：此人前身破戒犯律，生地獄中。如是攪骨，有漏無漏，有為無為，從二十八天，至無救地獄，知識所趣，善惡果報，白黑行報。有一全身舍利，無有缺減。爾時彌勒以杖攪之，推尋此識，了不知處。如是三攪，前白佛言：此人神識，了不可知，將非如來入涅槃耶？佛告彌勒：汝紹佛位，於當來世當得作佛，成無上道。何以攪舍利而不知識處耶？彌勒白佛言：佛不思議，不可限量，非我等境界所能籌量。今有狐疑，唯願世尊當解說之。五道神識，盡能得知彼善惡趣，不敢有疑於如來所。今此舍利無有缺減，願說此識，令我等知。佛告彌勒：過去、未來、現在諸佛，舍利流布，非汝等境界所能分別。又，阿賴耶識，無始時來，恆與此五心所相應，以是遍行心所攝故。一、作意者，論云：作意謂能警心為性，於所緣境引心為業（作意警心有二功力，一、心未起時，能警令起；二、若起已，能引令趣境）。二、觸者，論云：觸謂三和分別變異，令心心所觸境為性，受想思等所依為業（觸謂三和者，即根境識。體異名三，不相乖返，更相交涉，名為隨順。根本為依，境可為取，識二所生，可依於根，而取於境。此三之上，皆有順生一切心所功能作用，名為變異）。三、受者，論云：受謂領納違順俱非境相為性，起愛為業。四、想者，論云：想謂於境取像為性，施設種種名言為業。謂要安立境分劑相，方能隨起種種名言（此中安立取像異名，謂此是青非青等，作分劑而取其相，名為安立）。五、思者，論云：思謂令心造作為性，於善品等役心為業。謂能取境正因等相，驅役自心令造善等（此觸等五，與異熟識行相雖異，而時依同所緣事等，故名相應。此識行相，極不明了，不能分別逆順境相，微細一類，唯與捨受相應。又此相應受，唯是異熟，隨先引業轉，不待現緣，任善惡業勢力轉故，唯是捨受，苦樂二受，是異熟生，非真異熟，待緣現故，非此相應）。宗鏡問：一百法中，凡聖總具不？答：若凡夫位，通約三界九地，種子皆具百法。若諸佛果位，唯具六十六法；除根本煩惱六，隨煩惱二十，不定四，不相應行中四，共除三十四法。宗鏡明八識十名：一、七後得名，稱為八識。二、真偽雜間，名和合識。三、蘊積諸法，名為藏識。四、住持起發，名熏變識。五、凡成聖名，為出生識。六、藏體無斷，名金剛智識。七、體非寂亂，名寂滅識。八、中實非假，名為體識。九、藏體非迷，名本覺識。十、功德圓滿，名一切種智識。此識建立有情無情，發生染法淨法。若有知有覺，則眾生界起。若無想無慮，則國土緣生。因染法而六趣回旋，隨淨法而四聖階降，可謂凡聖之本，根器之由。了此識原，何法非悟？證斯心性，何境不真？可謂絕學之門，栖神之宅。又云：第八本識，真如一心，廣大無邊。體性微細，顯心原而無外，包性藏以該通。擅持種之名，作總報之主，建有情之體，立涅槃之因。居初位而總號賴耶，處果位而唯稱無垢。備本後之智地，成自他之利門。隨有執無執（攝論云：一切種子心識成熟，展轉和合，增長廣大，依二執受：一者有色諸根及所依執受，二者相名分別言說戲論習氣執受。宗鏡云：執受各具二義。且執二義者：一、攝義，即攝為自體。二、持義，即持令不散。受二義：一、領義，即領以為境，二、覺義，即令生覺受安危共同。根身具執受四義，一、攝為自體，同是無記性故；二、持令不散，第八能住持此身，令不爛壞；三、領已為境，此根身是第八親相分故；四、令生覺受安危共同。若第八危，五根危；第八安，五根安。若器世間量，但緣非執受，即受二義中，領已為境。問：何以器界不似根身第八親執受？答：以與第八遠故，所以不攝為自體。又器界損時，第八亦不隨彼安危共同，所以不執受。若髮毛爪齒膀胱宿水等雖近，已同外器攝。所以第八亦不執受。應具四句，一、持而不緣，即無漏種。二、緣而不持，即器界現行。三、俱句，即內身根塵。四、俱非，即前七現行），而立多名。據染緣淨緣，而作眾體。含一切而如太虛包納，現萬法而似大地發生。則何法不收？無門不入？但以迷一真之解，作第二之觀，因於覺明能了之心，發起內外塵勞之相。於一圓湛，析出根塵。聚內四大為身，分外四大為境；內以識精為垢，外因想相成塵。無念而境觀一如，有想而真成萬別。若能心融法界，境豁真空，幻翳全消，一道明現。可謂裂迷途之緻網，抽覺戶之重關，惛夢惺而大覺常明，狂性歇而本頭自現。",
    "阿陀那": "義翻執持，能執持種子根身生相續義。執持有三：一、執持根身令不爛壞；二、執持種子令不散失；三、執取結生相續義。即有情於中有身臨末位，第八識初一念受生時，有執取結生相續義。結者，繫也，屬也。於母腹中一念受也，便繫屬彼故。亦如磁毛石吸鐵，鐵如父母精血二點，第八識如磁毛石。一剎那間，便攬而住。同時根塵等種，從自識中，亦生現行，名為執取結生。故楞嚴曰：陀那微細識，習氣如瀑流（檇李云：言習氣者，謂熏習氣分，乃種子異名。以第八識中，無始習氣，微細生滅，流注不息，故如瀑流。解深密經云：如瀑流水，生多波浪，諸波浪等，以水為依，五六七八，皆依此識），真非真恐迷，我常不開演（宗鏡云：佛若一向說真，則眾生不復進修，墮增上慢，以不染而染，非無客塵垢故。若一向說不真，則眾生撥棄自身，生斷見故，無成佛期。故對凡夫二乘，恐生迷倒，常不開演。故解深密經云：阿陀那識甚微細，一切種子如瀑流，我於凡愚不開演，恐彼分別執為我。熏聞云：真諦謂之第七識，蓋取第八染分立名。唯識百法謂之第八識者，則通取染淨和合為因）。解深密經謂之第九者，乃別取第八淨分言之。故攝論云：世尊說法凡有三種：一染汙分，二清淨分，三染汙清淨分。譬如金藏土中有三：一地界，二金，三土輪。以地譬依他性，具染淨二分，此八識。以土譬分別性，為生死染分，此七識。以金譬真實性，為涅槃淨分，此九識。宗鏡云：分別諸識，開合不同，皆依體用。約體則無差而差，以全用之體，不礙用故。約用則差而無差，以全體之用，不失體故。如舉海成波不識海，舉波成海不礙波。非有非無，方窮識性；不一不異，可究心源。古德云：約諸識門，雖一多不定，皆是體用緣起，本末相收。本是九識，末是五識。從本向末，寂而常用；從末向本，用而常寂。寂而常用故，靜而不結。用而常寂故，動而不亂。靜而不結故，真如是緣起。動而不亂故，緣起是真如。真如是緣起故，無涅槃不生死，即八九為六七；緣起是真如故，無生死不涅槃，即六七為八九。無生死不涅槃故，法界皆生死；無涅槃不生死故，法界皆涅槃。法界皆涅槃故，生死非雜亂；法界皆生死故，涅槃非寂靜。生死非雜亂，眾生即是佛。涅槃非寂靜，佛即是眾生。是以法界違故，說涅槃是生死，即理隨情用；法界順故，說生死是涅槃，即情隨理用。如此明時，說情非理外，理非情外。情非理外故，所以即實，說六七為八九。實者，體也。理非情外故，所以即假，說八九為六七。假者，用也。以假實無礙故，人法俱空。以體用無礙故，空無可空。人法俱空，故說絕待。空無可空，故言妙用。如斯說者，亦是排情之言，論其至實者，不可以名相得。至極者，不可以二諦辨。不可以名相得，故非言象能詮。不可以二諦辨，故非有無能說。故云：至理無言，賢聖默然，正可以神會，不可以心求。問：一心湛寂，云何起諸識浪？答：只為不覺，忽爾念生。起信云：以不如實知真如、法一故，不覺心起。摩訶衍論云：即是顯示根本不覺之起因緣。根本不覺，何因緣故，得起而有？因不如故，得起而有。何等法中而不如耶？謂三法中而不如故。言不如者當有何義？謂違逆義故。云何三法？一者實知一法，二者真如一法，三者一心一法，是名為三。實知法者，謂一切覺，即能達智。真如法者，謂平等理，即所達境。一心法者，謂一法界，即所依體。於此三法皆違逆故，無明元起。是故說言，謂不如實知，真如、法一故，不覺心起。彼三種法，皆守一中，終不離故，故通名一。又起信云：以無明熏力，不覺心動，最初成其業識。因此業識，復生轉識等。論釋云：最初不覺，稱為第一業相。能見所見，無有差別，心王念法，不可分析。唯有精勤隱流之義，故名為業。如是流動，只申不覺。第二轉相，以業相念為所依故，轉作能緣，流成了相。第三現相，以了別轉為所依，戲論境界，具足現前，所緣相分，圓滿安布。依此見分，現彼相分。又，動相者，動為業識，理極微細。謂本覺心，因無明風，舉體微動。微動之相，未能外緣，即不覺故。謂從本覺，有不覺生，即為業相。如海微波，從靜微動，而未從此轉移本處。轉相者，假無明力，資助業相，轉成能緣，有能見用，向外面起，即名轉相。雖有轉相，而未能現五塵所緣境相。如海波浪，假於風力兼資微動，從此擊波轉移而起。現相者，從轉相而成現相，方有色塵山河大地器世間等。楞伽經大慧白佛言：世尊，諸識有幾種生住滅？佛告大慧：識有二種生住滅，非思量所知。謂流注生住滅，相生住滅（梵語伱伽，此云流注不斷，言流注者）。唯目第八：三相微隱，種現不斷，名為流注。由無明緣，初起業識，故說為生。相續長劫，故名為住。到金剛定，等覺一念，斷本無明，名流注滅。相生住滅者，謂餘七識，心境麤顯，故名為相。雖七緣八，望六為細，具有四惑，故亦云麤。依彼現識自種，諸境緣合生七識，為相生。長劫熏習，名為相住。從末向本，漸伏及斷，至七地滿，名為相滅。依前生滅，立迷悟依。依後生滅，立染淨依。後短前長，事分二別，即是流注生住滅，相生住滅。仁王般若經云：然諸有情，於久遠劫，初剎那識，異於木石，生得染淨，各自能為無量無數染淨識本。從初剎那不可說劫，乃至金剛終一剎那，有不可說不可說識。生諸有情色心二法。色名色蘊，心名四蘊。宗鏡引古釋：初剎那識，異於木石者，謂一念識，有覺受故，異於木石。即顯前念中有末心，所見赤白二穢，即同外器木石種類。此識生時，攬彼為身，故異木石。問：既非久遠無始，何名初識耶？答：過去未來無體，剎那熏習，唯屬現在。現在正起妄念之時，妄念違真，名為初識。非是過去有識創起，名為初識。故知橫該一切處，豎通無量時，皆是即今現在一心，更無別理。道契經：文殊師利白佛言：世尊！阿賴耶識，具一切法，過於恆沙。如是諸法，以誰為本？生於何處？佛言：如是有為、無為一切諸法，生處殊勝，不可思議。何以故？於非有為、非無為處，是有為、是無為法，而能生故。文殊又白佛言：世尊！云何名為非有為、非無為處？佛言：非有為、非無為處者，所謂一心本法。非有為故，能作有為；非無為故，能作無為。是故我言生處殊勝，不可思議。又云：當作二門，分明顯說：一者下轉門，二者上轉門。生滅門中不出此二。如是二門云何差別？頌曰：諸染法有力，諸淨法無力，背本下下轉，名為下轉門。諸淨法有力，諸染法無力，向原上上轉，名為上轉門。識論云：云何應知依識所變？假說我法，非別實有，由斯一切唯有識耶？頌曰：是諸識轉變（轉變是改轉義，即八種識，從自證分轉變，似二分現：即所變見分，有能作用，說名為見；所變相分，為所作用，說名為相。即俱依自證分而轉。既若見、相二分，包一切法盡，即此二分，從心體上變起，故知一切諸法，皆不離心），分別所分別（從初業識，起見、相二門。因見立能，因相立所，能所纔具，我法互興。或謂用為能相，體為所相；或以七識為能相，第八識為所相），由此彼皆無（此見、相二分上，妄執彼實我法，二執是無，由此見、相二分外，妄情執有心外我法之境，皆是無故），故一切唯識（唯遮境有，識簡心空。將唯字遮薩婆多執心外有其實境，將識字簡清辨等執惡取空，破空有二邊，正處中道）。又，諸師所明，總有四分義：一、相分（一、實相名相，體即真如，是真實相故。二、境相名相，為能與根心而為境故。三、相狀名相，此唯有為法，有相狀故。通影及質，唯是識之所變。四、義相名相，即能詮下所詮義相分是。此四相中，取後三相而為相分。又相分有二：一識所頓變，即是本質。二識等緣境，唯變影緣，不得本質），二、見分，唯識論云：於自所緣，有了別用（見分有五類，一、證見名見，即三根本智見分是。二、照燭名見，此通根心俱有照燭義故。三、能緣名見，即通內三分俱能緣故。四、念解名見，以念解所詮義故。五、推度名見，即比量心推度一切境故。於此五種見中，除五色及內外等三分，餘皆見分所攝）。三、自證分，為能親證自見分、緣相分不謬，能作證故。四、證自證分，謂能親證第三自證分、緣見分不謬故。從所證處得名。此四分義，鏡如自證分，鏡明如見分，鏡象如相分，鏡後弝（必駕切）如證自證分。此四分有四師立義：第一，安慧菩薩，立一分自證分。識論云：此自證分，從所緣生，是依他起故，故說為有。見、相二分，不從緣生，因遍計心妄執而有。如是二分，情有理無。唯自證分，是依他起性，有種子生，是實有故。見、相二分是無，更變起我法二執又是無，以無似無。若準護法菩薩，即是以有似無。見、相二分，是有體；變起我法二執，是無體。故安慧引楞伽云：三界有漏心心所，皆是虛妄分別為自性。故知八識見、相二分，皆是遍計妄執有故。唯有自證一分，是依他起性，是實有故。二、難陀論師，立二分成唯識。初標宗者，即一切心生，皆有見、相二分。見、相二分，是能所二緣也。若無相分牽心，心法無由得生；若無能緣見分，誰知有所緣相分耶？即有境有心等成唯識也。見分為能變，相分是所變，能所得成，須具二分。見分相分，是依他起性。有時緣獨影境，即同種生。有時緣帶質境，即別種子。故非遍計也。若不許者，諸佛不應現身土等種種影像也。三、陳那菩薩立三分。安慧立一分，但有體而無用；難陀立見、相二分，但有用而無體，皆互不足。立理者，謂立量果義。論云：能量，所量，量果，別故，相見必有所依體故。相分為所量，見分為能量，即要自證分為證者，是量果也。喻尺量絹，絹為所量，尺人為能量，記數之智名為量果。今見分、緣相分不錯，皆由自證分為作果故。今眼識見分緣青時，定不緣黃，如見分緣不曾見境。忽然緣黃境時，定不緣青，若無自證分，即見分不能自記憶。故知須立三分。若無自證分，即相、見亦無。若言有二分者，即須定有自證分。集量論頌云：似境相所量，能取相自證。釋云：似境相所量者，即相分似外境現。能取相自證者，即是見分能取相分。故自證即是體也。四，護法菩薩立四分。立宗者，心心所若細分別，應有四分。立理者，若無第四分，將何法與第三分為量果耶？汝陳那立三分者，為見分有能量了境用故，即將自證分為量果。汝自證分亦有能量照境故，即將何法與能量自證分為量果耶？即須將第四證自證分，為第三分量果也。引密嚴經云：眾生心二性，內外一切分（內一分為一性，見、相二分為第二性，即心境內外二性），所取能取纏（能緣麤動是能緣見分，所取是所緣相縛也），見種種差別（見分通三量，故言種種差別）。夫為量果，須是現量，方為量果。前五識與第八見分，雖是現量，以外緣故，即非量果。為量果者，須內緣故。七識雖是內緣，亦非量果。為量果者，應具二義：一現量，二內緣。又，果中後得見分，雖是現量，內緣時，變影緣，故非量果。即須具三義。又，果中根本智見分，雖親證真如，不變影故，是心用，故非量果。即須是心體，具足四義：一現量，二內緣，三不變影，四是心體，方為量果。問：四分以何為體性？答：相分，所變色心為體性。若內三分，即用現行心所而為體。宗鏡問：未有無心境，曾無無境心。凡聖通論，都有幾境？答：大約有三境。頌曰：性境不隨心（性是實義。即實根塵四大，及實定果色等相分境。言不隨心者，為此根塵等相分，皆自有實種生，不隨能緣見分種生故），獨影唯從見（影謂影像，是相分異名。為此假相分，無種為伴，但獨自有名，故名獨影，即空華兔角，過去未來諸假影像法是。此但從能緣見分變生，與見分同種，故名獨影唯從見），帶質通情本（即相分，一半與本質同一種生，一半與見分同一種生，故言通情本。情即能緣見分，本即所緣本質），性種等隨應（隨應是不定義，謂於三境中，各隨所應。有性種界，繫三科異熟等差別不定）。又廣釋云：性境者，為有體實相分名性境。即前五識及第八心王，并現量第六識。所緣諸實色，得境之自相，不帶名言，無籌度心，此境方名性境。及根本智緣真如時，亦是性境，以無分別，任運轉故。言不隨心者，都有五種不隨：一、性不隨者，其能緣見分通三性，所緣相分境惟無記性，即不隨能緣見分通三性。二、種不隨者，即見分從自見分種生，相分從自相分種生，不隨能緣見分心種生故，名種不隨。三、界繫不隨者，如明了意識，緣香味境時，其香味二境，唯欲界繫，不隨明了意識，通上界繫。又如欲界第八緣種子境時，其能緣第八，唯欲界繫，所緣種子，便通三界，即六八二識，有界繫不隨。四、三科不隨，且五蘊不隨者，即如五識見分，是識種收，五塵相分，即色蘊攝，是蘊科不隨；十二處不隨者，其五識見分，是意處收，五塵相分，五境處攝，是處科不隨；十八界不隨者，其五識見分，是五識界收，五塵相分，五境界攝，此是三科不隨。五、異熟不隨者，即如第八見分，是異熟性，所緣五塵相分，非異熟性，名異熟不隨。獨影境者，謂相分與見分同種生，名獨影唯從見。即如第六識，緣空華兔角過未，及變影緣無為，并緣地界法，或緣假定果極迥極略等，皆是假影像。此但從見分變生，自無其種，名唯從見。獨影有二種：一者無質獨影，即第六緣空華兔角，及過未等，所變相分是。其相分與第六見分同種生，無空華等質。二者有質獨影，即第六識緣五根種現是，皆托質而起故，其相分亦與見分同種而生，亦名獨影境。三帶質者，即心緣心是。如第七緣第八見分境時，其相分無別種生，一半與本質同種生，一半與能緣見分同種生。從本質生者，即無覆性；從能緣見分生者，即有覆性。以兩頭攝不定故，名通情本。質即第七能緣見分，本即第八所緣見分。又，四句分別，一唯別種非同種，即性境。二唯同種非別種，即獨影境。三俱句，即帶質境。四俱非，即本智緣如。以真如不從見分種生故，名非同種。又，真如當體是無為，但因證顯得，非生因所生法故，名非別種。性種等隨應者，性即性境，種謂種類。所謂於三境中，各有種類不同，今皆須隨應而說。又約八識分別者，前五轉識，一切時中，皆唯性境，不簡互用不互用。二種變中，唯因緣變，又與五根同境故。第六意識有四類：一、明了意識，亦通三境，與五同緣實五塵，初率爾心中，是性境。若以後念緣五塵上方圓長短等假色，即有質獨影，亦名似帶質境。二、散位獨頭意識，亦通三境，多是獨影，通緣三世有質無質法故。若緣自身現行心心所時，是帶質境。若緣自身五根，及緣他人心心所，是獨影境，亦名似帶質境。又獨頭意識，初剎那緣五塵少分緣實色，亦名性境。三、定中意識，亦通三境，通緣三世有質無質法故，是獨影境。又能緣自身現行心心所故，是帶質境。又七地已前，有漏定位，亦能引起五識緣五塵故，即是性境。四、夢中意識，唯是獨影境。第七識唯帶質境，第八識其心王唯性境，因緣變故，相應作意等五心所，是似帶質，真獨影境。問：三境以何為體？答：初性境，用實五塵為體，具八法成故。八法者，即四大地水火風，四微色香味觸等。約有為說，若能緣有漏位中，除第七識，餘七皆用自心心所為體。第二獨影境，將第六識見分所變假相分為體。能緣即自心心所為體。第三帶質，即變起中間假相分為體；若能緣有漏位中，唯六七二識心心所為體。攝論云：遠行及獨行，無身寐於窟，調其難調心，是名真梵志。百法釋云：如來依意根處，說遠行及獨行也，隨無明意識遍緣一切境也，故名遠行。又，諸心相續，一一轉故，無實主宰，名獨行。無身者，即心無形質故。寐於窟者，即依附諸根，潛轉身內，名寐於窟。寐者，藏也。即心之所蘊在身中。此偈意破外道執有實我也。世尊云：但是心獨行，無別主宰，故言獨行。又無始游歷六塵境，故名遠行。",
    "菴摩羅": "此云清淨識。僧遁注金剛三昧經云：白淨無垢識。彼經佛言：諸佛如來，常以一覺，而轉諸識，入菴摩羅。何以故？一切眾生本覺，常以一覺覺諸眾生。令彼眾生皆得本覺，覺諸情識空寂無生。何以故？決定本性，本無有動。熏聞云：天台依攝大乘說菴摩羅，名無分別智光，即第九淨識也（宗鏡云：摩羅淨識，湛若太虛，佛性明珠，皎同朗月）。然，據諸論所說第八。若至我見永不起位，即捨梨耶之名，別受清淨之稱，是則果位名菴摩羅。天台所依攝大乘義取第九識者，非無深致，此依真諦所譯梁攝論也。輔行云：真諦三藏云：阿陀那七識，此云執我識，此即惑性，體是緣因。阿賴耶八識，此名藏識，以能盛持智種不失，體是無沒無明，無明之性，性是了因。菴摩羅九識，名清淨識，即是正因。唐三藏不許此識，云第九是第八異名。故新譯攝論不存第九，地論文中亦無第九。但以第八對於正因，第七對於了因，第六以對緣因。今依真諦，仍合六七，共為緣因。以第六中，是事善惡，亦是惑性，委釋識義，非今所論。但以三識體性，對於三德三因，於理即足。論家雖云翻識為智，而不即照三識一心，即此一心，三智具足。光明玄云：菴摩羅識，是第九不動。若分別之，即是佛識（宗鏡問：無垢淨識為佛，決定有心？決定無心？答：據體則言亡四句，意絕百非，約用則唯無量，故知如來，心智能明，非情所及，應以智知）。阿梨耶識，即是第八無沒識，猶諸佛所證之理，乃立菴摩羅名。就眾生所迷之本，則標乾栗陀號。何者？經云：而轉諸識入菴摩羅，故知果位名菴摩羅。一切一心識，論云：能作一切種種名字，知是群生所迷之本。輒辨此義，後賢詳之（昔住大覺，李相公垂訪，問曰：楞嚴性覺妙明，本覺明妙，此為一法？此為二法？若云二法，性覺即本覺；若云一法，上句安言妙明？下句安言明妙？余即答曰：一法二義，上句言性，性體即寂而常照，故曰妙明；下句言覺，覺用即照而常寂，故曰明妙）。禮記云：人生而靜，天之性也；感物而動，性之欲也。斯乃儒家以寂然不動為性，感而遂通曰情。吾宗則以明靜真心為性，是理具也；昏動妄念為情，是事造也。故楞嚴云：從無始來，生死相續，皆由不知常住真心，性淨明體。用諸妄想，此想不真，故有流轉，以茲情性，分今十識。前之八識，皆屬情也，九十二識，乃當性焉。問：心與於性，同異云何？答：或同或異。言或同者，如楞嚴云：常住真心，性淨明體。此俱目真。光明云：心識二性，躁動不停。此俱召妄。二名異者，如楞嚴云：舜若多性可消亡，爍迦羅心無動轉。此心真而性妄矣。大意云：隨緣不變故為性，不變隨緣故為心。此性真而心妄也。忠國師云：迷時結性成心，悟時釋心成性。然，真妄二心，經論所明，大有四義，一唯真心。起信云：有隨眠煩惱，與無明合，別而分之，是菩薩識。大論云：在菩薩心，名為般若。即其義也。阿陀那識，是第七分別識，訶惡生死，欣羨涅槃，別而分之，是二乘識。於佛即是方便智，波浪是凡夫第六識，無俟復言。宗鏡九識十名：一、自體非偽，名為真識。二、體非有無，名無相識。三、軌用不改，名法性識。四、真覺常存，體非隱顯，名佛性真識。五、性絕虛假，名實際識。六、大用無方，名法身。七、隨流不染，名自性清淨識。八、阿摩羅，翻無垢識。九、體非一異，名真如識。十、勝妙絕待，號不可名目識。",
    "乾栗陀耶": "或名牟呼栗多，此云堅實心。楞伽注云：謂第一義心，如樹貞實心，非念慮也，乃是群生本有之性。又摩訶衍論：立十種識，總攝諸識。云何為十？於前九中，加一切一心識。論上文云，所謂以一心識，遍於二種自在，無所不安立。如佛告文殊師利言：我唯建立一種識，所餘之識，非建立焉。所以者何？一種識者，多一一識。此識有種種力，能作一切種種名字，而唯一識，終無餘法，是故我說建立一種識。今謂一切一心識，是此方言。梵語正名乾栗陀耶。問：一切一心識，與菴摩羅，云何甄別？答：從唯是一心，故名真如。二者唯妄心，如楞伽云：種種諸識浪，騰躍而轉生。三者從真起妄，如楞伽云：如來之藏，是善不善因，能遍興造一切趣生。四者指妄即真，如楞嚴云：則汝今者識精元明。又淨名云：煩惱之儔，是如來種。諸文所陳，此四收盡。然此諸識，西域東夏，異計紛紜。今先敘異執，後述會通。初異執者，性相二宗，肇分於竺國，南北之黨，彌盛於齊朝。故西域那爛陀寺，戒賢大德，遠承彌勒無著，近踵法護難陀，依深密等經瑜伽等論，立法相宗。言法相者，唯齊八識業相，以為諸法生起之本。故法相宗，以識相行布為旨。其寺同時智光大德，遠稟文殊龍樹，近遵青目清辯，依般若等經中觀等論，立法性宗。言法性者，以明真如隨緣，為染淨之本。故一性宗，以真理融觀為門。洎乎東夏，攝論有梁唐之異，地論分南北之殊，以無著菩薩造攝大乘論，流至此土，二譯不同。梁朝真諦，乃立九識，計第八識生起諸法。如彼論明十種勝相，第一依止勝相，明第八識生十二因緣。次唐時玄奘新譯攝論，但立八識。乃謂第九，祗是八識異名。此是梁唐之異也。天親菩薩造十地論，翻至此土，南北各計。相州南道，計梨耶為淨識；相州北道，計梨耶為無明。此乃南北之殊也。其次會通者，妙玄云：今明無明之心，不自不他，不共不無因，四句皆不可思議，此約自行破計，南北不存。若有四悉檀因緣，亦可得說。此約化他，性相俱存。以阿梨耶中，有生死種子，熏習增長，即成分別識。若阿梨耶中，有智慧種子，聞熏習增長，即轉依成道後真如，名為淨識。若異此兩識，祗是阿梨耶識，此亦一法論三，三中論一耳。攝論云：如金土染淨，染譬六識，金譬淨識，土譬梨耶識，明文在茲，何勞苦諍！又宗鏡云：此阿賴耶識，即是真心。不守自性，隨染淨緣，不合而合，能含藏一切真俗境界，故名藏識。如明鏡不與影像合，而含影像。此約有和合義邊說，若不和合義者，即體常不變，故號真如。本一真心，湛然不動。若有不信阿賴耶識即如來藏，別求真如理者，如離像覓鏡，即是惡慧。以未了不變隨緣，隨緣不變之義，而生二執。又宗鏡以理量二門，收盡一切性相，識相妙有，是如量門；識性真空，是如理門。問：真心無相，云何知有不空常住湛然之體？答：以事驗知，因用可辨，事能顯理，用能彰體。如見波生，知有水體。當觀理量之門，以造性相之道。",
    "塞健陀": "此云蘊，蘊謂積聚。古翻陰，陰乃蓋覆。積聚有為，蓋覆真性。又仁王云：不可說識，生諸有情色心二法，色名色蘊，心名四蘊。皆積聚性，隱覆真實。此以色、受、想、行、識，名為五蘊（心經疏記具解五蘊）。音義指歸云：漢來翻經為陰，至晉僧叡改為眾，至唐三藏改為蘊。",
    "䭾羅吠奢": "此云入。法界次第云：通稱入者，入以涉入為義。根塵相對，則有識生。識依根塵，仍為能入；根塵即是所入。今此十二，從所入受名。熏聞曰：夫六入者，凡有二義：一根塵互相涉入，二根境俱為識之所入。以是諸經名十二入。楞嚴唯以六根為入者，蓋根有勝義，親能生識，又根能受境，吸攬（音覽）前塵，故偏名入。故云：六為賊媒，自劫家寶。又云：六入村落。法界次第云：內六名入者，此之六法，親故屬內。為識所依，故名為入。亦名根者，根以能生為義。此六既並有生識之功，故通名根。外六入者，此六疏故屬外，識所游涉，故名為入。亦名塵者，塵以染污為義，以能染污情識，通名為塵。又十二處者，百法疏云：生長義。即六種識，依於根塵而得生長，名十二處。",
    "䭾都": "此云界。百法疏云：界是因義。中間六識，藉六根發。六境牽生，與識為因，故名為界。法界次第云：界以界別為義。此十八法，各有別體，義無渾濫，故名十八界。若根相對，即有識生。識以識別為義，識依於根，能別於塵，故通名識。由此根、塵、識三，各有六法，成十八界。此三科法，如俱舍云：聚生門種族，是蘊處界義，愚根樂有三，故說蘊處界。釋曰：愚三者，一、愚心，為說五陰，則開心為四，合色為一。二、愚色，為說十二處，則開色為十處半，謂五根、五塵及法塵少分；合心為一處半，謂意根及法塵少分。三、愚心及色，為說十八界，則更開心為七界半，謂六識、意根、法塵少分。皆言愚者，迷也。根三，謂上、中、下根，樂三，謂略、中、廣。皆如次配三科法。",
    "歌羅邏": "或羯邏藍，此云凝滑，又云雜穢，狀如凝酥。胎中五位，此初七日。大集經云：歌羅邏時，即有三事：一命，二煖，三識。出入息者，名為壽命；不臭不爛，名之為煖，即是業持火大，故地水等色，不臭不爛也。此中心意，名之為識，即是剎那覺知心也。長無增減，三法和合，從生至死，此識之種，即是命根。故宗鏡引論云：然依親生此識種子，以此種子，為業力故，有持一報之身，功能差別，令得決定。若此種子，無此功能，身便爛壞，故以親生種子為命根。夫命根者，依心假立，命為能依，心為所依。生法師云：焚薪之火，旋之成輪，輪必攬火而成照；情亦如之，必資心成用也。命之依心，如情之依心矣。",
    "頞部曇": "或遏蒲曇，或頞浮陀。此云疱。狀如瘡疱，胎二七日。",
    "蔽尸": "或閉尸，或伽那。此云凝結。狀如就血。或云聚血，或云耎（而兗切）肉，胎三七日。",
    "健男": "或羯南，此云凝厚。漸堅硬故，亦云硬肉，胎四七日。雖有身意，缺眼四根，六處未全，但號名色。涅槃佛言：如說名色繫縛眾生，名色若滅，則無眾生。離名色已，無別眾生；離眾生已，無別名色。亦名名色繫縛眾生，亦名眾生繫縛名色。",
    "缽羅奢佉": "此云形位，具諸根形四支差別。俱舍以此胎五七日，名胎中五位；六七日，名髮毛爪齒位；七七日，名具根位，五根圓滿故。所言根者，增上出生，名之為根。五識藉彼為增上緣而得生故。又具五義，名之為根，嚴續依發及遍別故。從此五七，至未出胎，並名六入。言胞胎者，說文云：兒生裹衣者曰胎。爾雅：胎，始養也。",
    "斫芻": "斫者行義，芻者盡義。謂能於境行，盡見諸色，故名為行盡。故瑜伽云：屢觀眾色，觀而復捨，故名為眼，是照燭義。楞嚴云：眼如蒲桃朵。或云：眼如秋泉池。眼有五種：一肉眼；二天眼；三慧眼；四法眼；五佛眼。今先通辨，然後別明。先通辨者，大品云：菩薩行般若時，淨於五眼。肉眼淨，見三千大千世界；天眼淨，見十方如恆河沙等諸佛世界中眾生死此生彼。慧眼菩薩不作是念：是法若有為、若無為，若世間、若出世間，若有漏、若無漏。是慧眼菩薩，無法不見，無法不知，無法不識，是為慧眼淨菩薩。法眼知是人入隨信行，是人隨法行，是人無相行，是人行空解脫門，是人行無相解脫門，是人行無作解脫門，得五眼。得五眼故，得無間三昧。得無間三昧故，得解脫智（云云）。乃至知是菩薩能坐道場，不能坐道場。知是菩薩有魔無魔，是為菩薩法眼淨（目連謂魔曰：吾以道眼觀內，天眼觀表，內外清淨，過天瑠璃）。菩薩入如金剛三昧，破諸煩惱習，即時得諸佛無礙解脫，即生佛眼。所謂一切種智、十力、四無所畏、四無礙智，乃至大慈大悲等諸功德，是名佛眼。大論釋曰：肉眼見近不見遠，見前不見後，見外不見內，見晝不見夜，見上不見下。以此礙故求天眼，得是天眼，遠近皆見，前後內外、晝夜上下，悉皆無礙，是天眼見。和合因緣生假名之物，不見實相。所謂空、無相、無作、無生、無滅，如前、中、後亦爾，為實相故求慧眼。得慧眼不見眾生，盡滅一異相，捨離諸著，不受一切法，智慧自內滅，是名慧眼。但慧眼不能度眾生，所以者何？無所分別故。以是故生法眼。法眼能令行人行是法，得是道，知一切眾生各各方便門，令得道證。法眼不能遍知度眾生方便道，以是故求佛眼。佛眼無事不知，覆障雖密，無不見知。於餘人極遠，於佛至近；於餘幽暗，於佛顯明；於餘為疑，於佛決定；於餘微細，於佛為麤；於餘甚深，於佛甚淺。是佛眼無事不聞，無事不見，無事不知，無事為難，無所思惟。一切法中，佛眼常照。此之五眼，當立四義，以辨其相。初約人分，淨名記云：欲指人中是肉眼故，明四趣眼不及人天，故為所破。此亦一往，亦有龍鬼，過人肉眼，終是惡業，從道已判。又云：以天眼法在色界故，破欲方有四禪天眼。聲聞是慧眼（我從昔來所得慧眼），菩薩是法眼，如來是佛眼。淨名記問：前三眼，兩教二乘，亦能得之。法眼，三教菩薩，亦能得之。如何五眼，併奪云無？答：隨教依理，其相天殊。若云諸佛菩薩有者，即是帶理之四眼也。地住分得，佛方究竟，故云肉眼一時遍見十方，天眼不以二相而見。慧眼乃云第一淨故，法眼佛眼元來永殊。是則五眼，具足在佛。二乘與人，既並無眼，如生盲者。問：佛之肉眼，與人肉眼，同異云何？答：凡夫惡業障故如盲，佛果功德熏故清淨。故大般若云：佛肉眼能見人中無數世界，不唯障內。故知凡夫肉眼，但見障內，義當盲矣。問：肉眼障礙，云何遍見？答：大論云：報生天眼，在肉眼中。天眼開闢，肉眼見色，故見大千。又云：天眼有二種：一果報得，二修禪得。果報得者，常與肉眼合用，唯夜闇天眼獨用。問：佛具肉眼，與於佛眼，同異云何？答：淨名記云，諸佛如來，法身菩薩，約體用分，互相不同。且如肉眼見於麤色，於麤色處見於中道。從麤色邊，名為肉眼；約見中道，即名佛眼。問：佛之天眼，與於佛眼，同異云何？答：淨名疏云：今取證理，見十方土及十法界麤細之色，名佛天眼。圓見三諦無二，名為佛眼。二約用釋，如淨名疏云：但眼是總名，從用分別，則有五種：一、肉眼，見麤事色；二、天眼，見因果細色；三、慧眼，即麤細色心偏真之理；四、法眼，見色心麤細因緣假名俗諦諸法；五、佛眼，見中道圓真佛性之理，又能雙照麤細因緣事理。問：見中道真，名佛眼者，未審菩薩分證，與佛究竟，同異云何？答：如發軫云：分證與究竟五眼，但有明昧之殊。三約諦釋，如淨名疏云：圓觀三諦，觀俗境，破諸惡業，名淨肉眼。觀俗細境，破諸亂心，名淨天眼。若觀真諦，破界內惑，名淨慧眼。觀內外俗，破塵沙無知，名淨法眼。觀中雙照，圓除無明，是淨佛眼。是則肉、天二眼，乃因緣所生之法；後三，即三觀所照之諦焉。四約教釋，如淨名疏云：約教則有四佛五眼不同。金剛般若，佛問須菩提：如來有肉眼不（云云）？準此，五眼皆通四教。若別釋者，淨名記云：若以偏圓相待，總而明之，唯圓佛眼；別教法眼；通菩薩慧眼；藏菩薩肉、天二眼。又淨名疏云：若諸凡夫，肉眼天眼，見麤細相。聲聞但有三眼：肉眼、天眼，所見同前；慧眼見真諦相，即是見二諦相。三藏菩薩，既未斷惑，不見真諦相，但有肉眼、天眼見世諦麤相。通教菩薩，亦但三眼，唯見二諦幻化之相。別教菩薩，得四眼。三眼如前，別得法眼，見界內外恆沙佛法，無量四諦之理，並是見相見也。若圓教菩薩，住十信位，雖有肉眼，名為佛眼，相似圓見法界，相惑未除，猶名見相見也。若入初住，發真無漏，即五眼圓開，此皆通辨。次別明者，淨名疏引首楞嚴云：阿那律言：我初出家，常樂睡眠，如來訶我為畜生類。我聞佛訶，啼泣自責，七日不眠，失其雙目，白佛具說。佛言：眠是眼食，如人七日不食，則便失命，七日不寢，眼命即斷。難可治之。當修天眼，用見世事。因是修禪，得四大淨色，半頭而見。謂之半頭者，昔神悟云：齊眉上半，如瑠璃明徹。此違楞嚴，明前不明後。南屏云：前之半頭，見大千界，但見於前，不見於後。今謂此解，違淨名疏云：那律修禪，得四大清淨造色，半頭天眼，從頭上半，皆得見色。觀三千大千世界，如庵摩勒果，若三藏佛，得全頭天眼，一頭皆發淨色，徹見無礙。今觀兩說猶鷸（音聿，鳥名）蚌之相搤（音厄，捉也），今乘其弊，以會通之。淨名廣疏以從上為半者，乃示天眼之體也。以報得天眼，在肉眼中；修得天眼，在肉眼外。既在眼外，則發半頭之色。雖半頭淨，及其視物，但見前矣。所以楞嚴約用說焉。然其聲聞所發天眼半頭，與佛全頭，優劣碩異。又佛乃隨所入定，欲見能見；聲聞須入所得之定，方睹境矣。又佛能見一切佛土，那律但見大千。淨名疏云：二乘雖有天眼，作意欲見千界乃至大千。諸佛菩薩有真天眼，不以二相見諸佛土。天台云：中道真天眼，非二諦之相。而能遍照四土，三種生死，死此生彼，依正並現。王三昧中，是真天眼。問：那律既見於前，云何倩人穿針？答：入定則見，出定不知。肇云：二乘在定則見，出定不見。荊溪記云：若約那律失眼，出觀但同世人壞根者不見。問：藏、通二教，既不談中，以何為佛眼？答：別行玄記云：故今正使，及二習氣，俱時而盡，故能二諦皆究竟也。方異三乘弟子，獨彰佛眼佛智。復次那律天眼，與大梵王天眼雖同，覈（下革切，考也）有四異：一、報修異，梵王報得，在肉眼中；那律修得，居肉眼外。二、總別異。淨名疏云：又梵王是總相見，見不分明；那律是別相見，見則了了。乃至諸阿羅漢因淨禪得者，皆別相見。三、自他異。梵王報得，於自住處則見，餘方不見。那律以修根本，得五種四禪，八色清淨，發真天眼，隨所至處，皆見三千。四、通明異，梵王天眼，是通非明；羅漢天眼，是通是明。又淨名疏問：梵王天眼，見大千界，與法華肉眼何異？答：大論明報生天眼，在肉眼中。天眼開闢，見廣由天。肉眼見色，故見大千。大品明菩薩肉眼，見百由旬，乃至大千。過此則用天眼。以肉眼與風相違，故不說見他土。若法華經力，肉眼能見大千一切法者。三藏二乘，天眼、慧眼，所見事理，尚不能及，何況梵王而可比也。故大經云：學大乘者，雖有肉眼，名為佛眼。二乘之人，雖有慧眼，名為肉眼。以其慧眼，見真斷惑，與圓教肉眼，有齊有劣故。圓教肉眼名佛眼者，以雖具煩惱之性，能知如來祕密之藏。",
    "娑路多羅戍縷多": "此云能聞。瑜伽云：數數於此，聲至於聞，故翻為耳，是能聞義。楞嚴：耳如新卷葉。或云：耳如卷樺皮。",
    "伽羅尼羯羅拏": "此云能嗅。瑜伽云：數由此故，能嗅於香，故名為鼻，是能嗅義。楞嚴云：鼻如雙垂爪。或云：鼻如盛針筒。",
    "舐若時吃縛": "此云能嘗，能除飢渴故。瑜伽云：能除飢渴羸瘦，數發言論，表彰呼召，故名為舌，是能嘗義。楞嚴：舌如初月偃。或云：舌如偃月刀。",
    "迦耶": "梵有四名：一迦耶，二設利羅，三弟訶，四應伽。此云積聚。瑜伽云：諸根所隨，周遍積聚，故名為身，是積聚義，及依止義。亦翻分，謂支分。楞嚴：身如腰鼓顙。或云：身如立戟（居逆切）槊。安般守意經云：何等為身？何等為體？骨肉為身，六情合為體。",
    "鼻鼓迦": "此云種。肇曰：此五眾生之所由生，故名種。婆沙問曰：何名大種？答：大而是種，故名大種。如言大地及大王等，能減能增，能損能益，是為種義。體相形量，遍諸方域，能成大事，是為大義。大乘入楞伽云：謂虛妄分別。津潤大種，成內外水界；炎盛大種，成內外火界；飄動大種，成內外風大，色分段大種，成內外地界；圓覺云：我今此身，四大和合。所謂髮毛、爪齒、皮肉、筋骨、髓腦、垢色，皆歸於地。唾涕、膿血、津液、涎沬、淡淚、精氣、大小便利，皆歸於水。暖氣歸火，動轉歸風。仁王云：堅持名地，津潤名水，煖性名火，輕動名風。淨覺云：通名大者，且從事立。智論云：佛說四大，無處不有，故名為大。長水直以藏性釋大，一何誤哉！孤山云：四輪持世，其實土輪、金輪、水輪、風輪也。此不言土者，土與金同是堅性，俱屬地大。故此但言四大，則已攝四輪矣。淨覺云：然此四大，風金則由妄心而起，火水復由風金而起。下文結云：遞相為種，義見此矣。宗鏡云：皆從四大和合成，盡是一心虛妄變。維摩詰問文殊師利：何等為如來種？文殊師利言：有身為種，無明有愛為種，貪恚癡為種，四顛倒為種，五蓋為種，六入為種，七識處為種，八邪法為種，九惱處為種，十不善道為種。以要言之，六十二見及一切煩惱皆是佛種。天台釋云：即是以非種為種，何者？離三道之外，更無如來種。一正因，即苦道；二了因，即煩惱道；三緣因，即業道。又上文云：三道是三德種，種既有三，如來亦三：一法佛如來，二報佛如來，三應佛如來。種以能生為義。若不能生，不名為種。以此三種，能生三佛，從微至著，終於大果，亦種類義。若此三種，非佛種類，此外更無同類之法。亦種性義，性名無改。此之三法，從初至後，不斷不滅，必致三佛三德之果，故名不改。今約眾生明種，不出此三。由煩惱潤業受身有苦，三無前後，亦非一時，不縱不橫。故金錍云：若有眾生未稟教者，來至汝所，先當語云：汝無始來，唯有煩惱業苦而已。即此全是理性三因（此乃約性開三）。由未發心，未曾加行，故性緣了，同名正因（此乃對修方合）。又妙樂云：三道是三德種者，即性種也。有生性故，故名為種。生時此種純變為修。此等諸文，皆以迷時為性，悟後名修。然此性種，天台名相對種。荊溪以敵對而釋，有總有別。若總以三道之事，俱對三德之理，此乃是理總論敵對。若別敵對。如記主云：此三從別，一一各異。苦道在迷屬因，法身所證是果，此乃因果相對；煩惱是昏迷之法，般若是明悟之法，此乃迷悟敵對；行違理是繫縛之法，行順理是解脫之法，此以縛脫敵對。荊溪又轉名相翻種。在因則翻法身為苦道，至果乃翻苦道為法身；迷日翻般若為煩惱，悟時翻煩惱為般若；縛則翻解脫為結業，脫則翻結業為解脫。始終理一，故名性種。若法華疏釋：諸佛兩足尊，知法常無性。佛種從緣起，是故說一乘。天台解曰：中道無性，即是佛種。妙樂釋云：立本無性，為本性德，故知今種，即性家之種。先德疑云：淨名以三道為性種，法華以中道為性種。觀此二處，文義頗異。遂立四義，消通二文：一種本，二種體，三種緣，四種果。遂定淨名三道是種之當體，法華三德是所依體，乃種之本也。今謂種以能生為義，種即是本，豈有二殊？學者須究二處經文，各順一義。維摩指迷令悟，故以在迷三道為佛種，正助二修為種緣（此乃迷悟分修性）。法華明諸佛設教，故當平等理性為佛種，逆順兩事為種緣（此乃事理分修性）。淨名三道，乃約即為種（三道是能，三德是所），猶冰是水種。法華三德，指性自是種（乃性當家名種），如水為冰種。作此區別，煥然明矣。又法華疏曰：若就類論種，一切低頭舉手，悉是解脫種；一切世智，三乘解心，即般若種。夫有心者，皆當作佛，即法身種。荊溪云：類謂類例，即修德也。斯乃順修二因，能成三德之果，故名類種。此由法華遍開六道：低頭舉手，彈指散花，本是人天之福，今開即是緣因佛種；一切世智，三乘解心，本是五乘之智，今開即是了因佛種；夫有心者，不知正因，今開眾生皆當作佛，即法身種。妙樂問曰：若爾，般若解脫有於種類，及以對論法身類種，與對論種，為同為異？答：理一義異。言理一者，只緣理一，是故修性相對離合。言義異者，對生死邊，名為相對。理體本淨，名為類種。又聞能觀智，名為了種；聞所緣理，名為正種，即是理淨與事淨為類，此約開顯明類種。昔經圓既隔偏，但約當教三因，自論類種，若前三教，如妙樂云：別教唯有種類之種，而無相對，於中法身，種類仍別。始終常淨，唯不從覆，故得種名。此與釋籤，雖法身本有，不同別教為惑所覆，二文相戾。妙宗釋曰：別教法身為惑所覆者，良由不知本覺之性，具染惡德，是故染惡，非二德也（云云）。但有法身本覺，隨於染緣，作上一切迷中之法，以是名曰：為惑所覆。既覆但中佛性之理，如淳善人，一切惡事，非本所能，為惡人逼，令作眾惡。故說善人為惡所覆。此顯定有能覆之惑。所覆真如，其理不變，始終常淨。故說唯不從覆，故得種名。問：妙玄云：十回向始正修中。此中但理，不具諸法。釋籤則曰：不同別人，理體具足，而不相收。故絳幃難云：別人既有理性三因，何緣別修緣了？淨覺雖約理性三因，皆但中德？答：未契四明之意，故於妙宗釋此義曰。亦為不知本覺之性，具染惡德，不能全性，起染惡修，乃成理體，橫具三法。言不相收者，以其三法，定俱在性，皆是所發。猶如三分，各稱帝王，何能相攝？是故不知性中三法，二是修者，二乃成橫。故曰三皆在性，而不互融也。藏、通兩教，全無此義。但約當教，其名非無，因時三學為五分種，達分即為二解脫種（第五記云：解脫達分者，涅槃名解脫所修善根。不住生死，名為達分），念處即般若種。當曉有身為種。若非聞法，孰能自知？不加功行，捨身受身，奚得成就無上菩提？遂示性、類二法，以為標月之指歟！",
    "攝提": "翻假施設，假謂三假。輔行云：因內因外，和合方成，故所生法，名因成假。念不實故，故前念滅，滅已復生，生者必滅。計能相續，名相續假。他待於己，假立他名，己待於他，假立於己。相待不實，名相待假。成實論云：三假浮虛者，如煙雲塵霧也。",
    "阿那": "亦云安那，此云遣來，入息也。",
    "般那": "此云遣去，出息也。安般守意經云：安為身，般為息；安為生，般為滅；安為念道，般為解結。所以先數（所矩切，計也。下並同）入者，外有七惡，內有三惡。用少不能勝多，先數入也。安名出息，般名入息。息有四事：一為風，二為氣，三為息，四為喘。有聲為風，無聲為氣。出入為息，氣出入不盡為喘也。出息為生死陰，入息為思想陰。或云先數出息，氣則不急，身不脹滿，身心輕利，三昧易成。或云先數入息，隨息內斂，易入定故。或云當隨便宜，以數出入，若心輕浮，繫心丹田，當數入息。若心昏沈，繫心鼻端，當數出息。此皆不許出入俱數，提婆菩薩云：佛說甘露門，名阿那波那，於諸法門中，第一安隱道。",
    "烏波": "或云薩遮，此云有。婆沙云：有是何義，謂一切有漏法是。佛言：若業能令後生續生，是名為有。華嚴云：何等名有為法？所謂三界眾生。婆沙云：漏是何義？答：住是漏義。凡夫至此，被留住故。浸漬是漏義，至三有頂，常浸漬故。流出是漏義，垂盡三有，還出下故。持義、醉義、在內義、放逸義，並是漏義。成論云：失道故名漏。律云：癡人造業，開諸漏門。文句云：漏謂三漏。妙樂云：一欲漏，謂欲界一切煩惱，除無明。二有漏，謂上兩界一切煩惱，除無明。三無明漏，謂三界無明。又輔行釋有流云：有即三有。流謂四流。一見流，三界見也；二欲流，欲界一切諸惑，除見及癡；三有流，上二界一切諸惑，除見及癡；四無明流，三界癡也。於此三處，因果不亡，故名為有。為此四法，漂溺不息，故名為流（婆沙問：緣起緣生，有何差別？答：或說無有差別，緣起緣生，皆有為法。或有說云亦有差別，因是緣起，果是緣生）。涅槃云：有漏法者有二種，有因有果。無漏法者亦有二種，有因有果。有漏果者，是則名苦；有漏因者，則名為集。無漏果者，則名為滅；無漏因者，則名為道。",
    "薩迦耶薩": "此云無常。荀卿曰：趨舍無定，謂之無常。唐因明正理論云：本無今有，暫有還無，故名無常。淨住法云：生不可保，唯欲營生；死必定至，不知顧死。況此危命，凶變無常，俄頃之間，不覺奄死。內德論云：百齡易盡，五福難常。命川流而電逝，業地久而天長。三塗極迍（株論切，厚也）而杳杳，四流無際而茫茫。憑法舟而利濟，謝信翮（下革切）以高翔。宜轉咎而為福，何罔念而作狂？正法念云：有於胎藏死，有生時命終，有纔行便亡，有能走忽卒。智論云：無常有二種：一、相續法壞無常，二、念念生滅無常。宗鏡明二種四相：一約麤果報，說生老病死。長阿含云：一生相，五陰興起，已得命根。二老相，謂生壽向盡，餘命無幾。三病相，謂眾苦迫切，存亡無期。四死相，謂盡也，風先火次，諸相敗壞，身亡异（音異）趣故。又四諦論曰：眾苦依止，名生苦；能令變壞，名老苦；逼迫身因，名病苦；能滅諸根，名死苦；非愛共聚，名怨憎會苦；可愛相遠，名愛別離苦；希望不遂，名求不得苦。是眾苦相，名五盛陰苦（婆沙論云：盛陰有何義？受所生是故說盛，謂生受是故說盛，受所養是故說盛，謂養受是故說盛。問：陰與盛陰，有何差別？答：名即差別。謂陰謂盛陰。又陰有漏無漏，盛陰一向有漏。又陰染污不染污，盛陰一向染污。章安云：今依經文，以五盛陰是其別體，善惡陰盛即是苦體）。涅槃云：復次菩薩修於死想，觀是壽命，常為無量怨讎所繞，念念損減，無有增長。猶山瀑水，不得停住，亦如朝露，勢不久停。如囚趣死，步步近死，如牽牛羊，詣於屠所。出曜經，佛言：是日已過，命則隨減。如少水魚，斯有何樂？二約細惑業，說生住異滅。如起信論，不覺心起，名為生；能見能現，妄取境界，起念相續，名之為住；執取計名，名之為異；造作諸業，名之為滅。唯識論云：生表此法先非有，滅表此法後是無，異表此法非凝然，住表此法暫有用。釋曰：自無而有曰生，自有而無曰滅，前後改變名異，暫爾相續名住。又論云：本無今有，有位名生；生位暫停，即說為住；住別前後，復立異名；暫有還無，無而名滅。前三有故，同在現在；後一是無，故在過去。輔行記云：言三相者，不立住相，與異合說。以人於住，起常計故。故淨名云：比丘，汝今亦生亦老亦滅。老即是異，圭峰云：住異二相，同是現在，故合為一，細分即四。孤山解楞嚴云：前舉四相，今唯二者。以生攝住，以滅收異。宗鏡云：雖年百歲，猶若剎那。如東逝之長波，似西垂之殘照，擊石之星火，驟隙之迅駒，風裏之微燈，草頭之朝露，臨崖之朽樹，爍目之電光。若不遇於正法，必永墜於幽途。",
    "闍提闍": "此翻云生死。",
    "仡那": "或繕摩，此翻生。瑜伽云：五蘊初起，名之為生。依殼而起，曰卵生；含藏而出，號胎生；假潤而興，曰溼生；無而忽現，名化生；如是四生。由內心思業為因，外㲉胎藏溼潤為緣。約藉緣多少，而成次第。卵生具四，是以先說。胎生具三，溼生具二，化生唯一，謂思業也。俱舍云：人，旁生，具四。地獄，及諸天，中有，唯化生。鬼通胎化二。人具四生者，如大論云：毗舍佉彌羅母，生三十二子。彌伽羅是大兒字，其母生三十二卵，剖生三十二男，皆為力士，其母得三道。又婆沙論云：昔於此洲商人入海，得一雌鶴，遂生二卵，出二童子，端正聰明。年長出家，得阿羅漢。大名世羅，小名鄔波世羅。大論云：胎生者，如常人生；溼生者，如揜（音庵）羅婆利婬女，頂生轉輪聖王。又涅槃云：頂生王從頂皰生。化生者，大論云：如佛與四眾游行比丘尼眾中，有阿羅婆，地中化生。及劫初時，人皆化生。旁生具四者，正法念云：化生金翅鳥，能食四生龍。龍與金翅，皆具四生；走獸皆胎，飛鳥俱卵。證真云：情想合離，四生皆具。經文且據一往增勝邊說。（仡，語乞切）。",
    "末剌諵": "此云死。勝鬘云：生者新諸根生，死者故諸根滅。正法念經云：臨終四大為害，謂之四大不調，有四種死。若風大不調，一切身分，互相割裂，從足至頂，分散如沙。又一乘章云：有二種死，何等為二？謂分段死（壽有分限，身有形段），不思議變易死（因移果易，故名變易）。分段死者，謂虛偽眾生。不思議變易死者，謂阿羅漢辟支佛大力菩薩意生身。又云：以分段死，故說阿羅漢辟支佛智，我生已盡，得有餘果證，故說梵行已立；凡夫人天所不能辦，七種學人先所未作，虛偽煩惱斷，故說所作已辦；阿羅漢辟支佛所斷煩惱，更不能受後有，故說不受後有。攝大乘，明七種生死：一分段，謂三界果報；二流來，謂有識之初；三反出，謂背妄之始；四方便，謂入滅二乘；五因緣，謂初地已上；六有後，謂第十地；七無後，謂金剛心。北史李士謙字子約，善談名理。嘗有客，坐不信佛家報應義。士謙諭之曰：積善餘慶，積惡餘殃，此非休咎耶？佛經云：輪轉五道，無復窮已。此則賈誼所言，千變萬化，未始有極，忽然為人之謂也。佛道未來，其賢者已知其然矣。至若鯀為黃熊，褒君為龍，牛哀為猛獸，彭生為豕，如意為犬，鄧艾為牛，羊祜前身李氏之子，此非佛家變化異形之謂乎！",
    "迦摩羅": "或迦末羅，此云黃病，又云惡垢，亦云癩病。智論云：一者，外因緣病。寒熱飢渴，兵刃刀杖，墜落推壓，如是等種種外患為惱。二者，內因緣病。飲食不節，臥起無常，四百四病，名為內病。",
    "阿薩闍": "此云不可治病。弘明集云：必死之病，雖聖莫蠲；可療之疾，待醫方愈。故涅槃明三種病：一易治，二難治，三不可治。淨名疏云：療治有損。一、有從初服藥，但增而不損，終無差理，是名增增。二、或雖困篤，方治即愈，是名增損。三、或有服藥，初雖漸損，而後更增，是名損增。四、從初漸損，乃至平服，是為損損。又釋治眾生病。一、增增者，即底下凡夫，若為說法，更起誹謗，闡提之罪，如善星、調達等也。二、增損者，如尸利鞠多。三、損增者，如大論，明四禪比丘，謂是四果。臨終見生處，謗無涅槃，即墮地獄。又毗曇成實，明退法人，皆其相也。四、損損者，即身子等，諸得道人。",
    "珊若婆": "此云癈（音廢）風病，一發不起。智論云：四百四病者，四大為身，常相侵害。一一大中，百一病起。冷病有二百二，水風起故。熱病有二百二，地火起故。止觀明治病方法，既深知病源起發，當作方法治之。治病之法，乃有多途。舉要言之，不出止觀二種方便。云何用止治病相？有師言，但安心止在病處，即能治病。所以者何？心是一期果報之主，譬如王有所至處，群賊迸散。次有師言，臍下一寸，名憂陀那，此云丹田。若能止心，守此不散，經久即多有所治。有師言，常止心足下，莫問行住寢臥，即能病治。所以者何？人以四大不調，故多諸疾患。此由心識上緣，故令四大不調。若安心在下，四大自然調適，眾病除矣。有師言，但知諸法空無所有，不取病相，寂然止住，多有所治。所以者何？由心憶想，鼓作四大，故有病生。息心和悅，眾病即差。故淨名經云：何為病本？所謂攀緣。云何斷攀緣？謂心無所得。如是種種說用止治病之相非一。故知善修止法，能治眾病。次明觀治病者。有師言，但觀心想用六種氣治病者，即是觀能治病。何等六種氣？一吹、二呼、三嘻、四呵、五噓、六呬（虛器切）。此六種息，皆於唇口之中，想心方便，轉側而作，緜微而用。頌曰：心配屬呵腎屬吹，脾呼肺呬聖皆知，肝臟熱來噓字至，三焦壅處但言嘻。高僧傳，僧善疾甚篤，將殛。告弟子曰：吾患腹中冷結者。昔在少年，山居服業，糧粒既斷，嬾往追求，噉小石子，用充日夕，因覺為病。死後可破腹看之。果如其言。南山鈔云：但飢渴，名生病，亦名故病。每日常有。故以食為藥醫之功。僧祇律云：佛住舍衛國，難陀毋人作釜飯，逼上汁飲，覺身中風除食消，便作念闍梨是一食人，應當食粥。乃取多水少米，煎去二分，然後入胡椒蓽茇（音缽）末。盛滿甖，持詣佛所，白言：惟願世尊，聽諸比丘食粥。佛許，仍為說偈。次四分云：佛在那頻頭國，因㝹沙施粥，佛許之。又十誦云：婆羅門王，阿耆達，施八般粥，謂乳酪、胡、麻、豆、摩、沙、荏、蘇等。佛許之。高僧法開，晉升平中，孝宗有疾，開視床知不起，不肯進藥。獻后怒，收付廷尉，俄而帝崩獲免。或問法師曰：高明剛簡，何以醫術經懷？開曰：明六度以除四魔之疾，調九候以療風寒之病，自利利他，不亦可乎？孫綽曰：才辯縱橫，以數術通教，其在開公焉！",
    "震越": "應法師云：此翻衣服，應是臥具。釋名曰：服上曰衣。衣，依也，所以庇寒暑也。傳云：衣，身之章也。上曰衣，下曰裳。白虎通曰：衣者，隱也。裳者，障也。所以隱形自障蔽也。涅槃云：如世衣裳，障覆形體。",
    "袈裟": "具云迦羅沙曳，此云不正色，從色得名。章服儀云：袈裟之目，因於衣色，如經中壞色衣也。會正云：準此，本是草名，可染衣，故將彼草，目此衣號。十誦以為敷具，謂同氈席之形。四分以為臥具，謂同衾（音欽）被之類。薩婆多云：臥具者，三衣之名。大淨法門經云：袈裟者，晉名去穢。大集經名離染服，賢愚經名出世服。真諦雜記云：袈裟是外國三衣之名，名含多義。或名離塵服，由斷六塵故；或名消瘦服，由割煩惱故；或名蓮華服，服者離著故；或名間色服，以三如法色所成故。言三色者，律有三種壞色：青、黑、木蘭。青謂銅青，黑謂雜泥，木蘭即樹皮也。業疏云：聽以刀截，成沙門衣，不為怨賊所剝故。章服儀云：條堤之相，事等田疇之畦，貯水而養嘉苗。譬服此衣生功德也。佛令象此，義不徒然。五分云：衣下數破，當倒披之。在雨中行，水入葉中，應順披之。章服儀云：比見條葉，不附正儀，當馬齒鳥足縫之，即須順左右條開明孔。不作，即同縵衣。南山問：比見西域僧來，多縫衣葉者何？答：此佛滅後將二百年，北天竺僧與外道同住，外道嫉之，密以利刀內衣葉中，同往王所。外道告王，沙門釋子，內藏利刀，欲將害王。因告撿獲，由此普誅一國比丘。時有耶舍阿羅漢，令諸比丘權且縫合，為絕命難。此乃彼方因事權制，非佛所開。故義淨云：西國三衣，並皆刺合，唯東夏開而不縫。依律，大衣限五日成，七條四日成，五條二日成。限日不成，尼犯墮，比丘突吉羅。業疏云：若有衣不受持者，突吉羅。下二衣有長者，開將作從。悲華經云：佛於寶藏佛前發願，願成佛時，袈裟有五功德：一、入我法中，犯重邪見等，於一念中敬心尊重，必於三乘授記；二、天龍人鬼，若能敬此袈娑少分，即得三乘不退；三、若有鬼神諸人，得袈裟乃至四寸，飲食充足；四、若眾生共相違背，念袈裟力，尋生慈心；五、若持此少分，恭敬尊重，常得勝他。瓔珞經云：若天龍八部鬥爭，念此袈裟，生慈悲心。海龍王經，龍王白佛：如此海中，無數種龍，有四金翅常來食之，願佛擁護，令得安隱。於是世尊，脫身皁（昨早切，黑色也）衣，告龍王：汝取是衣，分與諸龍，皆令周遍。於中有值一縷之者，金翅鳥王不能觸犯。持禁戒者，所願必得。搜玄引大集：王問比丘不能說，遂羞墮地，袈裟變白。法滅盡經云：沙門袈裟，自然變白。應法師云：韻作𣮫裟，音加沙。葛洪字苑，始改從衣。",
    "僧伽梨": "西域記云：僧迦胝，舊訛云僧伽梨。此云合，又云重，謂割之合成。義淨云：僧迦胝，唐言重複衣。靈感傳云：每轉法輪，披僧伽梨。南山云：此三衣名，諸部無正翻，今以義譯，大衣名雜碎衣，以條數多故。若從用為名，則曰入王宮聚落時衣，乞食說法時著。薩婆多論：大衣分三品：九條、十一條、十三條，兩長一短，名下品；十五條、十七條、十九條，三長一短，名中品；二十一條、二十三條、二十五條，四長一短，名上品。會正記問，所以長增而短少者？業疏云：法服敬田，為利諸有，表聖增而凡減也。業疏云：今準十誦加持。應云：大德一心念，我比丘某甲，是僧伽梨（若干）條衣，受（若干）長（若干）短（割截揲葉）、衣持（三說）。會正記云：如缺大衣，下二衣有長者，開將作從受持。應加云：大德一心念，我某甲比丘，此僧伽梨二十五條衣，受四長一短，割截衣持（三說。僧祗云：有緣須捨者，具修威儀加法云）。大德一心念，我比丘某甲，此僧伽梨是我三衣數，先受持，今捨（一說，下二衣亦爾）。",
    "鬱多羅僧": "或郁多羅僧，此譯上著衣，即七條也。南山云：七條名中價衣。從用云入眾時衣，禮誦齋講時著。若受，應加法云：此鬱多羅僧七條衣，受兩長一短，割截衣持（三說。如缺七條，開將上下二衣作從，加法例上）。",
    "安陀會": "或安怛羅婆沙，此云中宿衣，謂近身住也。南山云：五條名下衣，從用云院內行道雜作衣。若受，應加法云：此安陀會五條衣，受一長一短，割截衣持（三說：如缺五條，開將上二衣作從。五分云：獨住比丘，三衣中須有換易者，應具修威儀，手執衣，心生口言加法。云云）。菩薩經云：五條名中著衣，七條名上衣，大衣名眾集時衣。戒壇經云：五條下衣，斷貪身也；七條中衣，斷瞋口也；大衣上衣，斷癡心也。華嚴云：著袈裟者，捨離三毒。四分云：懷抱於結使，不應披袈裟。",
    "缽吒": "唐言縵條，即是一幅㲲（音[月*(蝶-虫)]），無田相者，三衣俱通縵也。佛法至此一百八十七年，出家未識割截，祗著此衣。",
    "尼師壇": "或尼師但那，此名坐具，或云隨坐衣。業疏，佛言：為身為衣，為臥具，故制畜之，長四廣三。更增半磔手者，善見云：令於縷際外增之（迦留陀夷身大，坐不容故，加之半磔）。十誦云：新者二重，故者四重。十誦云：不應受單者，離宿突吉羅。戒壇經云：尼師壇，如塔之有基也。汝今受戒，即五分法身之基也。良以五分，由戒而成。若無坐具以坐汝身，則五分定慧無所從生。天神黃瓊云：元佛初度五人，及迦葉兄弟，並制袈裟左臂，坐具在袈裟下（云云）。後度諸眾，徒侶漸多。年少比丘，儀容端美，入城乞食，多為女愛，由是製衣角在左肩。後為風飄，聽以尼師壇鎮上。後外道達摩多問比丘：肩上片布，持將何用？答曰：擬將坐之（云云）。達摩多云：此衣既為可貴，有大威靈，豈得以所坐之布而居其上（云云）？比丘白佛，由此佛製還以衣角居於左臂，坐具還在衣下，但不得垂尖角，如象鼻羊耳等相。摩得勒伽云：若離宿不須捨。業疏云：受應加云：大德一心念，我比丘某甲，此尼師壇應量作，今受持（三說。若捨準上）。",
    "僧祗支": "或僧卻崎（去奇切）。西域記云：唐言掩腋。舊或名竭支，正名僧迦支（處脂切）。此云覆腋衣。用覆左肩，右開左合。竺道祖云：魏時請僧，於內自恣。宮人見僧偏袒，不以為善，遂作此衣施僧。因綴於左邊祗支上，因而受稱，即偏衫右邊。今隱祗支名，通號兩袖曰偏衫。今作時，須開後縫截領，以存元式故也。",
    "泥縛些那": "或云泥伐散那。西域記：唐言裙（云云）。舊曰涅槃僧，訛也。既無帶襻（普患切），其將服也，集衣為襵（之涉切。廣雅，襵，襞也。通俗文曰，便縫曰襵），束帶以條。襵則諸部各異，色乃黃赤不同。釋名云：裙，群也，連接群幅也。",
    "舍勒": "應法師譯云：內衣也，半者言舍勒相短，似今短群也。小衣論雖不顯於相，可類半泥洹也。",
    "迦絺那": "明了論云：為存略故，但言迦提。此翻功德。以坐夏有功，五利賞德也。西域記以迦提翻云昴星，昴星直此月故。律鈔引明了論翻為堅實，能感實，能感多，衣衣無敗壞故。又名難活，以貧人取活為難，捨少財入此衣，功德勝如以須彌大衣聚施也。或云堅固，又云廕覆。古翻為賞善罰惡衣，賞前安居人，後安居人不得也。亦翻功德衣，以僧眾同受此衣，招五利功德，律中受此衣故。畜長財，離衣宿，背請，別眾食，食前食後至他家。四分云：安居竟，應受功德衣，則前安居人，七月十六日受，至十二月十五日捨。四分云：若得新衣，若檀越施衣，若糞掃衣（四分云糞掃者，則非死人衣）。新物揲（音牒）作淨，若已浣。浣已納作淨，即日來不經宿，不以邪命得。應法四周有緣，五條作十隔，用袈裟色。受捨，應鳴鐘集僧羯磨，具出自恣篇。",
    "憍奢耶": "應法師翻蟲衣，謂用野蠶絲緜作衣。事鈔云：即黑毛臥具。寧音義云：梵云高世耶，譯云野蠶緜。東天竺有國名烏陀，粳米欲熟，葉變為蟲，蟲則食米，人取蒸以為緜也。如此絲緜者，名摩呵跋多。此言大衣，衣甚貴，即大價之衣。感通傳云：伏見西來梵僧，咸著布㲲。具問。答云：五天竺國，無著蠶衣。由此興念，著斯章服儀。",
    "屈眴": "此云大細布。緝木緜華心織成，其色青黑，即達磨所傳袈裟。（眴音舜）。",
    "睒婆": "此云木緜。",
    "劫波育": "或言劫貝，即木緜也。正言迦波羅。此樹華名也，可以為布。高昌國名㲲。罽（居例切）賓國南，大者成樹已。此形小狀如土葵，有殼，剖以出華，如柳絮，可紉以為布。",
    "迦鄰陀衣": "細錦衣也。",
    "兜羅緜": "兜羅，此云細香。苑音義翻冰。或云兜沙，此云霜。斯皆從色為名。或名[妒]羅緜，兜羅樹名，緜從樹生，因而立稱，如柳絮也。亦翻楊華，或稱兜羅毦（而吏切）者，毛毳（此芮切）也。熏聞云：謂佛手柔軟，加以合縵，似此緜也。",
    "瞿脩羅": "此云圖像，從其衣形而立名。若著瞿脩羅，則不著僧迦鵄。",
    "尼衛": "此云裏衣",
    "欽跋羅": "即毛。",
    "頭鳩羅": "此云細布。",
    "芻摩": "此云麻衣。西域記云：衣麻之類也，麻形細荊芥葉青色。西域麻少，多用草羊毛。",
    "顩缽羅": "西域記云：織細羊毛。",
    "褐賴縭": "西域記云織。野獸毛細軟，可得緝績，故以見珍，而充服用。",
    "兜那波吒": "此云絹。",
    "俱蘇摩": "此云華。",
    "摩羅": "此云鬘。苑師云：一切花，通名俱蘇摩；別有一華，獨名俱蘇摩。此云悅意，其花大小如錢，色甚鮮白，眾多細葉，圓集共成。應法師云：西域結鬘師，多用蘇摩羅花，行列結之，以為條貫。無問男女貴賤，皆此莊嚴，或首或身，以為飾好。正法念云：生天華鬘在額。",
    "犍椎": "聲論翻為磬，亦翻鐘。資持云：若諸律論，並作犍槌，或作犍椎。今須音槌為地。又羯磨疏中，直云犍地，未見椎字呼為地也。後世無知，因茲一誤。至於鈔文，一宗祖教，凡犍槌字，並改為椎，直呼為地。請尋古本，及大藏經律，考之，方知其謬。今須依律論，並作犍槌。至呼召時，自從聲論。增一云：阿難升講堂擊犍椎者，此是如來信鼓也。五分云：諸比丘布薩時，不時集，妨行道。佛言：當唱時至，若打犍椎，若打鼓吹螺，使舊住沙彌淨人打，不得多，應打三通。若唱二時至，亦使沙彌淨人唱，住處多，不得遍聞，應高處唱。猶不知集，更相語知。若無沙彌，比丘亦得打。事鈔云：若尋常所行，生椎之始，必漸發聲，漸希漸大，乃至聲盡，方打一通。佛在世時，但有三下，故五分云打三通也。後因他請，方有長打。然欲初鳴時，當依經論，建心標為，必有感徵。應至鐘所，禮三寶訖，具儀立念，我鳴此鐘者，為召十方僧眾，有得聞者，並皆雲集，共同和利。又諸惡趣，受苦眾生，令得停息。故付法藏傳中，罽膩吒王以大殺害故，死入千頭魚中，劍輪繞身而轉，隨斫隨生。羅漢為僧維那，依時打鐘。若聞鐘聲，劍輪在空。如是因緣，遣信白令長打，使我苦息。過七日已，受苦即息。江南上元縣一民，時疾暴死，心氣尚煖。凡三日復甦，乃誤勾也。自言至一殿庭間，忽見先主被五木縲械甚嚴，民大駭，竊問曰：主何至於斯耶？主曰：吾為宋齊丘所誤，殺和州降者千餘人，以冤訴囚此。主問其民曰：汝何至斯耶？其民具道誤勾之事。主聞其民卻得生還，喜且泣曰：吾仗汝歸，語嗣君，凡寺觀鳴鐘，當延之令永。吾受苦，惟聞鐘則暫休，或能為吾造一鐘尤善。民曰：我下民耳，無緣得見。設見之，胡以為驗？主沈慮曰：吾在位，嘗與于闐國交聘，遺吾一瑞玉天王。吾愛之，嘗置於髻，受百官朝。一日如廁，忘取之，因感頭痛。夢神謂我曰：玉天王寘於佛塔，或佛體中，則當愈。吾因獨引一匠，攜於瓦棺寺，鑿佛左膝以藏之，香泥自封，無一人知者，汝以此事可驗。民既還家，不敢輒已，遂乞見主具白之，果曰冥寞何憑？民具以玉天王之事陳之。主親詣瓦棺，剖佛膝果得之，感泣慟躄，遂立造一鐘於清涼寺，鑴其上云：薦烈祖孝高皇帝脫幽出厄，以玉像建塔，葬於蔣山（智興鳴鐘事出法苑）。增一云：若打鐘時，一切惡道諸苦，並得停止。應法師準尼鈔云：時至應臂吒犍槌。應師釋云：梵語臂吒，此云打；梵語犍槌，此云所打之木，或檀或桐，此無正翻，彼無鐘磬故也。音義指歸斥云：祗如梵王鑄祗桓寺金鐘。又迦葉結集，撾（陟瓜切，椎也）銅犍槌，豈無鐘耶？但天竺未知有磬。五分律云：隨有瓦木銅鐵鳴者，皆名犍地。又律中集僧有七種法：一量影，二破竹作聲，三作煙，四吹貝，五打鼓，六打犍槌，七唱諸大德布薩說戒時到。事鈔明入堂法，應在門外，偏袒右肩，歛手當心，攝恭敬意，擬堂內僧，並同佛想，緣覺羅漢想。何以故？三乘同法食故。次欲入堂，若門西坐者，從戶外旁門西頰，先舉左腳，定心而入。若出門者，還從西頰，先舉右腳而出。若在門東坐者，反上可知，不得門內交過。若欲坐時，以衣自蔽，勿露形醜。須知五法：一須慈敬，重法尊人；二應自卑下，如拭塵巾；三應知坐起，俯仰得時；四在彼僧中，不為雜語；五不可忍事，應作默然。凡徒眾威儀，事在嚴整清潔，軌行可觀，則生世善心，天龍叶贊。華嚴云：具足受持威儀教法，是故能令僧寶不斷。智論云：佛法弟子，同住和合。一者賢聖說法，二者賢聖默然。準此處眾，唯施二事，不得雜說世論，類於污家俳說（俳，戲也）。又貴靜攝，不在喧亂。誦經說法，必須知時。成論云：雖是法語，說不應時，名為綺語。後裔住持，願遵斯式。",
    "隙棄羅": "此云錫杖，由振時作錫錫聲故。十誦名聲杖，錫杖經又名智杖。亦名德杖，彰智行功德故。聖人之幖幟，賢士之明記，道法之幢。根本雜事云：比丘乞食，深入長者之家，遂招譏謗。比丘白佛，佛云：可作聲警覺。彼即呵呵作聲喧鬧，復招譏毀。佛制不聽，遂拳打門。家人怪問，何故打破我門？默爾無對。佛言：應作錫杖。苾蒭不解。佛言：杖頭安鐶圓如醆口，安小鐶子，搖動作聲，而為警覺。動可一二，無人聞時，即須行去。五百問：論持錫有多事，能警惡虫毒獸等。義淨云：錫杖都有三分：上分是錫，中木，下或牙角也。若二股六鐶，是迦葉佛製；若四股十二鐶，是釋迦佛製。齊稠禪師，在懷州王屋山，聞虎鬥，以錫杖解之。因成頌云：本自不求名，剛被名求我；巖前解二虎，障卻第三果。又鄧隱峰飛錫空中，解於二陣。",
    "剌竭節": "此云杖。頌云：楖栗橫擔不顧人，直入千峰萬峰去。",
    "軍遲": "此云瓶。寄歸傳云：軍持有二：若瓷瓦者，是淨用；若銅鐵者，是觸用。西域記云：捃稚迦，即澡瓶也。舊云軍持，訛略也。西域尼畜軍持，僧畜澡灌，謂雙口澡灌。事鈔云：應法澡灌。資持云：謂一斗已下。",
    "缽里薩羅伐拏": "此云濾水羅。會正記云：西方用上白㲲，東夏宜將密絹。若是生絹，小蟲直過，可取熟絹四尺，捉邊長挽，兩頭刺著，即是羅樣。兩角施帶，兩畔直怐（音寇，似鼎鉉也），中安橫杖尺六，兩邊繫柱，下以盆承。傾水時，罐底須入羅內。如其不爾，蟲隨水落，墮地墮盆，還不免殺。僧祗：蟲細者三重漉，毗尼母，應作二重漉水囊。若猶有，應作三重不得夾作。恐中間有蟲難出，當各作捲，逐重覆卻，方護生也。根本百一羯磨，明五種水羅：一方羅，用絹三尺或二尺，隨時大小作；二法瓶，陰陽瓶也；三君遲，以絹繫口，以繩懸沈於水中，待滿引出；四酌水羅；五衣角羅，但取密絹，方一搭手，或繫瓶口，或安缽中，濾水用也。",
    "缽塞莫": "或云阿唎吒迦二合。此云數珠，木槵子經云：當貫木槵子一百八箇，常自隨身，志心稱南無佛陀、南無達摩、南無僧伽，乃過一子，具如彼經。",
    "缽多羅": "此云應器。發軫云：應法之器也，謂體色量三，皆須應法。體者，大要有二：泥及鐵也；色者，熏作黑赤色，或孔雀咽色、鴿色；量者，大受三斗，小受斗半，中品可知。又翻為薄，謂治厚物令薄，而作此器。南山云：此姬周之斗也。準唐斗，上缽一斗，下缽五升。五分云：佛自作缽坯，以為後式。受時，準十誦云：大德一心念，我比丘某甲，此缽多羅應量，受常用故（三說）。若捨，準衣。律云：比丘持木缽，佛言不應持如是缽，此是外道法也。",
    "鍵𨩲": "母論譯為淺鐵缽。經音疏云：缽中之小缽，今呼為鐼子。十誦律云：缽半大鍵𨩲，小鍵𨩲。四分律云：鍵𨩲入小缽，小缽入次缽，次缽入大缽。或作揵茨。建鎡，並梵音輕重。",
    "俱夜羅": "此云隨缽器。法寶解云：即匙箸鍵𨩲等。",
    "浮囊": "五分云：自今聽諸比丘畜浮囊，若羊皮，若牛皮。傳聞西域渡海之人，多作鳥翎毛袋，或齎巨牛脬，海船或失，吹氣浮身。",
    "僧跋": "即等供之唱法也。寄歸傳云：三缽羅佉多，舊訛云僧跋。梵摩難國王經云：夫欲施食者，皆當平等，不問大小。於是佛令阿難臨飯唱僧跋。僧跋者，眾僧飯皆平等故。莊嚴論：明尸利毱多長者，受外道囑，以毒和食，請佛及眾。佛知，令阿難唱僧跋，唱已方食，唱已毒散。事鈔云：況僧食十方普同，彼取自分，理應隨喜。而人情忌愜，用心不等。或有閉門限礙客僧者，不亦蚩乎！鳴鐘本意，豈其然哉！出家捨著，尤不應爾。但以危脆之身，不能堅護正法；浮假之命，不肯遠通僧食。違諸佛之教，損檀越之福，傷一時眾情，塞十方僧路。傳謬後生，所敗遠矣！改前迷而復道，不亦善哉（慳食獨啖，餓鬼之業）！或問：僧事有限，外客無窮。以有限之食，供無窮之僧，事必不立。答曰：此乃鄙俗之淺度，瑣人之短懷；豈謂清智之深識，達士之高見？夫四事之供養，三寶之福田，猶天地之生長，山海之受用，何有盡哉？故佛藏經云：當一心行道，隨順法行，勿念衣食所須者，如來白毫相中一分，供諸一切出家弟子，亦不能盡。由此言之，勤修戒行，至誠護法，由道得利，以道通用，寺寺開門，處處同食，必當供足，判無乏少。凡受用時，應作五觀：一、計功多少，量彼來處（大論云：復次思惟此食，墾植耘除，收穫蹂治，舂磨淘汰，炊煮乃成，用功甚重，計一缽之飯，作夫流汗，集合量之，食少汗多。此食作之功重，辛苦如是。入口食之，即成不淨，更無所直，宿昔之間，變為屎尿。本是美味，人之所嗜，變成不淨，惡不欲見。行者自思惟，如此弊食，我若貪著，當墮地獄，噉燒鐵丸。從地獄出，當作畜生，牛羊駱駝，償其宿債；或作豬狗，常噉糞除。如是觀食，則生厭想）；二、忖己德行，全缺多減；三、防心顯過，不過三毒；四、正事良藥，取濟形苦；五、為成道業，世報非意。事鈔：食不過三匙：初匙斷一切惡；中匙修一切善；後匙度一切眾生。增一云：多食致苦患，少食氣力衰；處中而食者，如秤無高下。",
    "逋沙他": "此云齋日。請觀音經疏云：齋者，齊也，齊身口業也。齊者，只是中道也。後不得食者，表中道法界外，更無別法也。中前得啖，而非正中，此得明表前方便，但似道之中，得有證義，故得啖也。亦是表中道法界外有法也。闡義引祭統云：齋之為言齊也，齊不齊以致齋者也。是故君子非有大事也，非有恭敬也，則不齋。不齋，則於物無防也，嗜欲無止也。及其將齋也，防其邪物，訖其嗜欲，耳不聽樂。今釋氏以不過中食為齋，亦取其防邪訖欲，齊不齊之義也。毗羅三昧經：瓶沙王問佛：何故日中佛食？答云：早起諸天食，日中三世佛食，日西畜生食，日暮鬼神食。佛制斷六趣因，令同三世佛食故。今約理解。故云齋者，祗是中道。後不得食者，即佛制中後不得食也。今表初住初地，圓證中道，心外無法，如中後不食也。中前得啖者，佛制中前非正食，皆得噉之。毗婆沙論云：夫齋者，以過中不食為體。以八事助成齋體，共相支持，名八支齋法。報恩經云：以無終身戒，不名優婆塞，但名中間人。智論問曰：何故六齋日，受八戒，修福德？答：是日惡鬼逐人，欲奪人命，疾病凶衰，令人不吉。是故劫初聖人，教人持齋，修善作福，以避凶衰。是時齋法，不受八戒，直以一日不食為齋。後佛出世，教語之言，汝當一日一夜，如諸佛持八戒，不過中食（云云）。是功德，將人至涅槃。如四天王經中，佛說月六齋日，使者太子，及四天王，自下觀察，眾生布施持戒孝順父母少者。便上忉利，以啟帝釋。諸天心皆不悅，說言：阿脩羅種多，諸天種減少。若布施持戒孝順父母多者，諸天帝釋，心皆歡喜，說言：增諸天眾，減損阿脩羅（云云）。又提謂經明八王日。何等為八王日？謂立春、春分、立夏、夏至、立秋、秋分、立冬、冬至，是謂八王日。天地諸神，陰陽交代，故名八王日。",
    "烏晡沙他": "此云受齋，又云增長，謂受持齋法，增長善根。南齊沈約，字休文，撰論云：人所以不得道者，由於心神昏惑。心神所以昏惑，由於外物擾之。擾之大者，其事有三：一則榮名勢利，二則妖妍靡曼，三則甘旨肥濃。榮名雖日用於心，要無晷刻之累；妖妍靡曼，方之已深；甘旨肥濃，為累甚切。萬事芸芸，皆三者之枝葉耳。聖人知不斷此三事，故求道無從可得。不為之立法，而使易從也。若直言三事惑本，並宜禁絕。而此三事，是人情所惑甚，念累所難遣。雖有禁約之旨，事難卒從。譬於方舟濟河，豈不欲直至彼岸？河流既急，會無直濟之理，不得不從邪流，靡久而獲至。非不願速，事難故也。禁此三事，宜有其端。何則？食之於人，不可頓息，於其情性，所累莫甚。故以此晚食，併置中前，自中之後，清虛無事。因此無事，念慮得簡，在始未專，在久自習。於是束八支，紆以禁戒，靡曼之欲，無由得前，榮名眾累，稍從事遣。故云往古諸佛，過中不食，蓋是遣累之筌罤，適道之捷徑。而惑者謂止於不食，此乃迷於向方，不知厥路者也。處處經，佛言：中後不食有五福：一少婬；二少睡；三得一心；四無有下風；五身得安隱，亦不作病。四分戒云：若比丘非時食，波逸提。",
    "蒲闍尼": "四分律云：有五種蒲闍尼。此云正食，謂飯乾飯魚肉也。僧祇云：時食，謂時得食，非時不得食。多論云：從旦至中，其明轉盛，名之為時。中後明沒，名為非時。今言中食，以天中日午時得食。僧祇云：午時日影，過一髮一瞬，即是非時。宋文帝飯僧，同眾御於地筵。班食遲，眾疑將旰，不食。帝曰：始可中矣！生公曰：白日麗天，天言始中，何得非中？遂取缽便食。眾從之，帝大悅。",
    "佉闍尼": "四分云：五種佉闍尼，此云不正食，謂枝葉華果細末磨食。",
    "半者蒲善尼": "寄歸傳云：唐言五噉食，謂飯餅麨等。",
    "半者珂但尼": "此云五嚼食，謂根莖葉花果等。寄歸傳云：若已食前五，必不食後五；若先食後五，則前五隨意噉之。今僧齋後，不食果菜是。",
    "佉陀尼": "或蹇茶，此云可食物。",
    "缽和羅": "應法師據自誓經云：缽和蘭，亦梵語輕重耳。此云自恣食。應法師云：坐臈臈餅，謂夏罷獻佛之餅，名佛臈食。又西方以佛從天降下王宮之日，供養佛食，名佛臈食。會正記云：即自恣日食，待佛比丘。",
    "分衛": "善見論云：此云乞食。僧祗律云：乞食分施僧尼，衛護令修道業，故云分衛。是則論從梵語，律謂華言，兩說未詳。應法師云：訛略，正言儐茶波多，此云團墮，言食墮在團中也。或云儐茶夜，此云團，團者食團，謂行乞食也，十二頭陀明常乞食。大論釋三種食：一受請食，二眾僧食，三常乞食。若前二食，起諸漏因緣，所以者何？受請食者，若得，作是念：我是福德好人，故得。若不得，則嫌恨請者，彼為無所別識，不應請者請，應請者不請。或自鄙薄，懊惱自情，而生憂苦。是貪愛法，則能遮道。眾僧食者，入眾中當隨眾法斷事，料理僧事，處分作使，心則散亂，妨廢行道，有如是等亂事，故受常乞食法。輔行云：諸律論文，乞食之法，不一處足，為福他故，令至七家。肇法師云：乞食有四意：一為福利群生；二為折伏憍慢；三為知身有苦；四為除去滯著。寶雨經云：乞食成就十法：一為攝受諸有情，二為次第，三為不疲厭，四知足，五為分布，六為不耽嗜，七為知量，八為善品現前，九為善根圓滿，十為離我執。寶雲經明乞食四分：一分奉同梵行者，一與窮乞人，一與諸鬼神，一分自食。輔行云：昔有長者，名曰鳩留，不信因果，與五百俱行。遠見叢樹，想是居家，到彼唯見樹神。作禮已，說己飢渴。神即攀手五指，自然出於飲食，甘美難言。食訖大哭，神問其故。答曰：有五百伴，亦大飢渴。神令呼來，如前與食，眾人皆飽。長者問曰：何福所致？答曰：我本迦葉佛時，極貧。於城門外磨鏡，每有沙門乞食，常以此指，示分衛處，及佛精舍。如是非一，壽終生此。長者大悟，日飯八千僧，淘米汁流出城外，可以乘船。",
    "怛缽那": "此云麨。通慧指歸云：謂將雜米碾碎蒸曝，毋論二種散麨，又將糖蜜持之。或言糒與麨不同。後堂云：糒（音備）是釜煮，連釜乾硬飯也。輔篇云：取乾飯麨，三過磨篩作之，稱為糒也。孟子曰：舜糗飯茹菜。糗（去久切），乾飯屑也。",
    "迦師": "後堂云：唐言錯麥。慈和云：北人呼為鷰麥，南人呼為雀麥。南泉抄以錯麥為大麥，十誦指迦師為小麥飯，事鈔錯麥與迦師一物也。",
    "脩陀": "此譯云白，或云須陀，此天食也。天台禪師觀心食法，既敷座坐已，聽維那進止。鳴磬後，歛手供養一體三寶，遍十方施作佛事。次出生飯，稱施六道，即表六波羅密，然後受此食。夫食者，眾生之外命。若不入觀，即潤生死；若能知入觀，分別生死有邊無邊。不問分衛，與清眾淨食，皆須作觀觀之者，自恐此身自舊食，皆是無明煩惱，潤益生死。今之所食，皆是般若。想於舊食，從毛孔次第而出。食既出已，心路即開。食今新食，照諸闇滅，成於般若。故淨名云：於食等者，於法亦等。是為明證（大品經云：一切法趣味，是趣不過。味尚不可得，云何當有趣非趣？所言一切法趣味者，味即是食。此食即是不思議法界。食中含受一切法。食若是有，一切法皆有。食若是無，一切法皆無。今食不可思議故，尚不見是有，云何當有趣？尚不見是無，云何當有非趣？若觀食不見趣非趣，即是中道三昧，名真法喜禪悅之食，而能通達趣非趣法，即雙照二諦，得二諦三昧法喜禪悅之食，是名食等）。以此食故，成般若食，能養法身。法身得立，即得解脫。是為三德。照此食者，非新非故，而有舊食之故，而有新食之新，是名為假。求故不得，求新不得，畢竟空寂，名之為空。觀食者，自那可食為新。既無新食，那可得食者，而不離舊食養身，而新食重益，因緣和合，不可前後分別，名之為中。只中即假空，只空即中假，只假即空中，不可思議，名為中道。又淨名云：非有煩惱，非離煩惱，非入定意，非起定意，是名食法也（什曰：一揣食，二願食，如見沙囊，命不絕也。三業食，如地獄無食而活。四識食，無色眾生，識想相續也）。",
    "波羅夷": "僧祗義當極惡。三意釋之：一者退沒，由犯此戒，道果無分故；二者不共住，非但失道而已，不得於說戒羯磨二種僧中共住故；三者墮落，捨此身已，墮在阿鼻地獄故。四分云：譬如斷人頭，不可復起，若犯此法，不復成比丘故。偈云：諸作惡行者，猶如彼死屍，眾所不容受，以此當持戒。自古從眾法絕分義，譯名棄。目連問罪報經云：犯波羅夷罪，如他化自在天壽，十六千歲，墮泥犁中，於人間數九百二十一億六十千歲。此墮燄熱地獄。以人間一千六百年，為他化天一晝夜。",
    "僧伽婆尸沙": "善見云：僧伽者，為僧；婆者，為初，謂僧前與覆藏羯磨也。言尸沙者，云殘，謂末後與出罪羯磨也。若犯此罪，僧作法除，故從境為名。毗尼母云：僧殘者，如人為他所斫，殘有咽喉，故名為殘，理須早救。僧伽婆尸沙罪，如不憍天壽八千歲，於人間數二百三十億四十千歲。此墮大大叫地獄，人間八百年，為天一日夜。",
    "摩那埵": "論云：秦言意喜，前雖自意歡喜，亦生慚愧，亦使眾僧歡喜。",
    "阿浮訶那": "善見翻為喚入眾羯磨，或名拔除罪根。母論云：清淨戒生，得淨解脫。",
    "偷蘭遮": "善見云：偷蘭名大，遮言障善道。後墮惡道，體是鄙穢。從不善體以立名者，由能成初二兩篇之罪故也。明了論：解偷蘭為麤，遮耶為過。麤有二種：一是重罪方便，二能斷善根。所言過者，不依佛所立戒而行，故言過也。偷蘭遮罪，如兜率天壽四千歲，於人間數五十億六十千歲。此墮嗥叫地獄，人間四百年，為天一晝夜。",
    "波逸提": "義翻為墮。十誦云：墮在燒煮覆障地獄，八熱通為燒煮，八寒黑暗等通為覆障。波逸提罪，如夜摩天壽二千歲，於人間數二十一億四十千歲。此墮眾合地獄，人間二百年，為天一晝夜。",
    "尼薩耆": "出要律儀，舊翻捨墮。聲論：尼翻為盡，薩耆為捨。四分：僧有百二十種，分取三十。因財事生，犯貪慢心，強制捨入僧故，名尼薩耆也。",
    "波羅提提舍尼": "義翻向彼悔，從對治境以立名。僧祗云：此罪應發露也。提舍尼罪，如三十三天壽命千歲，於人間數三億六十千歲。此墮黑繩地獄，人間一百年，為天一晝夜。",
    "突吉羅": "善見云：突者，惡也；吉羅者，作也。聲論：正音突悉吉栗多。四分律本云：式叉迦羅尼，義翻應當學。胡國訛云尸叉罽賴尼，胡僧翻守戒也。此罪微細，持之極難，故隨學隨守以立名。十誦云：天眼見犯罪比丘，如駛雨下，豈非專玩在心，乃名守戒也。七聚之中，分此一部以為二聚，身名惡作，口名惡說。多論問：何此獨名應當學？答：餘戒易持罪重，此戒難持易犯，常須念學，故不列罪名，但言應當學。犯突吉羅眾學戒罪，如四天王壽五百歲，墮泥犁中，於人間數九百千歲。此墮等活地獄，人間五十年，下天一晝夜。俱舍頌云：等活等上六，如次以欲天；壽為一晝夜，壽量亦同彼；極熱中半劫，無間中劫全；傍生極一中，鬼日月五百；頞部陀壽量，如一婆訶麻；百年除一盡，後後倍二十。",
    "那爛陀": "西域記曰：唐云施無厭。此伽藍南庵沒羅園中有池，其龍名那爛陀，旁建伽藍，因取其稱。從其實議，是如來昔行菩薩道時，為大國王，建都此地。憐愍眾生，好樂周給，時美其德，號施無厭。大宋僧傳云：那爛陀寺，周圍四十八里，九寺一門，是九天王所造。西域伽藍，無如其廣矣！",
    "雞頭摩": "竦疏釋雞園。引智論云：昔有野火燒林，林中有雉，入水漬羽，以救其焚。纂要云：即雞頭摩寺。",
    "羅摩": "此云院，周垣小院。",
    "拘吒迦": "此云小舍。",
    "招提": "經音義云：梵云招鬥提奢，唐言四方僧物。但筆者訛稱招提，此翻別房施。或云對面施，或云梵言僧鬘，此翻對面施。音義云：體境交現曰對，輟己惠他名施。後魏太武始光元年，造伽藍，創立招提之名。",
    "僧祇": "此云四方僧物。律鈔：四種常住：一常住常住，謂眾僧廚庫寺舍眾具，華果樹林田園僕畜等。以體局當處，不通餘界，但得受用，不通分賣，故重言常住。二十方常住，如僧家供僧常食，體通十方，唯局本處，此二名僧祇物。三現前現前，謂僧得施之物，唯施此處現前僧故。四十方現前，如亡五眾輕物也。若未羯磨，從十方僧得罪，若已羯磨，望現前僧得罪，此二名現前僧物。",
    "阿蘭若": "或名阿練若，大論翻遠離處，薩婆多論翻閑靜處。天台云：不作眾事，名之為閑；無憒鬧故，名之為靜。或翻無諍，謂所居不與世諍，即離聚落五里處也。肇云：忿競生乎眾聚，無諍出乎空閑。故佛讚住於阿蘭若。應師翻空寂。苑師分三類：一達磨阿蘭若，即華嚴之初，謂說諸法本來湛寂，無起作義；二名摩登伽阿蘭若，謂塚間處，要去村落一俱盧舍，大牛吼聲所不及處；三名檀陀迦阿蘭若，謂沙磧（遷歷切）之處也。",
    "僧伽藍": "譯為眾園。僧史略云：為眾人園圃，園圃生植之所，佛弟子則生植道芽聖果也。",
    "庵羅園": "闡義云：庵羅是果樹之名，其果似桃，或云似柰。此樹開華，華生一女，國人歎異，以園封之。園既屬女，女人守護，故言庵羅樹園。宿善冥熏，見佛歡喜，以園奉佛，佛即受之，而為所住。",
    "林微尼": "或流彌尼，或藍毗尼，或嵐毗尼，此云解脫處。亦翻斷，亦翻滅。華嚴音義翻樂勝圓光，由昔天女來，故立此名。新云藍軬（扶晚切）尼，此云監，即上古守園女名。",
    "秣蘇伐那": "西域記云：唐言闇林，千佛皆於此地說法。佛滅三百年，有迦多衍那，於此製發智論。",
    "阿奢理貳": "西域記云：唐言奇特。",
    "𡨧堵波": "西域記云浮圖。又曰偷婆，又曰私偷簸，皆訛也。此翻方墳，亦翻圓塚，亦翻高顯。義翻靈廟，劉熙釋名云：廟者，貌也，先祖形貌所在也。又梵名塔婆，發軫曰：說文元無此字。徐鉉新加云：西國浮圖也。言浮圖者，此翻聚相。戒壇圖經云：原夫塔字，此方字書，乃是物聲。本非西土之號。若依梵本，瘞（猗歷切）佛骨所，名曰塔婆。涅槃後分經，佛告阿難：佛般涅槃，茶毗既訖，一切四眾，收取舍利，置七寶瓶。當於拘尸那城內，四衢道中，起七寶塔，高十三層，上有輪相（云云）。辟支佛塔，應十一層；阿羅漢塔，成以四層，亦以眾寶而嚴飾之。其轉輪王亦七寶成，無復層級。何以故？未脫三界諸有苦故。十二因緣經，八種塔，並有露槃。佛塔八重，菩薩七重，辟支佛六重，四果五重，三果四，二果三，初果二，輪王一。凡僧但蕉葉火珠而已（言輪相者，僧祇云：佛造迦葉佛塔，上施槃蓋，長表輪相，經中多云相輪，以人仰望而瞻相也）。",
    "支提": "或名難提脂帝制底制多，此翻可供養處，或翻滅惡生善處。雜心論云：有舍利名塔，無舍利名支提。文句云：支提，無骨身者也。阿含明四支徵，謂佛生處，得道處，轉法輪處，入滅處也。",
    "舍磨奢那": "此云冢。西域僧死，埋骨地下，上累磚石，似𡨧堵波，但形卑小。",
    "健陀俱胝": "義淨云：西方名佛堂，為健陀俱胝。此云香室。",
    "毗訶羅": "此云游行處，謂僧游履處也。",
    "滿茶邏": "此翻壇。新云正名曼茶羅。言壇者，鄭玄註禮云：封土曰壇，除地曰墠（常演切）。封者起土界也，壇之言坦也。坦，明貌也。漢書音義云：築土而高曰壇，除地平坦曰場。國語云：壇之所除地曰場。除，掃也。周書曰：為三壇同墠。墠，除地也。說文云：野土也。爾雅云：鹿之所息謂之場。詩云：九月築場圃。註云：春夏為圃，秋冬為場。場即平治土面，於上治穀。",
    "脫闍": "資中翻幢。熏聞云：闍，有作都音。引爾雅云：闍謂之臺。而言脫者，積土脫落也。今所不取，蓋是梵語故。",
    "剎摩": "正音掣多羅，此云土田。淨名略疏云：萬境不同，亦名為剎。垂裕云：蓋取莊嚴差別，名之為剎。此乃通指國土名剎。又復伽藍號梵剎者，如輔行云：西域以柱表剎，示所居處也。梵語剌瑟胝，此云竿，即旛柱也。長阿含云：若沙門於此法中，勤苦得一法者，便當豎旛，以告四遠：今有少欲人。又法華云：表剎甚高廣，此由塔婆高顯，大為金地標表。故以聚相，長表金剎。如法苑云：阿育王取金華金旛，懸諸剎上，塔寺低昂。瓔珞云：土名賢聖所居之處。天台釋維摩佛國云：諸佛利物無量無邊，今略為四：一、染淨國，凡聖共居；二、有餘國，方便人住；三、果報國，純法身居，即因陀羅網無障礙土；四、常寂光，即妙覺所居。四土之名，雖出智者，四土之義，本載經論。今伸遺教，略開七門。初憑文，二釋名，三辨義，四定體，五示相，六對身，七解惑。初憑文者，維摩經云：隨所化眾生而取佛土，隨所調伏眾生而取佛土，隨諸眾生應以何國入佛智慧，隨諸眾生應以何國起菩薩根。天台釋云：若對四土，宛然相似，若別出者。思益經云：東方之國，佛號日月光。有菩薩梵天，曰思益，白佛：我欲詣娑婆世界。佛言便往：汝應以十法，游於彼土。斯乃淨聖來游穢土。又智論云：穢土先施三乘，後顯一乘，娑婆是。淨土先施三乘，後顯一乘，安養是。二有餘土，如法華云：我於餘國作佛，更有異名。智論云：有淨佛土，出於三界，乃無煩惱之名。於是國土佛所，聞法華經。三果報土，如仁王云：三賢十聖住果報，唯佛一人居淨土。四常寂光，普賢觀云：釋迦牟尼，名毗盧遮那。其佛所住，名常寂光。二釋名，初曰染淨同居者。染淨三種：一迷悟分，九界迷逆名染，佛界順悟名淨。如妙樂云：相約隨緣，緣有染淨故。又不二門云：法性之與無明，遍造諸法，名之為染。無明之與法性，遍應眾緣，號之為淨。二情理分，不二門云：故知剎那，染體悉淨。指要云：今之染淨，約情理說。三凡聖分，淨名疏云：六道鄙穢故名染，三乘見真故名淨。三六共住，染淨同居。問：不二門云：一理之內，而分淨穢。別則六穢四聖，通則十通淨穢。然此染淨淨穢，文心解云：染淨，從迷悟體用而言。淨穢，約凡聖界如而辨。今謂淨名染淨，正約凡聖而分。云何淨覺卻云：淨穢約凡聖界如而辨。又垂裕云：染淨之名，約正；淨穢之名，約依。二土凡聖共居，通名染淨。此土砂礫充滿，別受穢名；彼土金寶莊嚴，別受淨號。今謂淨名疏云：四趣共住，名穢；無四惡趣，名淨。此從正報立依報名。云何孤山卻云：染淨之名約正，淨穢之名約依。當知染淨，從凡聖之心以立名。淨穢，約依正之境而摽號。問：既從染淨，立同居名，還許亦從淨穢，立同居乎？答：染淨是通名，淨穢是別號。故垂裕云：此方即染淨穢土，安養即染淨淨土。故知同居，正從染淨而立。若從通義，如淨名中，身子見穢，梵王見淨，乃是娑婆淨穢同居。又婆沙云：若人種善根，疑則華不開。信心清淨者，華開即見佛。此是安養淨穢同居。雖通此義，名非正立。此染淨土，亦名凡聖同居。故淨名疏云：染即是凡，淨即是聖。如疏文云：凡聖各二。凡居二者，一惡眾生，即四趣也；二善眾生，即人天也。聖居二者，一實二權。實者，四果及支佛，通教六地，別十住，圓十信。通惑雖斷，報身猶在。二權聖者，方便有餘三乘，受偏真法性身，為利有緣，願生同居。若實報及寂光，法身菩薩及妙覺佛，為利有緣，應生同居，皆是權也。此等聖人，與凡共住，故名凡聖同居。二方便有餘土，言方便者，如禪門云：善巧修習，故名方便。此有三義：一真中，淨名疏云：二乘三種菩薩，證方便道之所居也。輔行云：所以在方便者，並屬空邊。二真似，妙玄云：別圓似解，未發真修，皆名作意。三遍圓，妙樂云：並以三教而為方便，雖通三義正從證真，立方便名。言有餘者，觀經疏云：無明未盡，故曰有餘。淨名疏云：若修二觀，斷通惑盡，恆沙別惑，無明未斷。捨分段身，而生界外。受法性身，即有變易。所居之土，名有餘國。亦名果報，如輔行云：通有由因感果之報，未入實報。又云：今文且說偏空偏假所感之報，則不如初住已上居果報土。又名法性，如智論云：受法性身，非分段生，三果報土。淨名疏云：報身所居依報淨國，名果報土。輔行云：言果報者，從報果為名。亦號實報，觀經疏云：行真實法，感得勝報。淨名疏云：以觀實相，發真無漏，所得果報，故名為實。亦名妙報，如輔行云：唯有別圓初地初住，獲妙果報。又名勝妙報，如止觀云：違即二邊果報，順即勝妙果報。亦名無障礙，觀經疏云：色心不相妨，故曰無障礙。淨名疏云：一世界攝一切世界，一切世界亦如是。此名世界海，亦名世界無盡藏。四常寂光者，觀經疏云：常即法身，寂即解脫，光即般若。此以不遷不變名常，離有離無名寂，照俗照真名光。亦名果報，如文句云：同居有餘自體，皆是妙色妙心果報之處。記云：故知三土，皆是證道色心報處。寂光既遍，遮那亦遍。此以妙色妙心果報也。問：如輔行云：今論感報，不論寂光。據此寂光豈名果報乎？答：所云寂光非果報者，三惑究盡，業報都亡，所以寂光身土亡泯。雖無惑業之報，而為願行之果。淨名疏云：修於圓教願行之因，因極果滿，道成妙覺，居常寂光。問：如垂裕云：中下寂光，攝在果報。不審四十一地生實報土，云何得受寂光名邪？答：淨名疏云：前四十一地，若約果報，名生實報。分見真理，名常寂光。又彼記云：約報論生。是故有邊論於果報，約所入邊，則非果報。但所入邊，即是見真，名常寂光。三辨義，此約教門辨四土義。復開五門，初論體用，寂光是體，餘三屬用，如釋籤云：諸佛寂理，神無方所。所依寂境，號常寂光。是故沙石七珍，隨生所感。又輔行云：常寂光土，清淨法身，無所莊嚴，無能莊嚴。為眾生故，而取三土。二論事理，淨名疏云：寂光是理，餘三是事。此乃對分事理，若各分事理。如淨名疏云：諸土非垢，寂光非淨，畢竟無說（此四俱理），而說諸土為垢，寂光為淨。記云：理論不當垢之與淨，約事唯有寂光永淨。三論能所，荊溪記云：但以寂光而為所成，即以三土而為能成。故所成唯一，能成有三，是則能所事別故也。四論凡聖，準雜編云：十界對土，有橫有豎。若豎對者，同居六凡，方便二乘，實報菩薩，寂光佛果（橫悞為豎）。若橫敵對，同居有十，凡聖同居故。方便有四，無六凡故；實報有二，無二乘故；寂光唯一，無菩薩故（豎悞為橫）。五論淨穢，淨名疏云：諸土為垢，寂光為淨。三惑覆蔽故為垢，三德究顯故為淨。此約四土對論。若各分者，觀經疏云：五濁輕重，同居淨穢。妙宗釋云：此淨甚通，須知別意。如戒善者，四教凡位，皆悉能令五濁輕薄。而圓觀輕濁，感同居淨，依正最淨。如此經說，地觀已去，一一相狀，比於餘經，修眾善行，感安養土，其相天殊。雜編乃云：嘗觀鼓音之外，六經土相，其實是一。縱有依報大小不同，此蓋如來善權赴機隨時之義也。良由凡夫心想羸劣，未能觀大，故方便示小，為發觀之境。若生彼土，所見俱大。今難霅川，既修偏行，安獲勝果，非獨彰行人之偶報，抑亦顯世尊之妄說。因果不類，徒虛語耳，二體析巧拙，有餘淨穢。刊正記云：通人體色即空故巧，藏人析色明空故拙。妙宗云：體觀感淨，不專通人。衍門三教，對三藏拙，俱明體法。通但空體，別次第體，圓不次體。三人生彼，俱感淨相，圓人最淨。又往生記引輔行云：次明體法，依門修觀，亦應具含三種四門，三次第頓入，實報淨穢。刊正云：別人漸修次第三觀，登地入實，以之為穢。圓人頓修一心三觀，登住入實，以之為淨。妙宗云：若論實證，此土唯有圓聖所居。別人初地，證與圓同，稱實感報，有何優降？今就教道，十地不融，致使感土，異於圓人，雜編雙取。謂偏成非次第頓入者，即別圓所修巧拙二觀也；實報淨穢者，即地住所見融礙二相也。良由別人久習次第，雖回向圓修，入地之時，仍見一分染礙之色，名之為穢。圓人始終唯修頓行，入住之時，但見此土融通之相，號之為淨。往生記，破約教道說，則見神智，自違輔行。義學之者，當思審矣。四分證究竟，寂光淨穢。妙宗鈔云：若就別人，同證圓實，論寂光者，唯約真因。對圓極果，而分淨穢。今論教道，詮於極果，但斷無明一十二品，寂光猶穢。圓知須斷四十二品，名究竟淨。往生記云：今約分滿相對，故合中下，但名分證，寂光猶穢。妙覺上品，真常究滿，方為極淨。請觀今文，諸佛如來所游居處，極為淨土。豈非分得究竟寂光？正約圓家真因極果，對分淨穢。四明云：別教教道，深不可也。刊正記云：由分證寂光，方生實報。今約分證，猶帶無明，無明故穢。究竟無明已盡故淨。雜編難云：若爾，則成穢屬實報，淨屬寂光。今謂無明分破，證少分無相，故穢。無明全盡，證究竟無相，故淨。四定體，先達通以三道，為下三土當體之體。引輔行云：分段三道，謂見思惑，為煩惱道。煩惱潤業，為業道。感界內生，為苦道。方便三道，謂塵沙惑，為煩惱道；以無漏業，名為業道；變易生死，名為苦道。實報三道，謂無明惑，為煩惱道；非漏非無漏業，為業道；彼土變易，名為苦道。通以三德為所依體。苦道即法身，結業即解脫，煩惱即菩提。先師乃謂惑業是因，苦道是果。今之土體，三世間中，唯取苦道，為國土一千當體之體，還以三德為所依體。故荊溪云：既許法身遍一切處，報應未嘗離於法身。若寂光土，觀經既約四德釋名，當以三德為土當體。理無所存，遍在於事，乃以三土，為所依體。廣慈法師準妙樂云：本有四德為所依，修德四德為能依。遂指修德三因為當體，性德三法為所依。今謂妙樂因釋下方空中菩薩，所以將身表智，以空表土，故明身土。今唯辨土，安得兼身。況將修德以對理土，乃彰能所義顛倒矣！五示相，此約教門示四土相：初示一異相，娑婆安養，垢淨相別，故名異。方便有餘，純清淨境，故名一。淨名疏云：三乘同以無言說道，發真無漏，所感國土，一往相同，故言一也。二示融礙相，方便雖是一相，無明未破，果報隔別。淨名疏云：染淨有餘，二種眾生，見有障礙。別圓地住，分破無明，依正互融，一多相即，故名融也。三示橫豎相，舊釋橫豎，句義紛雜，惑亂學者。今分二義，泠然易解。初就土自分，如妙玄云：若分別而言，謂方便在三界外；若分別而言，謂實報在方便外。例此分別，謂寂光在實報外。故淨名記問：三土之外，何殊太虛？答：土同理別。言理別者，法身即土。離身無土，離土無身。但真如實相，非智非境，說智說境。非身非土，說身說土。約此分別，義當豎矣。若約相即，如妙樂云：豈離伽耶？別求常寂。非寂光外，別有娑婆。淨名記云：橫解者，如前所引法華經文，祗於此土，而睹上二。故小被斥，見淨不驚，足指按地，即其事也。約此相即，義屬橫焉。若約相攝，淨名記云：既一土攝一切土，故得此界，遍攝下二。準此以勝攝劣，土亦橫矣。二與教對分，妙樂記云：橫論土體，與教相當。豎論約土，用教多少。然其豎論，如止觀云：若以四諦豎對諸土，有增有減。同居有四，方便則三，實報則二，寂光但一。輔行釋曰：豎約設教對機。機既增減不同，致使教有差別。四土對教，優劣多少，故名為豎。此則土相雖豎，教乃橫說。故淨名記云：然約橫論，同居具四。餘三漸減，同居機雜。遂設四教，方便但以大乘，訓令修學，理唯別圓。蓋為稟三藏者，始生方便，未習通門，逗其為知故學。遂談通教，以蕩執情，實報約行，證道同圓。但約有餘，用教之時，教道化機，說別異圓。具用二教，方生實報。寂光上品，不須用教，但被中下，故有圓乘。設教之相雖橫，就土自分成豎。若約相即，同居橫具四土體相，與四教旨論其相當。三藏談於生滅，乃與同居無常相當；通教談於幻化即空，乃與方便證真相當；別教從事受名，乃與實報感果相當；圓教談乎性德，乃與寂光理體相當。橫辨四教，無復優劣，故名橫矣。四示有無相，妙宗云：經論中言寂光無相，乃是已盡染礙之相，非如太虛空無一物，良由三惑究竟清淨，則依正色心究竟明顯。故大經云：因滅是色，獲得常色。受想行識，亦復如是。仁王稱為法性五陰，亦是法華世間相常。大品色香無非中道，是則名為究竟樂邦、究竟金寶、究竟華池、究竟瓊樹。又復此就捨穢究盡，取淨窮源。故苦域等，判屬三障，樂邦金寶，以為寂光。若就淨穢平等而談，則以究竟苦域泥沙而為寂光。此之二說，但順悉檀，無不圓極。又淨覺撰雜編云：且常寂光者，實三德之妙性也。離為三法，合成一性。一尚無一，豈有苦樂華胎之相乎？當知無相之言，其語猶略。具足須云：無相不相，所謂無生死相，不涅槃相。強而名之稱曰實相。今議二師所論，與而言之。若依說示分別，如普賢觀，示寂光土，乃以四德釋三德法。故祖師判寂光是理，餘三是事。約此就說分別，淨覺乃合分別之義。若約相即所依，理無所存，遍在於事。故維摩疏問：別有寂光土邪？答：不然。祗分段變易，即常寂光。四明乃合相即之義，奪而言之，分別但解三土之外，別有寂光。而迷寂光亦遍三土，遂執寂光空空然，誠不異乎太虛，故吾無取焉。然淨覺雜編難四明云：今問此依正色心，為體為用。若言體者。且妙玄明體用權實中云：體即實相，無有差別。用即立一切法，差降不同。妙樂指淨緣為一切法，豈非實體，亦無淨相。若言用者，則依正色心，正是下三土事。何得認為寂光之理邪？今謂如指要云：夫體用之名，本相即之義。故凡言諸法即理者，全用即體，方可言即。輔行云：即者，爾雅云合也。若依此釋，仍似二物相合，其理猶疏。今以義求，體不二故，故名為即。今謂全體之用，方名不二。故釋迦之王娑婆，即毗盧之處常寂。故文句云：同居有餘自體，皆是妙色妙心果報之處。荊溪釋云：寂光既遍，遮那亦遍。此皆事理相即之明文，云何撥事別求理邪？雜編又問：他引妙經疏云：常即常德，寂即樂德，光即我淨。是為四德祕密之藏。妙樂云：本有四德為所依，修德四德為能依。能所並有能依之身，依於能所所依之土。二義齊等，方是毗盧遮那身土之相。以此為證，寂光有相，不亦可乎？答：此人但聞身土之名，便作形相之解，而不知四德為是何物。又云：須了遮那本無身土，隨順世間，彊指妙覺極智為身，如如法界之理為土。若消妙樂之文，應云：本有四德者，理也；修德四德者，智也。能所並有能依之身，所依之土者，謂性德之理為所依，本覺之智為能依。又修德之理為所依，始覺之智為能依。修性雖殊，詎存萬有之境。始本雖二，寧留五陰之形。故維摩疏云：法身即土，離身無土，離土無身。今謂此釋，凡有二非：一能所不辨，妙樂因釋下方空中菩薩，遂以菩薩之身，以表能依之修德；以虛空土，以表所依之性德。安得唯釋所表修性，全棄能表身土乎？二修性不即，他以性德之理為所依，本覺之智為能依，修德之理為所依，始覺之智為能依。今謂本覺望修，俱屬乎性，修理望性，俱屬於修。依其所解，則成以性泯性，以修會修。非修性之不二焉。當云全性起修，故所依之土，即能依之身，寂光是應身。全修在性，故能依之身，即所依之土，應身是寂光。方顯身土之齊等，乃見事理之無別矣。又云：若謂寂光無相，便同偏真，猶如太虛者。斯由不知大小二理，智非智別也。如維摩疏云：大乘法性，即是真寂智性，不同二乘偏真之理。今問：寂光法身，既俱無相，真寂智性，為依何法？既彰智性之無依，顯非卓識之明鑒也。雜編又云：若據三身相即，四土互具，必須身身即三，土土具四。若然者，法身寂土，豈得無相耶？通曰：今為子論四土互具之義，若約事理相對論互具者，寂具三土，乃全體起用，無相而相也。三土具寂，乃全用是體，相即無相也。今問：全用是體，可得無相；全體起用，應云有相。那得一槩言無相耶？雜編又云，問：若三相不可混同者，何故荊溪難云：一一塵剎一切剎耶？答：此指剎性遍收，故云一切。如金錍即狹遍義。狹何以遍？狹即性故。又如芥容須彌。芥何以容？芥亦性故。此文但見事即是理，不見理即是事。理不即事，安得芥納須彌，無傷樹木，毛吞巨海，不撓龍魚乎？雜編又云：若無依正之相，斯則理無所具，事無所存。豈可法身便同灰滅？答：小乘無相，猶如太虛，無生法之理。大乘無相，譬若明鏡，具現像之性。像由形對，鏡匪自殊。無謂鏡具像性，便云性已差別。今謂，若言但具於性，不具於相，觀音玄義安云，千種性相，冥伏在心。又不二門云：理即名字觀行，已有依正不二之相。嗚呼！霅川雖留意於山家，但解修性之相依，未達事理之融即。違法示徒，後嗣絕矣！六對身，淨名疏云：前二是應，即應佛所居。良以王宮誕質，鶴樹潛神，現生滅相，說三藏法。化同居土，名劣應身。洎有餘國，現法性身。機興應興，機息應息。斯異娑婆，通佛灰斷，既非果報，但名勝應。第三亦報亦應，即報佛所居。以他受用，稱實感報，赴於地任菩薩大機，故彼土佛，亦名應也。後一但是真淨，非應非報，法身所居，此約土體，橫對四佛。若豎論土，凡聖同居，具現四身，方便唯勝，故無劣應。其實報土，無二乘人，唯別圓佛，寂光無機，獨妙法身。七解惑者，或曰，維摩經云：欲得淨土，當淨其心；隨其心淨，即佛土淨。心如形聲，土如影響，祗須自淨其心，何假別求淨土？答：初言心淨，應辨理事。一者性淨，二者事淨。且性淨者，大集經云：一切眾生，心性本淨。心本淨故，煩惱諸結，不能染著，猶如虛空。此則眾生國土，同一法性，地獄天宮，俱為淨土。二事淨者，性雖本淨，心乃忽迷。一念不覺，二障久翳，當修三觀，以破三惑。故仁王曰：三賢十聖住果報，唯佛一人居淨土。登妙覺果，方究竟淨。最下凡夫，慎勿叨濫。次云土淨，須曉難易。婆沙論云：於此世界，修道有二：一者難行，在於五濁惡世，於無量佛時，求阿鞞跋致，甚難可得。此難，無數塵沙，說不可盡（十疑論明五種難事）。二易行道，謂信佛語，教念佛三昧，願生淨土，乘阿彌陀佛願力攝持，決定往生，名易行道。此七義門，辨諸佛土，縱數逾地塵，皆理同鏡象。舒雖萬化橫陳，卷實一法不立。"
}
