{
    "header": {"title": "新譯大方廣佛華嚴經音義", "author": "唐 慧苑述", "number": "A091n1057"},
    "天冊": "冊測革反說文曰𠕋符命也謂上聖符信教命以授帝位字或從竹或古爲冊形也。",
    "造化權輿": "造謂造作化爲變化尒雅曰權輿始也言造作天地變化万物之始也。",
    "天道": "日月星辰陰陽變化謂之天道易曰乾道變易是也。",
    "龜龍繫象": "繫絃計反竟有神龜負園而出舜感黃龍負園而見也繫謂繫辭孔子述易十翼之二也。",
    "人文": "易曰觀乎天文以察時變觀乎人文以化成天下男女君臣父子尊卑上下謂之人文也。",
    "万八千歲": "按帝王甲子記云天皇氏治一万八千年地皇氏治九千年人皇氏治四千五百年有本云三皇皆治一万八千年。",
    "同臨有截之區": "毛詩傳曰有截整齊也言四海之外率服截尒齊整也區謂區域也。",
    "七十二君": "司馬相如封禪書曰繼韶夏崇號諡略可道者七十有二君管子曰昔者封太山禪梁父者有七十二家梁父太山下小山也禪音善也父者斧也。",
    "人迷四忍": "人迷謂人人迷也四忍者思益經云一者無生忍諸法無來故二者無滅忍諸法無去故三者因緣忍諸法因緣生故四者無住忍無異心相續故也。",
    "家纏五蓋": "家纏謂家家纏也五蓋謂貪恚蓋惛沉睡眠蓋掉舉惡作蓋疑蓋也。",
    "鷲嵓西峙": "鷲巖謂靈鷲山也西峙者廣雅云峙立也謂彼鷲峯亭亭然止立於西域也。",
    "超四大而高視": "老子云域中有四大謂天地王道也今言佛出過域內故云超四大也。",
    "混太空": "混胡本反按說文混謂混沌陰陽未分共同一氣之皃今此謂花嚴法門量同太虛也字又作渾也。",
    "叨承": "叨他勞反韻普稱叨忝也此言自謙狠厚承授記也。",
    "玉扆": "扆依豈反鄭玄注禮曰扆屏風也以玉飾扆謂之玉扆也珠藂曰天子施扆於戶牖以爲障蔽也。",
    "海晏": "晏於諫反說文曰晏安也言其遠近清怗故曰河清海晏也。",
    "殊禎": "禎陟盈反說文曰禎祥也蒼頡篇曰禎善也。",
    "貝牒": "貝北盖反牒徒頰反貝謂貝箋樹葉意取梵本經也牒謂簡牒卽經書之通稱也。",
    "時臻歲洽": "臻側詵反洽侯夾反時謂時時歲謂歲歲韻譜積臻至也說文云洽霑及也。",
    "越漠": "漠謀各反漢謂沙漠言諸遠國超越沙漠來歸獻也。",
    "獻賝": "賝勑林反玉篇曰賝寶也字或從玉。",
    "架險𮎃深": "𮎃何剛反架謂置物在高懸虛之上也說文曰𮎃方舟也言遠國來者莫不登渡深險也。",
    "罄": "牽定反毛詩傳曰罄畫者也。",
    "挹": "因入反珠叢曰凢以器斟酌於水謂之挹今謂以心測度於法亦謂之挹也。",
    "罕測": "罕希也測度也。",
    "窺覦": "窺遣規反覦𢈔俱反左傳服處曰窺謂舉足而視也珠叢曰覦謂有所冀望也今言二乘之人於此法中意絕希望也。",
    "隆": "鄭玄注禮曰隆盛也多也。",
    "隘": "於懈反狹也。",
    "肇": "持繞反始也。",
    "爰": "毛詩傳曰爰爲也凢爲於事皆謂之爰。",
    "緬惟": "上弥演反賈逵注國語曰緬思皃也。",
    "啟": "開也。",
    "粵以": "于月反發言之端也。",
    "筆削": "漢書衛青霍光傳曰削則削筆則筆音義曰削謂刪去筆謂增益也有云治書勘校削而注也謂筆削也。",
    "覃": "尒雅曰覃延也郭璞曰謂蔓莚枝相及也。",
    "式": "杜注左傳曰式用也。",
    "繕": "視戰反說文曰繕補也珠藂曰凢治故造新皆謂之繕也。",
    "廓法界之疆域": "方言曰廓謂張小使大也鄭玄注周禮曰疆猶界也毛詩傳曰壃境也域營域也說文域封也。",
    "珠凾之秘": "珠謂如意寶珠也喻般若也凾謂凾篋此喻佛身也謂般若在佛身中猶如意珠在凾也秘謂秘奧卽般若也故大智度論第六十四云般若是如意珠佛舍利是凾篋舍利中雖無般若而爲般若所熏成故故得供養也秘字有從未作者音蒲結反乃是香草也。",
    "弥十方": "漢書集注曰弥滿也。",
    "三復": "復房福反鄭箋詩曰復謂反覆也珠藂曰復謂重審察也字又作覆也。",
    "摩竭提國": "摩竭提者或云摩伽陁或云摩揭陁或云墨竭從此之多名由依八轉聲勢呼召致異也其意義大略不殊或有釋云摩若不也竭提至也其國將謀兵勇隣敵不能侵至也又有云摩遍也竭提聰慧也言聰慧之人遍其國內也又有云摩大也竭提體也謂五印度中此國最大統攝諸國故名大體也又釋云摩無也竭提害也言此國法不行刑戮有其犯死罪者送置寒林耳。",
    "阿蘭若法": "若然也反阿蘭若者或曰阿蘭耶正云阿蘭𭫲此翻爲無諍聲然有三類一名達摩阿蘭若卽此所無明者也謂說諸法本來湛寂無起作義因名其處爲法阿蘭若處此中處者卽菩提場中是也二名摩登伽阿蘭若謂塚間處要去村落一俱盧舍大牛吼聲所不及處也三名檀陁迦阿蘭若謂沙磧之處也磧音遷歷反。",
    "菩提場中": "菩提者此云覺也塲者漢書音義曰築土而高曰壇除地平坦曰塲斯皆神祇所遊止也場字有作場者謬也。",
    "正覺": "按諸字書覺字從學學字從教教字從孝孝字從交因聲義轉相生也。",
    "摩尼": "正云未尼未謂未羅此云垢也尼云離也言此寶光淨不爲垢穢所染也又云摩尼此曰增長謂有此寶處必增其威德舊翻爲如意隨意業逐義譯也。",
    "雨無盡寶": "雨于句反。",
    "光茂": "茂莫搆反尓雅云木如松栢曰茂郭璞注曰謂枝葉婆娑也漢貴音義曰茂美盛也。",
    "一切": "說文云一切普及曰普卽遍具之義故切字宜從十說文曰十謂數之具也有從七者俗也。",
    "瑠璃爲幹": "幹哥且反琉璃梵言具云吹琉璃耶此名不遠山謂西域有山去波羅柰國不遠此寶出彼故以名之幹者字書云幹枝也謂麁枝也字冝從千經本有從木者謬也孔安注書杜注左傳及勘玉篇皆以從干爲樹麁枝從木爲築牆椽板謂卽兩當頭者謂之楨兩旁者謂之幹也。",
    "寶葉扶踈": "扶服無反漢書音義曰扶踈分布也說文曰扶踈四布也扶字玉篇在木部經本從扌作者謬也。",
    "嚴麗": "王逸注楚辭曰嚴莊也小雅曰麗著也。",
    "萃影": "萃疾醉反易曰萃聚也詩傳曰萃集也。",
    "纓絡": "經本有作瓔珞二字並謬也瓔謂似王之石音與櫻同非此用。",
    "堂榭": "榭徐夜反尓雅曰闍謂之臺有木謂之榭郭璞注云謂臺上起屋也杜預注左傳曰榭謂屋歇前也言土臺上有歇簷之屋并有樹木者也闍音都字從木也。",
    "階砌戶牖": "砌千計反牖以柳反玉篇曰階謂登堂之道卽級道是也廣雅曰砌祀也謂卽夾級道兩邊平面砌石也說文云在屋曰窓在牆曰牖戺音仕也。",
    "備體": "劉兆注儀禮曰備畢盡也言盡體嚴之也。",
    "瑩燭": "瑩高定反廣雅曰瑩摩也謂摩拭珠玉使發光明也蒼頡篇四燭照也言相照發光也。",
    "妙音遐暢無處不及": "尔雅曰遐遠也廣雅曰暢達也及至也。",
    "威光赫弈": "赫許挌反弈移益反廣雅曰赫赫威也弈弈明也赫字又作赫弈字經本亦下著廾者薄弈字也。",
    "靡不咸覩": "靡亡彼反珠藂曰靡無也視視也。",
    "不思議刼": "刼梵言也具正云羯魔波此翻爲長時也。",
    "金剛䐡": "䐡字從肉。",
    "毗盧遮那": "按梵本毗字應音云死廢反此云種種也盧遮那云光明照也言佛於身智以種種光明照衆生也或曰毗遍也盧遮那光照也謂佛以身智無㝵光明遍照理事無㝵法界也。",
    "尊嚴": "珠藂曰尊可敬也鄭玄注禮曰嚴可畏也毛詩傳曰嚴威也。",
    "那羅延": "此云堅國。",
    "須弥光梵": "須弥具云蘇迷盧此曰妙高梵亦梵言具云梵摩此翻爲清淨。",
    "旃檀": "此云與藥謂白檀能治熱病赤檀能去風腫皆是除病身安之藥故名與樂。",
    "彩雲": "尚書曰以五彩彰施於五色𮨇野王曰彩猶色彩色之雲故曰彩雲。",
    "櫂幹": "櫂除覺反許重舛注淮南云櫂引也引謂引出字林曰幹枝也。",
    "逈曜": "逈胡𤈍反尓雅曰逈遠也。",
    "仁慈祐物": "祐尤教反孔子述易曰祐者助也物謂有情命者也言能以利樂事濟助含識也祐又作佑闍。",
    "主稼神": "稼加噉反廣雅曰主守也馬融注論語云樹五榖曰稼言五榖苗稼植之在田此神守護不令有損也。",
    "滋味": "上子之反蔣也液也旨也此神能益滋味令成熟也。",
    "環髻": "環胡關反。",
    "旋澓": "澓扶福反三蒼曰澓深也謂河海中洄漩之處是也。",
    "樹杪": "抄弥小反方曰杪木細枝也郭璞曰杪言梢也。",
    "阿修羅": "或云阿素羅阿此云無也素極也妙也羅戲也言此類形雖似天而無天之妙戲按婆沙論譯爲非天以此類雖天趣所攝然多諂詐無天實德故曰非天如人行惡名曰非人舊翻爲不酒者譯人謬也謂梵語中𡨔唎名酒而與素羅聲近卽訓阿字爲不故云不潤斯乃失之甚也按梵本中阿素羅是多聲呼之阿素洛是少聲呼之然皆同一猶謂也。",
    "羅睺": "睺胡鉤反羅此云攝睺云惱也謂此修羅能隱謂日月光明令中諸天生苦惱也或曰羅虎那此云名普間謂日月普天照臨此旣蔽之故天下聞其名。",
    "毗摩質多羅": "毗摩此云絲也質多羅此云種種也謂此修羅善於幻術能以一絲幻作種種事也又云毗摩此曰遍空質多羅此云種種嚴儀言此修羅與帝釋戰時嚴備種種軍伏之儀遍空而列也舊云嚮高或曰穴居者非敵對翻也。",
    "迦樓羅": "或曰揭路茶此云食吐悲苦聲也謂此烏凡取得龍先內素中後吐食之其龍猶活此時楚痛出悲苦聲也或曰此云大嗉項鳥謂此鳥常貯龍於嗉內益出項麤也舊云金翅妙翅者且就狀而名非敵對翻也然其翅有種種寶色非唯金耳。",
    "緊那羅": "緊此云疑也那羅云人也謂此神㒵似人然其項有一角令見者生屣云人耶非耶或曰那羅此云丈夫也緊云猶豫也以其形㒵如人而口似牛使見者生疑故名也舊云歌樂神者從技翻也。",
    "摩睺羅伽": "摩睺此云大也羅伽云胷腹行也此於諸畜龍𩔗所攝舊云蟒神者相似翻名非正對也。",
    "夜叉": "此云祠祭鬼謂俗閒祠祭以求恩福者也舊翻捷疾鬼之也。",
    "毗沙門": "具正云鞞室羅蔥囊此云多聞謂此王福德多處知聞也或曰毗遍也沙門聞也謂諸處遍聞義同前釋或曰毗云伊也此王本名俱乞羅後於一時佛正爲衆說法其王乃披袈裟來入會中時衆咸恠㸦相謂言伊是沙門伊是沙門從此與號毗沙門也。",
    "器仗": "仗直亮反風俗記曰伏者刀戟之惣名也。",
    "毗樓愽义": "具云髀路波呵迄义言髀者種種也路波者色也呵迄又者根也謂以種種雜色莊嚴諸根也又言躰種種也路色也波呵迄又目也言其目種種色莊嚴舊云醜目者𮘸也。",
    "娑竭羅": "此云海也。",
    "德叉迦": "此云能害於所害也謂德又是所害聲迦是能害聲言此龍悳時噓視人書皆致終也舊云多舌龍者由多言故名多舌非是口中有多舌也。",
    "鳩槃荼": "此云陰囊亦曰形夘謂此之類陰囊狀如冬苽行時擎置肩上坐時卽便據之由斯蔽狀特異諸類故從之爲名舊云冬苽者以其猥而不顯故使人𮘸解耳。",
    "𠃵闥婆": "此云食香或曰尋香言此類尋逐食之香氣往彼設樂以求食也舊云樂神者非正翻也。",
    "釋迦因陁羅": "釋迦正云鑠羯囉此云帝也因陁羅此云主也古來釋同佛族望之稱𮘸之深也。",
    "湏夜摩": "湏善也夜摩時也言彼諸天光明赫奕晝夜不別但看花開合以分其時旣非明暗之時故曰善時天也。",
    "兜率陁": "具云珊兜率陁此曰喜樂集依俱舍論中有三義得此名一喜事二聚集三遊樂舊翻爲喜足或曰知足非正翻也。",
    "華蘃": "如籌反玉篇曰藥謂花鬚頭黑也字從三心有作三止者不是字也。",
    "尸棄": "正云式棄𨚗此云持髻或曰有髻也。",
    "爲啟難思": "說文曰啟開也。",
    "陁羅𡰱": "此云惣持。",
    "不唐捐": "捐与專反唐虛也捐棄也。",
    "無倫疋": "玉篇曰倫類也疋比也。",
    "悟斯道": "邇雅曰斯此也。",
    "十力摧𣧠": "𣧠唐顯反邇雅曰𣧠滅也。",
    "曩": "那朗反尓雅曰曩久也謂久遠也。",
    "心馳蕩": "馳直知反蕩唐朗反廣雅曰馳奔也說文曰蕩放恣也蕩字正作惕經本作蕩者時共通用古體又作婸𢠽二躰也。",
    "不隨魔": "魔梵言也具云魔羅此云障㝵善或曰破壞善也。",
    "誘誨": "說文曰誘教也劉獻注易曰晦示也。",
    "俾無癡惑": "俾卑尒反孔安注書曰俾使也。",
    "益其精爽": "劉獻注易曰精靈也說文曰爽明也言增益心靈使明利。",
    "蔭澤": "蔭於禁反。",
    "滋榮": "韻圃稱滋潤也釋名曰榮榮然照明之㒵言其先潤者也。",
    "滌除": "滌曰歷反說文曰滌洗也。",
    "慰安": "慰於謂反漢書云應劭注曰由上撫下曰慰下得上慰曰安也。",
    "一𠛴𨚗中": "𠛴𨚗者時之極促名也人王經云一念中有九十𠛴𨚗一一𠛴𨚗有九百生滅又俱舍論云百二十𠛴𨚗爲一怛𠛴𨚗六十怛𠛴𨚗爲爲一臘縛三十臘縛爲一湏㬰三十湏㬰爲一晝夜三十晝夜爲一月十二月爲一年也。",
    "癡翳常蒙惑": "翳於許反方言曰翳薆也珠叢曰蒙蔽也文字集略四翳目障也公羊傳曰眼有眸子而无見曰蒙也言癡爲患眼之障蔽不見真理故常生疑惑也翳字又作翳蒙言愛也。",
    "漂淪": "淪力勺反王篇曰逾沒也。",
    "畏塗": "塗道也謂三𢙣道可怖畏故名之畏塗也。",
    "大名聞": "聞無運反珠藂聲謂名聲復有此言准釋之也。",
    "其聲所暨": "暨渠肆反杜注左傳曰暨及也。",
    "無央數": "央於良反王逸注楚云央盡也。",
    "决定": "决字從兩點不從水其從水者乃是水行之决字也。",
    "叵思議": "叵普我反字書曰叵不可也。",
    "世閒共度": "度唐洛反。",
    "𠕀不均": "邇雅曰𠕀无也。",
    "一切智道靡不宣": "珠叢曰靡無也邇雅曰宣示也示謂顯示又云明也明謂分別又云遍通也施行也。",
    "婆稚": "正云末梨此云有力。",
    "苫末羅": "西域近海岸邊樹名此翻爲黃雜色金翅鳥若來卽居其上也。",
    "曠劫": "曠苦謗反廣雅曰曠久也謂久遠者也。",
    "淪永夕": "廣雅曰淪沉也邇雅曰永長也夕夜也言死界中常癡闇故謂之長夜者也。",
    "尸利夜神": "此云普現吉祥。",
    "法炬": "炬渠與反說文曰炬謂束薪而灼之謂大燭也珠叢曰苣謂莒苣束草𬋖火以炤之也苣卽古之炬字莒音居呂反。",
    "克𣧠": "克肯勒反邇雅曰克能也珎滅也。",
    "牟𡰱": "此云寂然也。",
    "佛𠛴": "𠛴具正云紇差怛羅此曰土田也差音初界反。",
    "無猒足": "猒於𥂁反飽也。",
    "朗然": "說文曰朗明也。",
    "罣礙": "罣胡卦反字略曰罣謂䋄㝵也字又作罫也。",
    "三昧": "具正云三摩地此曰等持謂離沉掉名之爲等令心住一境性故曰持也。",
    "泉澗": "澗古鴈反。",
    "霈澤清炎暑": "霈澤普蓋反文字集略曰霈謂大雨也劉賾注孟子曰霈然注雨㒵郭璞注邇雅曰炎謂羊氣熏灼人也說文云暑熱也。",
    "難宣": "小雅曰宣示也。",
    "恬怡㝡勝道": "恬徒嫌反怡以之反孔安注書曰恬八安也邇雅曰恬樂也。",
    "蠲除": "蠲古玄反小雅曰蠲潔也絜謂淨潔之也。",
    "皆從化": "鄭箋詩曰從謂也珠叢曰教成於上而易俗於下謂之化也。",
    "險詖不修德": "詖彼義反毛詩序曰內有追賢之志而无險詖之心蒼頡篇曰詖謂侫諂也。",
    "無猒怠": "猒於燄反倦也。",
    "踰須彌": "字林月踰越也。",
    "如世生盲卒無覩": "卒將聿反竟也終也。",
    "如盲𥌒": "皷公五反三蒼曰无目謂之𥌒釋名曰𥌒謂眠眠目平合如𥌒皮也字從皮也。",
    "弥綸": "綸力脣反漢書拾遺曰弥綸猶纏裹也言周帀包羅耳。",
    "名譽": "譽余茹反毛詩傳曰譽謂人美稱揚也。",
    "明矚": "矚之欲反韻略曰矚視也。",
    "如川鶩": "鶩无羽反漢書音義曰鶩乱駞也謂因歷事元无邊佛海今坐道塲竟奉如百川之奏海耳。",
    "無遺隱": "遺餘也隱藏也。",
    "綺麗䆫": "張載注靈光殿賦云綺文也小雅曰麗著也言䆫有文彩照著者也。",
    "特明": "顏注漢書曰特獨也。",
    "填飾妙華": "填字正宜作瑱音唐見陟憐二反漢書訓慕曰瑱謂珠玉壓座爲飾也周禮有瑱圭長尺二寸王所雜飾也今經本從土作者音唐賢反乃是填塞之填字耳也。",
    "夷坦": "夷以脂反他嬾反毛詩傳曰夷易也謂簡易之道言省力易行者也廣雅曰坦平也。",
    "光瑩": "鄭棧詩曰光瑩也切韻稱瑩飾也言以名花妙實瑩飾於佛座也又按說文字統瑩又作鎣訓与瑩同然別有音余傾反訓爲光飾之義近代以來碩學絕嗣聲義渾雜濫以管音之訓安瑩聲之下也。",
    "世尊凝睟": "睟宣醉反易云君子以正位凝命王弼注曰凝者嚴整之㒵睟視也謂肅然而視也又孟子曰睟面色潤也睟然潤也玉篇曰澤之㒵也。",
    "炳然": "炳彼永反蒼頡篇曰炳明著也。",
    "門闥": "闥他達反漢書集注曰闥小門。",
    "洞啟": "洞徒弄反玉篇曰洞達也。",
    "棟宇": "棟都弄反尓雅曰棟屋穩也𢷍卽屋脊也字也穩音於靳反。",
    "妙香氛氳": "氛符云反氳於云反王逸注楚辭曰氛氳盛也香氣盛也二字又作葐蒀也。",
    "樹歧": "歧矩羈反兩股間也柣字書作岐謂枝橫首也今經本有從山邊作支及切韻音爲歧並誤。",
    "爭聳擢": "聳息勇反擢直角反切韻稱聳高也蒼頡篇曰擢抽也言抽樹枝條高上也。",
    "如重雲": "重直用反言密聞也。",
    "弥覆": "覆芳富反漢書音義曰彌滿也言遍滿覆蔭也。",
    "相庇映": "庇卑至反鄭玄注禮記曰庇覆也邇雅曰庇廕也字漢書映俞照也彩間也言相庇相映如五彩之綺鐟也映字古正體作[央/月]當日中央爲映有從日邊作英者謬之也。",
    "閻浮檀金": "具正云染都捺陁此是西域河名其河近閻浮捺陁樹其金出彼河中此則因樹以立稱金由河以得名或曰閻浮果汙點物成金因流入河染石成此閻浮檀金其色赤黃兼帶紫燄氣也。",
    "優鉢羅華": "具正云尼羅烏鉢羅尼羅者此云青烏鉢羅者花号也其𦯧狹長近下小圓而上漸尖佛眼似之經多爲喻其花莖似藕稍有㓨也。",
    "頗梨色": "正云窣堵致迦其狀少似此方水精然有赤有白者也。",
    "普振": "振字正宜作震動之義經太作據字者乃是根舉之振也。",
    "辟支佛地": "辟支梵言具云畢勤支底迦此云各各獨行佛者覺也舊翻爲獨覺正得其意或翻爲緣覺譯人謬以梵語云鉢羅底迦此翻爲緣故智度論第十八中通上二類也。",
    "僉然坐": "僉七𥂁反邇雅曰僉皆也邇雅曰僉同也如云莫不皆然也。",
    "克證": "邇雅曰克能也。",
    "法界周流无不遍": "周帀流布故曰周流。",
    "或覆或傍住": "覆芳福反傍薄卽反。",
    "周聞十方": "聞无運反鄭注禮記云周遍也珠叢曰聞聲所至也。",
    "包納": "包字又作苞並通用也。",
    "般涅槃": "具云般利涅槃𨚗謂般利普也究竟也涅出離也槃𨚗煩𢙉結也言諸煩惱結普究竟出離也。",
    "我曹": "如淳注漢書曰曹輩也。",
    "志欲廣大": "論語注曰志暮也慕謂希樂者也。",
    "煩惱擾濁": "擾如紹反孔安注書曰擾亂也字宜從憂憂音奴刀反經本從憂者謬也。",
    "或脩或短": "廣雅曰修長也經本作脩字者謂乾脯之脩非此用也。",
    "懸覆住": "覆孚福反倒垂狀也。",
    "㸦偱復": "偱祥倫反復符福反郭璞曰偱謂巡行也鄭𤖆詩曰復謂覆也言經歷往來也。",
    "無暫已": "已余里反廣雅曰已止也。",
    "三維及八隅": "廣雅曰維角也鄭玄注考工記曰隅角也。",
    "共美": "共字從廿不從廾撗盡必須連美字從大必不得從火也。",
    "一一區分": "馬融注論語曰區別也。",
    "迫隘": "隘於懈反玉篇曰迫隘也隘狹也夫狹窄必相逼。",
    "珎草羅生悉芬馥": "芬孚云反馥符福反邇雅曰珎珎美也賈逵注國語曰珎寶也謂以寶爲草楚辤曰羅生乎堂王逸注曰羅謂列而生也。",
    "不可沮壞": "沮才與反漢書音義曰沮毀也。",
    "澄垽其下": "垽魚靳反邇雅曰澱謂之垽郭璞注曰潀滓也江東呼爲垽也。",
    "欄楯": "欄勒丹反楯述尹反說文曰欄檻也王逸注楚辝云縱曰㩜撗曰楯楯閒子謂之櫺也。",
    "芬陁利": "此云白蓮花亦曰百葉花也。",
    "尸羅幢": "按梵語云陁羅此曰清涼若云試羅此翻爲王謂以王爲幢名尸羅幢也。",
    "𥪰奏": "小雅曰奏進也爲也。",
    "香水澄渟": "渟笛零反埤蒼曰水曰渟渟猶湛也經本有從立人作亭者誤也。",
    "垣牆繚繞": "垣于元反繚離鳥反毛詩傳曰垣牆也說文曰繚纏也謂周帀纏繞也牆字籍文隸文皆爲牆今或加土者也。",
    "洄澓": "洄漩也澓深也謂河海中深淵之處水旋轉也。",
    "壇墠形": "墠常演反尚書曰爲三壇同墠孔安注曰築土爲壇除地爲墠韓詩傳曰墠猶坦坦言平地也。",
    "佉勒迦形": "佉勒迦此云篇也。",
    "因陁羅": "此云帝也。",
    "娑婆": "此云堪忍也謂具足衆惡境對堪行忍也。",
    "币字之形": "今按梵本币字乃是德者之相元非字也然經中上據漢本惣一十七字同呼爲万依梵文有二十八相卽八種相中四種相也謂室利靺瑳難提迦物多塞囀悉底迦本囊伽吒又有鉢特忙研訖羅跋折羅等三相雖於花嚴迴向二品中有以其可識無謬故此不列在數又有盎句奢相此經惣无故亦不列其一十七相旣非万字又非一毛之相今顯異異同謂第八卷有一室利靺瑳相第九卷有三相勑難提迦物多次室利靺瑳後亦室利靺瑳第二十三有一相謂塞轉悉底迦苐二十七有五種相初室利靺瑳次塞囀悉底迦次難提物多次室利靺瑳後難提迦物多第四十八有三相一塞囀悉底迦相二室利靺瑳三室利靺瑳第五十七五十八六十三六十五等各有一室利靺瑳相若謹依梵本捴有二十八相具顯如刊定記說也。",
    "𭮊": "梵書万字。",
    "室利靺瑳": "此云吉祥海雲",
    "難提迦物多":"此云右旋",
    "本囊伽吒": "此云滿瓶或八相中無此瓶有螺",
    "鉢特忙": "此云赤蓮華",
    "跋折羅": "此云杵",
    "盎句奢": "此云曲鉤",
    "塞嚩悉底迦": "此云有樂",
    "斫訖羅": "此云輪。",
    "世界名尸利": "尸利此云殊勝亦曰吉祥。",
    "城郭": "風俗通曰城之爲言成郭之爲言廓謂寬廊成受者。",
    "狀如四洲": "爾雅曰水中可居之地曰洲今四天下皆在四大海中故俱名洲也言狀如四洲者東洲形圓如日西洲形如半月南洲北廣南狹北洲其形正方。",
    "師子頻伸": "毛詩傳曰頻急也申舒也謂有勞倦者以手足𦙄𦙄左右上下或急弩或舒展用自解其勞倦此或全是梵語如刊定記說也。",
    "世界名多羅": "未詳。",
    "龍淵": "淵烏玄反孔安國注論語曰淵潭也。",
    "慣習": "慣古患反案諸字書正宜作慣有作串字者𮘸也。",
    "天城寶堞": "堞徒頰反杜預注左傳曰堞女牆也。",
    "䡄度": "度徒故反賈逵注國語曰䡄法也鄭玄注周禮曰度謂尺丈之數也言䡄儀有節故曰䡄度也。",
    "佛号娑羅王": "娑羅此云堅固亦名㝡勝。",
    "絕倫": "鄭玄注儀禮曰倫比也。",
    "吉祥幄": "搓於角反尚書傳曰吉善也杜注左傳曰祥者吉凶之先兆賈注國語曰祥猶象也何承繤要曰在上曰帳旁日惟四合象宮殿謂之幄也。",
    "崇飾寶隦堄": "隦普米反堄研礼反鄭注考工記曰崇高也廣雅曰隦堄女墻也蒼頡篇曰坭城上小垣也按賈注國語隦字作埤杜注左傳作卻廣雅作隦籕文作𩫝𩫝又音避支反今經本作俾倪字者按聲類乃是軾中環持蓋杠者也又有䫌𧡎及䑀腉之字並是左右傾首邪視也或云車中傾視於外也杠音江謂蓋竿也。",
    "秀出": "秀私究反國語曰秀出於衆有則以告𮨇野王曰秀美也。",
    "如衆繢": "繢胡對反鄭注論語曰繢畫文也。",
    "刧燒": "燒書耀反。",
    "堅硬": "硬顏孟反。",
    "閻羅界": "閻羅具正云琰摩闍羅此云遮止謂遮止罪人不令更造也。",
    "金剛杵": "杵昌与反。",
    "海蜯": "蜯蒱項反蛤也字又作蜯也。",
    "酸楚": "酸蘇官反說文曰酸酢也按楚猶齗也謂身受劇苦疼痛不可觸近猶齒之酸齗不可以近物也或曰酸猶於痠疼也楚荆杖也言被杖疼痛也又曰酸傷於骨楚猶齒齗言受重苦徹骨疼痛不可觸近也。",
    "乃徃": "說文曰乃語辝也廣雅曰乃徃也重言訓義猶清淨也。",
    "不可紀極": "紀居理反廣雅曰紀記也鄭玄注禮記極盡也言記之不可窮盡也。",
    "𨚗由他": "或曰𨚗𢈔多當此方一億名也。",
    "從廣": "從紫容反孟康注史記曰南北爲從東西爲撗廣也從字正體從木有從糸彳作者皆俗通用。",
    "樓櫓却歒皆悉崇麗": "櫓郎古反切韻稱城上守禦曰櫓也繞城往往別築迴起土臺名爲卻敵旣高且飾故云崇麗也。",
    "塹": "七燄反說文曰塹坈也經本有作從水者𮘸也。",
    "波頭摩華": "正云鉢持忙此曰赤道也其花莖有㓨。",
    "拘物頭華": "其花莖有㓨色或赤白以其花𦯧稍短未開敷時狀郁蹵然故亦或名小白華。",
    "萃止": "毛詩傳曰萃集也。",
    "城邑宰官": "左傳曰邑都也有先君宗庿曰都无曰邑也孔安注論語曰宰臣也韻圃稱宰主也謂城邑中長吏卽爲其主也。",
    "四衢道": "尓雅曰一達謂之道路二達謂之岥旁三達謂之劇旁四達謂之衢五達謂之康六達謂之㽵七達謂之劇𩥵八達謂之崇期九達謂之達然以路多四達凡謂故多用也。",
    "妓樂": "渠倚反切韻稱妓女樂也埤蒼曰妓美女也因以美女爲樂謂之妓樂也經本有從扌邊作支者此乃藝技字也或有從立人作者章易反傷害也非經意也。",
    "巾馭汝寶乘": "馭魚據反乘食證反晉書與服志曰周礼巾車大赤以朝大白以成按巾謂飾也鄭玄注周禮曰巾猶衣也音於記反謂以繒緣衣帶有車也廣雅曰馭駕也。",
    "夫人采女": "采擇所得之女謂之采女風俗通口六宮女凢數千人天子遣掖庭丞率於鄉中閱視童女年十三以上二十以下長壯皎潔有法相者因義入宮故謂之采女也夫人者按因夫以成故曰夫人也。",
    "尋亦去世": "杜注左傳曰尋續也言續後去也。",
    "聚落": "聚疾喻反韋昭漢書云小鄉曰聚人所居也又左傳曰聚衆也廣雅曰落居也衆所共居故稱聚落也。",
    "依怙": "怙胡故反尓雅曰怙恃也韓詩傳曰怙頼也謂倚賴也。",
    "瞻葡華": "此云黃色花其花甚有香氣然以支子也。",
    "阿耨多羅三𦴭三菩提": "耨奴沃反𦴭字按梵本應音云弥略反阿此云无也耨多羅上也三正也藐等三正也菩提覺也惣應云无上正等覺也耨字古來經論巾多作耨音奴攜反按梵語耨音同此方入聲殊无去聲之勢字冝從示不慮從來此乃古今鈔寫之无識非潤色之紕𮘸𦴭字本者摸角弥紹二反此土旣无弥略之字故假借𦴭字而用之。",
    "釋迦牟𡰱": "釋迦此云能也牟𡰱寂囉也言其三業離於諠雜也。",
    "瞿曇氏": "具云瞿答摩言瞿者此云　地也答摩㝡勝也謂除天以外在地人類此族㝡勝故云地㝡勝也或曰瞿曇弥或云憍曇弥或云瞿夷皆女聲呼之也。",
    "瑿羅跋𨚗": "瑿者具云瑿溼弗羅跋此云自在也羅跋那者大聲也謂佛號大自在聲。",
    "修臂": "修相由反按玉篇修飾修長皆從攸或脩脯從肉今有以脯脩爲飾長之用者並𮘸修修同從亻彳。",
    "豐溢": "夷曰反說文曰溢器滿餘也。",
    "或名性超邁": "邁莫界反按梵本云遏底訖爛陁塞嚩皤婆言遏底訖爛陁者超過塞嚩自也皤婆性也謂自體性超過也說文曰邁遠行也遠卽過遠也。",
    "或名簡言詞": "簡皆限反尚書曰辭尚簡要孔安注曰簡略也。",
    "鮮少": "鮮斯演反賣注國語曰鮮寬也寬猶薄也古躰正作尟或俗作尠形亦有用者。",
    "𨷲": "餘灼反字又作籥鑰。",
    "躁動": "躁則到反鄭注論語曰躁不安靜也。",
    "仇對": "仇渠尤反尓雅曰仇讎也孔安注書曰仇怨也言集望於道如怨讎也障出離故也。",
    "資待": "考子記曰資取也王逸注楚辝曰待湏也言苦濟爲飢渴寒熱等病所隨故有所湏有所求取也。",
    "鄙賤": "鄙悲几反如淳注漢書曰鄙猥陋也。",
    "麁獷": "獷古撗反。",
    "破𤓲": "𤓲於胤反言苦報盡處方顯滅諦故名滅諦爲破𤓲或有經本而云破𡖉𡖉盧管反謂由破生死穀𡖉顯得滅諦故也。",
    "能攫噬": "攫拘縛反噬常制反蒼頡篇曰攫搏也說文曰攫爪持也廣雅曰噬嚙也言田造集𡧱真實出離善根故此猶如師子搏嚙也攫字絙本有從立犬邊作矍者甚𮘸花嚴闍梨共三藏覆勘此梵本謂之似多此云師子然依業用聲呼故翻爲攫噬其於犬邊矍者乃是猿猴之属與梵本元不相當也噬字要冝從竹經本有從廾者音武俱反又有口邊著莖者元不是字也㕽音辝孕反二。",
    "渾濁": "渾戶昆反切韻渾濁也重言訓義猶清淨耳。",
    "坏": "普談反未燒反也。",
    "憤毒": "憤夫問反賈注國語曰憤威也鄭注禮記曰憤謂怒氣充實也。",
    "驚駭": "駭閑堦反廣雅曰駭起也失驚者其心必舉起故驚也。",
    "匿疵": "匿尼力反疵疾移反廣雅曰匿隱也杜注左傳曰匿藏也疵病也言苦諦隱藏煩𢙉過患也。",
    "傲慢": "傲五告反杜注左傳曰傲不敬也傲字經本有從豎心邊作敖者𮘸。",
    "駃流": "駃所吏反蒼頡篇曰駃速疾也字從馬史聲經本有從馬邊决者音古穴反乃是駃騠馬名非此經意也。",
    "閻浮提": "正云贍部提贍部樹名也提此云洲謂昏山上阿耨池南有一大樹名爲贍部其紫上闊下狹此南洲似彼故取爲名。",
    "弗婆提": "具正云布嚕婆毗提訶言布嚕婆者此云初謂日初出處此翻爲東也毗勝也提訶身。",
    "瞿耶𡰱": "具云阿鉢唎瞿陁𡰱言阿鉢利者此云西域曰鉢軌忙此云使謂曰沒邊處也瞿牛也陁𡰱貨也謂以牛買物如此洲用錢也。",
    "欝單越": "具正云殟怛羅句嚧言殟怛羅者此云上也勝也句嚧所作也謂彼洲人於所作事皆無我所勝餘三洲故也。",
    "文殊師利": "正云𭦟殊室利言曼珠者此云妙也靈利德也。",
    "丈夫": "大戴禮日大者長也夫者扶也言長制万物者也白𧆞通曰夫扶也以道披按也丈夫爲言杖扶人者也左傳曰進賢達能謂之丈夫也廣雅曰男子之丈夫有名行者也。",
    "紺青": "紺古暗反珠叢日深青之色而佯赤色者謂之紺也。",
    "戲笑": "戲字虛邊作弋音餘力反笑字從竹犬聲有作笑者俗也。",
    "寤世閒": "寤吾故反寤悟也謂令世閒皆出生死睡眠也。",
    "塵累": "贏僞及鄭玄曰累係也謂六境汙心如塵坋人卽此係縛不得出離故捴謂之塵累也塵字從庶土庶衆也謂衆土所成塵會意字也今人多從庶下土爲塵莫識其義也。",
    "曉悟群蒙": "廣雅曰曉說也鄭注禮記曰群衆也韓康注易蒙昧幼小之㒵說文曰蒙謂童蒙也言凢夫於道未有所識如幼童蒙菩薩說之令開悟也說音書𨦣反。",
    "惟仁": "郭璞注尓雅曰惟發語聲辝也周禮曰天德曰仁言人有如天覆育之德者卽謂之爲仁。",
    "湍流𥪰奔逝": "湍他官反說文云淺水流沙上曰湍疾瀕也爾雅曰逝徃也瀬音頼也。",
    "長風": "長直良反兼名苑云風暴疾而起者謂之長風者也。",
    "鼓扇": "鼓公戶反鄭玄注儀禮云鼓猶擊也扇動攝也鼓字經本有從壴邊作皮者此乃鍾鼓之字。",
    "機關木人": "韓康伯注易曰樞機制動之主也按機卽樞機用資轉動関鍵遂在密能運言木人无心但以闇密繩楔而能運動今喻業體都无作者而能生起於果報。",
    "從㲉": "㲉善角反鄭注尓雅曰㲉謂鳥子湏母飯者𩿿謂能自食者也㲉字經本有從聲下作夘者无不是字尋茲𣧘𮘸起自无識胷遮製字陷悞童蒙耳。",
    "濤波": "濤唐勞反三蒼曰大波爲濤也。",
    "阿揭陁藥": "阿此云普也揭陁云去也言服此藥者身中諸病皆除去也又云阿无也揭陁病也服此藥已更無有病故名之耳。",
    "毗藍風": "正云吠濫婆言吠者散也濫婆者所至也言此風所至之處悉皆散壞也又云毗不也濫婆遲也謂此風行最極迅急也舊翻爲迅猛風是也其水輪下風轉亦與此風輪同名也。",
    "樵溼": "樵疾遙反溼失入反說文曰樵薪也溼字經本有作濕者音他合反此乃平原郡之水名耳。",
    "如鑽燧": "鑽則官反燧徐醉反鑽謂木中取火燧謂鏡中取火也淮南子曰陽燧見日則焫而爲火方諸見月則津而爲水許叔重曰陽燧五石之銅精仰日則得火方諸五石之精作圓繫似坏仰月則得水此燧又作燧也。",
    "赫日": "赫亨格反毛詩傳曰赫赤㒵也。",
    "孩稚": "稚直履反方言曰稚年小也字又作穉也。",
    "芒草箭": "芒草一名縈杜西域旣自有之東江亦多此類其形似荻皮重若笋躰質柔弱不堪動用也其正宜作惹也。",
    "射": "神亦反。",
    "躡": "𡰱獵反踽也。",
    "受餒": "餒奴罪反說文曰餒飢也字食妥聲經本有從食邊委者於僞反此乃餧飼之字也。",
    "基堵": "堵當古反賈逮曰基始也公羊傳曰五板而堵何休曰八尺曰板一堵凡四十尺也今謂創始築牆基爲宮室之本時也。",
    "率土咸戴仰": "尓雅曰率從也玉篇曰戴謂欣奉於上也言從化之民莫不欣然奉事也。",
    "奢摩他": "此云止息亦曰寂靜謂正定離沉掉也。",
    "毗鉢舍那": "此云種種觀案謂正惠决擇也。",
    "猗覺": "猗於宜反淹師文選音義云猗美也玉篇𮨇野王曰歎美之猗字又作褘郭璞注尓雅曰褘謂佳麗輕美之㒵今此覺支由定加行伏沉掉故引定身心輕美安和卽當輕美美之義故得定者非唯心安調暢亦復容㒵光潤矣。",
    "檀波羅蜜": "具云檀那波羅蜜多檀𨚗此云施也波羅蜜云彼岸也多云到也言施能到彼岸後之五度波羅蜜多皆准此釋也。",
    "尸波羅蜜": "具云尸羅此曰清淨。",
    "羼提": "羼初莧反此云安忍。",
    "毗梨耶": "此云精進。",
    "禪𨚗": "此云靜慮謂淨心思慮也舊翻爲思惟修者略也。",
    "般若": "此云惠也西域惠有二名一名般若二名末底智唯一名謂之諾般卽是第十智度名也。",
    "僧伽藍": "具云僧伽羅摩言僧者衆也伽羅摩者國也或云衆所樂住處也。",
    "捨諸罪軛": "軛於隔反珠叢曰軛謂車轅端撗木也今謂諸罪賀檐在身如牛爲重載所壓在家累繫如牛被軛脫入道猶捨軛也。",
    "袈裟": "具正云迦邏沙曳此云染色衣西域俗人皆著白色衣也。",
    "紹隆": "紹市沼反切韻稱紹緣也鄭注禮記曰隆猶盛也言繼嗣宗業令興盛者也。",
    "統理": "統他宋反漢書臣瓚注曰統惣也玉篇曰理洽也言惣管攝治御之也。",
    "闍梨": "具云阿闍梨此云軌範師謂與弟子軌則師範然有五種闍梨一羯磨二威儀三依止四受經五十戒闍梨西域又有君持闍梨。",
    "撿束": "顏注漢書曰撿局也謂拘局之不使分散也舊文依撿驗之蓋今依撿繫之義也。",
    "僧伽梨": "正云僧揭胝此曰和合衣謂要須兩重合成故也。",
    "噬諸煩𢙉": "噬常制反三蒼曰噬嚙也字宜從竹巫也。",
    "盥掌": "盥古滿反說文曰盥澡手也。",
    "發趾": "趾之市反字林曰趾足也。",
    "陂澤": "陂彼爲反說文曰穿地通水曰池畜水曰陂也。",
    "池沼": "沼之繞反說文曰沼池也。",
    "汲井": "廣雅曰扱取也取水於井故曰汲井。",
    "園圃": "蒼頡篇曰種樹曰園種菜曰圃也。",
    "耘除": "耘于君反韻圃稱耘鋤也毛詩傳曰秋除草也字又作[禾*員]耘兩體今經本作芸字者此乃芸薹菜名也。",
    "頭陁": "正云杜多此曰抖擻謂去離緣務少欲知足蕁十地一種行皆能棄拾煩惱故也。",
    "醜陋": "玉篇曰陋猥也謂容皃猥𢙣也。",
    "沙門": "正云沙迦葾囊此云止息謂止息一切諸不善法又曰劬勞謂修一切劬勞苦行又曰聽聞謂多聞熏習是常業故又云止息者謂袈裟蔭力止息一切不安隱故也。",
    "婆羅門": "此云捨惡法又曰淨行也。",
    "操行": "操倉到反王逸注楚辭曰操志也玉篇曰持志貞固日操也。",
    "甲冑": "廣雅曰冑兜鍪也鍪音牟。",
    "鎧仗": "鎧肯代反仗除亮反說文曰鎧甲也風土記曰仗謂刀㦸之揔名也顏注漢書曰仗謂所持兵器也字宜從立人經本有從木者棒杖字也或從扌者杖託字也。",
    "不矯威儀": "矯居夭反賈注國語曰行非先王之法曰矯玉篇曰矯假也詐也今言威儀真實不詐現異相也字宜從扌經本從矢者王逸注楚辝曰直也尒雅云勇也蒼頡篇曰正也此乃並非經意也。",
    "林藪": "藪桑走反鄭玄注周禮曰澤無水曰藪又曰藪大澤也又云水晞之澤曰藪韓詩傳曰澤中可禽獸居之曰藪。",
    "麁澀": "澀字有作澀者不是字也。",
    "諷誦": "諷方鳳反鄭玄注周禮曰背文曰諷以聲節之曰誦也。",
    "佛塔": "塔梵言也或曰偷婆正云窣堵及此翻爲墳陵。",
    "若飯食時": "飯扶晚反說文云飯食也謂食飯也盖喫之異名尓。",
    "摩訶衍": "具云摩訶衍那言摩訶者此云大也衍那者云乘也。",
    "兼利": "文字集略曰兼并也言菩薩自利復利於他故云兼利也。",
    "晃曜": "晃胡廣反說文曰晃明也廣雅曰晃暉也字又作晄。",
    "絢煥": "絢呼遍反鄭注儀禮曰絢謂文彩成也何晏注論語曰煥明也。",
    "刼中飢饉": "饉渠恡反尒雅曰穀不熟曰飢蔬不熟曰饉穀梁傳曰一穀不昇曰嗛二穀不昇曰飢三穀不昇曰饉四穀不昇曰康五穀不昇曰大浸昇登也成也墨子曰一穀不收謂之饉二穀不収謂之旱三穀不収謂之凶四穀不収謂之餽五穀不収謂之飢饉言五穀者禮記月令云麦菽稷麻黍也或曰房散角苗𥢶也飢字或作餞也。",
    "愜": "牽恊反。",
    "俾樂色": "俾卑尓反孔安國注書曰俾使也。",
    "所好尚": "好呼到反樂也顏注漢書曰尚崇者也。",
    "離諠憒": "憒公對反廣雅曰憒亂也。",
    "雅思淵才": "思先吏反淵烏玄反毛詩傳曰淵深也。",
    "良毉": "毛詩傳曰良善也毉字或作醫也。",
    "示謁天廟": "謁於歇反蒼頡篇曰示現也尓雅曰謁請也言示現祈請天神靈廟也。",
    "蹲踞": "蹲徂崙反踞居御反。",
    "稟雅": "稟彼錦反孔安國注書曰稟受也字冝從來古文作稟也。",
    "瀑流": "瀑蒲報反說文曰瀑疾雨也謂天澍淬疾大雨山川洪流忽尓而至也。",
    "舡筏": "筏房越反方言曰等謂之草箄謂之筏秦晉通語也又按暫縛柴木水中運載者亦曰筏也筏字又作撥[啜-口+舟]兩躰也。",
    "毀呰": "呰資尓反說文曰呰呵也。",
    "逮成": "逮唐愛反鄭注禮記曰逮及也謂預及於事也。",
    "拯": "蒸之上聲杜注左傳曰拯救助也。",
    "惠施": "廣雅曰惠賜也。",
    "珎饌": "饌仕眷反尓雅曰饌羙也。",
    "戈鋋劍㦸": "戈古禾反鋋市連反小雅曰戈劒㦸也說文曰戈謂平頭㦸也聲類曰鋋鏦也鏦音忩許叔重注淮南子曰鋋小矛也方言曰吳楊江淮南楚之間謂矛爲鋋按論語圖戈形旁出一刃也戟形旁出兩刃也。",
    "弧矢": "弧戶吾反矢式耳反說文弧木弓也考工記曰剡木曰矢謂卽箭也弧字經本有從矢邊作弧或矢邊作直作𤓰者皆無典據矢字又作𠂕或亦作𥬘。",
    "車輿": "輿與居反玉篇曰輿謂車之捴名也。",
    "何况": "况許誑反况字正體兩點邊作經本有從三點者說文謂之寒水珠乖譬况之義者也。",
    "須㬰": "玉篇曰須㬰俄須之間也俱舍論云百二十刹那爲一怛𠛴那量六十怛𠛴那爲一臘縛三十臘縛爲一須㬰三十須㬰爲一晝夜也。",
    "敗衂": "衂女育反玉篇曰衂折挫也左思吳都賦曰衂挫芒是也。",
    "徒旅": "旅力與反孔安注書曰徒衆也旅猶言侶廣雅曰侶伴也。",
    "竄匿": "竄麤亂反玉篇曰竄逃藏也廣雅曰匿隱也。",
    "釋提桓": "勘此中梵本與前第一卷說不殊古人謬置桓字深成罪過也。",
    "蹈": "徒倒反說文曰蹈蹋也。",
    "僅": "渠恡反說文曰僅纔能也字從墓省故但革下土也。",
    "憂悴": "悴疾醉反方言曰悴傷謂容皃瘦損字又作頌。",
    "被甲": "被皮義反廣雅曰被加也謂加之於身也。",
    "𦊰網": "𦊰古泫反珠藂曰𦊰謂以繩繫取鳥也字又作羂也。",
    "忉利天": "忉利梵言正云怛唎耶怛唎奢言怛唎耶者此云三也怛唎奢者十三也謂須弥山頂四方各有八天城當中有一大城帝釋所居揔數有三十三處故從處立名也。",
    "摩䤈首羅": "正云摩䤈溼伐羅言摩䤈者此云大也溼伐羅者自在也謂此天王於大千世界中得自在故也。",
    "無所拒": "拒渠呂反字冝作岠孔安注書曰岠違也玉篇曰岠推挌之也方言云格也止也今經本從扌者此則時俗共用耳。",
    "珂雪色": "珂可何反玉篇曰珂謂螺屬所出於海其白若雪所以嬰馬膺者也。",
    "馬𤤼": "按馬腦梵音謂之阿溼嚩揭波言阿溼嚩者此云馬也嚩音符何反揭波者腦也藏也若言阿溼摩揭波此云石藏按此寶出石中故應名石藏寶古來以馬聲濫石藏聲濫腦故謬云馬腦也。",
    "多羅華": "具釋如下三十三中。",
    "曼陁羅花": "此云悅意花又曰雜色花亦云柔軟聲亦云天妙花。",
    "鷄羅多摩": "鷄羅具云鷄薩羅此曰花葉也多摩具云多摩羅此云天花也謂此香是天上花葉所作也。",
    "婆利師迦": "此云兩時生者花卽以此花和合爲香故還立此名按梵語云婆利師此云兩也迦者時也其花要至兩時方生故名也。",
    "末利利香": "末利香花名也其花黃金色然非末利之言卽翻爲黃也。",
    "置普光明藏": "廣雅曰置者也謂安者於其藏中也。",
    "十千層級": "層賊楞反級居立反按梵本中謂之出超。",
    "十千繒綺": "繒疾陵反說文曰繒謂帛之惣名也白布邪文曰綺也釋名曰綺崎也其文崎邪不順經緯之縱撗也。",
    "迦葉": "具云迦攝波此曰飲光斯則一家之姓氏彼佛降生此姓氏中卽以姓爲名也。",
    "拘那牟尼": "正云迦𨚗牟𡰱言拘𨚗者此云金也牟𡰱仙也佛是大仙身真金色故此名佛爲金色仙也。",
    "迦羅鳩䭾": "具云迦羅鳩忖䭾此云所應断已断。",
    "毗舍浮": "正云毗溼婆部言毗溼婆者此云遍一切也部自在也言遍於一切皆得自在或翻爲一切有也。",
    "毗婆尸": "此云淨觀或曰勝觀亦云勝見或曰種種觀。",
    "弗沙": "正云勃沙此云增威。",
    "提舍": "正云底沙依西域訓字云底謂底邏那此云度也沙謂皤沙此云說也言說法度人也。",
    "波頭摩": "正云鉢特忙此云赤蓮花也。",
    "阿盧𨚗華": "此云曰欲出時紅赤之相其花色似彼故用彼名之謂卽紅蓮花也。",
    "𨚗羅陁華": "𨚗羅正曰㮈羅此云人陁謂陁羅此云持也其花香妙人皆佩之故曰人持華也。",
    "性尒": "尒猶如此也如此卽是印可之言故珠叢曰尒謂言相然也。",
    "寧受": "玉篇曰寧願辤也。",
    "偉哉": "偉于鬼反說文曰偉奇也切韻稱傳大也玉篇曰哉謂語末之辝也。",
    "虛閑": "无爲曰虛无事曰閑。",
    "宴寑": "宴於見反顏注漢書曰宴謂安息者也。",
    "吼": "呼口反。",
    "教詔": "教古孝古包二反詔章曜章遙二反尓雅曰詔導也郭璞曰謂教導之也。",
    "逮於无上": "逮唐愛反尓雅曰逮与也与卽古之預字今經意謂得預無上樂果也。",
    "喉吻": "吻无粉反蒼頡篇曰吻謂層兩頭邊也。",
    "預流": "味叢曰凡事相及爲預也此中謂於見道第十六心得果捨向及遁聖衆行流故曰預流者也。",
    "阿羅漢": "按梵語中此名舍攝多義依大婆沙論第九十四卷中四義釋一者應供二者煞賊三者不生四者遠惡依唯識論中三義以釋一已永害煩惱賊故二應受世間妙供養故三永不復處分叚生故依成實論中一釋謂断惑盡故名阿羅漢舊翻之爲无生者謂三界惑盡更无三界生故也。",
    "羯磨": "此云辦事謂諸法事由茲成辦也。",
    "和上": "按五天雅言和上謂之塢波陁耶然彼土流俗謂之殟杜于闐䟽勒乃云鶻社今此方訛音謂之和上雖諸方殊異今依正釋言塢波者此云近也陁耶者讀也言此尊師爲弟子親近習讀之者也舊云親教是也。",
    "阿闍梨": "此云軌範軌範卽是師義謂與弟子爲法則也。",
    "寧爲多不": "寧年形反玉篇曰寧安也漢書集注曰安焉也安焉之言皆是徵周之辝耳焉音於𧆛反。",
    "哥羅分": "正云迦羅此云豎析人身上一毛爲一百中之一分也或曰十六分中之一分或義譯爲校量分迦音量䭾反。",
    "優波尼沙陁分": "已見第十七卷。",
    "且置此喻": "廣雅曰置捨也。",
    "須陁洹": "正云𡨧路陁阿鉢囊言𡨧路陁者此云入也阿鉢囊者此云流也謂適斷見惑捨異生性初獲聖性入聖行流故名入流也舊安恒字莫知其所以也。",
    "斯陁含": "此云一來謂此聖者雖断欲界修惑六品然爲有餘三品示断此令聖者一度來生欲界故名一來也。",
    "阿那含": "此云不還謂断欲修九品惑畫從此上生色界更不還來受生欲界故名不還也。",
    "傘": "桑亶反。",
    "纔": "昨來反廣雅曰纔暫也。",
    "難制沮": "沮才歟反李琦注漢書曰制断也禁也毛詩傳曰沮止也。",
    "不告勞": "孟康注韓詩曰古者名吏休假曰告也又按告謂告訴卽辝聞之言也故詩云王事鞅掌不敢告勞是也。",
    "覲謁": "覲渠恡反謁於歇反珠藂曰覲謂就見尊老也杜注左傳曰謁白也謂答白溫清起居之事也。",
    "鑽仰": "鑽則官反論語曰子見齊縗者冕衣裳者與瞽者見之雖少必作過之必趍顏淵喟然歎曰仰之弥高鑽之弥堅何晏注云言其不可窮極也謂道高且堅都无際限再仰益高再鑽益堅也。",
    "躭味": "躭都合反按玉篇字林等嗜色爲媅嗜洒曰酖耳類媅字作妉今經本作躭字時俗共行未詳所出也。",
    "珎座": "賈注國語曰珎寶也。",
    "乍可量": "廣雅曰乍暫也。",
    "超諸等列": "韻圃稱等高也杜注左傳列位也鄭注禮記曰列等比也張湛注列子曰禽狩之智有與人同居則有群行則有列列立位也。",
    "舛𮘸": "舛昌䎡反珠叢曰舛相違背也鄭注禮記曰𮘸誤也。",
    "文相連屬": "成文相連對文相屬。",
    "三摩鉢底": "此云等至謂由加行伏沉掉力至其定立身心安和也。",
    "皆无瑕玷": "瑕行加反玷丁念反廣雅曰瑕裂也毛詩傳曰𡙇也凡物之有過者皆由玉之瑕玷古來以爲通語也。",
    "植": "承力反蒼頡篇曰植種也經本有作殖字者非此用也。",
    "莫不自謂": "珠叢曰莫无也玉篇曰謂猶言也道也。",
    "靡不充": "珠叢曰靡无也小雅曰充俻也。",
    "斯尚然": "迩雅曰斯此也。",
    "無屈撓行": "撓女教如紹二反杜注左傳曰撓曲也漢書集注曰撓觸也此中文意明精進波羅蜜勇捍榮勤無退屈無怯弱也撓字正應從本經本有從扌者音呼高反撓擾之字非此所用也。",
    "靡所資贍": "考工記因資取也小雅曰贍足也言觸事乏少无取足處也又郭象注㽵子曰資給濟也聲類曰贍助也言孤焭无人濟助也。",
    "補伽羅": "正云補特伽羅此曰數取趣謂造集不息數數取苦果也。",
    "摩納婆": "此云孺童也。",
    "姝麗": "姝昌逾反說文曰姝色美也小雅曰麗著也謂顏色鮮著也。",
    "珎玩": "玩五叚反廣雅曰珍重也賈注國語曰珍美也書曰玩人喪德玩物喪志孔安國注曰以人爲戲弄則喪德以器物爲戲弄則喪志今此謂所愛重戲弄之具也字又作貦妧兩體或戲人爲妧狎習爲說貪受爲忨也。",
    "若或從事": "邇雅曰或有也河上公注老子曰從爲也。",
    "頗能": "頗普我普俄二反廣雅曰頗少也。",
    "阿鼻地獄": "阿鼻此云无閒也。",
    "慶幸": "幸河耿反劉兆注公羊傳曰幸遇也韻圃稱幸頼也。",
    "無所𮨇戀": "廣雅曰𮨇眷也。",
    "毗𡰱": "正云毗奈耶此曰調伏謂調身語七種非故或謂三業令不造惡。",
    "無聡敏": "聡猶忩逮謂記覽疾也杜注左傳曰敏達也。",
    "頑嚚": "頑五鰥反嚚魚巾反廣雅曰頑鈍也蒼頡篇曰嚚惡也。",
    "匪懈": "匪方尾反孝經曰夙夜匪懈以事一人鄭注匪非也懈墮也按非猶不也无也。",
    "至法淵底": "淵烏玄反毛詩曰淵深也。",
    "無所適莫": "適丁歷反蜀志諸葛亮曰事以覆踈易奪爲益无適无莫爲平人情苦親親而踈踈故適莫之道廢人皆樂人從己不樂己從人故易奪之義廢也論語云子口君子之於天下无適无莫也漢書注曰適主也邇雅曰莫定也謂普於一切无偏主親無偏定踈也。",
    "冀望": "珠叢曰冀謂心有阿希求也。",
    "縷": "力主反。",
    "不遷身": "遷七延反鄭注禮記曰遷變改也。",
    "暨于法界": "上渠器反珠叢曰暨謂及頼也。",
    "該": "廣雅曰該包也。",
    "未嘗": "玉篇曰嘗謂昔暫爲之也今此云未嘗者卽是未嘗爲之也。",
    "聡哲": "書曰知人則哲邇雅曰哲智也。",
    "靡所儔": "儔直由反珠叢曰儔玉篇曰儔類也。",
    "分減施": "分方云反減閒斬反。",
    "不非先制": "說文曰非違也。",
    "貢高": "廣雅曰貢上也謂受貢上之國自恃尊高則輕易附庸之國今有自高陵物欲人賔伏者則亦謂之貢高也。",
    "陵奪": "蒼頡篇曰陵侵也奪字有作奪者俗。",
    "啟導": "說文曰啟開也教也導引也。",
    "輟己": "己居里反珠叢曰輟止也謂止卻自用迴與人也。",
    "夭命": "夭於矯反孔安注書云少喪曰夭也字有作叐者不是字也。",
    "身嬰重疾": "嬰於盈反漢書集注曰嬰繞也謂帶𤵜疾猶物之纏繞人也。",
    "年方": "玉篇曰方始也正也。",
    "焭獨𮊵頓": "焭渠營反孔安注書曰焭單也玉篇云无兄弟曰焭无子曰獨文字集略曰䪺損也焭字又作焭惸嬛婛三躰。",
    "宜時疾捨": "時速也此蓋蒲板方俗之言。",
    "王四天下": "王于誑反韓康注易曰主盛也威德之至王天下。",
    "我今貧寠": "寠其矩反蒼頡篇云无財曰貧无財俻禮謂之寠也。",
    "特垂矜念": "漢書集注曰特獨也毛詩傳曰矜憐也謂偏獨憂憐也。",
    "以贍於我": "贍時燄反小雅曰贍足也聲類曰贍助也。",
    "我等欽風": "孔安注書曰欽敬也風教也鄭玄注周禮曰風者聖賢治道之遺化也今謂敬用其教令也。",
    "都不可得": "漢書拾遺曰都捴也。",
    "我身薄祜": "祜胡古反鄭牋詩曰祜福也言冝從示邊古經本有示邊作右音尤救反孔子述易曰祐者助也按經本意明不具足身由薄福所致非関見在人天助故不從右也。",
    "諸根殘缺": "缺傾雪反蒼頡篇曰殘傷也。",
    "不淨微形": "毛詩傳曰微瘍也瘍音移益反郭注邇雅曰瘍瘡也言身之不淨如瘡也又王注書曰微賤也言此不淨之身非可貴重也瘍微從彳賤微從亻也。",
    "胞𫨻": "𫨻徒玩反胞胎分𫨻故云胞𫨻也。",
    "祇夜": "此云諷誦。",
    "伽陁": "此云諷重誦。",
    "𡰱陁𨚗": "此云因緣然有三類一因請而說二因犯制戒三因事說法也。",
    "優陁𨚗": "此云无問自說也。",
    "嬈亂": "嬈乃烏反三蒼曰撓擾也孔安注書曰擾煩也。",
    "過咎": "咎渠久反玉篇曰咎罪也孔安注書曰咎𢙣也。",
    "綺煥": "煥呼換反張載注靈光殿賦云綺文也何晏注論語曰煥明也言也文彩分明也。",
    "頻婆帳": "頻婆此云身影質謂此帳上㽵嚴具中儀現一切外質之影也或月頻婆鮮赤果名此帳似之故以名也。",
    "彰施": "孔安注書曰彰明也施猶發也言以妙寶發明於妙色也。",
    "頻婆羅香": "或色鮮赤或能現影淮前帳釋。",
    "香氣發越": "漢書集注曰發越謂香氣射散也言香氣纔發四散著人如箭射速中也。",
    "阿樓𨚗香": "紅赤色香色一如日欲出前之紅赤相卽梵語中呼彼赤相爲阿樓那也。",
    "拘蘇摩華": "此之一名有通有別謂但果本諸花通名拘蘇摩又有一花獨名掏蘇摩其花大小如錢色甚鮮白衆多細𦯧圓集共成乍如此方白菊花也。",
    "樓閣延袤": "袤莫搆反尓雅曰延長也切韻稱袤廣也聲類云袤長也史記曰蒙恬築長城延袤万餘里是也說文亦同此釋也。",
    "鮮白衣": "鮮斯延反玉篇曰鮮好也明也。",
    "天牟陁羅": "牟陁羅者三面赦也。",
    "因於撫擊": "撫孚武反字正冝作拊廣雅曰拊擊也釋名曰敷也敷以手拍之拍摶也經本作撫字者此乃撫育按撫之字也。",
    "克諧衆樂": "尓雅曰克能也孔安注書曰諧和也言能以衆多音樂和合成諸歌曲也。",
    "稽首作禮": "周禮大祝辯九拜之儀一曰稽首再拜頭至地也二曰頓首再拜頭叩地也三曰空首再拜頭至手也四曰振首戰動拜也五曰吉祥拜齊縗不拜也下拜六凶拜稽顙而後拜謂三年服者七曰奇拜謂一拜八曰褒拜謂報拜也九曰肅拜謂但俯而下手也。",
    "不瞬": "瞬舒閏反說文曰瞬謂目開閇數搖也字正體作𪱄今並隨俗作瞬也。",
    "阿迦𡰱吒天": "具云阿迦𡰱瑟吒言阿迦者色也𡰱瑟吒究竟也言其色界十八天中此最終極也又云阿無也迦尼瑟吒小也謂色界十八天中㝡下一天唯小无大餘十六天上下㸦望亦大亦小此之一天唯大无小故以名也。",
    "如是儀則": "邇雅曰儀法也。",
    "恱豫": "豫余據反珠叢曰心安知恱謂之豫也。",
    "良沃田": "良善也顏注漢書曰沃溉灌也言其土地有溉灌利者也。",
    "瞋佷": "佷何墾反杜注左傳曰佷戾也說文曰佷不聽從也按玉篇佷字在彳部今多從立亻盖是時俗共行也。",
    "崇巖邃谷": "邃辛酔反鄭注考工記曰崇高也說文曰邃深也邃字從遂韻也。",
    "入苦籠檻": "檻胡黤反籠字正冝作攏三蒼曰攏所以宬禽狩櫚檻也說文曰攏牢也郭璞注山海經曰檻欄也謂穿地爲坈上櫺子以欄禽狩也今經意謂三界皆昔如彼攏檻囚繫衆生也或謂三途劇苦名苦攏檻者也。",
    "衆苦大壑": "壑呵各反兼名苑曰東海有大燋石一名沃燋方圓三万里水沃之則消盡過此有大壑一名尾閭深莫測其涯海水常澍不知其所之也今經意謂生死海中三苦八苦无有涯底如彼大壑故借喻言耳。",
    "五欲所致": "顏注漢書曰致謂引而至之也。",
    "志獨無侶": "鄭注禮記曰志意也侶伴也謂廣心獨濟不待伴也。",
    "顧復一切衆生": "復扶福反詩云父兮生我母兮掬我拊我言我長我育我𮨇我復我出入復我鄭玄牋曰𮨇視也復反也言去子雖近猶步步反視也又牋詩曰是復者感念兩重復之也今經意菩薩於衆生亦然矣。",
    "供養瞻待": "毛詩傳曰瞻視也鄭注周禮曰待給也謂看視供給之也。",
    "寶璫樹": "璫得郎反釋名曰穿耳施珠曰璫按其一當乃用數種珠貫穿重懸之也。",
    "薩婆若": "具云薩婆若臺薩婆此云一切也若囊智也。",
    "軒檻": "軒許言反檻胡黤反漢書音義曰軒謂檻匕板也珠叢曰檻謂殿之欄也漢書集注曰檻謂軒前欄板也。",
    "澡漱": "澡子老反漱史救反蒼頡篇曰澡盥也盥音古滿反珠叢曰盥洗手也說文曰漱蕩口者也。",
    "羣萌": "萌莫耕反漢書集注曰萌謂草木初生也毛詩傳曰羣衆也言童蒙凡夫猶彼衆小草也又或字冝作眠毛詩傳曰珉民珉音與萌同也。",
    "無躁𥪰心": "躁則到反賈逵注國語曰躁擾也鄭注論語曰躁謂不安靜也有見爲二二則爲𥪰則是動不安靜也。",
    "懺除": "懺梵音也具云懺摩此云請忍謂請賢聖或清淨僧忍受悔過。",
    "恬然宴寂": "恬田鹽反宴於見反方言曰恬然靜也漢書音義曰宴安居也寂无聲也。",
    "超然出現": "鄭注書曰超出前也方言曰超遠也謂獨出高遠也。",
    "其心彌廣": "郭注邇雅曰彌極意也言心極廣大耳。",
    "臨御大國": "賈注國語曰臨治也鄭注禮記曰御主也謂主領而治理之也。",
    "名振天下": "振之刃反說文曰振舉也杜注左傳曰振發也謂加名遠發起也。",
    "發號施令": "廣雅曰號告也施設也令教也謂發言告示設教使行之也。",
    "溥蔭萬方": "溥潘補反珠叢曰溥遍也今並作普字也。",
    "感德從化": "邇雅曰感動也毛詩傳曰從隨也說文曰依教行曰化也言德能動之謂教令也。",
    "一切周給": "謂周帀供給故云周給也。",
    "被戮": "隆育反賈逵注國語曰戮煞也。",
    "僧坊": "坊甫良反韻林曰坊區也謂區院也。",
    "揣食": "揣字正冝摶音徒鸞反字從喪聲非從甫韻流俗不能別茲兩形遂用揣字揣初委反此乃揣量之字也。",
    "咽咀": "咽於見反咀才與反廣雅曰咀嚼也。",
    "不欬": "欬克代反玉篇曰欬上欶也欶音蘓豆反。",
    "芬馥": "馥扶福反鄭注邇雅曰芬香氣調也字林曰馥香氣盛也。",
    "覆育": "賈注國語曰育生也言如天覆如地生也。",
    "車𤦲": "梵音正云牟娑羅揭婆言牟娑羅者此云勝也揭婆藏也舊名爲車𤦲者所未詳也。",
    "珊瑚": "梵本正云缽攞娑褐羅寶樹之名其樹身幹枝條葉皆紅色又按說文云珊瑚色赤生之於海或出山中也。",
    "貧窮孤露": "孤焭裸露故云孤露。",
    "駕以駿馬": "駿將𨳝反駕䭾也說文曰駿謂焉之良才也又音私閏反毛詩傳曰駿也兩義俱通。",
    "牽御": "御魚據反廣雅曰御侍也進也。",
    "駕馭": "馭魚據反玉篇曰馭卽古之御字也今按諸書裝鞁爲駕牽空爲馭也。",
    "㽵嚴巨麗": "巨字古作岠珠叢曰岠至也王逸注楚辝曰麗美好也謂至極美好者也。",
    "翼從": "孔安注書曰翼輔也毛詩傳曰翼敬也。",
    "疲䪺": "文字集略曰䪺損也謂勞倦者損力也。",
    "柔明": "孔安注書曰柔謂和柔也言其行調柔識明利也。",
    "𥙆服莊嚴": "𥙆胡練反切韻稱好衣曰𥙆服虔注漢書曰𥙆服大盛玄黃之服也。",
    "年齒": "杜注左傳曰齒列也謂與己行列也司馬彪注莊子曰齒數也謂年壽之數也。",
    "奉養": "養余亮反說文曰奉承也謂承事供養也。",
    "其心曠然": "曠苦謗反河上公注老子經曰曠廣大也說文曰曠明也。",
    "珎竒萬計": "說文曰計筭也謂筭計有万故曰萬計也。",
    "周帀填飾": "填唐賢反賈注國語曰填加也言加之以飾又字或宜作鈿音與填同文字集略云鈿謂金花也。",
    "萬邦遵奉": "鄭玄注周禮曰大曰邦小曰國邦之所居亦曰國也三蒼曰遵習也邇雅曰導從也說文曰奉承也言從今承稟也。",
    "享灌頂位": "享虛兩反玉篇曰享當也杜注左傳曰享受也。",
    "庇蔭": "庇必至反鄭注禮記曰庇蔭者也。",
    "光踰曒日": "曒經了反埤蒼曰曒明也聲類作晈。",
    "首冠十力㽵嚴之冠": "上𭁺字音古乱反鄭注禮記曰著𭁺爲𭁺也下𭁺字音古丸反。",
    "撿繫其身": "漢書音義曰撿局也謂繫縛局也。",
    "裸": "胡瓦盧果二反字又作倮躶。",
    "將之死地": "毛詩傳曰之至也尒雅曰之仁也。",
    "永訣": "訣古穴反切韻稱訣別也。",
    "砧": "陟林反斫剉之机也字又作碪。",
    "屠割": "玉篇曰屠謂分割牲肉也。",
    "木槍": "槍七羊反蒼頡篇曰槍謂木兩頭𨦣者也又音楚庚反非此所用也經本有作鏘者此乃鏗鏘之字深爲差謬失經意也。",
    "貫": "古丸反。",
    "阿逸多": "正云阿制多此曰无能勝也。",
    "語主者言": "廣雅曰主也謂守當者也。",
    "記莂": "莂彼列反本作別字者誤。",
    "密緻髮": "緻直利反經本有作稚字者此乃幼稚之字深爲謬。",
    "光明鑒徹": "鑒照也徹通也言光照內外通現也。",
    "聾聵耳": "聵五恠反韋昭注國語曰耳不別五樂之和謂之聾從生卽聾謂之聵字又作聾二形。",
    "蒙昧": "鄭玄注周禮曰蒙冒也蒼頡篇曰昧冥也言昏冒闇冥也。",
    "輟身要用": "珠叢曰輟止也謂止絕己之要用也。",
    "銛白牙齒": "銛斯塩反漢書音義銛利也字從舌聲也。",
    "迦尸國": "迦尸者西域竹名也其竹堪爲箭幹然以其國多出此竹故立斯名其國卽在中天笁境憍薩羅國之北隣乃是十六大國之一數也。",
    "尋卽敗壞": "杜注左傳曰尋續也言絕成已續卽壞也。",
    "逢𨒦引納": "方言曰逢謂逆𨒦也納入也謂逆首迎之引入住處也。",
    "不尚": "社注左傳曰尚上也今謂不以之爲上也。",
    "傭": "丑恭反又音與恭反非此所用字又作𦟛。",
    "七仞": "汝胤反何承纂要云七尺曰仞小雅曰四尺曰仞。",
    "慈仁莅物": "莅力至反毛詩傳曰莅臨也。",
    "心懷殘忍": "漢書集注曰殘謂多所煞戮也今謂忍於煞戮故云殘忍者也。",
    "衆罪由生": "邇雅曰由從也。",
    "一切宗信": "白虎通曰宗尊言尊重信受也。",
    "造立精舍": "藝文類聚云精舍者非以舍之精妙名爲舍由其精練行者之所居故謂之精舍也。",
    "資生什物": "漢書集注曰什物者爲生之具三蒼曰什聚也雜也吳楚間謂資生雜具爲什物也。",
    "恭恪": "恪康鸖反孔安注書曰恪敬也。",
    "不匱": "匱其位反漢書音曰匱空也廣雅曰匱乏也。",
    "王京都": "公羊傳曰京師者何天子之居也京者大也師者衆也天子之居以衆大之辤言之也左氏傳曰邑有宗庿先君之主曰都无者曰邑廣雅曰都國也風俗通云天子治居之域舊曰郡曰邑者也。",
    "関防": "防浮亡反。",
    "妓侍衆女": "妓奇綺反埤蒼曰妓美女也爲侍謂之妓侍也或曰妓女樂也美女爲樂亦云妓樂或有作伎者言支義反傷字也非此所用也。",
    "罄所珎": "毛詩曰傳曰罄盡也杜注左傳曰珎寶也。",
    "中悔": "中陟仲反。",
    "弥宣正法": "劉瓛注易曰弥廣也郭璞注邇雅曰弥極意也迩雅曰宣明者也。",
    "無毒虐": "孔安注書曰虐暴也言无毒𢙣猝暴之性也。",
    "率土": "玉篇曰率遵也用也謂遵用教命之處也。",
    "牀蓐": "蓐如欲反聲類曰蓐薦也郭璞注尓雅曰蓐席也案古者薦蓆通稱謂之蓐也然今別有厚氊衣以表裏亦謂之褥其字正冝從衣邊作辱也。",
    "己頭充滿": "己基理反。",
    "僮㒒作使": "作則各反使所吏反按玉篇古之用字幼童爲僮㒒爲與今一倍別也鄭注禮記曰㒒謂賤伇之人也。",
    "發言誠諦": "河上公注老子曰誠實也方言曰諦審也謂所出言教真實審定也。",
    "庶品": "庶衆也品類也衆覺流類謂之衆類也。",
    "若專勵": "勵力制反杜注左傳曰勵勸也玉篇曰勵勉也謂自強筞勤也。",
    "若起行": "行遐孟反。",
    "周聞": "聞无運反。",
    "一毛端量處": "量力仗反端頭也賈注云量分齊也。",
    "誕生": "誕唐亶反珠叢曰誕育也賈注國語曰育生也。",
    "分無遐邇": "邇雅曰遐遠也孔安注書曰迩近也。",
    "離垢繒": "繒疾陵反說文曰繒謂帛之惣名凡綵帛皆是。",
    "寶多羅形": "多羅者西域樹名也其形似椶櫚樹也體堅如䥫𦯧長稠密縱多時大雨其𦯧蔭處乾若屋下今以此寶而成故曰寶多羅也又或翻爲高竦樹也。",
    "延袤": "袤莫搆反義已見上。",
    "逈然高出": "逈胡頂反邇雅曰逈遠言獨出高遠也。",
    "繚以寶繩": "繚零鳥反說文曰繚纏也。",
    "聳擢": "聳息勇反義已見上。",
    "稠密": "稠直由反。",
    "寶跋陁羅": "跋陁具云跋陁羅此曰賢也。",
    "寶吹": "吹昌僞反。",
    "其音清亮": "亮力仗反廣雅曰亮朗也。",
    "齅": "許救反俗作嗅。",
    "蘇利耶藏菩薩": "蘇利耶者此云白也。",
    "俱蘇摩德菩薩": "俱蘓摩者花名也具云俱蘇摩𨚗俱蘇此云恱也摩𨚗意也其花色美氣香形狀端正見聞之者无不恱意今此菩薩取之爲名也。",
    "舉要言之": "漢書集注曰舉惣也廣雅云要約也。",
    "珂貝壁玉": "珂恪何反玉篇曰珂螺属也所出於海其白若雪所以嬰馬膺者也說文曰貝謂海介蟲也壁瑞玉也安邇雅云玉肉倍好謂之壁璧形圓而有孔玉王者祭天神以用之矣。",
    "練金": "練字玉篇作煉字書作練今經本作練者揀練字也。",
    "爲將爲師": "將資亮反師所律反。",
    "瑕玷": "玷丁念反玷字有本作點者𮘸也瑕玷之義並見上也。",
    "道險易": "易以豉反郭注邇雅口易平也。",
    "仁恕": "恕傷預反釋名曰仁忍也謂好生惡煞善𢙣含忍聲類曰仁心庶物曰恕也。",
    "何况從事": "河上公注老子曰從爲也。",
    "風雅典則語": "毛詩序曰風以動之教以化之雅正也漢書注曰雅閑麗也邇雅曰典經也毛詩傳曰則法也依經化誘之言謂之風典語美妙方法之說謂之雅則語也。",
    "湍馳奔激": "湍吐官反激經歷反說文曰激疾瀬也淺水流沙上曰湍也馳急走也水文疑邪疾急曰激也。",
    "我𢢔原阜": "阜扶九反尓雅曰高厚廣平曰陸大陸曰阜按陸卽原也。",
    "重械": "重直隴反械侯界反。",
    "三界焚如苦无量": "周易离卦九四注云其炎始盛故曰如今此言三界諸惑如火熾盛能招感多苦果故也。",
    "生難遭想": "韓詩傳曰遭遇也。",
    "捫摸": "捫莫痕反摸謀各反毛詩傳曰捫持也方言曰摸撫也郭璞注曰謂撫指橫索之也。",
    "蚊蚋": "蚋如銳反字林曰蚋小蚊也。",
    "稱兩": "稱昌孕反古稱爲纏今流俗共用秤字甚𮘸也。",
    "無閒然": "閒皆莧反玉篇曰間隔也言情无阻隔也。",
    "國城財貝": "貝比頼反說文曰貝謂海介夬丸古者貨貝而寶龜也謂海蟲有甲作錦文者也今西域用貝爲錢故云財貝也。",
    "孰能": "邇雅曰孰誰。",
    "偱身觀": "偱祥倫反珠叢曰偱巡也念謂四念處中第一觀身不淨從頭至足次第巡歷三十六物皆不淨也。",
    "易誨": "易羊皷反。",
    "無慍暴": "慍於運反暴蒱報反蒼頡篇曰慍恨也玉篇曰暴陵犯也謂欺陵觸披於人也按暴字正體作暴若曝物爲之曝也。",
    "印璽": "璽斯尒反鄭玄注周禮曰璽所也蔡雍獨断曰天子之璽以王爲之古者尊卑通用自秦以來唯天子得其稱也。",
    "鬼鬽": "鬽眉秘反魑鬽也字又作魅俗。",
    "蠱毒": "蠱公戶反左傳曰於文皿蟲杜預注曰皿噐也所以噐受蟲害人爲蠱也聲類曰蟲謂蟲物病害人也。",
    "身相休咎": "休許鄒反咎其抑反杜注左傳曰休福祿也廣雅曰休善也孔安注書曰咎惡也說文曰咎灾也休息之字立人旁作木者許丘反。",
    "流轉遟迴苦趣中": "遟迴二字應作祗徊楚辭曰欲彽徊以于際王逸注云彽徊猶俳佪也經本皆作遟迴之字者此乃緩歸之名非俳佪之義埤蒼曰彽徊謂姆遊者也。",
    "苦海淪𣷢": "滑相余反廣雅曰淪沉也毛詩傳曰湑落也。",
    "我𢢔溉灌": "溉古代反說文曰溉灌澍木也。",
    "涕泗咨嗟": "涕他禮反泗先利反咨將伊反毛詩傳曰自目曰涕自鼻曰泗玉篇曰咨嗟差歎也詩牋曰嗟咨歎之深也。",
    "彼己": "己居理反彼他也己自也。",
    "王后所生": "禮記曰天子之妃曰后也。",
    "泥潦": "潦郎擣反說文曰潦天雨也謂因天雨稸積之也。",
    "念務皆息": "務事也謂攀緣事境心絕也。",
    "卽便𭔏寤": "寤兩字經本並從穴者且皆非是字然寤字去八字書乃以爲寤睡之字音云五盍反今冝作覺也。",
    "二行相行": "兩行字並遐孟反也。",
    "汝今適得": "適尸亦反三蒼頡曰適始也近也。",
    "各若干微塵": "漢書胡廣曰逆順也干求也當順所求而與之故謂若干也顏師古曰若干且毅數之語也干猶箇也謂當如此數耳。",
    "毗舍衆": "謂商估種族也。",
    "首陁": "具云輸達羅此云農業種族也。",
    "邪魔之道": "杜預注左傳曰道猶法術鄭注禮記曰道猶行也路也。",
    "因風濟": "毛詩傳曰濟渡也。",
    "羈繫": "羈寄宜反王逸注楚詞曰生爲貪愛等所繫亦然矣。",
    "禪定境排": "排蒱諧反也。",
    "𧆛誠": "賈注國語曰虔固也邇雅曰誠信也。",
    "萬種繽紛下": "繽疋人反紛撫云反漢書集注曰繽紛衆疾㒵謂衆多急下也。",
    "𠛴利王": "具云𠛴𤇅利耶此云土田主也。",
    "餘不重受": "重除用反再也。",
    "塵相如故": "杜注左傳曰故猶舊也塵字按字林隱文作塵今有從兩上者不是字也。",
    "花𬼵香篋": "𬼵力塩反篋牽恊反珠叢曰凡宬物小噐皆謂之𬼵𬼵字又作𬼵匳籨篋並是竹噐衣箱小者之類耳。",
    "噓": "許於反此氣也。",
    "鈿廁其閒": "鈿唐賢反文字集略曰鈿金花也廣雅曰廁間也珠叢曰金鈿婦人首飾也。",
    "鞞陁梨山": "鞞者此云種種也陁梨亦曰䭾羅此云持也謂此山中能持種種衆寶反諸花𦯧故名之。",
    "𠃵陁山": "具云瑜𠃵駃羅言瑜𠃵者此云雙也䭾羅持也。",
    "𡰱民陁山": "具云𡰱民䭾羅者也此曰持邊山者也。",
    "斫迦羅山": "正云拘羯羅此云輪也。",
    "計都末底山": "計都此云幢也末底𠅤也。",
    "嶷然住": "嶷魚力反嶷謂義崱也字指曰嶷崱山峯㒵今謂十地依佛智如十山依大地雖峯峙各殊而所依是一也。",
    "毗陁發妙光": "毗陁謂前鞞陁梨山發妙光謂喻發光地。",
    "毫未度空可知量": "度唐各反量力杖反。",
    "𨚗伽慧": "𨚗伽此云龍也。",
    "而竟不覩": "鄭牋詩曰竟終也覩見也。",
    "南無": "正云萳忙此曰教禮。",
    "不處於陸": "毛詩傳曰高厚廣平曰陸。",
    "近之": "近渠靳反煞也。",
    "諸心樂次第": "樂牙教反謂欲樂也。",
    "歌羅邏": "此云薄酪謂初入胎如薄酪也。",
    "白分義": "分浮問反。",
    "圓光一尋": "何𠇲繤要云八寸曰咫三尺曰武五尺曰壘六尺曰步七尺曰承八尺曰尋十尺曰丈丈六曰常小雅曰四尺曰仞倍仞曰尋倍尋曰常。",
    "其量七肘": "佛本行集云肘謂二尺也。",
    "一俱盧舍": "依毗曇中一尺五寸爲一肘四肘爲一弓三百弓爲一里四里爲一俱盧舍淮計一里三百六十步則一俱盧舍有一千四百四十步也依俱舍論第十二云分扸諸色至一極微故一極微爲色七極微爲一微量積微至七爲一金塵七金塵爲水塵量水積七爲一兔毛塵積七兔毛塵爲一羊毛塵量積羊毛塵七爲一牛毛塵積七牛毛塵爲隟遊塵量隙塵七爲一蟣七蟣爲一虱七虱爲獷麦七麦爲一指節二十四指撗布爲肘竪四肘爲弓竪積五百弓爲一俱盧舍卽是從肘至阿練若中間量者也。",
    "半由旬量": "由旬梵言具云踰繕𨚗此曰和合謂以多俱盧舍和合成故案佛本行集第十二云七微塵成一窓牖塵七窓塵成一兔毛頭塵七兔毛塵成一羊毛頭塵七羊毛成一牛毛頭塵七牛毛塵成一蟣七蟣成一虱七虱成一芥子七芥子成一大麦七大麦成一指節七指節成半尺二尺成一肘四肘成一弓五弓成一杖二十杖名一息八十息名一俱盧舍八俱盧舍成一由旬淮此方尺量二里餘八十步當一俱盧舍計一由旬合有一十七里餘二百八十步或日一由旬如此方一驛地也。",
    "北俱盧": "具云欝怛羅句盧此翻爲高上也。",
    "東毗提訶": "毗此云勝提訶日身也又毗云種種提訶典也。",
    "種種稼穡": "稼音稼穡音色馬融注論語曰樹五穀曰稼毛詩傳曰種之曰稼𣫍之曰穡案鄭玄注周禮云稼穡爲言其猶嫁穡謂種子相生貪苗實之利也。",
    "修羅退衂": "衂女六如育二反玉篇云血折挫也。",
    "入藕絲孔": "藕五荀反字冝從未。",
    "𠃵闥婆城": "此云尋香城也謂十寶山閒有音樂神名𠃵闥婆忉利諸天湏音樂時此神身有異相卽知天意徃彼娛樂因此以事西域謂諸樂兒亦曰𠃵闥婆然西域樂兒多爲幻彼幻作城郭湏㬰如故因卽謂龍所現城郭爲𠃵闥婆城也。",
    "恒伽河": "淮經香山頂上有阿耨達池其池四面各流出一河東面私陁河從金剛師子口流出其沙金剛東流入震旦國便入東海南面恒伽河從銀象口流出其沙白銀流入東印度便入南海西面信度河從金牛口流出其沙黃金便入西海北面縛蒭河從琉璃馬口流出其沙是琉璃流入波斯拂林便入北海其池樂廣五十由旬四面口各一由旬也。",
    "澒涌奔馳": "澒胡動反涌字正冝作溶故楚辞注云澒潛水去㒵漢書高紀傳集注云澒溶竦涌也經本作涌者誤也。",
    "奇香發越": "漢書集注曰發起香氣射散也謂香氣速疾遍布著人也。",
    "皆得潤洽": "洽侯夾反廣雅曰洽潰也。",
    "阿那婆達多龍王": "阿無也那婆達多熱惱也諸龍皆受熱沙之苦此龍元故立其名耳。",
    "無替": "邇雅曰替廢也。",
    "從諸善友而得出生": "友字經本有作支字深爲𮘸也。",
    "終不匱止": "匱渠位反廣雅匱少也漢書音義曰匱空乏也。",
    "摩那斯龍王": "摩那意也斯夜也流出也言此龍王凢興雲雨皆從慈心出也。",
    "嶷然高出": "嶷謂崱嶷也字指曰崱嶷山峯㒵也。",
    "伊𨚗鉢𨚗象王住金脅山": "伊𨚗鉢𨚗此云香𦯧其象身長九由旬高三由旬常住第一金山之脅卽是最初計都末底山也。",
    "閻魔王": "正云琰魔邏闍此曰遮止謂誠勗罪人之也。",
    "舍支": "正云設施謂月之別名帝釋夫人取爲號也。",
    "無方無隅": "方謂四方也鄭玄注考工記曰隅角也。",
    "不捨衆善軛": "軛於革反珠叢曰軛謂轅端撗木也今此謂駕擔衆善勒行不捨如牛駕重長途力進也。",
    "徒令": "劉熙曰徒猶獨也。",
    "一百洛叉爲一俱𦙁": "洛又此云万也俱𦙁此云億也又技此方黃帝笇法惣有二十三數謂一二三四五六七八九十百千萬億兆京垓𥞑壤溝澗王載從万已去有三等數法其下者十十變之中者百百變之上者倍倍變之今此阿僧祇中上數法故云一百洛叉爲一俱𦙘俱𦙁當此億也阿庾多兆也𨚗由他京也餘皆依次准配可知今案此經十百千万十十變之從万至億百倍變之從億已去皆以能數量爲一數復數至與能數量等變之能本行集第十二中百百變之也。",
    "矜羯": "矜居淩反。",
    "摩婆": "婆之上聲此後婆字並上聲呼之。",
    "弥伽": "此云能降伏或翻爲曇也。",
    "攞": "郎我反。",
    "毗佉擔": "擔多甘反。",
    "瑿攞陁": "瑿於奚反。",
    "阿麼": "麼莫我反。",
    "勃": "蒲沒反。",
    "翳": "煙計反。",
    "薜": "蒲計反。",
    "窣": "蘇沒反。",
    "睥": "普計反。",
    "䛧": "莫計反。",
    "荼": "荼之上聲。",
    "釋迦牟尼": "釋迦能也種族望稱也釋音作鑠呼迦字作告俄反呼牟尼此云寂嘿也德行之號。",
    "阿弥陁佛": "正云阿弭陁娑耶此云无量壽也。",
    "支提山": "支提本是塔廣之名此山似之故因爲號然支提此云生淨信之所具釋如下七十五中。",
    "毗舍離": "此釋爲廣愽謂此城於中印度諸城之中最廣大也或亦翻爲廣嚴也。",
    "度度羅城": "或云摩偷羅亦云摩突羅此云孔雀城或云蜜善皆古事者也。",
    "俱珎𨚗城": "或言俱陳𨚗耶言俱陳者是名此云大盆𨚗耶法律也昔此城未立之時有一五通仙名俱陳而於此地置一大盆蓄水若池恒在盆側修仙法律亦常爲人說護淨經及養性法於後學徒皆以師名及法爲其姓氏人衆漸廣卽於此處建立城郭故此舉國人今皆姓俱陳𨚗城亦因之立號耳。",
    "目真隣陁窟": "目真或曰牟真此云解脫是龍名也隣陁此云處也謂有龍於此窟中間法脫龍苦故名解脫處窟也。",
    "摩蘭陀國": "未翻。",
    "甘菩遮國": "未翻。",
    "震旦國": "或曰支𨚗亦曰真丹此翻爲思惟以其國人多所思慮多所計作故以爲名卽今此漢國是也。",
    "𨚗羅延": "此云堅固。",
    "䟽勒國": "正名佚路數恒勒古來此万存略呼爲䟽勒又訛數音爲䟽然此名乃是彼國一山之号因云其稱又或翻爲𢙣性國以其國人性多獷戾故也。",
    "迦葉弥羅國": "舊名𦋺賔國此翻阿誰入昔此國未建之時其地有大龍池人莫敢近其後有一羅漢見其形勝冝人居止乃從龍𠧒容一膝地時龍許之而羅漢變身漸大其膝漸滿龍池龍以言信便捨而去羅漢卽以神力𠃵竭其水令百姓於中建立屋宅人衆咸云我等不因聖僧阿誰得入此處故從此語卽立其名國卽在北印度境𠃵陁羅國次北隣也。",
    "菴浮梨摩國": "菴謂菴羅此云无垢卽西域果名其果堪以療疾諸國之中此國㝡多故以名焉其國卽在中印度境內也。",
    "𠃵陁羅國": "此云持地國謂昔此國多有道果聖賢任住持其境不爲他國侵害也又云𠃵陁是香羅謂陁羅此云遍也言遍此國內多生香氣之花故名香遍國其國在中印度北北印度南二界中閒也。",
    "苫婆羅窟": "苫式占反苫婆是香花樹名其窟側近多生此樹故因名耳也。",
    "寂漠无言": "玉篇曰无人聲曰寂郭璞注邇疋曰漠謂靜定也。",
    "逮十力地": "逮唐槩反說文曰逮及也字從之不從及。",
    "譏謗": "譏居疑反說文譏誹也。",
    "人王都邑": "左氏傳曰九有宗庿先君之主曰都无曰邑也漢書音義曰都城也廣𤴓曰都國也司馬法曰大國五百里爲都風俗通曰天子所居之城曰都舊都曰邑也。",
    "毗舍闍王": "毗舍闍之王卽是東方提頭頼吒此云持國謂護持國土願二部鬼一名毗舍闍此云噉精氣二名𠃵闥婆此曰尋香也。",
    "倮": "胡寡力果二反玉篇曰倮祖也字又作躶裸兩躰。",
    "一切樂器不鼓自鳴": "鼓字冝從支支者普木普角二反經本有從皮者鍾鼓字也。",
    "舍利": "正云設利羅或云實利此翻爲身。",
    "誠敬": "亦退曰誠信也。",
    "靡不驚懾": "懾之葉反鄭注禮記曰聶法也畏懼也經本有作攝字者謬也。",
    "信樂不回": "回音迴說文曰迴轉也今此謂信樂无轉動也。",
    "熙怡微笑": "𠘑許基反怡與脂反方言湘潤之閒謂喜曰𠘑怙或曰紛怡說文曰𠘑恱也怡和也謂容㒵和恱也鬚字又作𠘑也。",
    "炳然顯現": "炳彼永反蒼頡篇曰炳者明也謂顯著之明也字又作炳也。",
    "洞徹": "洞徒弄反玉篇曰洞猶通徹也字又作迴者也。",
    "其掌安平": "掌謂舌面平而且安。",
    "玩味不忘": "玩字正冝作忨杜注左傳曰忨食也經本作玩字者誤也案孔安注書云戲弄貪玩卽受樂之意也。",
    "上咢": "俄各反正躰作咢又或作齶。",
    "右輔下牙": "左傳宮文奇虢虞之表也猶輔車相依脣亡齒寒杜注曰輔類也車牙車也又注曰輔類車骨。",
    "弥盧藏雲": "弥盧此云高以在仏上牙故也。",
    "紺蒱成就": "紺蒱正云劒蒱此云乃西域果名其色紅赤腹園正云劍蒱三約撗文而佛頸成就彼相故云也今時俗謂頸圓有約爲嬰節者是也。",
    "弥布十方": "顏注漢書曰弥滿也。",
    "左臋": "臋徒論反聲類臋尻也尻音苦勞反也。",
    "其䏶與膊": "䏶字正冝作脾古文作䠋今䏶未詳所出膊字冝作膊今經本作膊者𮘸。",
    "伊尼延鹿王腨": "伊尼延者鹿名也其毛色多黑腨形𦟛纖長短得所其鹿王最勝故取爲喻腨字又作𬧅。",
    "舉足將步": "將欲也步行也王逸注楚辞曰步徐行也。",
    "足跟": "跟各痕反。",
    "因陁羅尼羅": "因陁羅者此云帝也主也尼羅青也此寶青色寶中㝡尊第一故曰青主也。",
    "隨好": "呼告反令衆生愛樂故又音呼暠反資嚴大相益殊勝故。",
    "摩耶夫人": "摩耶此云幻也由此菩薩唯依大𭛔智幻法門行故故此名夫人者梵本云苐脾此翻女天案鄭注禮云諸俠之妃曰夫人玉篇曰呼婦人爲夫人者亦所以崇敬之稱也又夫者男子美稱婦因夫以成人故名夫人也西域呼王妃爲苐脾呼男夫爲苐婆也。",
    "懺悔": "懺謂懺摩此云請忍謂請前人忍受我悔罪也。",
    "樂近凢庸": "廣𤴓曰凢輕也漢書集注口庸庸微小也言其輕薄寒微眇小之人耳。",
    "習童蒙法": "易稱蒙卦者謂童蒙來求我非我求童蒙蒙者𢠽也韓康注云蒙昧幻小之象又玉篇曰童幻迷意也廣雅曰童癡也鄭玄注周禮蒙冒也毛詩傳曰蒙覆也言童幼之心愚昧所爲惛𮘸如以物覆蔽之。",
    "口如啞羊障": "啞於雅反巧能宣說大乘妙義名無啞羊障大智度論第三云啞羊僧者謂雖不破戒鈍根无惠不別好𢙣不知輕重不知有罪若有僧事二人共諍不能断決嘿然无言譬如白羊乃至人煞不能作聲是名啞羊僧也。",
    "洎于法界": "洎字正冝作暨暨音渠秘反珠藂曰暨謂及預也杜注左傳曰暨至也經作洎者𮘸也。",
    "充洽": "洽侯夾反小雅曰充俻也玉篇曰洽濡治潤之也。",
    "工幻師": "韻圃稱工巧也謂巧能於幻術。",
    "偏祖": "祖唐𮧊反露也字從示又音宅莧反非此所須也。",
    "右跽": "路其几反跪也。",
    "如我惟忖": "忖忩本反顏注漢書曰惟思也珠藂曰恃惻度也。",
    "瞻仰如來仁及我": "有仁德者號之爲仁故諡法曰貲賢視之曰仁煞身以成人曰仁度功而行曰仁周禮曰天德曰仁禮記云上下相親曰仁論語云克己復禮曰仁鄭注禮云施恩曰仁白虎通曰仁者是忍好生愛人者也。",
    "佉陁羅山": "亦曰軻梨羅此卽木名謂此方苦梗木也由彼山中多有此木故立其名耳。",
    "尼民陁羅山": "此翻爲許邊以彼山是七重金山中㝡外邊故然卽院繞護持餘內六山故名持邊也。",
    "目真隣陁山": "目真此云解脫卽是龍名也隣陁此云處也謂此山中是解脫住處也。",
    "水族衆生": "孔安國注書曰族類也謂水畜之流類也。",
    "大雨名洪霔": "注之戎反洪大也併𢙣寫水曰霔也。",
    "變溼令燥": "燥蘇早反燥乾也變字從變作文有從反者不是字也溼字有作濕者誤也。",
    "廓徹虛空": "廓苦郭反尓𤴓曰廓大也今謂寬大遍虛空量也。",
    "普照無私": "玉篇曰事不公爲私王逸注楚辞曰竊愛爲私也郭象注㽵子曰世所謂無私者釋已而愛人也言无已情偏有所爲也私字加持者非也。",
    "作務": "作則各反務事業也。",
    "或牟薩羅": "或曰牟婆羅此云紫色寶。",
    "哮吼": "哮呼教反吼呼口反。",
    "洞然": "洞徒弄反韻團稱洞徹也謂通徹火然之狀也字或冝作炯炯音徒東反韓詩傳曰炯謂草傳火焰也。",
    "鼓楊海水": "鼓公戶反說文曰鼓擊也字從支不從皮也。",
    "則便謝": "王逸注楚辞曰謝去也謂神識去身者也。",
    "積同須彌": "說文曰積聚也聚謂堆聚聚音疾喻反也。",
    "如乾草𧂐": "𧂐卽賜反鄭玄注周礼塔小曰委垖大曰積積字從廿者俗也。",
    "知諸稱謂": "稱昌孕反稱順也漢書音義云謂者指趣也今謂於法門意趣皆順知漢書又曰謂者稱也事冝也謂凢諸事物知其名自識其所冝皆曰稱謂也。",
    "知諸制令": "令力政反制謂禁制令謂法令也。",
    "長嬰疾苦": "嬰於征反漢書曰嬰繞也謂常爲疾苦之所纏繞也。",
    "啟一切衆生心意": "玉篇曰啟開也古體作启也。",
    "閒无空處": "閒古閑反謂中閒也。",
    "善言開喻": "漢書音義曰喻曉也蒼頡篇曰喻諫也。",
    "棒打屠割": "棒字正冝作棓或亦爲柈今經本作棒杖之棒非打棓字然復有從手邊作奉者乃是棒持之轉違經意也廣雅曰棓箠也又有木邊作吉者卽是棒杖之棓字體耳。",
    "誓期自勉": "鄭注禮記曰勉勤也玉篇曰自勸強也。",
    "撾打楚撻": "撾陟苽反撻他沬反說文曰撾箠也鄭玄注周禮箠擊也楚杖也又注周禮曰撻猶杖之以荆也撾字從木古體作葉之也。",
    "挑": "天彫反。",
    "或級其頭": "漢書衛青霍去病傳第二十五云斬首三千一十七級顏師古曰本以斬敵一首辦爵一級故卽因謂斬首爲級亦卽又名生護一人爲一級也珠叢曰斬首一名爲級也。",
    "無央數劫": "央於良反王逸注楚辤曰央盡也。",
    "無所觸嬈": "嬈乃了反三蒼嬈擾也孔安注書曰擾乱也說文曰擾煩也。",
    "悉稱": "稱昌孕愜可也又邇雅曰稱好也郭璞注云事稱人意皆好也。",
    "補特伽羅": "此翻爲數取趣謂數造趣因數取趣果也舊翻爲人隨方語便非正刻字譯也。",
    "心恒𮨇復": "已見第二十三卷。",
    "嬉戲": "嬉許其反切韻稱戲遊也。",
    "得預": "預餘茹反珠藂曰凡事相及曰預字古作與也。",
    "菩提薩埵": "依佛地論主親光菩薩以三義釋菩提薩埵具如彼論中也。",
    "不㢮": "㢮式尓反論語云君子不㢮其親孔安注曰㢮易也韋昭注漢書曰㢮廢也郭璞注尓雅曰㢮放也鄭玄注禮記曰㢮棄也此中經文舍於多義故具存之。",
    "無險詖故": "已見苐四卷中。",
    "身心憺怕": "憺徒敢徒嚂二反怕暜白反王逸注楚辞曰憺安也廣雅曰怕靜也憺字又作淡澹二體也。",
    "癡㲉": "㲉苦角反有從㲉下作夘者不是字也。",
    "殘毀": "蒼頡篇曰殘傷也。",
    "無中息": "中陟仲反。",
    "難處受生": "難那幹反難處謂八難中五也。",
    "捨一切烏波提涅槃法": "鳥波此翻爲有提云苦也謂二乘所得无餘涅槃未離變易行苦隨故有餘涅槃反諸外道所計涅槃並未離三苦故法卽涅槃或通教等於彼悉捨故云捨一切有苦涅槃法。",
    "樂法樂義以法爲樂": "此中三箇樂字初二首五教反後一音郎各反。",
    "如虹蜺色": "虹古巷胡公二反蜺研奚反蔡雍月令曰虹螮𧋐也謂陰陽文接之氣而著之形色雄者曰虹雌者曰蜺者也。",
    "無主無待": "邇雅曰待湏也謂凢事相湏待藉於他也今此謂求緣无作卽亡待義也。",
    "無著無行": "行遐庚反。",
    "無有瘡疣": "疣有鳩反廣雅疣腫也說文曰疣贅也贅謂賸聚肉也贅音支𨦣反疣字又作肬也。",
    "瘢痕": "瘢蒱寒反痕戶恩反。",
    "解因自悟": "因由也言辟支悟於苦無常等但用自觀緣生克證不依師受故立其名爲獨覺也。",
    "而強爲說": "強其兩反。",
    "志尚涅槃": "顏注漢書曰尚崇也。",
    "求其罪舋": "覺許覲反玉篇曰舋謂有禍兆也。",
    "或以妙義授非其人": "顏注蕭望之傳曰將非其人者言不才之才也謂有器量者也。",
    "嚬蹙不喜": "嚬脾仁反感子六反玉篇曰嚬蹙謂憂愁不樂之狀也賈注國語曰頻近也毛詩傳曰蹙促也言人有憂愁則皺𢲻眉額鼻目皆相促近也又案說文渡水向岸水文叢皺亦謂之嚬蹙然愁憂之頻頻下著卑今從省之不用也經本有傍安口者俗也。",
    "伺其過失": "伺相吏反鄭玄注周禮曰伺猶察也玉篇曰伺𠋫也方言曰伺視也自開而北凢竊相視謂之伺也。",
    "頑佷": "佷何墊反左氏傳曰心不測德義之經曰頑也杜注左傳曰佷戾也說文曰佷不任從也佷字正體從彳今亻者俗也。",
    "我𢢔所吞": "吞他痕他賢反廣雅廣吞滅也。",
    "醒悟": "醒素形桑迴二反。",
    "天魔波旬": "具云提婆魔羅播裨言提婆者此云天也摩羅障㝵也播裨罪惡也謂此類生天宮性好勸人造惡退善令不得出離故也。",
    "悉知將有": "廣雅曰將欲也當也。",
    "徙置": "從仙紫反蒼頡篇曰徙移也鄭玄注考工記云置猶著於地也置字本徙𠕀下直今從曰者俗也。",
    "侍衛": "蒼頡篇曰侍從也毛詩傳曰侍近也言側近左右扶侍之也王弼注易曰衛護也。",
    "免濟": "免亡辯反杜注左傳曰免脫也毛詩傳曰濟渡也言令物脫苦渡難也。",
    "欣慰": "廣雅曰欣喜也毛詩傳曰慰安也言歡喜則心安也。",
    "圖書印璽": "鄭玄注周禮曰圖畫也璽印也蔡雍獨断曰天子之璽以螭虎劒古者尊卑共之月令秦以前諸侯卿丈夫皆曰璽自茲已降天子獨稱諸侯不敢用也秦王子嬰上高祖傳國璽文曰受命于天旣壽永昌此印章古名璽飾今謂斗撿文也螭音勑支反。",
    "弧𠂕劒㦸": "弧戶孤反矢式耳反㦸居逆反說文曰孤木曰弓考工記曰孤名弧謂徃多而來寡也易曰㓨謂之矢矢卽箭也㦸有三歧歧皆兩刃或中有小子名雄㦸或有兩岐名偏㦸矢字又作𠂕。",
    "博弈嬉戲": "嬉許其反博字正冝從竹說文曰搏謂戲爲戲六薄十二棊也杜注左傳曰弈圍棊也切韻稱嬉遊也。",
    "親戚": "戚千曆反孔安注書曰戚近也𮨇野王曰近所以爲親也毛詩傳曰相親曰戚戚字正冝從竪心也經本作戚者俗也。",
    "能忍劬勞": "劬具虞反毛詩傳曰劬勞病苦也勤劬勞倦猶病苦也。",
    "正法盈洽": "洽侯夾反注左傳曰盈充也玉篇洽濡也濡滲閏也。",
    "菩薩無㝵乘巾之出三界": "乘食證反乘謂車馬通稱巾謂服乘之名案周禮巾車氏卽掌駕之官主當嚴乘故鄭玄注云巾猶衣也衣音於記反謂㽵飾衣帶之也珠藂曰以衣被車謂之巾也此則文言尚簡名有影略故巾車之言當乘車之謂亦猶設席之名以目食客也。",
    "宴然": "宴於見反漢書音義曰宴安居也嘿靜也。",
    "皎鏡": "方言曰皎明也廣雅曰鏡照也又可皎然如鏡故曰皎鏡也。",
    "馳逐": "廣雅曰馳奔也玉篇曰逐駈也。",
    "菡𦾩花": "菡胡感反𦾩徒感反說文曰芙葉花未發者盛之貌也菡𦾩二字玉篇作𦾩蘭字書作菡茵說文作莟𦾩。",
    "娛樂": "杜注左傳曰娛樂也樂卽可樂故七娛樂也。",
    "室羅筏國": "舊云舍衛國具稱室羅筏悉底此翻爲好道或曰聞物此乃城名非是國號以其城多出人物好行道德五天共聞故名聞物或曰室羅筏悉底者此云聞者城西域俗聞傳記云昔於此處有一老仙修習仙道復有少仙從其受學厥号聞者老仙歿後少仙建立此城卽以少仙之名爲其城稱然國都号爲憍薩羅但以就勝易彰故城取國号耳。",
    "逝多林": "逝多梵言也或曰制多或云祇陁此翻爲勝卽太子之名當欲造此寺時湏達長者買園太子出樹故曰逝多林者也。",
    "䐡藏菩薩": "案此菩薩名䐡䐡卽是肚䐡之䐡字冝從肉也。",
    "師子頻申三昧": "杜注左傳曰頻齊名申展也謂申展四體之拘急所以解於勞倦故曰頻申也表此三昧能申展自在无㝵法法界解脫障㝵拘急勞倦故喻名耳此或全是梵言也刊定記說。",
    "危樓逈帶": "逈胡項反鄭注禮記云危高也邇雅曰逈遠也言高樓險絕似空中之遠挂者也。",
    "階墀軒㩜": "墀直尼反玉篇曰階謂登堂之道也說文曰墀謂以丹塗地卽天子丹墀也韋昭注漢書曰軒㩜上板也王逸注楚辤曰懢植也縱曰㩜橫曰楯𮨇野王曰謂殿上抅攔也。",
    "階隥欄楯": "撜多鄧反楯食尹反隥級道也王逸注楚辞云從曰欄撗曰楯楯閒子謂之櫺也噔字又作嶝。",
    "湍激洄澓": "湍吐宮反激古歷反洄音回澓音服說文曰湍疾瀬也淺水流於砂上曰湍也水文疑邪急疾曰激也三蒼曰水轉洄也澓深也謂洄澓之處其水必深也。",
    "芬敷": "芬麩雲反郭璞曰芬謂香氣和調也小雅曰敷布散也。",
    "舍利弗": "具云奢唎補怛羅言奢唎者此云鶖鷺鳥也補怛羅者此云子也此尊者母眼黑白分明轉動流利似鶖鷺眼故時共号爲奢唎也其尊者依母得名故云鶖鷺子舊翻爲身子者𮘸也梵本中呼身爲設利羅故知懸別也。",
    "大目𠃵連": "𠃵渠焉反目連者此云採菽氏卽此尊者母姓又以尊者有文神通卽將一事爲号也然母本族採綠豆仙之苗𧜟也。",
    "摩訶迦葉": "具云摩訶迦葉波言摩訶此云大也迦葉波此云飲光也此尊者上古元祖是大仙人身有光明而能吞蔽燈火之光時人異之号曰飲光仙人因此摽其氏族焉又以尊者有頭陁大行故時與其大飲光名之耳。",
    "離波多": "此云所供養之也。",
    "湏菩提": "此云善現亦曰善實舊云善吉者非。",
    "阿㝹樓䭾": "正云何泥嚕多此云无滅。",
    "難陁": "此云歡喜也。",
    "刧賔𨚗": "此云黃色者謂此尊者上祖是黃頭仙人因爲族此則氏族爲名耳。",
    "迦旃延": "迦旃者一宗之姓氏也延此云胤也言此尊者是彼種族之後胤耳。",
    "富樓𨚗": "具云富樓𨚗弥多羅尼子言富樓𨚗者此云滿也弥多羅尼者此云願也滿願是尊者母稱子卽尊者自身從母立名故曰滿願子也。",
    "不能遊履": "履字本作樂者𮘸勘梵本是履。",
    "舉體燋然": "劉兆注儀禮曰舉畢盡也此言舉體燋者遍體盡燋也。",
    "烏鷲": "郭璞注山海經曰鷲者鷲謂卽鵰也說文曰鷲鳥黑色而多子也。",
    "瞖膜": "瞖於計反文字集略曰瞖目障也經本有從羽作者非此所用也。",
    "捕獵放牧": "牧叵福莫六二反三蒼曰牧養𩚅也。",
    "振䘏": "振之刃反䘏湏聿反鄭注禮曰振救也又注周禮曰䘏憂貧也文云憂恤從心䘏少從卩邇雅通用今案諸書依說文從卩爲勝。",
    "均贍": "均居春反贍市燄反小雅曰贍足也言均平皆使得足也。",
    "舉世": "杜注左傳曰舉皆也言世皆不能測也。",
    "孰有": "邇雅曰孰誰也。",
    "凢夫嬰妄惑": "廣雅曰凢輕也案夫猶人夫嬰繞也言輕庸之人爲虛妄感障緾繞也。",
    "難稱": "稱昌陵反鄭注禮云稱猶言也廣雅曰稱舉也字正體從立人今多從禾。",
    "欽歎": "欽去今反孔安注書曰歎敬也。",
    "曉悟": "廣雅曰曉說也說音書春反說文曰悟覺也聲類曰悟解也言說化令覺也。",
    "因陁羅䋄": "因陁羅者此云帝也帝謂帝釋䋄謂帝釋大衙殿上結珠之䋄孔相望更爲中表𮞏相圍繞互作主伴同時成就圍繞相應也。",
    "舟": "章由反船也。",
    "明練": "珠藂曰鎔金使精曰鍊煑絲令熟曰練也今謂善知儀式分明精熟故云明練也又李善注文選曰練蕑也謂蕑分明也。",
    "君慧比丘": "梵本中云因陁羅未底比丘言因陁羅者此云君也末底惠也言此比丘智惠比餘比丘最尊如君故曰君惠也。",
    "娑羅林": "娑羅者此云高遠以其林木森竦出於餘林之上也舊翻云堅固者誤由娑囉之与娑羅聲勢相近若呼堅固卽轉舌言之若呼高遠直之耳。",
    "湏達多": "此云善給施无依怙者舊譯云給孤獨者是也。",
    "婆湏達多": "此云財施或云有善施行。",
    "徽纆": "徽許韋文纆莫北反廣雅曰徽束也珠藂曰纆繩索也案經義謂以愛繩束縛難可解也。",
    "轡勒": "轡鄙媚反說文謂曰勒謂馬頭鑪銜。",
    "憍盈": "玉篇曰盈懈也緩也謂憍恣懈怠𢢔緩也。",
    "令我載此乘": "乘食證反王逸注楚辞曰載乘也乘音繩也。",
    "茵蓐": "茵於真反蓐如欲反毛詩傳曰茵虎皮也玉篇曰以虎皮爲蓐曰茵也茵字又作鞇郭注邇雅曰蓐席也聲類曰蓐薦也案茵蓐二字以草爲之者字卽從廿若以皮爲之者字卽從草其蓐字從衣者盖是通用也。",
    "羈鞅": "羈居宜反鞅於兩反王逸注楚辞曰羈謂絡鳥頭也[革*夬]謂靳牛頸繩也。",
    "周挍": "周帀㽵挍故言挍也。",
    "四維": "廣雅曰維隅也隅卽角也。",
    "玩好之物": "死五𫨻反孔安注書曰玩戲弄也謂戲弄之具。",
    "等祐一切": "鄭注禮云等齊也周禮曰祐助也普皆齊等以福助之祐字古作佑闍二體也。",
    "頗有": "頗普歌反廣雅曰頗少也少猶希也有呼頗音爲叵者甚誤。",
    "分敷布濩": "濩音護顏注漢書曰布濩猶言布露謂於缺露之處皆遍布也芬敷如上漢字經本從言作者𮘸也。",
    "辯析": "扸蘇歷反漢書音義曰辯別也析分也析字有作扸者俗也。",
    "深入法旋澓": "旋徐攣切澓浮福反切韻稱旋洄也三蒼曰澓深也謂深水下有深穴則令水有洄澓也經本旋字從方者音徐緣反切韻稱還也。",
    "行至楞伽道": "楞伽者具云楞求羅伽西域山名在南天笁南界近海岸也。",
    "激電": "激經歷反說文曰激疾波也謂電光急速如波迅速也。",
    "𠛴𨚗羅婆牟呼栗多": "仁王經云九百生滅爲一𠛴𨚗九十𠛴𨚗爲一念業俱舍論等謂時之㝡少名一𠛴𨚗一百二十𠛴𨚗名一怛𠛴𨚗六十怛𠛴𨚗名一羅婆三十羅婆名一牟呼栗多三十牟呼栗多爲一晝夜也。",
    "國名達利鼻荼": "荼除如反其國在南印度境此翻爲銷謂此國人生无妄語出言成呪若隣國侵迫但共呪之今其滅亡如火銷膏耳。",
    "市肆": "崔豹古今注曰肆陳也謂陳𧵍鬻物。",
    "善財言唯": "唯營癸反孔安注書曰直曉不問曰唯也鄭注禮曰唯恭於諾也謂諾然教許。",
    "遽卽下": "遽梁預反賈注國語曰遽疾也玉篇曰遽急也。",
    "則爲不断": "爲于危反廣雅曰則卽也爲猶是也下諸問並准此。",
    "菩薩爲一切衆生恃怙": "恃時止反怙胡古反韓詩傳曰无父何恃恃負也无母何怙怙賴也案經義菩薩於衆生如父母慈威兼濟常爲倚頼也。",
    "長者": "風俗通曰春秋之末鄭有賢人著書一篇号鄭長者謂年長德艾事長於人以之爲長者故也。",
    "涕泗悲泣": "涕音體泗音四毛詩傳曰自目曰涕自鼻曰泗也崔時注漢紀曰淚下无聲曰泣也。",
    "拔猶豫箭": "邇雅曰猶狩名也其形似麂善登木性多疑慮常止山中忽聞有聲恐人來𡧱卽豫上樹久无方下湏㬰又上如此非一故時謂不决多猜慮者爲猶豫焉或曰隴西時俗呼犬子爲猶犬隨人行喜預在先未至却來迎𠋫因謂心所不决爲猶豫也今案論中猶豫卽是疑煩𢙉攝而於善品不能進修故此湏拔者也。",
    "坦蕩自心": "論語曰君子坦蕩蕩小人長戚戚鄭玄曰坦蕩寬㒵戚戚多憂懼也。",
    "有一國土名摩利伽羅": "未譯也。",
    "梵行之道": "梵摩具云毗澄摩此云清淨也又葛洪字𫟍云梵淨也。",
    "衝": "昌客反。",
    "優婆夷名𠇲捨": "𠇲捨具云呼舍羅此云悕望亦曰意樂或曰滿願謂滿衆生悕望意樂故也。",
    "咨嗟戀慕": "咨音諮孔安注書咨嗟也玉篇曰咨嗟嗟歎也鄭箋詩曰咨嗟歎美之深者。",
    "想其容止": "容謂容儀止謂行止。",
    "善知識者是我師傅": "府遇反師傅者尚書云周官有三公三孤言三公者謂太師太傅太保師謂天子所師傅謂傅相天子保謂保安天子於德義此三公之位佐王論道以經緯國事如理陰陽有德行者乃堪之也三孤謂少師少傅少保孤特也言卑於三公尊於六卿特置少三人也玉篇曰傅猶於附如以脂粉塗附於面益乎姿質也今案所喻踓舉師傅義通於保謂求道者得善友益己猶天子之有三公三孤佐弼之也。",
    "毗盧遮𨚗摩尼寶": "此云光明遍照如意寶也。",
    "鳬鴈": "鳬快趺反似鴨而小謂之危也。",
    "俱抧羅鳥": "抧經以反其鳥未譯。",
    "寶多羅樹": "多羅樹者形如此方椶櫚樹其𦯧繁密此中然是勝寶所成也。",
    "徐搖": "徐緩也搖動也。",
    "挾閣": "挾弦頰反。",
    "阿盧𨚗香": "阿盧𨚗者此云赤色也。",
    "挂": "古賣反又作掛。",
    "釧": "昌戀反。",
    "耳璫": "璫得郎反釋名云穿耳施珠曰璫也。",
    "婆樓𨚗天佛": "婆樓𨚗者此云水也。",
    "國土名𨚗羅素": "𨚗羅素者此云不嬾墮也。",
    "仙人名毗目瞿沙": "毗目瞿沙具云毗沙摩爲多羅菩提瞿娑言毗沙摩者此六無怖畏也烏多羅者㝡上也菩提瞿娑者出聲也。",
    "鮮榮": "鮮新然反玉篇曰鮮是明也釋名曰榮猶榮榮然照明之㒵也。",
    "波吒羅樹": "其樹正似此方揪樹也然甚有香氣其花紫色也。",
    "尼拘律樹": "其樹𦯧如此方柿𦯧子似枇杷子子承蔕如柿然其種類耐老諸樹中㝡能高大。",
    "領徒一萬": "孔安注書曰徒衆也司馬彪注莊子曰徒謂弟子也。",
    "編草": "編蒱典反倉頡篇曰編識珠藂曰取物交織謂之編也字又作辮也。",
    "髻環垂𩯭": "𩯭環謂槃髻如環垂環至𩯭故云也。",
    "夷險道": "孔安注書曰夷平也方言曰險高也。",
    "險易": "易羊豉反玉篇曰險難也郭璞注邇雅曰易平也言道路或險或平。",
    "阿𢈔多": "𢈔逾主反阿𢈔多者當此方兆之名也。",
    "聚落名伊沙𨚗": "伊沙𨚗者此云長直也。",
    "離諸難難": "上難字𨚗翰反習八難也下難字者𨚗乾反謂艱難之也。",
    "伊𨚗跋羅龍王": "伊羅者樹名此云臭氣也跋羅此云極也謂此龍徃昔由損此極臭樹𦯧故致頭上生此臭也因卽以爲名耳。",
    "難陁優波難陁": "難陁此云歡喜也優波此云近也。",
    "脣口丹潔如頻婆果": "丹赤也潔淨也頻婆果者其果似此方林檎極鮮明赤也。",
    "於河渚中": "渚支與反邇雅曰水中可居者曰洲小洲曰渚小渚曰沚小沚曰坘人所居者曰潏沚者止坘音遲橘字决述二音。",
    "商估": "估公戶鄭注周禮曰行賣曰商坐賣曰估估字又作賈也。",
    "貯": "陟呂反。",
    "福德淵": "淵烏玄反說文曰水洄曰淵毛詩傳曰淵深也今謂福德深奧也。",
    "挍飾": "㽵挍爲飾故云挍飾也。",
    "鵝王羽翮": "翮莖隔反珠叢曰翮謂鳥羽之本也。",
    "憩止": "憩去例反珠藂曰憩息也。",
    "稟善知識": "稟彼錦反孔安注書曰稟受也字從來稟聲古文作稟也。",
    "靡不周贍": "贍市熖反珠藂曰靡元文賈注國語曰周俻也漢書音義曰贍足也。",
    "游福德海": "游似由以周二反說文曰浮於水上也今以喻言尓。",
    "遽卽徃諸": "遽渠預反賈注國語曰遽疾也玉篇曰遽急也。",
    "何緣致此清淨衆會": "致陟利反顏注漢書曰致謂引而至之也。",
    "不憚": "憚唐翰反鄭箋詩曰憚難也謂忌難艱辛也難音𨚗輸反。",
    "雉揲崇峻": "雉重尔反揲徒恊反公羊縛日五板爲堵五堵爲外百雉爲城何休注曰二萬尺也周十一里三十三步二尺公侯之制也禮記云天子十雉蓋受雉之城千百七十雉子男五十雉天子周城諸侯千城千城者缺其南面以受過也杜注左傳曰堞女牆也崇高也揲字又作堞也。",
    "風黃淡熱": "文字集略曰淡謂胷中液也騫師注方言曰淡字又作痰也。",
    "辛頭波羅香": "辛頭者河名也謂卽阿耨達池西面金牛口出水流入信度國者是也波羅云岸也謂其香生波河岸故以出處爲名耳。",
    "阿盧𨚗跋底香": "阿盧𨚗盧此云赤色也跋底者有也或云極也謂此香極有赤色堪以練緋色甚鮮明故因名耳。",
    "烏洛迦旃檀香": "烏洛迦者西域虵名其虵常患毒熱據此香樹以身繞之毒熱便息故因名也或曰此虵㝡毒螫人必死唯以旃檀能治故以爲名耳。",
    "城名多羅幢": "多羅者義翻爲明淨謂如星之明淨或曰精等明淨也謂昔有王名明淨眼幢創建此城故從之立名耳。",
    "怡暢心": "怡與脂反毛詩傳曰怡恱也漢書傳曰暢通也。",
    "撫其孤弱": "撫赽禹反漢書集注曰撫慰也鄭注周禮曰撫安也杜注左傳曰撫恤也。",
    "阿𨚗羅王": "此云无猒足也或曰普可畏聲言其王可畏聲名普遍諸國也。",
    "以爲其䐡": "䐡字冝從肉經本有作齊者𮘸也。",
    "十万猛卒": "卒作沒反方言曰南楚東海之閒呼𮇬人給事者謂之卒也。",
    "楄": "方緬反字冝從衣作。",
    "攘臂瞋目": "攘如羊反孟子曰臂而下車𮨇野王曰攘謂除去衣袂而出臂也㭈音弥勵反弟也。",
    "曾不𮨇懼": "廣雅曰𮨇眷也言不眷戀身命怖懼死也。",
    "命之同坐": "廣雅曰命呼也。",
    "承旨": "玉篇曰旨意也。",
    "富贍断其所作": "断都管反說文曰断截也安注書曰断絕也。",
    "靡不該練": "珠藂曰靡无也廣雅曰該咸也包也小雅曰該俻也珠藂曰鎔金曰鍊煑絲令熟曰練也該字又作晐練字鎔金從金煑絲或從散水也。",
    "伊羅婆拏大象王": "伊羅謂伊陁羅卽帝釋名也婆拏云出聲也言此大象時出美聲娛樂帝釋也或曰伊謂能出也羅婆拏聲也娛樂如前說也。",
    "脩臂": "毛詩傳曰脩長也案玉篇修飾修長字昔從彡唯脩脯字從肉也。",
    "如漁": "漁御居疑據二反說文曰漁捕魚也字又作𩼪𭤐𮫱三形者也。",
    "㧌動": "㧌呼高反攬也。",
    "城名無量都薩羅": "都薩羅者都謂都羅此云喜也薩羅者此云出生也言此城中出生无量歡喜之事故名之。",
    "廛店隣里": "廛除連反鄭注禮曰廛謂市物𨚎舍也謂停估客坊𨚎尚書大傳曰八家爲隣三隣爲盟二明爲里五里爲邑此虞夏之制也廛字經本從厂作者𮘸也。",
    "巖巚": "巚魚偃反說文曰巖峯也郭璞注邇雅曰巖謂山形如累重甑也字或作巘也。",
    "鬻香": "鬻與六反玉篇曰鬻賣也賣鬻從每羹鬻從米。",
    "摩羅耶山": "具云摩利伽羅耶其山在南天笁境摩利伽羅耶國南界而因國以立山名其山中多出白栴檀木。",
    "香名先陁婆": "先陁羅此云石塩其香似之故以名之耳。",
    "舩師名婆施羅": "此翻爲自在也。",
    "部多宮": "部多此云自生謂此類從父母生者名夜叉化生者名部多也。",
    "晨脯": "尓雅曰晨早也玉篇曰脯加申也。",
    "晷漏延促": "晷音輒李善注文選曰晷漏曰影也細分晷與漏別故周禮云表長八尺夏至曰晷長六寸日益兩晷益長也文字集略曰漏刻謂以筒受水刻節晝夜百刻也。",
    "理断": "断都乱反鄭注禮記曰断决也。",
    "良久": "玉篇曰良由長也長對於促非蹔時也。",
    "國名輸𨚗": "輸音冝借上聲呼正曰輸羅此翻爲勇猛也。",
    "城名迦陵迦林": "以義翻之名相闘諍時此據因闘諍建國立名也。",
    "波利質多羅樹": "波利此曰遍也亦曰周帀質多羅云間錯莊嚴也言此樹泉雜色花周帀嚴飾或曰圓妙㽵嚴也。",
    "迦隣陁衣": "細綿衣也。",
    "迫窄": "窄側格反玉篇曰迫猶逼也廣曰迫狹也窄隘也窄字經作迮者俗也。",
    "婆樓𨚗天": "此云水友也。",
    "菴羅林": "菴羅果名狀貌似此土榛其味如梨也。",
    "波湏蜜多": "此云世友亦曰天友或云寶亦曰財也。",
    "脣吻": "吻无粉反蒼頡玉篇曰吻謂脣兩角頭邊也。",
    "蹈彼門閫": "蹈徒到反閫苦本反說文曰蹈蹋也閫門限也閫字又作捆也。",
    "居士名鞞瑟𦙁羅": "此翻爲纏裹也或曰包攝謂現廣大身可以含容國土也𦙘字上聲呼之。",
    "弥勒": "具云昧怛𭌆曳此翻爲慈氏也。",
    "山名補怛洛迦": "此翻爲小花樹山謂此山中多有小白花樹其花甚香香氣遠及也。",
    "泉流縈映": "縈於營反珠藂曰榮卷之也字指曰映不明也案經意言泉流交給互相纏互相隱映故曰縈映也映字經本有作月邊英者盖是胷臆。",
    "樹林蓊欝": "蓊鳥孔反玉篇口蓊欝草木茂盛也蓊字漢書相如傳從竹下翁也。",
    "遷移": "遷七延反鄭注禮曰遷猶變改毛詩傳曰遷猶去也。",
    "城名墮羅鉢底": "此翻爲門主或曰有門謂古者建立此城王之号也。",
    "㲉": "苦角反經本有作㲉者元不是字之也。",
    "迦毗羅城": "具云迦比羅皤窣都言迦比羅者此云黃色也皤窣都者所依處也謂上古有黃頭仙人依此處修道欲因名耳。",
    "夜神婆珊婆演底": "具云婆傘多婆演底言婆傘多婆演底言婆傘多者此云春也婆演底主當也謂於春時此久主當守護衆生及諸苗稼也或曰婆羅婆薩𨚗此云依止无畏謂與衆生作依止處令離怖畏又中天笁本云跋僧多云春主謂能生物善故借喻名耳。",
    "佇立未久": "佇除呂反李善注文選云佇立㒵也郭璞注尓雅曰佇企也謂舉足竦望有所敬時也。",
    "方隅": "隅語俱反鄭玄注考工記曰隅角也方謂四方隅謂四維也。",
    "慞惶": "慞諸羊反切韻稱慞懼也三倉曰惶恐也。",
    "爲作靈藥": "靈謂神靈也。",
    "藤羅所胃": "藤但登反胃古泫反切韻稱卦也藤性緣物自織或羅也。",
    "欲度溝洫": "溝古侯反洫許域反苞氏注論語曰方里爲井井閒有溝溝深四尺十里爲城城閒有洫洫廣深八尺之也。",
    "令諸世事悉得宣敘": "小雅曰宣示也說文曰敘次第也言顯示得其次第也。",
    "盜塔寺物": "塔具云窣堵波謂置佛舍利處也寺名依梵本中呼爲鞞訶羅此云遊謂衆生共遊止之所也三蒼曰寺舘舍也舘舍與遊義稱相近耳又風俗通曰寺司也匡之有法度者也今諸侯所止皆曰寺也釋名曰寺嗣也治事者相継嗣於內也今若以義立名則佛弟子助佛楊化住持正法同後二說若直據梵本敵對而翻則如初釋也。",
    "夜久眠𥧌": "𥧌弥利反毛詩傳曰𥧌𥨊也玉篇曰𥨊謂偃臥熟也。",
    "勸喻": "倉頡篇曰喻諫。",
    "遽發是念": "遽渠慮反玉篇曰遽急也。",
    "被大精進甲": "被皮義反。",
    "悉苦無味": "味猶樂也言皆是苦無可樂戀。",
    "捶": "之藥反說文曰捶杖擊也案捶守說文從手玉篇從木聲類從竹耳。",
    "其心泰然": "珠藂曰泰通也凢離憂塞者心則通暢耳。",
    "爲現不樂世閒欲樂": "上樂字五教反下樂字郎各反。",
    "嬰妄想": "漢書集注曰嬰繞也加也言爲妄想之所纏繞也。",
    "得此解脫其已久如": "久謂久近如何故維摩觀衆生品云舍利弗問天曰天止此室其已久如荅曰如耆年解脫舍利弗言止此久邪天曰耆年解脫亦何如久今准此文如卽是久近如何之問辞也。",
    "嬪御有十億": "嬪婢人反賈注國語曰妄御曰嬪毛詩傳曰嬪婦也鄭注禮云嬪謂婦人有法度者之稱也周禮有九嬪教九御蔡雍曰天子九衣服加於身飲食入於口妃妾接以𮄊皆曰御御之所親愛則曰幸之也。",
    "我時尋覺": "杜注左傳曰尋續也。",
    "金剛䐡佛": "䐡字從肉。",
    "不藉耕耘而生稻梁": "耘于君反梁呂羊反毛詩傳曰耘除草也說文曰梁米名也耘字經本作芸者乃是芸薹菜字非此所用梁字或亦從禾也。",
    "良臣猛將": "將卽亮反諡法曰小心敬事曰良順理習善曰良今謂正耘存曰良絕謀而後勇曰猛將也。",
    "中夭": "中張仲反於矯反孔安注書曰小𬽐曰夭也。",
    "陵蔑他人": "蔑莫結反蒼頡篇曰陵侵也玉篇曰陵𢢔也鄭牋詩曰蔑輕也陵字說文單作麦又有從心作者俗通用也。",
    "衆景奪曜": "說文曰景光也曜字又從光也。",
    "大臣輔佐": "佐臧箇反鄭注禮曰輔助也佐副也言臣之於君有副助爕理之用。",
    "無高倨心": "倨居御反杜注左傳曰倨𢢔鄭注禮曰倨不敬也。",
    "受種種如來命": "鄭箋詩曰命教令也。",
    "高七多羅樹": "多羅樹似此方椶櫚樹然西域者其高例十文餘故經中㝡爲定量。",
    "波頭摩花": "或曰鉢蹋忙此翻爲赤蓮花。",
    "覺悟": "覺古皂反字又作𥧝。",
    "蓮花覆合": "覆撫目反還也復也。",
    "罷遊觀時": "罷蒱解反玉篇曰罷止也休也。",
    "杵破": "杵昌與反打也字冝從手其掊杵字從木也。",
    "苗稼不登": "馬融注論語曰樹五穀曰稼也小雅曰登昇也謂穀𠬧則可昇楊耳。",
    "枯槁": "槁苦老反說文曰槁木枯也鄭玄注周禮曰槁木乾也槁正冝作槀其𣝩音苦到反杜注左傳槁乃勞義非經所用也。",
    "衣裳弊𢙣": "弊毗例反說文曰衣敗爲弊玉篇曰蔽與敝同杜注左傳曰敝衰壞也。",
    "𭽫裂": "上七倫反下力哲反。",
    "牀搨": "搨他盍反。",
    "仁慈孝友": "釋名曰仁忍也好生惡煞善𢙣含忍也邇雅曰善事父母爲孝善事兄弟爲友也。",
    "瞻奉撫對": "撫芳武反瞻視也奉承也漢書集注曰撫慰也恤也對謂抵對也。",
    "媱佚": "佚夷曰反倉頡篇曰佚愓也樂也愓音蕩。",
    "枯涸": "涸何各反廣𤴓曰涸盡也。",
    "油雲柀八方": "孟子曰天油然與雲沛然下雨則苗浡然而長也毛詩音義曰油雲春雲也言能潤澤万物也。",
    "大王臨庶品": "鄭玄注周禮曰臨謂尊適卑也賈注國語曰臨治也治謂治理也庶衆也品類也。",
    "暴虐": "暴蒲報反玉篇曰暴陵犯也虐灾也。",
    "刑獄皆止措": "措倉固反鄭玄注考工記白措猶頓也置也置謂廢之也。",
    "殘害": "顏注漢書曰殘謂多所煞戮也倉頡篇曰殘傷也忉也。",
    "犬豚": "豚徒䰟反方言曰豚豕子也。",
    "僉然備": "命七廉反邇雅曰僉昔也小雅曰僉同也俻具也。",
    "入池自撫鞠": "鞠居六反王逸注楚辤曰撫持也鞠謂𢲻之也𢲻音麁括反鞠字正冝從手。",
    "毗舍闍": "此云噉人精氣鬼也。",
    "中霄": "中張仲反霄相遙反霄夜。",
    "宿植": "植承力反倉頡篇曰植種也。",
    "囹圄": "囹歷丁反圄魚舉反鄭注禮曰囹圄所以禁守繫者若今之刑獄也說文曰囹圄謂之獄名也。",
    "榜笞": "榜蒲庚反笞勑之反字書曰榜捶也說文曰笞擊也榜字冝從手。",
    "𩪯割": "𩪯蒲忍𭷀忍二反大戴禮曰人生暮而𩪯生然後行也說文曰𩪯膝骨也尚書太傅曰决開梁踰城郭而略盜者其刑𩪯𮨇野王曰謂断足之刑卽呂刑之䠊周禮之刖類也字從骨經本月作作者俗也。",
    "寬宥": "宥云救反杜注左傳曰宥𢼜也。",
    "盜入宮闈": "闈于歸反尓雅曰宮中門謂之闈其小者曰閨小閨曰閤也。",
    "王之寶祚": "祚字故反寶謂大寶書曰大寶曰位玉篇曰祚位也。",
    "赫然大怒": "鄭牋詩曰赫然怒皂也毛詩傳曰赫赤也謂人大怒則面色赤也。",
    "毀形降服": "降古巷反邇雅曰降下也謂下其好服又可著下𢙣衣服故也。",
    "拘留孫": "具云羯羅迦寸地此云所應断已断或障已断也。",
    "薩遮尼𠃵": "薩遮此云有也尼𠃵者云尼𠃵連陁言尼者不也𠃵連陁繫也謂此類外道躶形自餓以爲少欲不爲衣食所繫故也。",
    "御群生": "孔安注書曰御治也謂治理之也鄭注禮云御勸也謂勸化之也。",
    "園林名嵐毗尼": "嵐盧含反或曰流弥尼此云樂勝圓光是昔天女之名因來此處遂以其處名耳。",
    "被求一切智堅誓甲": "被皮義反著也。",
    "傳來": "傳除緣反字從叀不從甫。",
    "果從兜率": "玉篇曰果遂也定也。",
    "坈坎塠阜": "坎口攬反塠都迴反阜扶九反易曰坎陷也王逸注楚辞曰塠高土也邇雅曰高平曰陸大陸曰阜埠字又作堆耳。",
    "瓦礫荆𣗥株杌": "礫零擊反說文曰小石曰礫也荆𣗥草穢通語也說文曰株樹根也杌謂𠛴去枝柯者也。",
    "畢洛叉樹": "或曰畢利又此云高顯謂佛於降誕則爲高勝名顯人天故曰高顯也有戎有處云佛於阿或迦樹下生者也。",
    "諸佛䐡中": "䐡字從肉。",
    "釋女瞿波": "瞿波或曰瞿夷此翻爲守護地也。",
    "愛念情至": "至猶極也。",
    "爲其安立": "爲于僞反。",
    "十方無閒": "顏注漢書曰閒空也謂无空隟之處也又音古閑反文紀傳注曰容也謂更无有容受處也。",
    "足跌隆起": "小雅曰隆高也。",
    "身上分": "分苻閣反。",
    "頰": "兼恊反。",
    "鮮白": "鮮相延反玉篇曰鮮明也。",
    "睫": "煎葉反又作䀹。",
    "身上靡": "靡亡彼反漢書拾遺曰靡傾也傾謂偃臥也。",
    "翊從": "翊以力反尚書大傳曰翊輔也毛詩曰翊敬也字又作翼翼与翊義古別今作翼。",
    "洪纖得所": "纖相塩反蔡雍注班固典引曰洪大纖細也。",
    "修短合度": "修長也鄭玄注周禮曰度謂尺丈之數也言其長短合折中之節度。",
    "先太子行": "先謂於先行也。",
    "諷詠": "鄭注禮曰背誦曰諷也。",
    "殞滅": "殞爲愍反聲類曰殞沒也。",
    "非其匹偶": "偶吾苟反毛詩傳曰匹配也杜注左傳曰匹敵也玉篇曰偶謂不羈隻也賈注國語匹偶對也玉篇曰耦對之耦從耒偶尓之偶從立人也。",
    "暫時假𥧌": "寐蜜二反毛詩傳曰𥧌𥨊也毛詩曰假𥧌永勤箋曰不脫衣而眠謂之假𥧌玉篇曰假𥧌衣冠坐而眠熟也。",
    "爲誰守護": "護謂三護亦曰三監女人志弱故籍三護幼小父母護適人夫聲護老邁兒子護今此通問故言誰也監護之大經書懸合耳。",
    "開剖": "剖潘補反玉篇曰剖破也倉頡曰剖折也。",
    "巧断": "断都乱反。",
    "冠以妙藏": "冠古乱反。",
    "被以火燄": "被皮義反。",
    "無譏醜": "鄭注禮曰譏呵察也毛詩傳曰醜𢙣也言可呵毀猥𢙣之事。",
    "天繒纊": "繒疾綾反纊苦謗反說文曰繒帛也纊綿也小雅曰絮之細者曰纊也。",
    "芬馨": "馨顯形反郭注邇雅曰芬謂香氣調和也說文曰馨謂香之遠聞也。",
    "尊宿": "宿謂舊也。",
    "下車步進": "王逸注楚辤步徐行也進向前也。",
    "立佛支提": "支提者具云制底耶謂於佛闍維處置墳及安佛所說經臺閣之名也此翻爲積集謂是人天積集無量福善之所也又或翻爲生淨信處。",
    "竟不可得": "鄭箋詩曰竟終也。",
    "願得俻瞻侍": "說文曰俻具也𮨇野王曰俻謂豫早爲之也孔安注書瞻視也謂看視。",
    "毛孔量": "量力仗反謂分位也。",
    "禦扞": "禦魚舉反杆何幹反鄭注邇雅曰禦謂禁制之也杜注左傳曰禦正也杆修也蔽謂遮寒之也杆字聲類作捍也。",
    "廓徹心城": "方言曰張小使大謂之廓也邇雅曰廓大也通俗文曰廓寬也說文曰縱通也此中經意謂以理融事小遍法界故曰張小使大。",
    "嚴肅": "毛詩傳曰嚴威也肅綃也縮謂高浪者令縮退也言其有威德肅物也。",
    "逐諸𢙣法": "玉篇曰逐駈也。",
    "瑩徹心城": "倉頡篇曰瑩治也賈注國語曰徹明也說文曰徹通也今謂治理心城使其通達无所擁塞也。",
    "部分心城": "分苻問反謂有部類有分齊者也。",
    "羅𠛴鬼王": "羅𠛴具云羅𠛴娑此翻爲可畏也言王者謂卽毗沙門也。",
    "悉達太子": "悉達者具云薩縛頞他悉地地字應平聲呼言薩縛者此云一切也頞他事也悉地成也言其於一切所應作事皆已成就也。",
    "雖不踰本": "字林曰踰越也。",
    "樓至如來": "樓至具云嚕支此翻爲愛樂也。",
    "造僧伽藍": "具云僧伽羅摩言僧伽者此云衆也羅摩院也。",
    "營辦什物": "顏注漢書曰什物謂爲生之具也三蒼曰什聚也雜也吳楚之閒資生雜具通謂之什物有數十事物爲什物者此盖少知之說也。",
    "拖": "䭾之輕聲。",
    "婆": "婆之上聲。",
    "沙": "史我反。",
    "縛": "房我反。",
    "哆": "哆之上聲。",
    "也": "夷我反。",
    "娑": "並二聲呼。",
    "麼": "莫我反。",
    "衆峯齊峙": "峙持止反廣雅曰峙止也齊齊然止立也。",
    "字": "冝從止者𮘸也。",
    "伽": "伽之上聲。",
    "他": "他之上聲。",
    "奢": "尸何反借音也。",
    "叉": "楚我反。",
    "娑哆": "娑乘紇反哆當我反。",
    "車": "昌野反。",
    "娑麼": "娑乘我反。",
    "訶婆": "並上聲呼。",
    "縒": "倉我反。",
    "吒": "陟加反。",
    "拏": "搦可反。",
    "娑頗": "娑乘紇反。",
    "也娑": "也夷我反娑字上聲呼之。",
    "侘": "耻加反。",
    "咸綜无遺": "綜子貢反三蒼曰綜理經經謂整理經緯之都本也。",
    "薀其深解": "薀於殞反杜注左傳曰蘊蓄也方言曰蘊積也馬融注論語曰薀藏也。",
    "呪詛": "詛側預反鄭玄注周禮曰融謂柷使其敗露也。",
    "痊愈": "痊七緣反愈逾矩反郭象注莊子曰痊謂病除也玉篇曰病差曰愈字又作瘉也。",
    "別知": "別彼別反。",
    "珠貝": "案西域以貝爲錢故列在寶類。",
    "鷄薩羅": "師子身毛施文呼爲鷄薩羅西域有寶旋文恰如師子毛旋形故從其爲名耳也。",
    "城名婆怛那": "具云難陁婆怛𨚗言難陁者此云喜也婆怛𨚗者增益也其城在摩竭國內如經本中說。",
    "涸無量愛欲海": "廣雅曰涸盡也謂令其竭盡也。",
    "杜絕諸𢙣道": "賈注國語曰杜塞也說文曰杜塞閇也說文字乃作𢾖也。",
    "如濟客": "毛詩傳曰濟渡也案客謂寄居之稱故採樵寄山齊渡中水飲士寄醉賈人寄屋皆謂之客也。",
    "重任": "重直勇反任如禁反。",
    "傭作": "傭與恭反作則各反玉篇曰傭謂伇力也受直也穀梁傳曰作爲也。",
    "仾下": "仾丁奚反。",
    "旃荼羅": "此云暴𢙣人也。",
    "犗牛": "犗加邁反切韻稱犗犍牛也。",
    "舟艥": "艥秦業資業二反通俗文曰曜謂之擑釋名曰擑值也撥水使舟倢疾也又案𢴠字不者戈音乃資葉反訓然義无別也。",
    "良工": "良善也工枝也。",
    "捃拾": "捃居韻居運二反漢書集注曰捃𠬧也。",
    "𭁺王𭁺": "上𭁺字古乱反下𭁺字古端反。",
    "損耗": "耗呼告反滅也。",
    "善知識之所致耳": "顏注漢書曰致謂引而至之也。",
    "此善漁人": "漁語居語據二反工能於事曰善也說文曰漁捕魚也大篆字又作𩼪聲類作䱷䰻二體。",
    "過尒燄海": "尓燄者此云所知謂智所知境非預識境由其轉若南聲爲尓塩故非轉毗若南聲也。",
    "哽噎": "哽加杏反說文曰哽謂食內膏骨在喉內也悲憂咽塞者似其膏骨在喉故借喻言之耳。",
    "自盈其手": "韓康注易云盈滿也。",
    "曩於福城": "曩𨚗朗反邇雅曰曩曏也珠藂曰曏謂往時也曏音虛鞅反。",
    "擐大悲甲": "擐胡串反杜注左傳曰擐貫也賈注國語曰擐衣甲也衣音意。",
    "断貪鞅": "鞅於仰鞅謂切牛頸下繩中以此繩不能重載凢夫田其貪之能断生死之鞅繩也。",
    "撒睡盖": "撤除列褚列二反字書曰撤除也去也。",
    "四流漂汩者": "汩榮笔反珠藂云汩流㒵也又音古沒反尚書大傳曰汩亂也漢書集注曰汩流𢙣㒵今取流急也。",
    "飲以甘露": "飲於禁反飲𩚅水也。",
    "住邪濟者": "毛詩傳曰濟渡也謂行異道如度者求於異淬故此借喻名耳。",
    "曉誨": "說文曰曉說也音稅。",
    "獷㑦": "獷古猛反㑦零計反。",
    "坑穽": "穽疾政反鄭玄注周禮曰穽謂穿地爲塹所以捕狩其超踰者則陷焉案籀文作阱蔽古文作棐者也。",
    "苦的": "的謂准的鹿䐡也。",
    "篋": "牽恊反鄭注禮記曰成私物函曰噬也。",
    "毗笈摩藥": "毗笈摩者此云普去謂能普去一切疾病也。",
    "周給": "周帀供給故云周給。",
    "利矛": "矛莫胡反。",
    "兵仗": "仗除亮反風俗通曰仗者刀㦸之揔名也。",
    "鉗鋷": "鋷尼輙反玉篇曰鋷謂拔去𥇒髮也經本有作鑷者此乃車軸端鐵非經所用。",
    "阿伽陁藥": "此云無病藥也謂有藥處必无有病也。",
    "婆樓那風": "此云迅猛風也其風堅密如持世界風輪也。",
    "毒不能中": "中陟仲反中猶者也。",
    "大應伽藥": "應伽此云身身有四名一曰迦耶二曰沒理羅三曰弟河四日應加亦云分謂支分也。",
    "藥樹名珊陁𨚗": "珊陁𨚗者此云和合或云續断謂此藥能令已断傷者再續和合也。",
    "初无所損": "言從初已來不增損也。",
    "藥名阿藍婆": "此云汁藥其藥出香山及雪山中天生在石臼內或云得喜謂得此藥者皆生歡喜之者。",
    "婆師迦花": "具云婆利史迦言婆利史者此云兩也迦謂迦羅此云時也西域呼夏爲兩其花生於夏時故名也。",
    "瞻蔔迦花": "此云黃色花有香氣而形似梔子花。",
    "蘇摩那花": "此云悅意花其花形色俱媚令見者心恱故名之也。",
    "海島": "島當老反孔安注書口曲謂之島說文曰海中往往有山可止曰島也。",
    "捓子": "捓余遮反。",
    "藥汁名訶宅迦": "此云金色水甚於九轉還丹之力者也。",
    "燈炷": "炷之遇之𢈔二反。",
    "筋": "居欣反字宜從肉經本有從角者謬也。",
    "迦陵頻伽鳥": "此云美音鳥或曰妙聲鳥此鳥本出雪山在㲉中卽能鳴其音和雅聽者无猒也。",
    "飛則勁捷": "勁甄盛反捷錢葉反說文曰勁強王逸注楚辤曰捷疾也勁字從力捷字本從人今俗也。",
    "摩訶那伽": "此云龍亦曰象今此刀士力如龍象故其名也。",
    "射師": "上食夜反。",
    "摩竭魚": "此云大體也謂卽此方巨鰲魚其兩眼如日張口如闇谷吞舟凡出海流如潮若欲欱水啟高下如山大者可長二百里餘也。",
    "安繕𨚗藥": "繕時戰反其𦯧色以青黛可以合和眼藥然今所明自據別法也。",
    "延齡藥": "齡歷丁反邇雅曰近長也廣雅曰齡年也禮記曰古之謂年爲齡也。",
    "揳": "先結反案說文作捐古作相形者也。",
    "㵕漏": "㵕所禁反水潛汝也字冝作㕘經本有從喿者音早非經所用也。",
    "醉傲": "傲五告杜注左傳曰傲不敬也廣雅曰傲𢢔也案諸子書傲字皆從立人今有本從竪心者𮘸也。",
    "陁𨚗婆王": "阿修羅之別名未詳其義。",
    "兜沙羅色": "具云兜沙兜羅色言兜沙者此云霜也兜羅求也或有經本云兜羅沙者准知也。",
    "獄卒": "卒則沒反。",
    "長者子瞿波羅": "案西方訓字瞿有九義此中但取地白義波羅此云守護也謂守護心地或守護白法也。",
    "摩羅提國": "具云拘羅耶提數此云𨲾陁或曰摩羅耶者山名也提數中也言此國中央有摩羅耶山故因名也。",
    "拘吒聚落": "具云拘吒迦此云小含或曰多家亦曰多多樓觀以此聚落中樓閣多也。",
    "優曇花": "優曇此云希有也此花多時乃一開也。",
    "儼然坐": "儼魚儉反。",
    "加被": "被皮義反杜注左傳曰加益也孔安注書曰被及也謂以益相及也又珠藂曰從加恩謂之被也。",
    "誓衆宣威": "誓謂戒誓主與軍旅爲要約也故鄭玄注周禮云戒誓要之以刑也毛詩傳曰宣示也。",
    "聽訟断獄": "聽他甯反断都乱反孔安注書曰聽謂察是非也周禮曰獄訟者聽而断之鄭玄注云爭罪曰獄爭財曰訟玉篇曰断謂裁制分决之也。",
    "輔弼": "弼皮筆反尚書大傳曰天子必有四隣前儀復丞左輔右弼直立而敢料廣心而從欲輔善而相承謂之輔廉潔而切謂之弼戴禮曰弼者拂拂天子之過常立於左潔廉而忉直匡過而諫邪謂之弼也。",
    "阿迦尼吒天": "具云阿迦尼瑟吒天此云色究竟天也廣釋如上第二十二卷中。",
    "霑洽": "廣雅曰霑漬也玉篇曰洽濡也濡潤也霑字或通作沾也。",
    "炎熱": "炎丁嚴反尓雅曰炎熏也郭璞云早氣熏灼人也。"
}
