{
    "header": {"title": "續一切經音義", "author": "宋 希麟集", "number": "T54n2129"},
    "大朴": "上徒葢反蒼頡篇云大巨也易曰大哉乾元萬物資始下普剝反正作樸字說文云木素也聲類云凡物未雕刻曰樸王弼云樸真也猶氣像未分也莊子云純朴不殘孰爲犧罇又日夫殘樸以爲器工匠之罪也毀道德爲仁義聖人之過也",
    "萬籟": "上無怨反合作万字筭經云十千曰万今作萬本蟲名州名人姓也相承借爲万字下落大反樂器名也說文云大籟小簫郭璞注尒雅云大簫二十三管長尺四寸小者十六管長尺二寸一名籟也字從竹賴聲也序文從草作藾蒿名也非此用",
    "紛綸": "上芳文反字書云衆也又亂也紛紜也下力迍反說文云糾青絲也二字並從糸分侖皆聲也",
    "旭日": "上凶玉反切韻云日初出也說文云日旦出也考聲云旭明也從日九九亦聲也下仁一反說文曰實也太陽精不虧也從口一聲也口音雨非反像口匝之形也",
    "罽賓": "上居又反西域國名或云个溼蜜羅亦云迦葉彌羅皆梵言訛轉也正云羯溼弭羅此翻爲阿誰入謂此國未建都時有大龍池人莫敢近也有一羅漢見地形勢宜人居止從龍乞容一膝地時龍許之羅漢變身漸大膝滿龍池龍以言信捨之而去羅漢復以神力乾竭其水遂建城郭衆人咸言我等不因聖師阿誰敢入因有此語乃立國名",
    "空𧦬": "上苦紅反切韻大也又通也說文云從冗工聲下符仲反字書云理也考聲云明也亦皮變反切韻云訓也今案空𧦬二字僧名也",
    "梗槩": "上古杏反尒雅云梗直也廣雅云略也鄭注禮記云平斛也薜註東都賦云梗槩不纖密也釋文大略也二字並從木更旣聲",
    "薄伽梵": "或云薄伽伴古云婆伽婆正云婆誐𮢥舊翻爲世尊謂世出世間咸尊重故大智度論云如來尊號有無量名略而言之有其六種也佛地論頌云自在熾盛與端嚴名稱吉祥及尊貴如是六種義差別應知總名薄伽梵爲含多義故譯主但存梵語也",
    "迦蘭多迦": "上下皆薑佉反舊云迦蘭陀或云迦闌鐸迦皆梵音訛轉也正云羯嬾馱迦此譯云好聲鳥謂王舍城側有大竹林此鳥多棲此大林中因以爲名卽說此理趣般若處也",
    "阿僧企耶": "企音輕以反耶音以遮反正梵語也舊云阿僧祇此譯爲無央數謂數之盡名也古華嚴音義云一百二十數中無央數當一百二十也又依小乘數慈恩法師引俱舍說本數六十傳失其八無央數當第五十二數也",
    "依怙": "胡古反爾雅曰怙恃也詩云無母何怙也",
    "羈鞅": "上居宜反下於兩反王逸注楚辭云以革絡馬頭也釋名云覊檢也所以檢持縻絆",
    "明星": "上說文從囧作朙蔡邕從目作明古文從日作明三體皆通經典多用古文明字囧音鬼永反下星字古文作曐尒雅曰明星謂之啟明郭璞注云太白星也晨見東方爲啟明昏見西方爲太白",
    "洄澓": "上戶恢反爾雅曰逆流而上曰泝洄下符福反三蒼云澓深也謂河海中洄旋之處也說文竝從水回復皆聲也",
    "迦嚕羅": "中離古反或云迦婁羅亦云揭路茶正云𭒯嚕䋈此云妙翅亦云金翅亦名龍冤案起世經云金翅鳥與龍各具四生卵生金翅鳥只食卵生龍以力小故乃至化生金翅鳥具食四生龍以威力大故餘二生准知",
    "僂者": "上力主及杜注左傳云僂傴也背曲也廣雅云身曲也說文云尫也從人縷省聲也",
    "裸者": "上華瓦反避俗諱作此音本音郎果反顧野王云裸者脫衣露袒也說文從衣果作裸字書從身作躶玉篇從人作倮三體並通經文從示作祼音灌書誤也",
    "聾瘂": "上祿東反左傳云耳不聽五音之和謂之聾杜注云聾暗也蒼頡篇云耳不聞也說文云從耳龍聲下鵶賈反考聲云口不能言也古今正字瘂瘖也從疒亞聲疒女厄反律文從口作啞音厄周易云笑言啞啞也非聾瘂字",
    "魍魎": "上音罔下音兩賈注國語云水恠𰋼鬼也淮南子云魍魎狀如三歲小兒赤黑色赤目赤爪長耳美髮有本作蝄蜽亦通用",
    "砥掌": "上脂履反杜注左傳云砥平也蒼頡篇云磨礪石也經文從手作抵擊也非平如砥掌義",
    "隘陿": "上鵶介反廣雅迫也王逸注楚辭云隘險阸也或作阸下咸甲反顧野王云迫阸也說文從阜從匧聲也經文從犬作狹謂狹習也非此用",
    "廛里": "上直連反考聲云市空地也又居也經作㙻𫮈皆俗字下良史反周禮云五家爲隣五隣爲里也風俗通云里止也謂五十家共止爲里也",
    "鸚鵡": "上烏莖反下文作䳇音武說文云能言鳥也前已具釋",
    "𤛆牛": "上音茅西南夷牛名亦名長髦牛也下語求反世本云黃帝臣𧣙得仙服牛史記云紂倒曳九牛",
    "犎牛": "上音封山海經云南方野牛集注尒雅云今交趾所獻丞相牛是也郭璞注釋畜云領上犦肤起高二尺許如駝肉鞍今俗謂之峯牛是也犦音雹胅田頡反",
    "熊羆": "上羽弓反毛詩云惟熊惟羆說文云獸也似豕山居冬蟄𦧇足掌其掌蹯音煩下音悲尒雅云羆如熊黃白文郭璞曰似熊長頭高脚猛㺖多力熊拔樹木也",
    "虎豹": "上呼古反說文云山獸君也字從人虍音呼虎足似人足也律文作乕非本字下博教反廣志云豹死守山說文云獸名作豹律文從犬作豹非也",
    "豺狼": "上士諧反爾雅曰豺狗足郭注云脚似狗切韻狼屬也禮記云豺祭獸也下音郎爾雅曰牝貛牝狼說文似犬銳頭而白頰從犬良聲",
    "箜篌": "上苦紅反下胡鉤反字菀云箜篌本胡樂也漢書云靈帝好胡服作胡箜篌也世本云師延所作靡靡之音也出於[濮-(仁-二)+彳]上取空國之侯名也",
    "蚖蛇": "上五官愚轅二反下社遮反抱朴子曰虵類甚多唯蚖虵中人最急以刀割其所螫處肉弃於地肉自沸似火炙須臾焦盡人方得活也二字並從虫元它聲",
    "蝮蠍": "上芳伏反尒雅曰蝮虺博三寸首大如擘郭璞注云如人擘指史記云蝮螫手則斷也下軒謁反四方通語也說文云毒蟲也尾上拳玉篇云蠆也字從虫歇形聲字也經文作蝎音褐蝎蛣崛也乖蝮蠍義也",
    "魚鼈": "上語居反說文水蟲也尒雅云魚尾謂之丙郭注云似篆書丙字俗作魚字下鞭滅反說文云水介蟲也從黽敝聲也經文從魚作鱉俗字也黽音猛",
    "黿鼉": "上音元說文云鼈也下達河反說文云水蟲也形似𧋍蜴長五六尺從龜單聲龜音猛單音那形聲字也",
    "鳳凰": "上馮貢反下音皇尒雅曰鷃鳳其雌凰郭璞注云瑞應鳥也許慎說文云神鳥也出東方君子之國翱翔四海之外龍文龜背鷰頷雞喙五𰐩備舉非梧桐不棲非竹實不食朝鳴曰發明晝鳴上朔夕鳴曰滿昌昏鳴曰固常夜鳴曰保長見則天下大安",
    "蘇莫遮冐": "下毛報反說文云小兒及蠻夷頭衣從目曰聲也曰音同上文字集略從巾作帽亦通案蘇莫遮胡語也本云颯麼遮此云戲也出龜茲國至今由有此曲卽大面撥頭之類是也",
    "船筏": "上食川反方言云關東曰船關西曰舟說文云從舟沿省聲也沿與專反鉛錫之銘沿流之沿皆同經文作船或作舡皆非本字下又作橃亦作𦪑同扶月反方言云𥱼也編竹木浮於河運物也𥱼音蒲住反",
    "𤄗河": "上蒲冒反考聲云猝雨也說文疾雨水也又𤄗霣也字從水從曰從出從廾音拱從丰音滔也",
    "毫𣯛": "上胡高反下力馳反九章筭經云凡度之始初於忽十忽爲絲十絲爲毫十毫爲𣯛說文云毫𣯛二字並從毛毫字從豪省𣯛字從𣺶省經文作豪󱶩二字誤也",
    "輕懱": "下眠鼈反說文云輕㑥也從心變體作忄從薎音同上經文從竹作篾竹皮也非經義有本從手作㩢樂名也今不取",
    "迦遮隣底迦": "上下二字皆薑佉反底音丁以反西國瑞鳥名也身有葩毛非常輕耎績以爲衣轉輪聖王方御此服卽今彼國見有此鳥流類毛麤不如輪王時所得者也",
    "不瞚": "下水閏反說文云瞚謂目開闔數搖動也從目寅亦聲也俗作瞬古文作眒今經文從目旬作眴亦通魯史春秋云萬世猶如一眴也",
    "嗢鉢羅": "上溫骨反舊云漚鉢羅或云優鉢羅亦云烏鉢羅皆梵語輕重也此云青蓮花其花青色葉細陿長香氣遠聞人間罕有唯大無熱惱池中有此蓮花也",
    "鉢特磨": "梵語不正也或云波頭摩或云鉢弩摩正云鉢納摩此譯云紅蓮花謂花之上者也",
    "拘牟頭": "或云拘勿頭或云拘摩郍皆梵語訛轉爾正云拘某陀此譯云赤色蓮花人間亦少多出彼池",
    "奔茶利": "古云芬陀利皆訛也正云奔去聲䋈奴雅反哩迦此云白色蓮花也人間無亦出彼池也",
    "曼茶羅": "上母官反梵語也或云曼拏攞或云滿拏羅亦云曼吒羅一也此云衆聖集會義翻也卽今壇是也",
    "蓊鬱": "上烏孔反玉篇云蓊欝謂草木茂盛",
    "菴愔": "上烏甘反下於淫反真言中字也",
    "呬䤈": "上馨以反下呼雞反",
    "㝹迷": "上奴溝反案字兔子",
    "𩑔叉": "上苦骨反案字白禿",
    "伱㕧": "下音許兮反真言中字也",
    "沃屹": "上烏酷反下魚訖反自菴揞至沃屹並直言用影梵文不求字義",
    "賑恤": "上真刃反爾雅曰賑富也下思律反鄭注周禮云賑恤憂貧也顧野王云賑救也恤慜也說文云恤從心血聲也",
    "心胏": "白虎通云心禮也南方火之精赤銳而有瓣如未敷蓮花王𠦑和脈經云心與小膓大膓合爲府其藏神其候口反心有病則失音不能言下芳廢反白虎通云胏義也西方金之精色白王𠦑和脈經云胏與膀胱合爲府其神魄其喉鼻故胏有病則鼻不聞香臭說文云從肉𠂔聲也𠂔音肥味反經文從市作肺俗用非",
    "膓胃": "上除良反釋名云膓腹內暢氣之府也下或作𦝩正作𦞅白虎通云脾之府色黑說文云穀府也從肉作𦞅像形字",
    "肝膽": "上古安反木之精也白虎通云像木有葉王叔和云肝與膽爲府其候目故肝實熱則目赤暗也下答敢反白虎通云膽者肝之府脈經云膽病則神不守是也二字並從肉干詹聲也詹音占形聲字也",
    "脾腎": "上婢彌反白虎通云脾者信也中央土之精色黃王氏脈經云脾與胃合爲府其候舌故脾有熱則舌病脣不收下臣忍反白虎通云腎者智也北方水之精色黑其形偶脈經云腎與三焦合爲府其候耳故腎虛則耳聾說文從肉臤臤音啟絃反",
    "穿脇": "下許業反說文云肚兩旁脇也從肉劦聲也劦音叶從三力經文從三刀作刕非也",
    "啄噉": "上音卓廣雅云啄嚙也說文云鳥喰也從口豕聲也豕音丑綠反經文從彖作喙音吁穢反鳥口也非此義下唐濫反噉亦食也或作啖亦同",
    "鉆鋷": "上儉嚴反說文云鐵銸夾取物也從金占聲經文從苷作鉗乃小兒鐵枷也非夾取義下黏輙反說文鋷亦鉆也攝也從金取聲也取音同上經文從三耳作鑷車下鐵纂非本字",
    "磔裂": "上陟革反字書云磔開也又張也說文云殺而張𦢸也音匹各反謂割肉也周禮云磔牲祭以禳灾也郭璞注爾雅云今俗磔狗當大道中云止風也",
    "焚燎": "下聊弔反鄭注禮記云照也說文云放火也從火尞形聲字也",
    "相拶": "下贊辣反集訓云拶逼也考聲云排也說文云從手𡿪聲𡿪音才辣反辣音闌怛反",
    "偃仆": "上去蹇反廣雅云偃仰也從人匽聲下明北反或作踣同考聲云前倒也覆面也說文傾頓也又芳遇反",
    "斸斫": "上冢綠反考聲云斸掘也鑺斸也說文斸斫也從斤屬聲也經文作斸俗字下章若反刀斫也",
    "韁𬘍": "上音薑下音祕顧野王云制馭車馬勒也說文形聲字也𬘍字從絲從𨊥音衛會意字也有從口從亡非",
    "鞭撻": "上卑連反考聲云打馬杖也字書云馬策也下他達反字書云擊也尚書云撻以記之也禮記云成王有過周云則撻伯禽也從手達聲也律文從革作韃非體也",
    "髲下": "上音被謂髮垂也說文從髟皮聲髟音必遙反",
    "𠒎鴈": "上輔于爾雅曰舒𠒎鶩鶩音木郭璞注云鴨也考聲云野鴨之小者也字從鳥几聲几音殊几者鳥之短羽飛几几然形聲字也下顏諫反毛詩傳云大曰鴻小曰鴈隨陽鳥也月令云季秋之月鴻鴈來賓說文鴈鵝尸也亦名鴚音歌",
    "蜴蜥": "上音亦下西歷反爾雅云蜥蜴蝘蜓卽守宮也說文云在壁曰蝘蜒在草曰蜥蜴方言云秦晉謂之守宮南楚謂之虵醫或謂之蠑螈說文云蜴字或作易蜥字從虫析聲經文從斤作蚚乃音祈非蜴蜥字",
    "蟣蝨": "上居扆反蝨𣫢也下所櫛反考聲齧人小蟲也淮南子云湯沐具而蟣蝨相弔也從䖵卂聲也䖵音昆卂音色臻反經文作虱非",
    "𧎮等": "臧老反說文嚙人跳蟲子也從䖵從叉亦聲也經文作蚤俗字叉音爪",
    "螟蛉": "上覓瓶反下歷丁反爾雅曰螟蛉桑蟲毛詩蟲魚疏云桑小青蟲也似步屈今蜾𧕳所負爲子者是也蜾𧕳蜂也一名蠮螉許慎云細腰蜂也郭璞云俗謂螟蛉爲桑蟃蜾音果𧕳音魯果反蠮音煙繼反螉音烏公反蟃音萬",
    "蟊螣": "上莫侯反下騰德反皆蝗蟲類也毛詩傳曰食根蟊食葉螣或作𧈩爾雅作𧎢說文曰官吏乞貣則生𧈩二字皆形聲字也",
    "蛗螽": "上音負下音終說文作𧑸音同上許慎曰負螽蝗蟲類也在草中不食苗毛詩曰趯趯蛗螽爾雅作蛗螽皆形聲字趯音他曆反",
    "蛺蝶": "上兼葉反下恬頰反說文蟲名也一名胡蝶莊周所夢者是也二字竝從虫虫音許鬼反夾枼聲夾音古洽反枼音葉",
    "蜣蜋": "上佉良反下音良爾雅云蛣蜣蜣蜋也郭璞注云黑甲蟲也噉糞土者蛣音詰",
    "蠅蝱": "上孕蒸反下麥彭反鄭箋毛詩云蠅之爲蟲汗白爲黑方言云秦晉陳楚之間謂之蠅東齊謂之羊聲訛轉也郭璞曰江東呼羊似蠅也",
    "𩧐駝": "上又作馲同音湯落反亦音郎各反下亦作駞同音唐何反考聲云胡地畜也山海經云背有肉鞍力負千斤日行三百里能知水泉所在也說文二字皆形聲也經文作駱音洛爾雅云白馬黑鬣曰駱非馲駝字也",
    "尫羸": "上烏光反考聲云破也杜註左傳云瘠病也說文云曲脛也從犬象漏曲一脚王聲也經文從兀作尫誤也下力追反賈住國語云羸病也杜預注左傳云弱也說文羸瘦也從羊從𣎆音力戈反",
    "㓟剝": "上音皮下邦角反字書剝落也傷害也上㓟字相承音皮檢字書無此字未達案合作㱟音疋靡反傷也打折也",
    "皴劈": "上匕遵反埤蒼云𭽫皵也皵音匕略反考聲云凍裂也說文從皮夋形聲字也夋音匕旬反下劈音匹亦反廣雅云劈裂也說文劈破也從刀辟聲也古文作𤖼從片從𠂢分散形也",
    "乞匃": "下垓艾反顧野王云匃亦乞也考聲云求也古今正字云人亾財則匃也說文云從人亾會意字也古作勹几二形並音人",
    "勞倦": "下渠卷反疲也懈也尚書云猒倦也說文云從人卷聲或作勌亦通經文作倦無此字也",
    "弓弰": "下所交反埤蒼云弓兩端末也考聲云弰謂弓兩頭從弓肖聲",
    "孤惸": "上古胡反考聲云獨也說文無父曰孤從子從觚省聲下葵營反考聲云孤單也文字典說無兄弟曰惸說文作㷀從卂營省聲或從人作𠌻或省作焭皆通用字",
    "鰥寡": "上寡頑反禮記云老而無妻曰鰥尚書云有鰥在下謂舜年過而無室也下寡音關瓦反考聲云獨也謂婦人無夫也寡字下從分經文從灬音必遙反作𡪍書寫誤",
    "囹圄": "上歷丁反下魚舉反獄名周禮三王始有獄釋名云囹領也圄禦也謂領錄囚徒御禁之說文云囹獄也圄守也外形內聲字",
    "鈇鉞": "上甫于反又音斧禮記諸侯賜斧鉞然後得殺鄭玄注云得其器乃敢行其事說文鈇剉也從金夫聲下袁厥反崔豹古今注云諸侯得黃鉞者許斬持節將說文從金戉聲也戉字從𠄌音厥從戈經作戊非也音茂",
    "蠱道": "上音野鄭注周禮云野毒蟲也說文云腹中蟲能痛害人從蟲皿聲或云蠱毒蠱音古字",
    "護魔法": "護魔二字或云呼麼梵語也唐云火祭案瑜伽護魔經有四種爐謂半月形滿月形方與八角應四種法謂勾召降伏息灾敬愛等加持雖別皆以三白食及雜花果等於爐中焚燎用祭賢聖如此方燔柴之祭",
    "燖去": "上祥簷反考聲云燂煑也謂以湯沃毛令脫也說文云從火覃聲也經文作燖俗字也正作󱺆古文作𦠹今人罕用",
    "騣髦": "上子柬反蔡邕云駿馬上毛也古今典說云馬騣也從馬㚇聲也下音毛㚇音同上",
    "剜眼": "上椀莞反埤蒼云剜削也考聲云剜由刻也說文云從刀𢀸形聲也",
    "刵耳": "上而志反孔注尚書云刵截耳也廣雅亦云截耳也說文云斷耳也從刀耳聲也",
    "劓鼻": "冝器反孔注尚書云劓割也說文云截也從刀鼻聲也",
    "魁膾": "上苦瓌反孔注尚書云魁帥也廣雅主也鄭注禮記云首也史記云壯大也從斗鬼聲下瓌外反廣雅膾割也案魁膾者屠殺兇惡之帥也從肉會聲也",
    "罘網": "上縛謀反鄭注禮記云罘獸𮊁也韻英云罝也說文兔𮊁也從𠔿不聲𮊁音古罝音姐耶反下無倣反亦作网正作罔也",
    "矰繳": "上則登反鄭注周禮云結繳於矢謂之矰也考工記云矰矢弓所用也又云矢羽名也說文從矢曾聲也經文作繒音疾陵反誤書也下章苦反廣雅云繳緾也說文云生絲縷也從糸敫聲也敫音羊灼反作𦅾字亦通用",
    "薜茘多": "上鼙閉反下𥟦帝反梵語訛也正云畢隸多此云餓鬼也亦三途中鬼趣總名也",
    "乳哺": "下浦慕反許慎注淮南子云口中嚼食與之似鳥與兒食曰哺說文從口甫聲也今經文從食作餔米糊也又逋布二音非乳哺義也",
    "嚬嘁": "上毘寅反下子六反文字集略云嚬者嘁眉也顧野王云憂愁思慮不樂之皃也古文作顰亦作顰下或作㗤經文從足作蹙非也",
    "谿㵎": "上啟奚反爾雅曰水注川也說文云川瀆無所通者也從谷奚聲亦作溪字下閒晏反毛詩傳曰山夾水曰㵎說文云從水間聲也又作𡼏亦作𧯑皆通用也",
    "𪵬漲": "上芳梵反王逸注楚辭云𪵬淹也說文淨也從水凢聲下張亮反郭璞注江賦云漲大水也說文從水張聲也",
    "噏取": "上歆急反顧野王云噏氣息入也說文云內息也從口翕聲亦作吸字歆音許金反",
    "鐶釧": "上又作環同患關反鄭注禮記云旋也統也說文云壁肉好若一謂之環郭注爾雅云肉邊也好孔也謂邊孔適等也下川戀反東宮舊事云釧臂飾也古今正字從金川聲",
    "耳璫": "下都卽反考聲云耳飾也說文云穿耳施珠也從玉當聲也",
    "俳優": "上敗埋反博雅云俳亦優也說文云戲也從人非聲也下於尤反顧野王云優樂人所爲戲笑杜注左傳云調戲也蒼頡篇云優亦樂也說文云從人憂聲也",
    "尼殺曇分": "梵語數法之極也或云優波尼洒陁慧菀法師音義引瑜伽大論譯爲微細分如析一毛以爲百分又析彼一分爲百千萬分又於析分中如前析之乃至隣虛至不可析處名爲鄔波尼殺曇分也",
    "窣堵波": "上蘇骨反梵語也或云蘇偷婆或云塔婆皆梵言楚夏耳此譯云高勝方墳也卽安如來舍利㙛石䥫木等塔是也俗語或云浮圖也",
    "赧而": "上拏揀反方言云赧亦媿也說文云面慙赤也字從㞋聲也㞋音展經文從皮作𧹞誤書也",
    "瘡疣": "上惻莊反韻英云瘡痍也或作創古文作𭃅下有憂反蒼頡篇疣病也或作肬亦通古文或作𤴨也",
    "夢寐": "上說文作㝱從宀從爿夢周禮以日月星辰占六㝱之吉凶一曰正㝱二曰𰇪㝱三曰思㝱四曰悟㝱五曰憘㝱六曰懼㝱下彌臂反𥧌寑也說文從㝱未省聲也",
    "𭔏寤": "上音教正作覺蒼頡篇云寐起也下吾故反說文覺而有信也寤亦晤也經文二字從穴作窹窹非也說文從㝱晤省",
    "陷穽": "上咸鑒反考聲云陷穴也王逸注楚辭云陷沒也從阜臽聲亦單作臽字下情性反鄭注周禮云穿地爲深坑捕禽獸也說文從穴井聲或作阱亦作󱷄汬皆古字也",
    "游泳": "上酉幽反顧野王云游浮於水上而進也鄭注周禮云備沉溺也說文從水斿聲下榮命反毛詩云潛行水中爲泳郭注爾雅云水底行說文云從水詠省聲也",
    "鉤餌": "下仍吏反說文云粉餅也又食也案鉤餌卽以魚所食物施於鈎用取魚",
    "黑蜂": "下敷容反爾雅云土蜂木蜂郭注云今江東呼大蜂於地中作房者爲馬蜂啖其子者也爾雅正作蠭今俗作蜂或俗音蓬也",
    "旋嵐": "下臘南反梵語也卽劫灾起時大猛風也",
    "談謔": "上蹈南反顧野王云談言論也說文從言炎聲下香虐反爾雅曰謔浪笑敖戲謔也說文亦云戲也從言虐形聲也",
    "枯槁": "上苦姑反切韻云朽也考聲云木乾死也下苦皓反切韻云槁亦枯也說文云從木高聲",
    "眼睛": "下子盈反考聲云目珠子也說文云從目青聲經文有作精善也正也非眼睛義也",
    "廝下": "上息資反何休注公羊傳云廝賤人也廣雅命使者也說文云從广斯聲亦作㒋",
    "旃茶羅": "上諸延反梵語或云旃陀羅此云殺人謂屠殺者種類總名也亦云嚴熾惡業西域法其人若行自持標幟或搖鈴或杖破頭之竹若不然者王與之罪",
    "𬄏隥": "上體奚反賈注國語云梯階也說文解同從木第聲也下登鄧反博雅云隥履也依而上之也說文云從阜登聲也",
    "螘穴": "上冝倚反爾雅曰蚍蜉大螘小者螘郭注云大者俗呼馬蚍蜉說文從虫豈聲也經文作蟻𧕶皆俗字也",
    "捐棄": "上悅玄反考聲云捐棄也俗作捐從手涓省聲也下輕異反說文棄捐也從廾音拱從枼音鉢安反從云音土骨反云逆子也倒書子字推而棄之會意字也",
    "革𩌦": "上耕額反革獸皮也下所綺反考聲云履之不攝跟者名爲革𩌦說文鞮屬也從革徙聲經文從尸作屣或作𩌦俗字也鞮音都奚反",
    "媿恧": "上歸位反杜注左傳云媿慙也耻也說文云從女鬼聲或從心作愧亦通下女六反爾雅云心媿爲恧說文云亦慙也從心而音同上𮕜字無下畫也",
    "窳憜": "上俞主反史記云窳亦嬾惰也爾雅勞也郭注云勞苦者多惰寙言嬾人不能自起如瓜瓠繫在地不能起立故窳字從二瓜喻嬾人在室中不出說文從穴會意字也下徒臥反考聲云惰嬾也說文云從心隋聲也亦作惰字",
    "耕墾": "上古莖反周書云神農時天雨粟神農耕而種之下康佷反蒼頡篇云墾耕種也字從土墾聲也貇坤穩反也",
    "擐甲": "上古患反左傳云擐貫也桂菀珠叢云以身貫穿衣甲曰擐衣去聲謂著也本音胡慣反說文云從手睘聲下甲字有本作鉀非也",
    "芬馥": "上芬文反考聲云香氣也古文從屮作𡵳屮音丑列反說文云草初生香氣分布從屮分聲今隸書從草作芬芬和也經文從香作馚非本字下𠗦目反韓詩云芬馥香氣皃也",
    "阿迦膩吒": "梵語也具足應云阿迦尼瑟吒此譯云色究竟也言其色界十八天中此最終極也又云無小餘天互望亦大亦小此之一天唯大無小故以爲名",
    "阿鼻": "梵語也或云阿毘或云阿鼻旨此云無間無間有二義一身無間二受苦無間此地獄縱廣深等二萬由旬故俱舍論云此下過二萬無間深廣同也",
    "贍部洲": "上時染反梵語也此大地之惣名古譯或云譫浮或云琰浮或云閻浮提或云琰浮利正云𭛆謨立世阿毘曇論云有贍部樹生此洲北邊泥民陀羅河南岸正當洲之中心北臨水上於此樹下水底有贍部黃金樹因金而得名洲因樹而立號故名憺部洲譫音之𦯧反𭛆音蠶覽反",
    "勝身洲": "古云弗于逮或名弗婆提或云毘提呵皆梵語輕重異也正云補囉嚩尾尼賀譯云身勝毘曇云以彼洲人身形殊勝體無諸疾量長八肘故以爲名",
    "牛貨洲": "古云瞿伽尼或云瞿耶尼或名瞿陀尼皆訛轉也正云遇嚩柅義譯爲牛貨毘曇云以彼多牛用牛貨易故因以爲名",
    "俱盧洲": "古名鬱單越或名鬱怛羅或名鬱多羅拘樓亦名郁多羅鳩留皆訛轉也正云嗢怛羅矩嚕此譯云高勝謂此一洲人無中夭定壽千歲",
    "畟方": "上初色反說文正方四面齊等",
    "竦慄": "上息拱反爾雅曰竦懼也詩云不戁不竦下力質反考聲戰懼也詩云惴惴其慓說文云從心票聲也",
    "賙給": "上之由反毛詩傳云賙救也鄭箋云權救其患也說文云從貝周聲也下金立反顧野王云給權供也賈注國語云給及也足也備也說文相供足也從糸合聲",
    "慣習": "上關患反杜註左傳云慣亦習也說文作遦云習也從辵貫聲辵音丑略反經文有本作串音釧俗字也",
    "躁動": "上早到反賈注國語云躁擾也鄭注論語云不安靜也考聲性急也玉篇云躁亦動也說文云從足喿聲經文從叅作𨅶非也喿音蘇到反叅音倉含反",
    "犛牛": "上莫交反說文云西南夷長旄牛也案諸經律竝作犛牛字謂如犛牛愛尾也今律文作貓乃捕鼠獸名非此用也",
    "作鐆": "下隨醉反左傳云風駕出鐆杜注云取火具也淮南子云陽鐆見日則熯而爲火也說文云從金隊聲經文作燧或作㸂皆俗字乃候望之烽火也非經用熯音然善反",
    "蟒蛇": "上莫牓反爾雅云蟒王蛇也郭注云蛇之大者故曰蟒蛇說文云從虫莽聲莽字說文從犬𬻀聲𬻀音同上從重艸篆作茻經文從卉作莾誤也下射遮反毛詩云惟虺惟蛇周易蛇豸屬也說文從虫它聲經文作蛇俗字也它音徒何反豸音雉也",
    "墋𡹆": "上楚錦反砂墋不可服說文從土參聲參從彡音衫經文從小作㕘謬也又從石作磣俗字𡹆字說文從屮音丑列反屮草也云草初生有𡹆也",
    "𧄼瞢": "上音騰考聲云瞢𧄼臥初起皃也下墨崩反鄭注周禮云目無精光不明也杜注左傳云悶也二字皆從夢省登目亦聲也",
    "麁歰": "上麁字正作麤從三鹿說文不細也今省去二鹿作此麁字下色立反說文云歰不滑也字從四止二止倒書二止正書經文從水三止作澁非",
    "捫摸": "上莫盆反毛詩傳曰捫持也韻詮云捫搎也下音莫說文云摸𢱢也案捫搎摸𢱢猶摩挲也搎音孫𢱢音索挲音娑",
    "憾恨": "上含紺反孔注論語云憾亦恨也說文從心感聲下胡艮反蒼頡篇云恨𭜨也從心艮聲也",
    "暎蔽": "上於敬反考聲云暉也隱也韻英云傍照也古文作󱶹下卑袂反韻英云掩也考聲云鄣也說文云從草敝聲也",
    "火煖": "下奴管反俗字也賈注國語云煖溫也正作煗經文作𤏙非也說文從火而聲",
    "飇火": "上必遙反爾雅云扶搖謂之飇郭注云暴風從下而上也說文云搖風也從風猋聲也猋字三犬也音同上經文從三火作飈非也爾雅亦單作猋字",
    "拇指": "上莫補反古今正字云拇者足大指也從手母聲也",
    "菡萏": "上胡感反下單感反爾雅釋草云荷芙渠其花菡萏毛詩傳云未開曰芙容已開者菡萏說文菡從草函聲音含萏從草臽聲音陷經文作菡萏二形皆訛謬也",
    "撮磨": "上蒼括反廣雅云撮持也應劭注漢書云三指撮下莫何反研磨也無垢稱經云是身如聚沫不可撮磨言浮幻虛脆不可撮持而磨也說文云從手最聲",
    "芭蕉": "上覇麻反下卽消王注楚詞云香草名也生交阯葉如席煑漬可紡績也不堅草也自外至內並無有實故經中多引爲喻淨名云是身如芭蕉中無有堅是也",
    "絡腋衣": "上郎各反次音亦桉有部律名僧脚崎舊云僧祇支唐云掩腋衣也淨三藏寄歸傳云本製恐汗汚三衣先用掩右腋下交絡於左肩上後披袈裟相承用爲覆膊者誤行已久經文作掖亦通用",
    "稼穡": "上加暇反下所側反馬注論語云樹五穀曰稼鄭注周禮云稼有似嫁女相生也毛詩傳云種曰稼斂曰穡說文云稼禾之秀實也一云在野曰稼穀可收斂曰穡二字竝從禾家嗇皆聲也嗇音同上",
    "室羅筏": "舊云舍衛國正云室羅筏悉底此云好道或云聞物卽波斯匿王所治之境也",
    "翳障": "上於計反顧野王云隱也亦奄也說文云羽葆也舞者所執以蔽身也從羽殹聲也下又作鄣同之亮反切韻障遮也隔也字書掩也玉篇云亦作㢓說文云從阜章聲",
    "揀擇": "上姦眼反文字集略云揀選也亦擇也從手柬聲說文柬字從八在束中下音澤切韻擇亦揀也從手澤省聲也",
    "閻浮檀": "梵語也或名琰浮或云贍部立世論云有贍部樹生於泥民達羅河南岸正當此洲之中心北臨水上於樹下水底南岸有贍部黃金卽閻浮檀金是也南贍部洲因此彰名",
    "門闥": "上門字或作門說文云從二戶也下他達反漢書集注云闥謂小門也切韻云闥謂門道也又通也",
    "牕牖": "上楚江反說文云在牆曰牖在屋曰牕從片悤聲像交眼之形經作牎或作窻皆俗字下由酒反說文云穿壁以木交爲窻也從片戶甫聲也悤音同上",
    "階墀": "上音皆下直尼反玉篇曰階謂登堂之道也說文曰墀謂以丹塗地謂之丹墀又道也亦階也",
    "欄楯": "上落干反慈恩音義云鉤欄也或作闌說文云門遮也下食尹反說文云楯欄檻也王逸注楚辭云檻楯也縱曰檻橫曰楯字從木盾聲也",
    "湍激": "上吐官反下古歷反說文曰湍瀨也淺水流於砂上曰湍也水文疑邪疾急曰激竝從水耑敫聲也凝字去聲耑音端敫音同上也",
    "布濩": "下音護顏注漢書曰布濩猶言布露謂於鈌露之處皆遍布也經文從言作護切韻云助也台也非此用",
    "氤氳": "上於真反下音於云反切韻云二字元氣盛也又香氣分布皃說文云從氣因昷形聲字也气音氣昷音溫也",
    "繽紛": "上疋賓反切韻繽盛也下撫文反切韻云大也衆多貌又紛紜亂下也",
    "拘蘇摩": "梵語花名正云俱蘇摩那此云悅意也其花色美氣皆香形狀端正見聞之者無不悅意也",
    "跏趺": "上音加下音夫二字皆相承俗用也正作加跗二形鄭注儀禮云跗足上也顧野王云足面上也案金剛頂瑜伽儀云坐有二種謂全加半加結加坐卽全加也加跗坐卽半加也謂降魔吉祥等也如前已釋也",
    "天竺": "相承音竹准梵聲合音篤古云身毒或云賢豆新云印度皆訛轉也正云印特伽羅此翻爲月也月有千名斯乃一稱西域記云良以彼土佛日旣隱賢聖誕生相繼開悟導利群生如月照臨故以爲名也",
    "烏長國": "正云烏仗那梵語西域記云國周五千餘里崇重佛法敬信大乘舊有伽藍一千四百所僧徒一萬八千人竝學大乘寂定爲業善誦其文戒行清潔特閑禁呪也",
    "支那國": "或云真那或云震旦亦云摩訶支那皆梵語輕重也舊飜爲漢國或云卽大唐國也或飜大夏國又云思惟國謂此國人多有智略能思惟故皆義飜也",
    "違諍": "上雨非反字書云背也亦逆也說文離也從辵韋聲韋字從舛從口上下相背之形舛音喘口音韋走音丑略反下側迸反說文諫止也從言爭聲也爭音同上",
    "阿㝹": "上音遏下奴溝反梵語也不求字義",
    "裸露": "上胡果反考聲云脫衣露肉也本音郎果反又作倮躶二形同說文云從衣果聲律文從示書誤也下洛故反切韻云露泄也敗漏也說文云露潤澤也從雨路聲也",
    "羸瘦": "上累危反杜注左傳云羸弱也許糾重注淮南子云劣也從羊𣎆聲下所救反切韻云瘦損也說文云從疒叟聲正作瘦經作瘦俗字疒音女厄反",
    "顦顇": "上齊遙反下情遂反考聲云顦顇瘦惡蒼頡篇作憔悴云愁憂也毛詩從言作譙誶班固從疒作癄瘁漢武帝李夫人賦從女作嫶𡝵左傳從草作蕉萃諸書無定一體今經文多作顦顇",
    "枯涸": "上康胡反考聲云木乾死也或從歹作㱠古字也下河各反賈注國語云涸竭也廣雅云盡也說文云從水從固聲",
    "瞖膜": "上於計反郭璞云瞖掩也覆也說文云目病也從目殹聲也經文從羽作翳非目瞖下音莫考聲云皮內肉外曰膜說文從肉莫聲經文作瞙亦通",
    "假寐": "下彌庇反毛詩傳曰寐寢也顧野王曰假寐者謂具衣冠而坐眠也說文云寐從未從㝱省聲",
    "賑給": "上章刃反馬注論語云賑窮乏也考聲云賑亦給也說文從貝辰聲下居立反切韻供也散與也說文云從糸從合聲也上賑又音之忍反",
    "地獄": "下虐錄反史記皐陶始作獄杜預注周禮云爭財曰訟也爭罪曰獄風俗通云三王爲獄夏曰夏臺殷曰羑里周曰囹圄自秦漢已後通名爲獄說文從犾言二犬相噬言以訟之會意字也今經中言地獄者地底也謂在贍部之下故言地獄故俱舍論云此下過二萬無間深廣同上七捺落迦八增皆十六廣如論釋",
    "頻申": "上瓶寅反毛詩傳曰頻急也申舒也謂以手足胸背左右上下或急蹙或舒展自解其勞倦也",
    "聚落": "上疾喻反韋昭漢書云小鄉曰聚蕃籬曰落以人所居故也聚字說文云從乑從取聲乑音吟從三人",
    "旋澓": "上又作漩音似緣反考聲洄也爾雅曰旋復返也下符福反三蒼澓深也謂河海中洄旋之處從水復聲",
    "雷震": "上魯迴反王充論衡曰以天地爲爐陰陽爲氣相擊成聲也說文正作靁從雨畾聲下章認反切韻云動也起也說文云從雨辰聲",
    "赫奕": "上呼格反切韻赤也又明盛也從二赤也下羊益反玉篇大也案赫奕卽盛大貌也經文從火作焃非",
    "熙怡": "上虛飢反字統云熙和也考聲云美也從灬巸聲也灬必遙反巸音同上下以之反考聲云喜悅也說文和也從心台聲台音怡見爾雅又古文以作台字",
    "池塹": "上直离反廣雅曰亭水曰池下僉焰反顧野王云城池爲塹卽今城外壕坑也字書云城隍也說文云坑也從土斬聲也或從漸作壍亦同",
    "垣牆": "上遠元反毛詩傳曰垣亦牆也下匠羊反聲類云亦牆垣也尚書云無敢逾垣牆說文牆敝也從嗇爿聲也經中或作墻𡒅𤖠竝俗",
    "諂誑": "上丑琰反又作讇同諛也說文從言臽聲臽音陷經文從舀作謟音他力反非經義舀音以沼反下居況反欺也字書從言狂聲說文從心作㤮義同",
    "羂索": "上癸兖反桂菀珠叢云以繩係物謂之羂也或作𦊰下蘇各反字書索大繩也亦綆也又盡也散也",
    "茵蓐": "上於真反下如欲反毛詩傳曰茵虎皮也玉篇云以虎皮爲蓐曰茵又作鞇郭注尒雅曰蓐席也聲類曰蓐薦也又作褥字同案茵蓐二字若以皮爲卽從艸作若以革爲卽從革作鞇也",
    "誘誨": "上與之反考聲云引也導也論語曰夫子循循善誘人說文云教也從言秀聲下荒外反教也亦訓也論語云誨人不倦何有於我哉說文云從言每聲也",
    "鹹味": "上遐巖反尚書洪範云潤下作鹹尒雅曰鹹苦也說文云北方味也從鹵咸聲也經文從酉作醎非也",
    "欻然": "上輝律反𦵮琮曰欻急也蒼頡篇猝起也說文吹起也從炎吹省會意字也下然字從肉犬灬灬音標火行皃也云犬逐其肉灬以然之亦會意字也",
    "泳游": "上榮柄反尒雅曰潛行爲泳郭璞注云水底行也晏子春秋曰潛行逆流百步順流七里下以周反尒雅曰順流而下曰泝游說文云從水斿聲經文作㳺俗字非正",
    "捃拾": "上居運反字書云取也聲類云拾穗也又從禾作𮃨下是汁反考聲斂也切韻云取拾也從手給省聲",
    "楞伽": "上勒登反俗字也正作棱從木夌聲正梵語應云䮚誐是寶名也梵語不求字義䮚勒鄧反",
    "嘯和": "上蘇弔反說文云呼吟也謂聚辱出聲也亦作歗下胡臥反尒雅曰徒吹謂之和卽應和也",
    "罣礙": "上又作罫絓二形同胡卦反字書云𦊱亦礙也謂羂礙也下五槩反切韻止也亦作硋㝵閡皆俗字也",
    "達邏": "下來箇反梵語不求字義也",
    "遽卽": "上其倨反字書云急疾也切韻云戰慓也說文云從辵豦聲也豦音同上經文作遽俗非也",
    "普霔": "下之戍反切韻時雨霔下也說文從雨注形聲字亦作澍正體字也",
    "船舫": "上食川反玉篇曰舟曰船下府妄反又補浪玉篇亦舟也通俗文云連舟曰舫雙併兩舟也",
    "船橃": "上述緣反方言曰自關而西謂舟爲船說文云船舟也從舟沿省聲也下煩韈反考聲云縛竹木浮於水上也集訓云木橃也從木發聲也俗從竹筏通用廣雅作𦪑古文也經文作栰謬作也",
    "惑箭": "上胡國反切韻云心迷亂也說文云從心或聲也下煎線反俗字正體作𥳭從竹從止從刂說文云止舟爲歬音前蔡邕加刂音古外反刂水也可以行舟後因行草書字變止作󱴁變舟作月變刂爲刀作前字考聲云箭本竹名此竹葉似葦叢生高五六尺莖實可以爲矢笴因名矢爲箭笴音干旱反",
    "袈裟": "上音加下音沙梵語訛也具足應云迦邏沙曳此云染色或云壞色以西域俗人皆著白色衣故簡異之袈裟二字本非衣名不合從衣",
    "臍輪": "上情奚反字書云當腹之中曰臍說文云膍臍也從肉齊聲也或作齊亦通經文單作齊古文借用也下力迍反周禮曰軫之方以像地蓋之以像天輪圓以像日月也輪三十幅也從車侖聲",
    "兩脇": "下或作脅同香業反說文云肚兩傍也從肉從劦聲音叶從三力經文從三刀作𦚰非也",
    "廣陿": "下遐甲反禮記云廣則容姦陿則思欲考聲云陿隘也玉篇云迫隘也不廣也經文從犬作狹誤謬也乃是狹習字犬馬所以馴狹之又輕㑥也甚非廣陿義也有經作陜亦非乃陝州字陝音式染反卽周書分陝之地是也",
    "漁捕": "上語居反說文漁捕魚也尸子曰燧人之世天下多水故教人漁古文作𭤐亦捕也或作𮫱謂𮫱獵也下薄故反切韻捉也",
    "屠獵": "上唐胡反考聲云殘殺也說文刳也從尸都省聲也下廉葉反考聲云犬逐獸也尒雅曰獵虛也又取也亦謂畋獸爲獵說文云從犬鼠聲也鼠音云上",
    "善軶": "下於格反俗作軛正作軶從戶乙聲也鄭衆注考工記云軶轅端壓牛領木也",
    "閻羅王": "或云剡魔或云𤓁魔皆訛略梵語也正云琰魔羅義飜爲平等王謂典生死罪福之業主守八寒八熱大地獄伇使鬼卒於五趣中追攝罪人平等治罰捶拷故三啟經云將至琰魔王隨業而受報是其事也",
    "氛氳": "上符云反下於云反王逸注楚辭云氛氳盛也謂香氣遠布皃也",
    "延袤": "上以然反下莫候反延長也袤廣也如前第七卷經已釋訖",
    "甍棟": "上莫耕反切韻甍亦棟也下多貢反尒雅曰棟謂之桴郭璞注曰屋穩也桴音浮檼於靳甍從瓦從夢省聲也",
    "鳧雁": "上輔於反尒雅曰舒鳧鶩音木郭璞注云鴨也考聲云野鴨之小者也字書云從鳥從几几音殊聲也下顏諫反毛詩傳曰大曰鴻小曰鴈卽隨陽鳥也禮記月令云季秋之月鴻雁來賔方言云自關而西謂雁爲鴚鵞鴚音歌",
    "鴛鴦": "上於袁反下於薑反毛詩曰鴛鴦干飛傳曰鴛鴦疋鳥也言其止爲疋偶飛則雙飛說文從夗央皆形聲字也",
    "白鶴": "何各反郭璞注山海經云色白長喙壽滿千歲頂背朱色字書云神仙鳥也見則爲祥瑞也抱朴子曰鶴鳴九皐聲聞於天淮南子云鷄知將曉鶴知夜半也說文云從鳥寉聲寉音何各反又解寉從冖音癸營反從隹隹卽鳥也鳥高飛至欲出冖也會意字",
    "理翮": "上良始反字書云通也切韻料理也說文云從玉里聲下行格反顧野王云鳥羽翮也說文從羽鬲聲鬲音革也",
    "葱翠": "上倉紅反下七醉反上合作總字青黃色葱䓗乃葷菜也說文云翠青羽雀也今言總翠謂雜色晃曜也非是葱菜之翠也",
    "優鉢羅": "此云青蓮花",
    "波頭摩": "此云紅蓮花",
    "拘物頭": "梵語或云拘某陀亦云拘牟那此云赤蓮花其色深朱甚香亦大人間無亦出彼大龍池",
    "芬陁利": "此云白蓮花此四種花如前袟第八卷中已具釋之",
    "牽我": "上企堅反廣雅云牽連也挽也說文云引前也從冖音癸營反像牛之縻也從牛玄聲也俗從去手作牽非也",
    "波濤": "上博科反切韻云水波濤也爾雅曰大波爲瀾小波爲淪也說文從水波省聲下徒刀反考聲濤浪浪也說文三波曰濤從水壽省聲",
    "湧浪": "上容悚反說文云勇亦騰起也從水勇聲也亦作涌下來宕反切韻云浪亦波也說文云從水朗省聲",
    "窻牖": "上楚雙反釋名云窻聰也於內視外聰明也說文云在屋曰窻下與久反說文云穿壁以木爲交悤也禮記云儒有蓬戶甕牖說文云從片戶甫聲",
    "頤頷": "上以伊反下含感反方言云頤頷牙名也文字集略云頦也說文云輔車骨也從頁頁頭也臣含聲也經文作頤非也臣音夷也",
    "𢩌髆": "上古賢反切韻云頂傍也髆上也下牓莫反字林髆胛也說文云肩胛也從骨博省聲也經文作膊音普博反郭璞云披割午羊五藏謂之膊非肩髆義胛音甲",
    "傭圓": "上丑囟反考聲云上下均也韻英傭直也說文云均直也從人庸聲也經文作𦟛俗字也",
    "胸臆": "上香邕反說文云胷膺也膺卽臆或作匈亦通下應力反說文臆亦胷骨也從肉億省聲也",
    "過膝": "下𦙃逸反玉篇膝脛上頭也說文脛骨節頭也正體從月從𣷚作𦡀此𦡀字時用已久有經作𦡀字全乖",
    "網鞔": "下母桓反說文鞔覆葢也案網鞔卽如來手足指間如鵞王相聯緜無缺也律文作輞車輞也作縵音莫叛反二字竝誤",
    "鹿腨": "上來谷反切韻獸名也下遄耎反文字集略云脛之膓也說文足䠊膓也或作𨄔踹𨄔並同今從肉遄省聲遄音船案鹿腨者謂毉泥耶鹿王身毛種種異色光潤鮮明腨膝傭纖故引爲喻也",
    "足跟": "下網恩反字統云足後曰跟說文曰足踵也從足根省聲也踵音腫",
    "不瞬": "又作瞚同式閏反韻英云動目數搖動也呂氏春秋曰萬世猶如一瞬目也或作眴亦通",
    "雍肅": "上於容反爾雅曰雍雍和也郭璞注云和樂也又作邕爾雅正作癰皆同下息竹反爾雅云肅肅恭也郭注云容儀謹敬也肅字從𦘒從𣶒𦘒音女輒反槁属𣶒古文泉字兩傍像岸橫畫像水以𦘒插在中間肅然也會意字",
    "河渚": "上音何爾雅曰江河淮濟爲四瀆山海經曰河出崐崘西北隅郭注云潛流地中汩漱沙壤宣其濁黃也下章與反爾雅曰水中可居者曰洲小洲爲渚王逸注楚辭云水涯曰渚爾雅從阜作陼義同",
    "風癎": "上音封說文云風動蟲生故蟲八月而化從虫𠘨聲也下限姦反聲類云小兒病也從疒間聲也疒音女厄反像倚臥之形也",
    "痟瘦": "上相焦反說文作消盡也切韻云渴病也下正作𤸃同所救反切韻云損也說文云瘦瘠也瘠音籍",
    "百洛叉爲一俱胝": "洛叉俱胝皆梵語數法名也。或十萬爲一洛叉。百萬爲一洛叉或萬萬爲一洛叉。依此方孫子算經云十十爲百。十百爲千。十千爲萬。自萬至億有三等上中下數變之也。依黃帝算經總有二十三數謂一二三四五六七八九十百千萬億兆京姟秭壤溝澗正載也。亦從萬已去有三等數謂其下者十十變之。中者百百變之。上者億億變之。慧菀法師云經言俱胝當此億也。阿庾多兆也。那由他京也。餘准例知。自億已去皆以能數量爲一數。復數至本名數量乃至不可說轉是",
    "獶鉢弥": "上奴刀反下迷比反",
    "邏伽": "上盧賀反",
    "皤訶": "上音婆下音呵",
    "覩𨤤": "下里也反",
    "你㕧": "下許伊反",
    "瓢孽哆": "上毘摽反中魚謁反下多可反",
    "印𡫸": "下寧吉反",
    "呾羅": "上音怛從旦經從且非也",
    "鞞麼": "上音毘下音莫可反自獶鉢彌至鞞麼皆真言中字但借音就字影對梵聲不求訓釋也",
    "衢路": "上具于反爾雅曰四達謂之衢郭璞注云謂交道四出也下盧故反爾雅曰路旅途也郭璞注云途卽道",
    "藤根": "上徒能反切韻云苰藤草名也韻英云藤蘿也依樹蔓生說文從草滕聲也",
    "雉堞": "上池履反字書云雉𨺙也公羊傳云五板爲堵五堵爲雉百雉爲城何休注云二萬尺也考聲禮記並云天子城千雉葢受百雉之城十也公侯城百雉伯城七十雉子男五十雉但諸侯之城缺其南以授過也下徒頰反杜注左傳云堞者城上女牆也說文女垣也從土枼聲也",
    "𩱱香": "今俗作鬻同余六反字書云賣也下香字正𪏽詩云黍稷惟馨說文云從黍甘會意字也",
    "竅隙": "上企曜反鄭注禮記竅孔也說文空也從穴敫聲也敫音羊灼反下鄉逆廣雅云隙裂也顧野王云隙穿穴也說文壁孔也從阜白上下小也",
    "倉篅": "上七崗反切韻云倉廩也釋名云倉藏穀物所也下市緣反切韻篅亦倉也說文從竹遄省聲也經文或作圌俗字",
    "挻埴": "上傷延反下承力反淮南子云陶人之挻埴也許注云押也孔注尚書云埴黏土也如淳曰挻擊也埴柔也和也謂柔土作器也說文挻字從手埴字從土竝形聲字經文二字皆從土作埏埴上字誤也",
    "坏器": "上芳盃反切韻云未燒瓦器也說文作坏下去冀反史記云舜作什器於壽丘說文云器皿也飲食之器總名也從犬㗊音庄立反㗊衆皿犬以守之會意字",
    "燥溼": "上蘇皓反切韻云乾也說文云火乾也從火喿聲下身入反切韻云水霑也經文作濕俗用非也",
    "䘏惸": "上新律反切韻云賑䘏也下葵營反考聲云孤單也文字典說云無兄弟也",
    "嫡嗣": "上丁歷反切韻正也字書云長也爾雅曰長婦爲嫡也下祥志反爾雅嗣續也",
    "日躋": "上人一反說文曰實也言太陽之精不虧也下祖兮反爾雅曰躋登也公羊傳曰躋者何陞也或作隮陞音升",
    "駕駟": "上古訝反切韻駕乘也毛詩云駕我其𮩴下息利反四馬共乘也爾雅曰天駟房也郭璞注云龍爲天馬故房四星謂之天駟李淳風注天文經云天駟一名天馬二星爲右服右驂二星爲左服左驂也馬文句反",
    "祠祭": "上似茲反爾雅曰春祭曰祠郭注曰祠之言飤也下子例反切韻享薦也論語云祭神如神在如前花嚴經第十二已釋",
    "巡狩": "上祥倫反切韻徧也察也下舒救反韻英云狩獵也尚書曰二月東巡狩至于岱宗柴孔傳云諸侯爲天子守土故巡行之順春先東巡次夏秋冬例然巡狩四岳然後歸告太廟",
    "罄志": "上苦定反爾雅曰罄盡也顧野王云器中空也下職吏反孫緬云念也意也誠也說文從心ㄓ聲也ㄓ音之案罄志謂空其心盡其誠也",
    "曆筭": "堯典云曆像日月敬授人時孔注云曆像其分節敬記天時以授人也下蘇貫反世本云黃帝時肄首所作也劉法九章孫子五曹皆計數術也說文曰筭長六寸計曆數者",
    "髫齔": "上音條考聲云小兒剃頭留兩邊也字書曰髫小兒垂髮也從髟召聲下初覲反鄭注周禮云男八歲女七歲卽毀齒說文從齒七聲或從匕乚作齔齔二形皆非本字也",
    "緯候": "上云貴反經緯也經音古定反下胡遘反韻譜云伺也案五星曆云二十八宿爲經日月五星爲緯行度有踵次故候占吉凶也",
    "弼諧": "上房密反爾雅曰弼輔也廣韻備也古文作㢸下戶皆反爾雅曰諧和也書曰允迪厥德謨明弼諧也",
    "原隰": "上牛袁反爾雅曰廣平曰原又曰可食者曰原郭注云可種穀給食也下似入反爾雅云下溼曰隰郭注引公羊傳云下平曰隰",
    "𢤱戾": "上籠董反下音麗又作悷切韻云不調貌也皆俗用字案字書本無此字也",
    "兇殘": "上許容反考聲云頑也說文云惡也從人在凶下也下昨竿反韻譜云傷也害也說文從歹戔聲歹音五割反戔音殘易曰束帛戔戔也",
    "豐登": "上方戎反玉篇稔茂也韻集云大也多也下都滕反切韻成也又升也禮記月令云仲秋之月禾乃登也",
    "嶷然": "上魚力反字指曰嶷崱山峯貌也謂住立端直如山峯也",
    "驕侈": "上舉喬反說文云馬高六尺也孝經云在上不驕高而不危御注云無禮爲驕也下尺氏反又作奓說文奢也切韻泰也",
    "股肱": "上公戶反髀也下古弘反臂也案股肱卽手足也尚書云股肱惟人孔傳云手足具乃成人又曰元首明哉股肱良哉是也",
    "非辜": "下古胡反爾雅曰辜辠也辠音罪言人自取其辛苦卽爲辠矣因秦始皇冀累世爲皇嫌辠字似皇字故改爲罪也辜說文從辠省古聲也經文從手作𢪿傳寫誤也字書無文也",
    "韛囊": "上排拜反蒼頡篇云韛韋皮也顧野王曰謂吹大鑄冶令熾也從韋𤰇聲也𤰇音備也",
    "攘臂": "上如羊反孟子曰攘臂而下車顧野王云謂除去衣袂出臂也袂音彌勵反袖也",
    "齧齒": "上五結反考聲齧噬也字書云淺齩也從齒契省聲經文從口作嚙非本字",
    "刖挑": "上魚厥反爾雅曰䠊則也郭注云謂斷足也說文作跀刑足也下吐彫反亦作𢬹俗字韻譜撥也",
    "䏺脹": "上疋江反又作肨切韻云䏺亦脹也下知亮反說文云滿也壯脹也或作痮亦同經文作膖俗字",
    "膓𦝩": "上除艮反白虎通云小膓者心之府也膓者肺之府也釋名曰傷暢也謂腹內暢氣之府也下韋畏反白虎通云胃脾府也說文穀府也從月胃形聲字或作胃字",
    "筋脈": "上謹欣反周禮醫師以辛養筋說文肉之力也從肉竹竹者物之多筋也力像筋形經文多從草從角作𮏴非也下盲伯反周禮以鹹養脈也說文血理之分行於體中也或作衇又𧖴二形正體字俗用脉已久也",
    "鞭笞": "上必綿反顧野王云用革以扑罪人字書云撾馬杖也說文從革便聲下丑之反律書云笞杖徒流死是也笞刑有罪之人下者說文笞撻也從竹台聲音怡",
    "澄垽": "上直陵反考聲水清也下魚靳反爾雅曰澱謂之垽郭注云滓澱也江東呼垽",
    "俾倪": "上普米反下五禮反說文作壀堄又作隦𨺙廣雅云城上小垣也考聲女牆也釋名云於牆孔中伺候非常也二字亦通去聲呼經本或作脾腉非也",
    "寶塹": "下七燄反說文云塹坑也經本有從水作壍者謬也",
    "洲渚": "上音州下章與反爾雅曰水中可居者曰洲小洲曰渚小渚曰沚也詩云在河之洲也方言云洲灘也音他丹反沚音止渚或作陼",
    "啗肉": "上徒濫反又作啖切韻食㗖也或作噉音徒敢反下肉字說文作肉像筋肉之形",
    "竊自": "上千結反郭注爾雅云竊淺也切韻盜也字書云私竊也從穴釆𠨄聲也𠨄音𦵮經文有作竊字非也",
    "拘尸那": "梵語西國城名也此云䎡草城或云香茅城以多出此草故也在於中印度境周千餘里卽如來於此入大涅盤處",
    "般涅盤": "上音補末反梵語也舊云泥洹竝訛略也正云摩訶波利儞嚩喃此云大圓寂也謂三點圓伊四德圓果等是也",
    "漉諸": "上盧谷反切韻云瀝也郭注爾雅云漉出涎沫也亦作𥂖韻英云去水也",
    "㧌動": "上音呼高反俗字也正作撓切韻攪也亦動也撓音奴巧反今此不取",
    "廛店": "上直連反居也考聲云市空地曰廛下都念反切韻店舍也崔豹古今注云店置也所以置貨鬻也從广占聲也广音儼形聲字也鬻音揚菊反",
    "巖岫": "上五銜反切韻云峯險也毛詩云惟石巖巖注云峻也下似右反爾雅曰山有穴爲岫郭璞云謂巖穴也",
    "晷落": "上音軌說文云日景也從日從咎音舊經文從各作晷俗誤也下盧各反爾雅云降墜湮下落也案經晷落卽日景沉下也",
    "歰滑": "上色立反韻英云不通也說文云不滑也從四止二正二倒作歰經文從三止作澁脫略也下尸八反切韻利也從水骨聲也",
    "陂池": "上彼爲反爾雅云陂者曰阪尚書云澤障曰陂下直離反切韻停水曰池廣曰沼也從水馳省聲",
    "蹈之": "徒倒反切韻踐履也",
    "箏笛": "上側莖反說文皷絃筑身樂也本大瑟二十七絃秦人不義二子爭父之瑟各得十三絃因名爲箏下徒歷反說文笛七孔俗云羗笛風俗通云笛滌也言滌去邪穢納正氣也",
    "琵琶": "上房脂下蒲巴反本出西戎胡樂名也釋名云推手爲琵引手爲琶其皷時爲名也說文二字並從玨比巴聲也玨音角",
    "簫瑟": "上蘇彫反爾雅云大簫謂之䇾郭注云編二十三管長尺四寸小者十六管長尺二寸風俗通云舜作簫以像鳳翼也下所櫛反爾雅云大瑟謂之灑郭璞注云長八尺一寸廣一尺八寸二十七絃世本云庖羲氏始作瑟",
    "瞬目": "上舒閏反韻英云目搖動也說文作瞚經本作眴皆通用下莫六反眼瞳子也釋名云目默也謂默而內識也",
    "脣吻": "上食倫反字書亦作𠼉下無粉反切韻云口吻也三蒼云脣之端也",
    "門閫": "上莫毘反爾雅云正門謂之應門顧野王云在堂房曰戶城郭曰門說文云從二戶作門下苦本反說文云門限也從門困聲也",
    "遞相": "上特計反爾雅釋言云遞迭郭注云謂更迭也迭音田結反經文作𮞏不成字也",
    "補陁落迦": "亦云補怛洛迦舊云寶陀羅皆梵語楚夏也此云小花樹山謂此山中多有此花樹其花甚香卽南海此岸孤絕山觀自在菩薩所居宮也",
    "𦟛圓": "上丑容反爾雅曰𦟛均也郭注云謂齊等也爾雅作𦟛字",
    "弓矢": "上居戎反釋名云弓穹也謂穹穹然說文云像形字也下又作矢笑皆音式是反世本云黃帝夷牟作矢也",
    "寶璫": "上博抱反衆珍之總名也亦作珤從玉缶聲下都郎反說文云穿耳施珠也韻英云耳飾也從玉當聲",
    "髑髏": "上同祿反下勒候反埤蒼云頭骨也說文云頂骨也並從骨獨樓省聲字經文有作䫳䫫俗字非正體",
    "慞惶": "上諸良反切韻云懼也下胡光反考聲云慞惶恐懼也韻英遽也悚懼失次也",
    "驚駭": "上舉卿反怖也下候揩反切韻云駭亦驚也說文云從馬亥聲孫然注爾雅云禹疏九河北河功難衆懼不成因名徒駭也",
    "捔力": "上古岳反合單作角考聲云競也切韻云角牴戲也今作捔說文云掎捔也有經作捔椓又作斠平斗斛槩也皆非角力義掎音居綺反",
    "捶楚": "上隹蘂反說文云以杖擊也從手垂聲或從竹作箠策也從木作棰棓也下瘡所反切韻云榎楚也楸木名亦荆從林疋聲疋音踈榎音賈",
    "開闡": "上可哀反韻集云開闢也說文啟也從門幵聲從井作開俗用非正下昌善反玉篇亦開也揚也韻英明也教也",
    "主稼": "爾雅曰師職主也廣雅云主守也字從王丿聲丿音竹句反下加暇反馬融注論語云樹五穀曰稼卽苗稼也此神守之不令有損也",
    "覺寤": "上音教蒼頡篇寤覺也經文作𭔏俗字下吾故反考聲云寤中有所見覺而有信謂之寤從㝱省吾聲也",
    "號泣": "上胡刀反切韻哭也爾雅曰舞號雩也郭璞注云雩祭吁嗟請雨也說文作唬下去急反切韻哭泣也考聲云無聲出涕曰泣從水立聲也",
    "稻梁": "上徒皓反切韻云秔稻也本草云秔米主益氣止煩泄稻米主溫中令人多熱字林云秔稻不黏糯稻黏說文云糯卽稻也下音良或作梁切韻云稻梁也廣志云遼東有赤梁米也",
    "嬉戲": "上許其反聲類云美也遊也從女喜聲下香義反切韻云弄也謔也郭注爾雅云謂調戲也謔音虛虐反",
    "淳熟": "上時倫反正作𤂸說文清也下常六反考聲云熟成也方言云爛也",
    "際畔": "上子例反玉篇邊也切韻云畔也下蒲半反說文云田界也從田半聲也",
    "惽寐": "上呼昆反考聲云不明也字林又音呼困反昧也經文單作昬爾雅云昬強也切韻曰暮也非此用下民致反玉篇寢臥也孝經曰夙興夜寐說文從㝱省聲也",
    "檢策": "上錦儼反爾雅曰檢同也釋名云撿禁也說文云從木僉聲下楚革反或作筴賈注國語云策計也字書云策謀筭也說文從竹朿音此志反經文從宋作榮誤書字也宋音送",
    "瞖瞙": "上於計反說文目中瞖也從目殹形聲字也經文從羽作翳非眼瞖字也下音莫字書云目不明也釋名云瞙幕也如隔障幕也文字集略從目作瞙經文從月作膜謂皮內肉外筋膜也",
    "寶繩": "下食蠅反世本曰涶作準繩尚書曰繩𮘧糺謬格其非心也又曰木從繩則正說文索也從糸蠅省聲也",
    "妃嬪": "上芳非反韻英云喜偶也郭璞注爾雅云相偶嫓嫓音疋閉反案毛詩傳云關鴠后妃之德也下符真反爾雅釋親云嬪婦也禮記云生曰父母妻死曰考妣嬪也堯典曰降二女於媯汭嬪于虞孔傳曰使行婦道於虞氏也",
    "煢獨": "渠營反尚書云無虐㷀獨孔安國曰㷀單也謂無兩依也無子曰獨也亦作惸字",
    "溝阬": "上苟侯反考工記云井間廣四尺深四尺謂之溝鄭注周禮云十夫二隣之田所以通於川也說文云水瀆也從水冓聲也下客庚反爾雅云阬虛也蒼頡篇云阬壑也陷也塹也古今正字從阜亢聲經作坑俗字也",
    "堆阜": "上當雷反考聲云堆土之高也說文云小阜也從土隹聲也經文作塠俗字非也下房務反爾雅曰大陸曰阜考聲云丘類也釋名云阜厚也從𠂤土省聲古文作𨸏大篆作隹經文作阜埠皆非也",
    "荆棘": "上舉卿反切韻荆木名可以染也從草刑聲也下紀力反考聲云酸棗木名也切韻云箴也從二朿也朿音㓨也",
    "鬚蘂": "上相俞反切韻小髻也下如捶反廣雅云花也謂花鬚頭點也說文云從三心作蘂云花外曰萼花內曰蘂經從三止或從木作蘃皆非",
    "婬佚": "上余針反切韻云邪也蕩也說文云貪也從女㸒聲也㸒字從爪壬音同上下寅質反切韻云佚樂也說文云從人失聲也",
    "搒笞": "上白忙反顧野王云搒擊也字書云捶也說文從手旁聲下恥持反說文云苦擊也從竹台音怡聲也",
    "臏割": "上蒲忍反大戴禮云人生暮而臏生然後行也說文云臏膝骨也尚書傳曰决關梁踰城郭略而盜者其刑臏顧野王曰斷足之刑也卽呂刑䠊刑之類也或從骨作𩪯下古達反爾雅曰割裂也切韻云剝截也從刀害聲也",
    "宮闈": "上居戎反世本云禹作宮室爾雅曰宮謂之室禮記云由命氏以立火子皆異宮案古者貴賤同稱宮自秦漢以來唯王者所居之稱下雨非反爾雅曰宮中之門謂之闈郭璞注云謂相通小門也其小者謂之闈也",
    "犀牛": "上音西爾雅曰犀似豕郭璞注云似水牛豬頭大腹庳脚脚有三蹄色黑三角一角頂上一角額上一角鼻上鼻上者卽食角也小而不橢好食棘亦有一角者從牛尾省聲經文作󱯜誤也橢音他果反",
    "環珮": "上戶關反切韻玉環也爾雅曰肉好若一謂之環郭注云謂邊孔適等也下蒲妹反切韻云玉佩也禮記云古之君子珮以比德也",
    "母脇": "上莫厚反爾雅曰父爲考母爲妣父之妣爲王母郭注云加王者尊之也蒼頡云字從女雨點像婦人乳形也下香業反或作脅亦同說文云肚兩傍也從肉劦聲劦音叶從三力也",
    "慙愧": "上徂含反下軌位反說文愧亦慙也禮記云君子不以所能者而病於人不以所不能者而愧於人廣雅曰慚恥也爾雅云愧慙也二字互相訓也說文作愧亦作謉聭二形皆古字也",
    "沮壞": "上情與反左傳云沮亦壞也說文云從水且聲且音子魚反下懷恠反考聲云崩摧也敗也古今正字云自破曰壞從土褱聲也褱音懷包也說文云懷字從衣眔音談合反眔上從橫目下從氺音別經文作壞傳寫人誤書也",
    "焚爇": "上符分反切韻燒也下又作焫同如雪反韻英放火也亦燒也",
    "翼從": "上與職反切韻恭也助也爾雅云翼敬也論語云趨進翼如也孔注云言端謹也下疾用反切韻云後也侍也經文或作翊俗用亦通",
    "殞滅": "上爲敏反聲類云殞沒也爾雅云落也亦作隕左傳星隕如雨是也下亾烈反說文作威解云火從十月亥受氣至九月戌乃死故從火戌也蔡邕加水作滅",
    "佞媚": "上乃定反切韻云諂也論語云雍也仁而不伎郭註爾雅云佞人似信者也下明祕反考聲云悅也美也切韻云姿媚也論語云王孫賈問曰與其媚於奧寧媚於竈也",
    "愆違": "上去乾反又作𮘧𠍴󱰺三形皆同爾雅曰逸𮘧過也書云監於先王其永無愆孔注云過也下雨非反字林背也切韻違逆也拒也",
    "猨𤜴": "上雨元反爾雅曰猱猨善援也下余救反山海經云鬲山多蜼音同上郭璞注云似獼猴而大蒼黑色尾長四五尺似獺尾頭有兩歧天雨則倒懸於樹以尾塞鼻江東養之捕鼠切韻云虫名也亦作󱶫𮙧狖古字有作㹨非",
    "袨服": "上玄絹反文字集略云盛服也考聲云袨美服字書云袨衣服鮮者也從衣玄聲",
    "慳悋": "上苦間反切韻云恡也爾雅曰慳固也郭璞云慳然牢固也下良刃反切韻云鄙財曰悋考聲云惜也或作恡吝𠫤皆俗字",
    "繒纊": "上疾綾反下苦謗反說文曰繒帛也纊綿也小雅曰絮之細者曰纊也",
    "迫窄": "上博陌反切韻逼近也考聲附急也古文作皈下又作迮側伯反切韻陿也亦迫也",
    "洗滌": "上先禮反又作洒字書洗盪也刷也下徒曆反切韻淨也除穢也又盪滌也",
    "開闢": "上苦哀反韻集云解也張也字從門幵聲幵音牽下房皃反切韻開也舜曲曰闢四門孔傳云開闢四方之門說文云從門辟聲也",
    "瑩徹": "上又作鎣同烏定反切韻鎣飾也考聲云光也下直列反切韻徹通也明也字書云道也達也作徹俗",
    "禦捍": "上魚舉反切韻禁也止也考聲云應當也爾雅云禦圉禁也郭注云禁制也圉音語下胡肝反玉篇云抵捍也旰古案反",
    "婀字阿可反　攞字盧可反。": "阿可反盧可反",
    "哆字": "多可反已上三字皆梵語作觀祕門不求字義",
    "咸綜": "上胡嵒反切韻云皆也同也下宗送反說文云機縷持交絲者也從糸宗聲糸音覓",
    "癲癎": "上丁堅反廣雅云癲狂也毛詩箋云癲病也聲類云癲風病也或作瘨下音閑集訓云小兒癲病說文云風病也從疒間聲或作𤺛亦通",
    "鉛錫": "上與專反玉篇鉛青金也尚書云青州貢鉛說文云從金㕣聲經文作鈴俗字下先戚反亦鉛類也爾雅云錫謂之鈏郭璞注云白鑞也說文云鋃錫之間從金易聲也鈏音弋忍反",
    "讖緯": "上楚𧮂反釋名云讖纖也謂其義纖微也下緯字前已釋",
    "該練": "上古哀反廣雅云咸也包也切韻云備也古文作眩字下練字桂苑珠叢云煮絲令熟曰練鎔金作鍊字",
    "沃田": "上烏酷反切韻云地肥美曰沃顏注漢書云沃謂溉灌也",
    "鬻金": "上余六反切韻云賣也說文作鬻從毓聲也毓音與上同",
    "補特伽羅": "舊經云富伽羅亦云弗伽羅舊翻爲數取趣謂諸有情數造集因數取苦果又云或翻爲入言捨天陰入人陰等",
    "奢摩他": "梵語也此云止",
    "毘鉢舍那": "梵語此云字觀也案止觀卽定慧二名也如前新花嚴音義已釋",
    "關鑰": "上古還反說文曰以橫木持門曰關從門𢇇聲也經文作閞音弁爾雅曰閞謂之槉非此用下羊斫反說文作𨷲謂關之鎻也或作籥非也",
    "搏噬": "上補各反切韻云手聲也爾雅曰暴虎徒搏也郭注云謂空手執也下時制反切韻齧噬也又建也從口筮聲也",
    "犗牛": "上古邁反切韻牛去勢曰犗卽犍牛也從牛從害聲也",
    "紹繼": "下古詣反爾雅曰紹胤嗣續係繼也說文從糸㡭會意字㡭古文絕字經文作繼或作継皆不成字也",
    "浣染": "上又作澣胡管禮記云浣衣濯冠也下如撿而贍二反切韻染物也字書云以色染繒也",
    "佷戾": "上胡懇反切韶佷亦戾也下郎計反切韻云乖也尚書云罪也爾雅云辜辞戾辜也說文云曲也從犬出戶下也",
    "草積": "下子賜反切韻云委積也說文云聚也正作𥢼從朿音㓨聲也字書相承肄省作積亦音子惜反經文從草作𧂐俗字",
    "青瘀": "下於據反考聲云謂皮肉中凝血也文字典說云積聚血也",
    "尒燄": "梵語也此云所知花嚴七十七云過尒燄海也菀法師釋云謂智所知境非預識境共轉也",
    "哽噎": "上古杏反下烏結反氣塞也玉篇云如骨在喉也律文作咽音烏見反又音烟非哽噎義也",
    "穽陷": "上疾政反古文作阱阮也書云敜乃穽字書云陷獸曰穽下戶蘸反切韻云入也隤沒也考聲云墮也說文作臽小阮也蘸音㽵陷反臽字從⺈在臼上也⺈音人諂燄之類皆從此或從爪作舀音羊小反韜蹈之字於此敜音躡",
    "利鐮": "下力炎反切韻刈刀也釋名云鐮廉也取其廉薄也從金廉形聲字也經從兼作鎌俗用字也",
    "金錍": "下府移反切韻云錍鏃之薄者也又音疋迷反今按金鎞合作釵鎞之鎞也",
    "鉗鑷": "上儉嚴反合作鈷說文云䥫夾也鉆取物者也經文作鉗乃小兒䥫枷也下黏輙反合作銸說文云銸亦小鉆也從金耴聲耴音同上經文從聶作鑷車下䥫纂也二字皆非經義",
    "貿易": "上莫侯反爾雅曰貿賈市也考聲貿買也又交易也下音半益反謂交還貨易也說文從日勿聲也",
    "支提": "梵語也或云制底或云制多皆訛略應云制底耶此翻爲積聚謂於如來涅盤及說法經行等處起塔廟臺閣令無量人天積集福善之所此義翻也舊亦翻爲高墳或云靈廟",
    "瘢痕": "上簿官反切韻瘡瘢也下戶恩反切韻瘢痕也考聲瘢之微者曰痕也",
    "沈溺": "上直林反切韻沒也字書濁也又下也說文從水冘聲也冘音淫經文作沉非下正作溺古文作㲻同乃歷反說文溺亦沒也從人沒在水也",
    "鎧仗": "上苦亥反切韻云甲之別名也字書從金皚省聲下直兩反字書云儀仗也",
    "銷秏": "上相焦反切韻云鑠金也亦冶金也作消盡也滅也下呼倒反玉篇減也又損也或云秏亦稻屬今不取",
    "竄伏": "上倉乱反玉篇曰竄謂逃藏也廣雅云隱匿也說文云從鼠在穴中則竄矣下伏字按說文從犬從人云犬見人則伏矣",
    "卵㲉": "上落管反玉篇鳥卵也說文云無乳生㲉者曰卵也下苦角反切韻云鳥卵㲉也說文云從卵𣪊聲𣪊音同上有本作聲甚乖於義",
    "貓貍": "上莫交反詩云有貓似虎切韻云捕鼠獸也下力之反切韻云野貍也爾雅曰貙似貍郭注云貙虎類也大如猫文如貍也二字皆從豸經文從犬作猫狸非正字也",
    "礠石": "上疾之反切韻礠石可以引針也",
    "延齡": "上似然反爾雅曰永承引延長也下歷丁反廣雅曰齡年也禮記云古者謂年爲齡",
    "滲漏": "上所禁反水潛沒也下盧候反字書云漏落也又刻漏以銅盤盛水滴漏百刻以定晝夜也",
    "金屑": "上金字說文曰五色金也黃爲長久薶不生百鍊不輕從革不違西方之行生於土從土今左右注像金在土中形今聲下先結反切韻盡也清也不安皃按經意合作糏粖之糏",
    "三摩鉢底": "梵語也此云等至琳菀二法師云謂由加行伏沈掉力至其受位身心安和也亦云等持謂平等持心也",
    "法螺": "下盧和反俗字也正作蠃說文介蟲也經作𧋠音禮皆非法蠃字",
    "平坦": "他袒反說文云坦安也廣雅云亦平也論語云君子坦蕩蕩是",
    "陿劣": "上咸甲反顧野王曰陿迫隘下廣大也說文曰從阝匚夾聲也經文從犬作狹乃習犬馬也非經意下戀惙反考聲云弱也少力也會意字也古文作乎阝音𨸏匚音方夾音田",
    "霈然": "上普蓋反雨盛皃切韻云霶霈也說文從雨沛聲沛音同上",
    "卉木": "上許貴反七詩云卉木萋萋也傳云衆也爾雅云卉草郭注云百草惣名也說文從三屮作芔二屮爲艸也屮丑列反草本初生之形也艸今爲廾音草",
    "燈炷": "下朱遇反近代字也案陸氏釋文切韻許慎說文玉篇字林古今正字並無唯孫緬廣韻收在注字內",
    "踈勒國": "梵語訛略也正云佉路數怛勒此翻爲惡性國以其國人性多獷戾故或云彼國有佉路數怛勒山因山立稱也在北印度境也",
    "乾陁羅": "上音䖍舊云健䭾羅此云持地昔此國多有得道聖賢住持其境不爲他國侵害故也又云香氣邏謂此國多生香氣之花遍其國內以爲名也其國在中印度北北印度南境也",
    "迦濕彌羅": "或云迦葉蜜羅舊云罽賓訛略也此翻爲阿誰入謂此國未建時有大龍池人莫敢近其後有羅漢見地形勝宜人居止從龍乞容一膝地時龍許之羅漢變身漸大膝滿龍池龍以言信捨之而去羅漢復以神力乾竭其水遂建城郭衆人咸言我等不因聖師阿誰得入故因此語乃立國名其國北印度境也",
    "披緇": "上敷羈反說文云開也散也或作帔襜也巾也又作被音平義反服也加也衣也今合從後作下側持反說文云緇黑色繒也論語云涅乎不緇注云涅謂黑泥可以染皂者也涅音奴結反從水日炙土也",
    "鄔波𬽓耶": "鄔烏古反𬽓亭也反正梵語也舊云郁波弟耶此云近誦謂以弟子年小不離於師常近隨逐受經而誦也或翻爲親教龜茲于闐等國訛云和闍或云鶻社今云和上本非梵語亦非唐言蓋䓗右諸國訛轉音耳也",
    "蒙鞮": "下都奚反非正梵語蓋罽賓國寺名也未詳翻對案鞮字履屬也",
    "拗怒": "上於六反廣雅云拗止也又烏絞反今不取案錄文云時首領普告衆曰誰將舍利異寶不爾龍神何斯拗怒有卽投入海中無令衆人受茲惶怖據此卽龍神方怒未止應作彧字說文云吹氣聲也從欠彧省聲彧音同上",
    "僅全": "上渠靳反切韻云能也少也顧野王云僅纔也下正作全音疾緣反韻英云完也說文云具也從工亼會意字也亼才入反三合之形也",
    "那爛陀": "或云娜那爛多西域寺名也此云施無猒西域記云歷代帝王共建合爲一寺東闢其門常供千僧自興建已來未有一人犯間疑者故五印度境捨施無猒因以爲名也在中印度境",
    "泠泠": "郎丁反序中人名不求字義",
    "提堤犀魚": "次都奚反三音西非印度言龜茲語也此云蓮花精進彼國三藏法師名也",
    "郭昕": "下許斤反人名也案字日欲出也釋名云昕者忻也言皎日將出万物忻然也",
    "滴霤": "上都歷反切韻云水滴也說文云涯也從水滴省聲也下力救反案滴霤合作溜說文云水溜也字書云小流也今作霤說文云霤神名也非此用",
    "程鍔": "上直貞反人姓也本自顓頊重黎之後周宣王時程伯休甫入爲大司馬封于程後以爲氏也下五各反人名也案字劒口端也說文云從金咢聲也咢音同上",
    "所齎": "下相兮反切韻付之考聲云遺也字林云送物也又裝也說文從貝齊聲俗作賷非也",
    "鍊冶": "上音郎甸反又作煉說文云銷金也從金柬聲柬音揀從束八下羊者反切韻銷金也尹子曰蚩尤作冶說文從仌音氷台音怡考聲云氷熱則冶遇寒則疑也",
    "悅豫": "上翼雨反玉篇云樂也爾雅云悅服也孝經云敬一人則天下人悅說文云從心說省聲也下羊茹反韻集云備也先也爾雅云豫樂也尚書云王有疾弗豫孔傳云伐紂明年武王有疾不悅豫也",
    "珂貝": "上恪何反玉篇珂螺屬也出於海者其白如雪所以纓馬膺也下博蓋反亦珂類也爾雅曰貝居陸𧷼在水者蜬郭注云水陸異名貝中肉如科斗但有頭尾耳說文貝像形案貝古者用以市物也故財貨買賣之流皆從貝也𧷼音標蜬音含也",
    "璧玉": "上必益反爾雅云肉倍好謂之璧璧大六寸謂之瑄郭注云肉邊也好孔也白虎通曰外圓像天內孔方法地君執爲信以祭天也下語欲反爾雅曰以玉者謂之珪禮記曰執玉不趨舜典曰修五禮五玉孔注云五等諸㑦各執其玉白虎通云玉像君子之德燥不輕溼不重也說文云玉有五德",
    "資糧": "上卽夷反玉篇助也切韻云資亦貨財也下呂張反亦作糧案資糧謂諸大士欲趣菩提涅盤二轉依果先修福德智慧二種資粮也",
    "麤獷": "上倉蘇反正體字也俗作鹿鄭注禮記云麤疎也廣雅云惡也說文云從三鹿下虢猛反集訓云如犬獷惡不可近也故從犬經或作礦字非也",
    "蜇螫": "上陟列反字書云蠍蜇蜂蠆毒也古文作虻下商隻反切韻蟲行毒也云地有螫毒不可觸其尾考聲云螫噬也嚙也古文作蠚",
    "磣剌": "上楚錦反又作墋說文云土石砂參也經文作磣非下郎遏反上言磣下剌令作糲切韻云麁也米之脫粟者也作此剌字𪿢也戾也非磣糲義也",
    "捺落迦": "梵語也或云那落迦此云苦器或云苦具卽治罰罪人之器具地獄總名也故俱舍論云此下過二万無間深廣同上七捺落迦八增皆十六",
    "湍馳": "上他端反說文云淺水流沙上也字書云疾瀨也音落大反下直离反玉篇云馳逐也字書云馳騖也說文疾也從馬池省聲也",
    "淪溺": "上力迍反字書沈也沒也爾雅曰小波爲淪郭注云謂薀淪也下乃曆反切韻云溺水也說文沒也從水弱聲也古文作㲻云人墮水也",
    "灘渚": "上他單反爾雅云太歲在申曰涒灘玉篇河灘也方言云江東呼水中沙堆爲潬河北呼灘下章與反爾雅云水中可居者曰洲小洲曰渚又作陼字涒音他昆反",
    "蚊蚋": "上音文莊子云蟭螟巢於蚊眉下而稅反小蚊蚋說文云秦人謂之蚋楚人謂之蚊通俗文云蜎化爲蚋也蜎音血緣反又作蚉蜹二形",
    "𧏙蜋": "上去羊反下呂張反爾雅釋蟲云蛣𧏙𧏙蜋郭璞注云黑甲蟲也噉糞土者",
    "策勵": "上楚革反韻集云謀也籌也顧野王云馬撾也釋名曰策者教令於上駈策諸下也下力制反字書云兔也廣雅云勸勵也說文云力也從力厲形聲字厲音同上猛也列也又嚴整也",
    "慍暴": "上於問反切韻云怒也論語云人不知而不慍何晏注云慍怒也凡人有所不知君子不怒下蒲報反五經音義云謂侵暴說文云從日共音拱水音別作暴經文從田恭作暴甚乖字義也",
    "箭鏃": "下作木反爾雅云金鏃翦羽謂之鍭郭璞注云今之錍箭是也鍭音侯錍音批",
    "溟渤": "上莫經反考聲云深也山海經云北海謂之溟說文云從水冥聲下蒲沒反玉篇渤澥也字書云海水渤渤然也",
    "厚膜": "上胡口反切韻云重也廣也下音莫字統云皮內肉外謂之膜說文肉間䀭膜也䀭音古衰反",
    "纏裹": "上直連反考聲云繞也束也說文云纏約也從糸廛聲下光火反考聲云包也說文云裹纏也從衣果聲也俗作畏訛略字也",
    "印璽": "上正作𤓲釋名曰印信也因也封物因付信也下斯氏反蔡雍獨斷曰天子之璽以玉󱷉虎劒古者諸侯共之月令曰秦以前諸侯鄉大夫皆曰璽自茲以降天子獨稱璽諸侯不敢用也傳璽譜云秦王子嬰上高祖傳國璽李斯所篆其文曰受命於天帝壽永昌也󱷉音勅支反",
    "蟲𡹆": "上直躬反說文從三虫音許鬼反並二虫爲䖵音昆爾雅曰有足謂之蟲無足謂之豸音文爾反今俗借虫爲蟲下徒沃反切韻痛也害也考聲云苦也說文云從屮作𡹆屮音母列反",
    "呪詛": "上又作祝或作詶同之受反說文云詶亦詛也下側據反古文作樝釋名云祝屬也謂以善惡之辞相屬著也詛謂使人行事阻限於言也說文云從言且聲且音子余反經從口作咀音才與反謂嚼也非此用",
    "眩瞖": "上玄絹反賈注國語眩惑也蒼頡篇示之不明也說文云目無常主下於計反郭璞云瞖掩覆也考聲云目中瞖也說文云從目殹聲也音一奚反經文從羽作翳非眩瞖義也",
    "溉灌": "上基懿反韻英云澆灌也說文溉示灌也顧野王云溉猶灌注也下古玩反切韻云漬也亦澆灌也二並形聲字",
    "號嘷": "二字同音胡刀反上號爾雅曰舞號雩也說文哭也作唬同下嘷玉篇叫也說文作獋虎怒聲也亦作󱾅字也",
    "喟歎": "上口愧反說文大息歎聲又作㕟爾雅曰息也又音口恠反下他旦反切韻云歎息也又作嘆傷也",
    "吁嗞": "上況于反切韻疑恠之詞也下子之反切韻云嗞嗟憂聲也爾雅作咨云嗟咨𨲠也郭注云今河北人云嗟歎𨲠音嗟",
    "廁填": "上初史反切韻廁間也下唐賢反宜作瑱字漢書訓纂云謂珠玉𡑅坐爲飾也又音唐見反今經作填乃是填塞之填非間飾義",
    "瞬息": "上式𨳝反說文云目動睫也考聲云目搖動也謂眸子轉也又作瞚眴義同下相卽反藥證病源云凡人晝夜共一萬三千三百息一息有差卽爲病矣梵云阿那鉢那此云出息入息也",
    "遽務": "上渠預反賈注國語云遽疾也玉篇云遽急也下亾遇反切韻事務也爾雅云騖務強也郭注云馳騖事務皆自免強也",
    "駛流": "上所吏反蒼頡篇云駛速疾也從馬史聲也經文作駛音古穴反駃騠馬名非駛疾義下流字說文從水從㐬音他忽反倒㜽也㜽音子經文作流非也古文又作㳅騠音柱奚反良馬也生走乃母",
    "那庾多": "中音以主反梵語或云那由他西域數名也此土憶",
    "幽邃": "上於虬反切韻深也隱也爾雅曰幽深也說文從山𢆶聲𢆶音同上說文云微也下私醉反說文云邃深遠也古文又作㥞音訓同",
    "羈繫": "上居宜反釋名云絡馬頭曰羈縻馬足曰絆下古詣反玉篇云繫縛也又閇也",
    "誨誘": "上荒外反韻英云訓也教也論語云誨人不倦也下與久論語云循循善誘人也玉篇云引導也切韻該也音古泫反泫胡詃反又教也說文從言秀形聲也",
    "暉昱": "上許歸反切韻曰光也又作輝輝皆同下余六反爾雅云昱明也切韻云光也說文從日立聲",
    "靉靆": "上音愛下音代埤蒼云靉靆翳薈雲興盛皃切韻雲皃通俗文云雲覆日爲靉靆也薈音烏外反",
    "駭蹙": "上閑揩反廣雅曰駭起也夫驚者其心必舉舉卽起也說文從馬亥聲下子六反切韻云促近也說文云迫急也從戚足聲也",
    "棽儷": "上勅林反玉篇曰木枝而儷也說文木長儷也從林今聲下郎計反字統云伉儷也亦宏壯也棽又音森林二音今並不取",
    "摩䤈": "下又作醯同呼鷄反梵語也具足應云摩醯首羅此云大自在也卽色界主大自在天王是也",
    "鈿廁": "上徒年反玉篇金花鈿也下初吏反切韻云閒下也說文云雜廁也",
    "刹別": "上案玉篇音初八反案經合作差字故經云種種欲樂勝解差別今云刹別恐因聲誤寫請諸高識再詳經意",
    "無怙": "上亾夫反古文奇字作无像天屈西北角也有本作旡音旣非无字也下胡古反爾雅曰怙恃也詩云無父何怙無母何恃",
    "忿恨": "上正作忿音𢾭粉反切韻怒也亦音𢾭問反下胡艮反切韻恨怨也恚也",
    "竝將": "上音滿逈反正體並字也切篇比也說文云二人同立也下卽羊反爾雅曰將送也考聲將大也助也說文云從󱱸寸爿聲也󱱸音肉爿音牆經文作捋俗字非正",
    "噫夫": "上於其反切韻憶也考聲云恨聲也鄭注禮記云噫不寤之聲也下房無反考聲云語端之詞禮記曰夫爲人子者又曰夫三年之喪又曰夫不舍晝夜皆語端也",
    "筌蹄": "上七緣反說文取魚竹籠也亦名魚笱音苟從竹全聲下束奚反說文作蹏莊子云筌所以取魚得魚而忘筌蹄者所以取免得免而忘蹄也",
    "逵路": "上求危反爾雅曰九達謂之逵郭璞注云四道交出復有傍通下洛故反爾雅曰一達謂之道路郭注云謂長道也逵又作馗音訓同",
    "耆闍崛山": "上音祇次視遮反梵語訛略也正云姞粟駄羅矩吒此云鷲峯亦云鷲臺此山峯多棲鷲鳥又類高臺故以爲名姞音巨乙反",
    "或祼": "下古玩反詩云祼將於京論語云楴自旣祼孔注云酌鬱󱵨以祼太祖與灌同訓案經序云潛導之功或裸於理說文祼字從示音灌神祇禱祝祭祀之類皆從示今序從衣作裸音華瓦反謂脫衣露體也智者詳之",
    "醴泉": "上來啟反爾雅曰甘雨時降萬物以嘉謂之醴泉瑞應圖曰王者飲食純和則醴泉出飲之令人壽東觀漢記云光武中元元年醴泉出京師飲之痼疾皆愈說文從酉豊聲也",
    "醍醐": "上徒奚反下戶姑反說文作䬫餬二形云酪中出酥酥中清液也案本草治熱毒去衆風疾涼藥也",
    "阿若憍陳如": "上鳥葛反次如者反梵語訛略也應云阿若多憍陳那阿若多此云解也以初解法故先彰其名憍陳那是婆羅門姓那是男聲顯從其父故新翻經云解憍陳那是也",
    "阿史波室多": "梵語也舊云阿濕縛此云馬勝羅漢名也",
    "澄澈": "上直陸反字書澄水清也下直列反爾雅曰波澈也說文澈亦澄清也從水撤省聲",
    "薜舍": "亦梵語也薜毘桂反或云吠舍此云𧷮主雖有大福多有珍財不能通達典墳貨遷蓄積或賜封邑多爲長者榮鎮國界以救貧乏",
    "戊達羅": "上式句反亦梵語也舊云首陁訛略也此之一姓務於田業耕墾播植賦稅王臣多爲民庶並是農夫寡於學問四姓之中最下也",
    "蠶繭": "上雜含反說文紝絲也從䖵朁聲經文作蝅蠶非或作蚕音天顯反蚯蚓之類甚乖字義下古典反說文從虫糸󱷑像繭蛾之形三啟經云譬如蠶作繭吐絲還自縛也經作蠒非本字也",
    "蘇迷盧": "舊云須彌或云彌樓皆訛也正云蘇迷盧此云妙高山琳引俱舍論云東面白銀北面黃金西面頗黎南面青琉璃大論云四寶所成曰妙出過衆山曰高亦名妙光謂以四色寶光明各異照世故名妙光出水八万踰繕那量也",
    "瞻蔔迦": "舊云瞻蔔正云瞻博迦舊翻爲欝金花大論云黃色花也其樹高大花氣遠聞西國多有此樹也",
    "極爆": "上極字說文從木亟聲亟從二人又口云人在天地之間所急者莫越手口二卽天地也勹古人字又卽手也下補教反說文爆灼也廣雅熱也考聲燒柴作聲火烈也韻英云火灹也韻詮火烈聲也",
    "胷臆": "上許容反說文云胸膺也下於力反切韻胸臆也臆亦膺也或作𩪣謂胷骨也亦作匈字",
    "沈淪": "上直林反切韻沒也考聲濁也說文從水冘聲冘音淫經文作沉音胡浪反非本字下力迍反爾雅云大波爲淪切韻淪亦沒也考聲云溺也說文云從水侖聲侖音同上也",
    "盲龜": "上武庚反切韻無目也文子曰師曠瞽盲也字書云盲無所見也下居追反說菀曰靈龜五色似金似玉背陰向陽上高像天下平法地大戴禮云甲蟲三百六十四神龜爲之長爾雅曰一曰神龜也山海經云大苦山多三足龜",
    "吮乳": "上徐充反韻英云嗽也從口允聲經作呪草變字下儒主反切韻柔也酪屬也考聲㚷汁曰乳說文從乙孚聲",
    "瀑漲": "上薄報反爾雅曰瀑雨謂之涷郭注云江東呼夏月瀑雨爲涷雨也涷音東下知亮反切韻大水滿也說文水盛也從水張形聲字也",
    "矛矟": "上莫侯反呂氏春秋云蚩尤作矛考聲酋矛戈之類也說文矛長二丈建於兵車也有作鉾俗字下雙卓反博雅云矟亦矛也古今正字矟長丈八尺文字典說今之戟矟也有作槊㮶皆非正字",
    "髓惱": "上雖柴說文骨中脂也從骨隨省聲下能老反文字集略云頭中髓也說文匘字從匕從囟囟音信小兒𡍗會也從巛巛像髮上謂相上著也今經作腦字或作𣎗𦠊腦𰈐󱹟五形皆訛謬字也",
    "蚊蝱": "上勿汾反方言云秦謂蚋爲蚊齧人飛蟲子也說文作蟁吳音閩經文作蚉俗字下莫耕反聲類云蚊蚋之屬也似蠅而大說文山澤草花中化生也亦生鹿身中大者曰蝱小者曰󱯑音蹔也",
    "攢鎽": "上在桓反切韻合也字統云攢聚也謂合聚一處也下敷容反韻集云劒刃也考聲鎽利也銳也從金峯聲也",
    "象蹋": "上徐兩反爾雅曰南方之美者有梁山之犀象焉郭注云大獸也長鼻大耳三歲一乳或作𤉢下徒合反韻英云蹴也考聲足踐也經作踏音他合反著地行也非經意又作踏不成字也",
    "船撥": "上述緣反方言云自關而西謂舟爲船說文船舟也從舟沿省聲下煩靺反考聲云縛竹木浮於水上集訓云木橃也或作筏栰俗謬也古作𦪑字",
    "萎悴": "上於媯反韻英云萎蔫也說文從草萎聲言草委在地也下情醉反案萎悴宜作瘁顇爾雅云病也悴憂也經作忰俗字",
    "螻蟻": "上勒候反下又作螘同音宜豈反小雅云大者蚍蜉亦大螘也小者螘子說文爾雅皆從豈作螘經從義作蟻俗字今俗通揔呼螻蟻一云大曰螻小曰蟻子也",
    "迦蘭陁": "梵語也或云迦蘭多或云迦蘭鐸迦此云好聲鳥謂此竹林多棲此鳥故以爲名在王舍城也",
    "貨鬻": "上呼臥反切韻賄貨也字書云市財也亦賣也從貝化聲下余六反切韻鬻賣也爾雅曰鬻縻也說文作鬻從毓鬻省聲也",
    "廛肆": "上直連反正體字也經文作䣑或作㙻𫮈二形皆訛案周禮云廛謂市中空地也考聲一畝半也韻英云居也下息利反爾雅曰肆故今也廣韻陳也放也亦作肆也",
    "蔓延": "上無怨反韻英蔓謂苽𤫸之苗也下延爾雅曰延長也延引也案蔓延如蔓草連延長引不絕也下延又作莚音餘戰反廣雅云蔓長也莚遍也二字皆從草",
    "蓬勃": "上蒲公反亂也下蒲沒反勃盛也案如蓬草之亂盛也今經文作熢㶿二形上音峯謂𠋫望者夜火也字書無蓬音下㛘煙起也若塵起作𡋯若香氣作馥若心逆者作悖若水廣浡非亂盛卒起皃也今合作蓬勃也",
    "牝馬": "上頻忍反爾雅曰牝曰騇郭注云草馬名也魏志云教民畜㹀牛草馬也詩云騋牝三千也下馬字說文像形也頭尾四足王在其上也騇音舍騋音來",
    "槌胷": "上直追反俗字也正作椎說文擊也從木隹聲下勗恭反說文膺也亦作匈字書云椎胷者悲恨之極自毀其身也",
    "鉾矟": "上正作矛音莫侯反下雙卓反前第二卷經中已訓釋訖",
    "霹靂": "上普擊反下郎擊反說文云霹靂折震戰也所擊輙破若攻戰也字書云迅雷也二字並從雨辟歷皆聲也",
    "阿練若": "或云阿練兒或云阿蘭若或云阿蘭那皆梵語訛轉耳正云阿蘭孃義譯云寂靜處或云無諍地所居不一或住砂磧山林壙野或塚間寒林皆出聚落一俱盧舍之外遠離喧噪之處也",
    "優曇": "下徒含反梵語也或云烏曇應云優曇鉢羅此云妙瑞花或云祥瑞花人間本無天妙花也或時一見",
    "隙光": "上綺戟反切韻閑也考聲壁孔也說文空閑皆曰隙從阜曰上下小也經文作隟或作隙皆非下古皇反爾雅曰光充也切韻明也大也顯也古作光字",
    "飛蛾": "上甫非反切韻飛翔也說文云如鳥飜飛像形字也經本有作蜚音費臭蟲也下五何反大戴禮云虫食桑者有絲而變形而飛爲蛾也說文從虫我聲也",
    "牝鹿": "上頻忍反爾雅曰鹿牝麚牝麀其子麛案別雌雄辨子母也麚音加麀音於牛反麛音迷下鹿字正從比",
    "芳餌": "上𢾭亾反考聲芳草之香者也又美盛也下仍吏反韻英食也說文云粉餅也從食耳聲也",
    "牆壁": "上疾良反說文垣也五版爲堵釋名云牆障也所以自障蔽也從嗇爿聲經作𭎷𡓜墻皆非下比激反說文屋牆也釋名曰壁辟也謂辟禦風寒也從土辟聲",
    "坏瓦": "上芳杯反說文云未燒瓦器也下五寡反又作瓦像形也古考史曰夏時昆吾氏始作瓦也",
    "蝦蟆": "上胡家反下莫遐反切韻水蟲也又作蜝本草云蝦蟆一名蟾一名去𪓰爾雅云鼁𪓰蟾蜍郭云似蝦蟆居陸地淮南謂之去蚊音甫",
    "洟唾": "上他計反切韻云鼻洟也說文云鼻液也從水夷聲也律文從弟作涕音他禮反說文云目汁也非洟唾義下託臥反說文云口液也禮記曰讓食不唾說文云從口埵省聲",
    "猿猴": "上王元反爾雅作蝯云猱蝯善援郭注云便攀援也下音侯獮猴也從犬侯聲也",
    "埃坌": "上烏開反說文細塵也從土矣聲下滿悶反考聲汚也字書塵埃著物也",
    "青蠅": "下餘陵反考聲云飛蟲也鄭箋毛詩云蠅之爲蟲汚白色使黑喻佞人變亂善惡也又曰白珪之玷尚可磨也斯言之玷不可爲也",
    "吠憚": "真言中字也上借音微一反下音但不求字義",
    "炳曜": "上兵永反考聲明也說文煥明也從火㐁形聲字下弋肖反韻英云日光也切韻照也又作耀燿二形光耀炫燿也",
    "沙滷": "上所加反爾雅曰渾沙出郭注云江東呼水中沙堆爲潬西有沙州卽鳴沙山也下郎古反爾雅曰滷苦也郭注云謂苦地也案沙漠鹹滷之地也二字並合從水經文作砂乃砂石也作鹵乃鹵簿樂名引天子車駕者也並非沙滷字也",
    "羯邏": "上居謁反下盧賀反梵語不求字義",
    "拊擊": "上孚武反切韻拍也下古歷反切韻打也尚書舜典曰擊石拊石百獸率舞孔傳曰拊亦擊也二字並從手付毄皆聲也",
    "癡膜": "上丑之反切韻癡愚也下幕各反切韻肉薄皮也考聲云皮內肉外曰膜從肉莫聲",
    "叢林": "上族公反說文叢聚也從丵音士角反取聲也",
    "莽字": "上莫朗反說文上下草犬在中也經作莾俗字",
    "滌垢": "上徒歷反切韻淨也玉篇除也考聲云洗滌也說文從水條聲也下古厚反韻英云塵也考聲染汚也說文垢圿也從土后聲圿音姧八反",
    "怡暢": "上與之反切韻和樂也爾雅曰怡懌悅欣樂也下丑亮反玉篇通暢也韻英云達也脉經云膓爲膓氣之府也從申膓省聲",
    "諦聽": "上都計反說文云諦審也從言帝聲下他定反考聲待也說文云審也字書謀也又聆也說文從𢛳耳壬聲也𢛳音得壬音他頂反謂以耳審得其聲也壬卽聲又他丁反",
    "瀑流": "上蒲報反切韻瀑雨也蒼頡解詁云水濆起也說文從水暴聲下流字說文從水㐬音他忽反㐬倒書㜽字也㜽古文子字也",
    "危險": "上魚爲反玉篇云隤也字書云殆也考聲亦險也字林云從人在厄上下虛撿反說文危阻也韻集云險難也又邪惡也從阜僉聲",
    "憍陳如": "上舉喬反略梵語也具足云阿若多憍陳那阿若多此云解也謂最初悟解法故以彰其名憍陳那婆羅門姓也那是男聲顯從父得新譯經云解憍陳那是也",
    "多陀阿伽度": "或云阿伽度梵語魯質也正云怛他誐多此云如來十号之中第一号也",
    "阿羅訶": "下音呵梵語訛略也正云遏囉曷帝此云應供謂應受人天妙供故卽十号之中第二号",
    "三藐三佛陀": "藐本音莫角反爲就梵語借音彌藥反正云三藐三沒駄三字去聲此云正等覺亦云正遍知卽第三号也",
    "𭹀膳": "上正作珍陟隣反考聲貴也說文重也儒行云儒爲席上之𭹀也下時戰反說文食具也周禮云膳夫上士二人掌王之膳方言云膳美食也從肉善聲或作饍俗字非",
    "遲緩": "上直知反切韻久晚也爾雅曰遲遲徐也郭注云安徐也下胡管反切韻舒也爾雅曰綽綽爰爰緩也郭注云皆寬緩也說文從糸爰聲也",
    "謇澀": "上九輦反說文謇吃也謂語難也或從言作𧮈下色立反案澀字合從人作㒊字書云譶澀語不正也今從水作澀說文水塞不通也非謇㒊義譶音初音反",
    "𤺊破": "上先妻反說文病聲散也又作𧬊悲聲也經作嘶字書云馬鳴嘶也非𤺊破義也",
    "觱篥": "上卑吉反下力質反本胡樂名也毛詩云一之曰觱發二之日篥烈傳云一之日周之正月也觱發寒風二之日殷之正月篥烈寒氣也經文作篳篥二字同說文從竹畢栗聲也",
    "鶴唳": "上下各反說文鶴色白而喙長朱頂壽滿千歲神仙鳥也拘朴子曰鶴鳴九皐聲聞干天淮南子曰鷄知將曉鶴知夜半是也說文從鳥寉聲寉音何各反云從冖隹隹鳥也鳥飛高至欲出於冖音癸營反下郎計反切韻鶴鳴也",
    "蠃聲": "上洛戈反切韻𧉻屬也爾雅曰蠃小者蜬郭璞注云大者如斗出日南漲海中可爲酒杯說文從虫𣎆聲俗作螺或有作蠡二形並音禮鹿案蠃本古樂器名也吹以和樂故經中多云蠃聲或云法蠃用表法聲普聞含識",
    "谷響": "上古屋反切韻山谷也又養也老子云谷神不死是爲玄牝也又音欲下許兩反字林聲響也切韻響應也說文從音鄉聲",
    "藤蘿": "上徒登反字書云藤似葛而蔓生玉篇云藟也音壘下洛何反爾雅曰唐蒙女蘿女蘿菟絲也韻英云蘿蔓也上藤字經文作蕂音詩證反乃苣蕂字胡麻別名也非藤蘿義苣音巨",
    "羖羊": "上音古爾雅云夏羊牝羖郭注云黑羖䍽也或作𦍩字",
    "石礦": "上常尺反釋名云山體曰石下古猛反切韻金玉璞也說文未鍊金也從石廣聲有作𨥥紫𨥥藥名也經文從金廣作鑛俗用字也",
    "鈴鐸": "上郎丁反金鈴也切韻似鍾而小下徒洛反今大鈴也左傳金鈴木舌振於文教也又云上軍尉鐸遏𡨥也",
    "驎陁": "上良忍反下徒何反梵語也卽赤色花名案字驎青驪馬名",
    "辯捷": "上皮件反切韻引也理也字書辯惠也說文從言辡聲辡音辯下疾葉反韻英云速也勝也考聲疾也爾雅際接翜捷也郭注云捷謂接續也卽經中詞無礙辯也",
    "謇訥": "上九󱶊反說文語吃也從言褰省聲或作𧮈經文從足作蹇足跛也非此用下奴骨反字書亦謇也",
    "筏喻": "上房越反方言曰筟謂之箄箄謂之筏秦晉通語也案暫縛柴木水中運載者曰筏也又作撥𦪑箄音牌",
    "歌吹": "上古俄反切韻歌謠也詩云我歌旦謠爾雅曰徒歌謂之謠下尺僞反爾雅曰徒吹謂之和說文作籥",
    "株杌": "上知虞反韻英木根也考聲木本也下五忽反切韻樹無枝也說文二字並從木朱兀聲",
    "糠䴬": "上又作穅同苦崗反說文米皮也下與職反切韻麥䴬也卽麥上麁皮也",
    "閥閱": "上房越反下翼雪反考聲容受也字書云簡閱具其數自序功狀也史記云人㠯功有五各明其等曰閥積閥曰閱說文二字並從門伐悅省聲也",
    "掐珠": "上苦洽反切韻以爪掐物也說文從手臽聲臽音陷經文從舀作搯音他刀反非經用也舀音以小反",
    "臘沓子": "沓徒合反考聲合也說文從水音別與雜還字義同經文從水舊作沓或作沓誤書也案臘沓子者以五穀雜令一處用以加持如今俗言臘雜子也",
    "缾缸": "上薄經反字書云汲器也或作瓶下下江反切韻甖類也考聲云酒器說文從瓦作瓨古字也",
    "孽捙": "上魚列反下七何反正梵語也此云去阿孽捙云不去捙或作搓",
    "啞啞而笑": "上烏陌反顧野王云啞啞笑聲下私妙反說文大戴其竹君子樂然笑也經作㗛𠸍咲皆非本字傳寫誤",
    "旱澇": "上胡笴反笴各旱反切韻云雨少也說文云從日從干下郎到反玉篇水澇也切韻淹也或作潦又音老泊水也非此用",
    "饑饉": "上居疑反下巨靳反爾雅曰穀不熟爲饑蔬不熟爲饉郭注五穀不成也凡草菜可食者通名爲蔬又云仍饑爲荐郭注連歲不熟",
    "雷霆": "上魯𢌞反切韻雷電也易曰天雷無妄也論衡云陰陽氣繫成聲古文作靁下特丁反考聲云疾雷也字書迅雷也",
    "篡奪": "上初患反字書纂亦奪也韻英殺也說文從厶箕聲厶音私箕音筭云奪其君位事不敢公私而箕也下奪字說文正作奪強取也云手持一鳥大鳥在上𡙜去也從寸亦通無從木者",
    "逃竄": "上徒刀反字書云走也避也切韻亡也亦竄也下七亂反考聲藏也說文云鼠在穴中則爲竄矣也",
    "椰子": "上以遮反韻集云椰子果木名也其葉背面相類出交趾及海島子大者可爲器從木耶聲",
    "仆面": "上滿北反爾雅曰斃仆也郭注云謂前覆也亦作踣案仆面謂面覆於地也",
    "𦧇脣": "上神氏反切韻以舌取物也說文作舓俗又作舐訓同下食倫反切韻口脣也字書亦作𠼉字也",
    "拳手": "上巨圓反廣雅曰拳奉持也切韻屈手也從手卷省聲經文從足作踡字書云踡跼行不進也非拳手義",
    "咀沫": "上慈呂反切韻咀嚼也字林咀齧也亦作齟蒼頡篇咀噍也下莫割反卽水沫也案咀沫卽口中廷沫也",
    "阿闍梨": "中音士遮反梵語也或云阿遮梨正云阿折里耶此譯云親教謂親能教授諸餘學者故",
    "和尚": "正梵語㨶波地耶此云近讀謂此尊師爲弟子親近習讀者也舊翻爲親教良以彼土流俗云殟社此方訛轉謂之和尚相承旣久翻譯之者順方俗云",
    "摩䤈首羅": "梵語訛也正云麼䤈濕伐羅也麼䤈此云大也濕伐囉此云自在天也卽大自在天王也謂此天王於大千界中得白在故",
    "蠢動": "上尺允反亦動也爾雅曰蠢震動也郭注云皆搖動貌又曰蠢作也卽動作也說文云動也從䖵春聲會意字䖵音昆也",
    "屠兒": "上達胡反考聲屠殺也說文屠刳分割牲肉也下汝移反正從凶几上音信󱹵會也下音人云󱹵會未合人以承之",
    "田獵": "上徒年反正作畋白虎通云畋爲田除害故曰畋獵如經文作田非案字書作畋古者肉食取禽獸曰畋下良涉反爾雅獵虎也郭注云凌獵暴虐也從犬巤聲也",
    "駞驢": "上徒何反說文駱駞獸名外國圖云大秦國人身長一丈五尺好騎駱駞又作駝字下力居反切韻畜也漢書西域傳云烏桓國有驢無牛也",
    "猪狗": "上又作豬爾雅曰豕子豬也郭注云今亦曰彘江東呼狶禮記檀弓注云南方謂猪爲都字從豕都省聲下古厚反切韻犬也爾雅云犬未成毫狗也從犬句形聲字",
    "瘖瘂": "上飲今反說文不能言也瘖猶無聲也下烏賈反考聲云不能言也瘂人雖有聲無詞也古今正字瘂瘖也從疒亞聲疒女厄反",
    "芬陀利": "或云奔茶利皆訛正云奔䋈里迦此云白色蓮花也人間無亦出彼池",
    "鉢頭摩": "或云波頭摩或云鉢弩摩亦云鉢特摩皆訛應云鉢納麼此云紅色蓮花上者人間雖有不及彼池出者",
    "俱物頭": "或云拘牟頭亦云拘摩那梵音輕重也正云俱某陀此云赤蓮花亦出彼池人間希少",
    "颰陀": "土蒲鉢反梵語也古或云跋和正云跋捺羅此翻爲賢也或云賢善",
    "殑伽": "上疑等反下魚佉反梵語也舊云恒河是也卽無熱惱大池流出四河南面一也旋流一匝流入南海者涅盤經中恒河女神也案殑伽河神名因神彰名也慧菀慧琳皆作此說",
    "糝㡌地": "上乘感反次音冐梵語也舊云三菩提此云正等覺也",
    "葂憾": "上借音無遠反下胡感反梵音祕密不可翻傳也",
    "嘊喍": "上五佳反下音柴犬鬪也玉篇犬相啀也埤蒼云相啀拒也玉篇作齜𪘲褰脣露齒之貌也",
    "嘷吠": "上胡刀反古文作獋說文玉篇咆吠犬鳴也切韻熊虎聲也經文作號悲哭聲非嘷吠義",
    "腐爛": "上房武反切韻敗也字書臭也考聲朽也下郎肝反切韻火熟也從火闌聲",
    "卜筮": "上博木反尚書云我卜河朔孔傳曰卜必先墨畫龜然後灼之兆順食墨吉也下時制反說文蓍曰筮決也世本云巫咸作筮故從竹從巫也",
    "毘盧遮那": "梵語訛也應云吠嚕左曩舊譯云光明遍照新翻爲大日如來云如大日輪無幽不燭也",
    "阿閦": "下又作閦同初六反梵語不妙古云阿插一也應云惡蒭此云無動卽東方佛名也",
    "懶惰": "上亦作嬾同勒坦反下又作墯同徒臥反考聲云不勤也說文不敬也並從心賴隋聲也",
    "𣖳椎": "上渠焉反爾雅曰椹謂之𣖳郭注云斫木櫍也下直追反說文擊也從木隹聲經文作楗槌或作揵稚梵語薜吒迦此云所打卽或銅或木擊以警衆也",
    "瑩明": "上烏定反顧野王云瑩飾也考聲瑩光也亦明也或從金作鎣訓同明或作明又作明同",
    "纏縛": "上直連反俗又作纏切韻繞也考聲纏亦縛也又音直戰反下符約反切韻繫也字書縛亦纏也三啟經云如蠶作繭吐絲自縛也從糸博省聲也經作縛也爾雅云十羽謂之縛書誤也",
    "諂諛": "上丑琰反又作讇切韻諛也論語云非其鬼而祭之者諂也鄭注云諂媚求其福下以朱反說文諛亦諂也從言臾聲經文單作乃須臾字也",
    "休廢": "上許尤云切韻善也美也考聲息也說文從人倚木息也下芳肺反爾雅曰廢舍也郭注云舍放置也切韻止也經文作癈癈病也非休止義",
    "秉顯": "上兵永反爾雅曰秉拱執也說文云手持一禾曰秉下呼典反說文玉篇字林並云光也明也案經云五智秉顯宜作炳或作昞字未詳秉顯義",
    "濟拔": "上子計反切韻惠也定也爾雅曰濟渡也濟成也濟益也郭注云廣異訓各隨事爲義下蒲八反切韻擢也又盡也從手犮聲",
    "逼迮": "上彼力反切韻逼迫也考聲云逼近也下側伯反玉篇陿也亦迫也或作窄亦同",
    "登入": "上都勝反爾雅曰躋登陞也切韻進也禮記月令禾乃登卽成也",
    "裸形": "上華瓦反避俗諱作此音也案說文云本音郎果反顧野王云裸者脫衣露體也從衣在果邊也經文從身作躶亦作倮皆俗用字有經從示作祼音灌不達字義書誤也",
    "廝破": "上息妻反切韻病聲散也考聲云聲嗄也經作嘶馬嘶嗚也非破義",
    "綟急": "上練結反切韻云小結也字書拗綟也與捩意同下急字從人手心也云人之急者心之與手𠂊古人字彐古手字會意也",
    "詆債": "上又作詃同都禮反切韻呰也𧥮亦訶也考聲欺也毀也下側懈反切韻徵財也從人責聲",
    "拘賖梨子": "具足應云未伽梨拘賖梨子末伽梨是姓拘賖是母名也此外道計苦樂不由因卽自然外道",
    "毘羅𦙁子": "具足應云毘羅𦙁子珊闍邪毘羅胘母名也珊闍邪此云等勝此外道不須修道經八万劫自盡生死如轉縷丸也",
    "鳩駄迦旃延": "具足應云迦羅鳩駄迦旃延迦羅鳩駄此云黑領迦旃延姓也此外道應物而起人若問有答有若問無答無也",
    "富蘭那迦葉": "富蘭那此云滿也迦葉姓也此云龜氏此外道計無因也",
    "尼乾陀若提子": "尼乾陁此云無繼若堤母名亦云親友母名親友也此外道計苦未有定因要必須受非道能斷",
    "阿耆陁翅舍欽婆羅": "阿耆陁此云無勝翅舍欽婆羅此衣名此外道以人髮爲衣五熱炙身也",
    "皇矣": "毛詩傳曰皇大也匡也爾雅曰皇匡王正也下於紀反說文語已詞也從厶古文已字矢聲也厶音以",
    "綿絡": "上彌編反切韻微也歷也下音洛說文織絡亦䋄羅也從糸各聲",
    "羅罩": "上魯句反爾雅云鳥𮊁謂之羅下竹教反說文捕魚器也方言籠罩也說文羅罩二字並合從冈作也",
    "泳沫": "上音詠爾雅曰泳游也郭注云潛游水底也下滿鉢反考聲沫止也水上浮沫也又終也杪也二字形聲也杪音亾沼反",
    "五始": "案三五歷記云氣像未分謂之太易元氣始萠謂之太初也氣像之端謂之太始形變有質謂之太素也質形已具謂之太極也斯爲五始也",
    "徹枕": "上纏列反字書云徹去也除也考聲抽也說文通也從彳攴育聲也下之荏反韻詮云枕所以承頭也從木冘聲冘音淫彳音丑尺攴音普十反",
    "遏𡨥": "上安葛反蒼頡篇云遏遮也毛詩傳曰遏止也尚書云遏絕也下口搆反考聲寇賊也韻詮云盛多也說文暴也字書寶字從攴完",
    "著星辰": "上張盧反。周易曰玄像著明莫大乎日月也。禮記云著而莫息者天也。著而不動者地也。又曰著明也立也成也。古今正字從草署省聲。下星字古文作曐。說文云万物之精上爲列宿也。又星卽五星𨂷行二十八宿也。案七曜天文經云紫微太微于市三垣及列宿中外官惣一千四百六十四星應占用者辰卽北辰也。論語云爲政以德譬如北辰也",
    "緬尋": "上綿典反賈注國語反緬思也說文微絲也從糸面聲下徐林反字書常也考聲覓也逐也字從彐音手從口工寸會意也",
    "𡕆夫": "上於記反考聲云𡄻哀痛聲也入發歎詞也從壴次口作𡄻今序中從心作懿俗用字下夫音扶壴音竹句反",
    "波斯": "波斯匿王名梵語略也正云鉢羅犀那逝多此云勝軍卽請佛說內護外護之請主",
    "永袪": "下去魚反考聲云袪袖也集訓舉也韓詩云袪去也說文從衣去聲",
    "迺津": "上奴改反古文乃字也亦語詞也下井寅反鄭注周禮云津潤也爾雅曰津梁也廣雅亦津濟也",
    "緹油": "上弟矣反鄭注周禮云綠色繒也又云淺紅也說文帛赤黃色也下油謂絹油也古人用色絹油以書記事也",
    "大輅": "下洛故反白虎通云天子大輅也字書古者椎輪今飾之華麗也大戴禮云古之車輅蓋圓像天二十八轑以像二十八宿𨋏方像地三十輻像日月之數仰則觀天文俯則察地理前視覩鑾和之聲側視觀四時之運也釋名云天子所乘曰輅也以金玉象隨飾名之也",
    "𢯱綴": "上色鄒反考聲云𢯱求也索也下追衛反賈注國語云綴連也切韻續也說文從糸叕聲也叕音陟劣反",
    "褰裳": "上去乾反考聲云摳衣也尒雅曰深則厲淺則揭揭者揭衣也郭注云謂褰裳也揭音去謁反下市羊反字書上曰衣下曰裳也",
    "沃朕": "上烏酷反說文云沃灌也從水夭聲也下直稔反爾雅云朕我也史記云古者貴賤悉稱朕自秦始皇二十年始天子獨稱也說文云從舟作𦨶",
    "襲予": "上尋立反廣雅襲反也司馬彪注莊子云襲入也郭注尒雅云襲重也下以諸反尒雅曰予我也",
    "之籟": "下洛大反廣雅曰籟簫也大者二十四管長尺四十小者十六管長尺二寸有二底說文云三孔簫也從竹賴聲也",
    "欒棘": "上盧桓反禮記天子墓樹松諸侯栢大夫欒士楊說文欒木似欄從木鸞省聲下矜力反毛詩傳曰棘酸棗也郭注尒雅云顛棘葉細有㓨說文似棗叢生從二束廣雅云棘箴也東音㓨",
    "弼我": "上貧蜜反孔注尚書云弼輔也尒雅曰弼崇重也尚書大傳云天子方四隣左輔右弼前疑後承廣雅弼備也大戴禮云潔廉而切直匡過而諫邪謂之弼也說文云字從弜音巨支反從西音添念反或從攴作㢸或作𢐡字皆古文也",
    "良賁": "下彼義反韻集云賁微也又卦名也易曰賁亨小利利有攸往也案良賁者卽助譯仁王經沙門名也",
    "常衮": "下公穩反卽翰林學士姓名也",
    "握槧": "下才敢七艷二反釋名云槧版也長二尺韻詮云以版爲書記也說文牘樸也從木斬聲集訓云削版而記事者也又音僉字",
    "邃賾": "上雖醉反王逸注楚詞云邃深也下柴革反劉獻注周易云賾者幽深之稱也說文從𦣝責聲也𦣝音夷序文作顊賾俱非",
    "較然": "上音角考聲略也廣雅明也尒雅直也尚書大傳較其志見其事太玄經云君子小人之道較然見矣漢書云較然易知也",
    "鉤𡩡": "下所革反說文入家搜也從宀索聲考聲云取也求也今俗省去宀但從市從糸作索也宀音彌仙反",
    "躡金": "上黏輒反方言云躡登也廣雅履也說文蹈也從足聶聲也聶音同上",
    "惋撫": "上烏貫反考聲云歎恨也桂菀珠叢云驚歎而藏於心也下芳武反尒雅曰撫者掩也拍也",
    "旃蒙歲": "上之然反尒雅曰太歲在乙日旃蒙在巳日太荒落案唐帝年歷云代宗皇帝廣德三年甲辰改永泰元年二年乙巳卽旃蒙歲也到今統和五年丁亥得二百二十三年矣",
    "木槿榮月": "次巾隱反尒雅曰椵木槿也郭注云似李樹孫炎疏云花如蜀葵紫色朝生夕殞也此花夏五月方榮盛也仁王般若念誦儀軌前記云夏四月於南桃園乃譯此經",
    "鷲峯": "舊云耆闍崛山正梵云姞栗駄羅矩吒此云鷲峯或云鷲臺此山峯上多栖鷲鳥又類高臺故也在王舍城側說此經處也姞音巨乙反",
    "技藝": "上渠綺反切韻藝能也說文云從手支聲律文作伎非下魚祭反考聲云才也切韻能也廣雅云常也論語云遊於藝也",
    "比丘": "梵語不正也應云苾蒭此云怖魔一乞士二淨命三淨戒四破惡五也具此五義故存梵語不譯也",
    "比丘尼": "五義如前尼卽女聲",
    "優婆塞": "古梵語也正云鄔波索迦鄔波此云近也迦此云事也索是男聲卽近事男也謂受丑戒親近承事於三寶者也",
    "優婆夷": "正云鄔波斯迦鄔波迦如前釋斯是女聲呼也",
    "杻械": "上勅久反下胡戒反玉篇云桎梏也考聲云所以拘罪人也在手曰杻在足曰械竝從木丑戒聲也",
    "枷鎻": "上古牙反釋名云枷加也以木加於項也在手曰桎在足曰梏在項曰枷卽拘罪人五木也下蘇果反切韻鐵索也謂聯環也",
    "檢繫": "上居儼反廣雅曰檢匣也括也謂括束不得開露也又察也謂察錄繫縛也從木僉聲",
    "摩訶迦羅": "梵語也摩訶此云大迦羅此云黑經云摩訶迦羅大黑天神唐梵雙舉也此神青黑雲色壽無量歲八臂各執異仗貫穿髑髏以爲瓔珞作大忿怒形足下有地神女天以兩手承足者也",
    "日月失度": "下徒故反案青岑子云日太陽之精一歲一周天月太陰之精一月一周天金匱經云月主憂患日主福德故月爲刑奇日爲德奇常以冬至日在斗二十一度四分度之一春分之日在奎十四度夏至之日在東井二十六度秋分之日在角二度四分度之一差此則爲失度也",
    "搏蝕": "上補各反說文云擊也下音食釋名云月虧則蝕稍稍侵虧如虫食草木葉也九曜五行歷云羅𬑟一名蝕神頭常隱不見逢日月則蝕又日月同色月掩日日蝕又云日衝大如日日光不照謂之暗虗值月則月蝕也",
    "彗星": "上隨銳反考聲妖星也尒雅曰彗星爲欃槍郭璞注云亦謂之孛星言其形孛孛似掃彗或云掃星或云孛星或云攙槍星或云彗星也",
    "木星": "五星行藏歷云木之精也其色青其性仁順度行則爲福逆行所守則爲灾十二年一周天凡八十三年七十六終而七周天",
    "火星": "一名熒惑南方火之精一名罰星徑七十里其色赤光其行二年一周天所守犯皆凶也",
    "金星": "太白金之精其色白其性勇將軍之象一年一周天見二百四十四日初夕見西方其行稍急日行一度少半漸遲二百四十九度乃留八日逆行十日夕伏十二日遂晨見東方大抵八年五終五度夕見五度晨見",
    "水星": "水之精其色黑其性智四時皆出入光明潤澤則國豊民樂不尒則水旱作沵常以四仲見一年一周天去日極遠不過二十六度故人多不見凡三十三年一百四終七十四度晨見二十六度應見不見",
    "土星": "土之精其色黃其性信女主象也順軌光明有福亂行變色赤白天下有兵其行最遲二十九年半一周天三百七十八日一伏凡五十九年十七終而再周天初見東方也",
    "泛漲": "土芳梵反賈注國語云泛浮也毛詩傳云泛流皃說文從凡作汎下張亮反考聲云水增大砂岸崩摧入水曰漲從水張聲俗音上聲非也",
    "亢陽": "上康浪反考聲極也字書高也切韻旱也易曰上九亢龍有悔謂陽極也",
    "降澍": "下朱戍反集訓云時雨所灌澍潤生万物也經文作霔字書並無筆受者率意妄作也",
    "㮀盛": "上遐嚴反考聲云木匧也或作椷經文作凾俗字本凾谷關名下音成說文曰黍稷在器從皿成聲也",
    "記籍": "上居吏反釋名曰記識也從言已聲下秦昔反切韻簿籍也尚書序曰造書契以代結繩之政由是文籍生馬",
    "摩醯首羅": "醯音馨奚反梵語也此云云大自在卽上界天王名也住色究竟之最上頂也",
    "逶迤": "上於爲反切韻雅也行皃也下弋支反切韻溢也漢書云水曲案逶迤迃曲邪行皃下又音達羅反訓同上",
    "烏樞瑟摩": "梵語或云烏蒭沙摩舊譯云穢跡金剛此言有失似毀於聖者也新翻爲除穢忿怒尊謂以金剛慧現威怒身降伏難調穢惡有情故也",
    "線絣": "上私箭反周禮曰線人掌王宮縫線之事切韻縷線也又作綫同下北萠反切韻振繩纆使直也俗從手作拼使也經文從木作拼音并乃拼櫚木名並非線絣字",
    "顰蹙": "上符真反切韻顰蹙眉也或作頻說文憂又嚬笑也經文作頻切韻數也近也非此用下子六反玉篇迫也說文急也從戚足聲",
    "關鍵": "上古還反說文曰以橫木持門曰關聲類曰關所以閉也切韻扄也說文從門𢇇聲也經文作閞音弁尒雅曰閞謂之槉非關鍵義下其輦反切韻鍵籥字書橫曰關竪曰鍵也",
    "躑躅葉": "上呈戟反次重錄反藥草名也本草云羊躑躅也葉花皆有大毒三月採花其花色黃亦有五色者羊誤食其花葉躑躅而死因以爲名古今正字躑躅行不前也二字並從足鄭蜀皆聲也",
    "用㲲": "徒叶反切韻白㲲也西域所尚也經文從糸作𦁛俗用非也",
    "遁形": "上徒損反切韻遁逃也謂潛隱也按一字頂輪王經安怛袒那法此云隱形也良以彼國邪正雜信異道間居更相是非佛以神力故說斯要令修瑜伽者隨意自在速成悉地",
    "鍱裹": "上與協反切韻鐵鍱也金銀銅等鍱皆同從金枼聲也下古火反切韻包也又纏縛也從坼衣果在中形聲字經文作裹俗用不成字",
    "制帝": "梵語也或云支提或云制多應云制底邪此翻爲積集或云生淨信或云靈廟皆義譯也謂於佛闍維處及經行說法處建置墳廟臺閣總名也令諸人天積集福善之所也",
    "紫𨥥": "下虢猛反藥名也本草云出西域以樹皮葉及膠煎成人藥用亦堪膠黏寶鈿珠璣等物膠去聲",
    "𤊛稻": "上初爪反切韻熬也又作煼說文作𩰸經文作炒俗字下徒晧反本草云粳米止煩泄稻米主溫中令人多熱說文糯卽稻也字從禾舀聲也",
    "麻󱷹": "上莫霞反切韻紵麻也說文云𢃷网人治在屋下也故從广𢃷也經從林作麻俗用變體也𢃷音疋賣反下側加反切韻麻󱷹也又󱷹糝考聲滓也從米虘聲也",
    "齩牙": "上五狡反說文齩齧也從齒交聲經文從口作咬音交咬咬鳥鳴也非此用也",
    "虎皮褌": "下古渾反切韻褌袴也字林從巾作㡓古文作裩皆云下衣也",
    "木橛": "其月反切韻杙也爾雅曰樴謂之杙郭注云橛也又云在地者謂之楎注云門橛也或作橜楎音睴也",
    "𢯪量": "上丑格反切韻毀也考聲以手拓物也經文作拆俗用變體",
    "痃癖": "上又作胘同胡堅反切韻肚痃也下芳辟反玉篇腹病也藥證病源云恣飡生冷魚肉雜果晝眠夜食胃冷脾虛不消化因茲結聚爲癥塊發卽築心吐酸水也",
    "鵶翅": "上烏加反切韻鵶烏別名也廣雅云純黑而返哺者曰烏小而不返哺者鵶也從鳥亞聲也下施智反玉篇翅羽也又作翄古文作翨說文翮也從羽支聲也",
    "滷土": "上卽古反爾雅曰滷矜鹹苦也說文沙滷也從水鹵聲經文單作鹵太常鹵簿樂名非滷土義",
    "虵蛻": "上食遮反切韻毒虫也爾雅曰蟒王虵也下湯外反又舒芮反說文蟬虵所解皮也廣雅蝮蜻蛻也蝮扶六反蜟餘六反蟬未脫者",
    "溼吠帝": "上失入反次借音尾一反梵語也經中有作涅誤也",
    "𤙖𤙖": "呼感反從臍輪氣海引聲合口連呼",
    "馺嚩": "上蘇合反下無可反梵語不求字義也",
    "瑟鹻": "下本音古斬反鹹土也爲就梵音借音竹感反",
    "薄誐鑁": "上音傍各反下亾范反梵語也舊云薄伽梵或云婆加伴古翻爲世尊今云具六義故總云薄誐𮢥謂自在熾盛端嚴名稱吉祥尊貴六也",
    "稻穀𥢶": "下苦會反蒼頡篇云麁糠也",
    "撚彼": "上奴典反切韻以手指緊撚物也從手然聲",
    "繒幡": "上疾陵反說文帛也又繒綵也下孚袁反說文幡幟也釋名云幡翻也飜飛然也",
    "㟏": "借音胡感反梵聲不求字義",
    "嗢陀南": "上溫骨反次徒何反或云嗢柁南柁唐賀反舊翻爲偈頌也琳法師引瑜伽大論翻爲足跡又云集總散義譯也",
    "跋折羅": "上盤末反次職列反梵語也舊云伐闍羅皆訛也正云嚩音無滿反日羅此云金剛也",
    "邏惹": "上盧箇反下自攞反梵語也此云王經文作運字不曉梵音人誤書",
    "纔𤼵": "上昨哉反說文暫也切韻僅也下𤼵字說文從弓殳癶也癶從止止作󱷘音鉢隷書變󱷘作癶殳音殊󱶢音撻癶音鉢",
    "應拼": "下百萠反說文拼撣也從手并聲亦作抨古文作𰭙䍬撣音但丹反",
    "鈿飾": "上堂練反韻集云以寶瑟鈿以飾器物也下昇織反考聲云糚飾也文字典說修飾古今正字從巾飤聲音似",
    "噁": "烏各反借音也真言種智字也",
    "心臆": "下應力反說文臆亦胷也亦膺也從肉意省聲也",
    "詵遮𤚥": "上所臻反下牟含梵語不求字義",
    "搊擲": "上簉鄒反考聲以手指鉤也經文作𢬟俗字非",
    "幖幟": "上必遙反考聲云幖舉也或從木作標經從手作摽俗字下昌志反字書云幟謂標上幡也從巾戠聲也",
    "弱吽鑁斛": "上借音慈洛反吽音呼感反鑁音亾范反下胡谷反皆取梵聲也卽金剛鉤索鎻鈴四攝種智字也",
    "耨佉": "上借音奴屋反下丘迦反梵語不求字義也",
    "掣那": "上昌制反去聲",
    "閼伽": "上安葛反或作遏字梵語也卽盛香水杯器之總名也",
    "靺㗚多": "上望𤼵反次音栗梵語不求字義也",
    "上𦠍": "我各反字書云喉上也說文齦也又作腭齶",
    "紗縠": "上所加反切韻絹屬也考聲似絹而輕者也下胡谷反玉篇云羅縠也似羅而輕者也",
    "燥溪": "上蘇到反下苦鷄反真言中字不求訓解也",
    "巘盪": "上魚蹇反下徒朗反梵語也此云塗香也",
    "蠱𡹆": "上字古鄭注周禮云蠱者蠱物病害人也字書云腹中蠱也爾雅云蠱亦𡹆也考聲蠱魅也文字典說從蟲皿也",
    "澡罐": "上子老反下官喚反按澡罐卽銅鉼也",
    "𦝫絛": "上又作腰同於宵反下吐刀反字林云以絲織如繩也從糸從條省聲也字統作縚亦通用縚又音他到反",
    "花搵": "下溫困反韻詮云內物水中也考聲云拄也從手昷聲",
    "鑱鉞": "上士銜反切韻銳也方言云吳人謂犁鐵爲鑱也下音員厥反切韻鉞斧尚書王左仗黃鉞字林云鉞玉斧也說文從金戉聲戉音同上戉字從𠄌戈𠄌音厥戈音過",
    "斧槊": "上方矩反切韻斧鉞也周書曰神農治斤斧下正作矟字音雙角反切韻刀槊也通俗文云矛長丈八者謂之槊也",
    "三甜": "上牒兼反切韻美也甘也一字頂輪王經云三甜謂蘇乳酪也卽西域所尚者也",
    "機杼": "上居衣反下除旅反方言云杼軸織具也說文杼持緯也二字從木幾予聲也",
    "惡獸": "下舒救反切韻守也國語云獸三爲群字林云兩足曰禽四足曰獸說文從犬嘼聲嘼音丑救反經文作狩冬獵也非此用",
    "龍湫": "上力鍾反切韻君也禮記云龜龍麟鳳四瑞也易曰雲從龍論衡云龍亦畜也古有捕龍氏若非畜安捕哉下卽由反切韻水神名也考聲湫聚也謂不流水也",
    "犢牸": "上徒木反爾雅曰其子犢郭𤪟注云今青州人呼犢爲𤘽音火口反下疾吏反切韻牛牝曰牸從牛字聲字亦愛也養也",
    "篦攪": "上邊兮反考聲竹篦也下古巧反切韻以手動也從手覺聲也",
    "指擘": "下補革反三蒼云擘大拇指也陸氏釋文云手足大指俱名擘也今經云大如指擘卽形段如大拇指也",
    "劒把": "上居欠反釋名云劒撿也所以防撿非常也廣雅云龍泉太阿干將莫耶斷虵魚膓等十餘名皆劒異号也下必駕反切韻刀劒把也經文作靶說文轡飾也非此用有從金作釰全非",
    "邂逅": "上胡賣反下胡遘反考聲邂逅依俙也詩云見此邂逅也",
    "靈鷲": "下疾秀反按靈鷲西域山名也或云鷲峯亦云鷲臺如前已釋",
    "捴持": "上作孔反切韻合也都也皆也普也字書云捴衆也下直之反切韻執也案梵語陀羅尼此云捴持謂文義呪忍是也",
    "𮆋戾車": "上眠彌反次音梨結反下齒耶反梵語訛也正梵語畢栗蹉此譯爲下賤種也謂樂垢穢業不知禮義淫祀鬼神互相殘害也彌音邊篾反蹉音倉何反",
    "淨灑": "下色下反切韻水灑也考聲㵶水也字書以水散地也從水曬省聲字",
    "薩陀波崘": "下盧毘反梵語也舊翻爲常啼是",
    "月厭": "下於艷反韻略魅也按月厭神殺名也正月建寅月厭在戊以此逆推至十二月月厭在亥經文作靨面上黑子也非月厭字",
    "組織": "上則古反爾雅曰組似組東海有之郭注云組綬也禮記綬長一十二尺十二月也廣三尺天地人三才也",
    "蘿菔": "上音羅下蒲北反爾雅曰葖蘆菔郭注云紫花大根俗呼雹𥥛𥥛音他怱反本草蘿菔性冷利五藏除五藏中惡氣服之令人白淨肌細從草服聲經文作蔔乃葡蔔字",
    "靺師迦花": "舊云婆師迦花梵語訛也正云靺㗚沙迦此云雨時花也或云夏生花其花白色甚香半夏時生因名云",
    "鹹滷": "上胡緘反爾雅曰鹹苦也切韻不淡也亦作醎俗字下卽古反說文云西方鹹地爾雅滷苦也從水鹵聲經文單作鹵音雖同鹵簿樂也",
    "礓石": "上居良反字書石也釋名云礓薑也言石似薑而堅也從石薑形聲字經文作彊爾雅音強作彊界也陲也皆非礓石字",
    "縷㲲": "上力主反玉篇緒也切韻絲也下徒叶反切韻白㲲布也經文作𦁛俗用字非也",
    "藕絲": "上五口反蓮根也爾雅曰荷芙渠其根藕也郭注云別名芙蓉江東呼荷也",
    "結纇": "下盧對反切韻麤絲也字書纇結纇從糸類",
    "芙蓉": "上防無反下餘封反卽荷蓮也爾雅曰荷芙渠郭注云別名芙蓉江東呼荷毛詩傳云未開者曰芙蓉已開者曰菡萏也",
    "撚綫": "上年典反方言云撚續也倉頡篇云搓綫也從手然聲下又作線俗作綖音私箭反說文云縷綫也周禮云線人掌王宮縫線之事也以伇女御也",
    "𪍿麥": "上古猛反考聲麥芒也又曰稻未舂者也作穬亦通下麥字俗作麥也白虎通麥金也金王而生火王而死也從來久作麥也",
    "樺皮": "上胡罵反木名也皮堪爲燭者其中有赤白麁細白細者堪書梵夾以彼土無紙多以貝多葉或多羅葉反樺皮書字也",
    "吃哩爹": "上居乙反次音里下陟耶反梵語不求字義",
    "牙𪙉": "下昨何反又作齹切韻齒本也顧野王云齹踈者齒參差也",
    "繕縫": "上時戰反切韻補也考聲云繕修也下符容反說文縫紩也音直曰反亦縫也平聲又音扶用反",
    "三橜": "其月反爾雅曰樴謂之杙郭注云杙橜也又作橄爾雅曰門閫也",
    "嚧地囉": "上借音來古反下彈舌呼羅字梵語此翻爲血也",
    "瞻睹": "上職廉反爾雅曰瞻視也考聲察也下丁古反切韻見也視也玉篇觀也正作覩從見者省經作睹俗通用",
    "劑膝": "上在詣反切韻分劑也下息匕反切韻曲膝骹骨也說文從肉桼聲經文作膝誤書也桼音七骹音苦交反古今正字從卪作𨞢",
    "沒㗚多": "中音栗彈舌呼之餘依字梵語也此翻爲死屍也",
    "摩努沙": "中借音尼古反鼻音呼梵語也此翻爲人人之揔名也",
    "扂鎻": "上徒玷反切韻閉戶也字書小關礙門扇令不開也古文作扊又作𠂼下正作鎖音同蘇果反切韻鐵鎻",
    "角勝": "上古岳反切韻角競也角觸也漢書故事云未夬庭設角抵戲者使角力相抵卽今之相撲也經文從手作捔卽掎捔非此用",
    "坏椀": "上配盃反考聲云瓦器未燒者坏從土從盃省聲或作坏字下烏管反切韻云器物也古文作盌字同",
    "鍮石": "上音偷埤蒼云鍮石似金而非金也西域以藥鍊銅所成有二種鍮石善惡不等惡者挍白爲灰折善者挍黃名爲金折亦名真鍮俗云不博金是",
    "捏塑": "上奴結反切韻手揑搦也下乘故反切韻以泥塑像也古今奇字作塐經文作素非",
    "黍米": "上舒呂反說文云禾屬而黏者也以大暑而種故謂之黍從禾雨省聲孔子曰黍可爲酒禾入水也經文作𤇕不曉字義誤書也下莫禮反說文穬粟實也象禾實之形也",
    "豌豆": "上一桓反切韻豆名下田候反切韻穀豆也物理論云衆豆謂之菽也",
    "一俱胝": "下丁尼反梵語數名此翻爲億也黃帝筭經總有二十三數億當十四數自萬已去有三等謂上中下也卽十萬百萬千萬依次配之",
    "腰髆": "下牓莫反字林云髆脾也說文云肩胛也從骨從榑省聲經從月作膊音普博反郭璞云披割牛羊五藏也非經義專從甫寸也",
    "花蘂": "下如捶反玉篇曰蘂爲花鬚頭點也從草糸惢聲經有從三止作蘃非也惢音乘果反",
    "底哩": "上借音丁逸反哩彈舌呼梵語也此云三謂此經中說三種三昧卽金剛蓮花佛部是也",
    "磔開": "上陟格反切韻脹也開也周禮牲祭以穰灾也爾雅祭風曰磔今經從手搩非經義",
    "先彎": "下烏關反切韻挽取曲勢也考聲彎環曲皃也",
    "縛撲": "上符钁反說文繫也字書執縛從糸博省聲經文從專作縳音傳非也下滿角反考聲撲打也切韻相撲也經文作󱰉非",
    "辮髮": "上薄泫反考聲辮結也字書編也從糸辡聲辡音弁泫音胡畎反畎音古泫反",
    "蹙眉": "上子六反切韻近也從也考聲逼急也從戚足聲經文從就作蹴切韻逐也又音七宿反非蹙眉義",
    "鵶𩿒": "上烏加反切韻烏別名也說文作鴉云陽鳥也下處脂反又作鴟郭注爾雅云鴟鵂也今江東通呼此屬爲怪鳥又云鴉鴟也",
    "梟翎": "上古堯反郭注爾雅云上梟也切韻食母不孝鳥也故冬至捕梟磔之也字從鳥頭在木上也下卽丁反文字音義云烏翎卽毛翎翎羽也經文作鴿詩云𪃹鴿在原爾雅䳭鴒𪄉渠也郭云雀屬也非翎羽義也",
    "暫瞬": "上藏濫反考聲纔也下舒閏反切韻目動也亦作瞚字",
    "目鍵連": "中音健梵語訛也或云目揵連或作楗音渠焉反正云摩訶目特伽羅此云大採菽氏或云菉豆子母是採菉豆仙人種也從母得名也從父應云俱利迦也",
    "脛踝": "上形定反玉篇脛足䠊膓前大骨也說文足胻也胻音幸從肉逕省聲下華瓦反蒼頡篇云在足側高處也聲類云足外附骨也說文云從足裸省聲也",
    "塢波塞迦": "上烏古反舊云優婆塞新云鄔波索迦鄔波此云近迦此云事索卽男聲也卽近事男也謂親近承事三寶者故云",
    "謨呼律多": "上莫胡反梵語也或云牟乎㗚多此云分俱舍論云一百二十刹那爲一怛刹那六十怛刹那名臘縛三十臘縛名一牟呼㗚多三十牟呼㗚多爲晝夜也",
    "傘蓋": "上音蘇旱反古文繖字也從亼音才入反三合之形也傘音華夏之華會意字下古太反切韻覆也掩也通俗文云張帛也禮記曰弊蓋不弃爲埋狗也字從廾盍廾音草盍音合",
    "團圝": "上徒官反切韻團圓也下落官反切韻團圝也字書圝亦團也二字並從囗專䜌聲說文從木作欒木名也說文似木欄也",
    "搓縷": "上士何反切韻云手搓物也字書搓挼也挼奴禾反從手差聲經文作縒非也下力主反切韻絲縷也亦線也",
    "織㲲": "上之翼反切韻組織也下徒協反切韻細毛布也又白㲲巾㲲也從毛疊形聲字經文作緤俗用非",
    "珊瑚": "上蘇安反下戶吳反廣雅曰珊瑚珠也說文云珊瑚生海中而赤色有枝無葉也",
    "絹縠": "上古椽反切韻縑也廣雅曰繁忩鮮支縠絹也下胡谷反切韻羅穀考聲似羅而踈也從糸穀省聲",
    "蟒虵": "上莫朗反切韻虵之最大者也尒雅曰蟒王虵也下食遮反毒虫也古文作蛇同",
    "隘窄": "上烏懈反玉篇隘迫也下爭索反考聲云窄亦陿小也古今正字從穴乍聲也經文作阨責二形皆非",
    "瀘漉": "上盧著反下聾屋反顧野王云漉猶瀝也郭璞注方言云漉滲水極盡也說文云滲也又水下皃也二字從水盧鹿皆形聲字",
    "水蛭": "下之日反本草云水蛭一名蚊也一名至掌俗呼馬蚑博物志云水蛭三段而成三物字林音猪秩反訓義同",
    "人莽娑": "中莫朗反下乘歌反梵語也此云是未壞人肉也",
    "𭉾唼": "上補各反切韻㗘㗱也㗱音姉入反下子荅反說文作𠯗入口也考聲嗍也從口帀聲㗘從口博省聲經文作博非此用",
    "鎚銅": "上直類反廣雅云半熟合鎚也玉篇䥫鎚也下徒紅反說文云金之一品",
    "甲麝": "上古狹反下神夜反切韻麝香獸香也尒雅曰麝父麕足郭注云脚似麕而有香也按本草甲亦獸甲煎而成香經言甲麝今據壇法甲麝雖香爲傍生身分故不用也",
    "爲㡧": "下猪孟反文字指歸云開張畫繒也從巾䆸聲也䆸音中莖反經從木作楨音貞幹也非此用也",
    "𭤔熙": "上古文希字下許其反和也悅也按二字合作熈怡也怡音與之反和悅",
    "𰆓踝": "上息七反古文膝字從卪音節從𣷚音七聲今從肉作膝說文骹骨也下華瓦反前經第一卷已釋",
    "如蠃": "下落戈反說文水介虫也尒雅云蠃小者蜬郭注云蝸牛也又作螺俗用切韻蜯屬也或作蠡通又音禮經文作䗍不成字也",
    "無瑕": "下胡加反切韻過也說文玉病也從玉遐省聲經文作瘕音加癥瘕肺病非經所用",
    "木槵": "下胡慣反切韻無槵卽木名也",
    "鄉黨": "上許良反釋名鄉向也謂衆所向下多朗反釋名云黨長也謂一聚所導長也鄭注論語云万二千五百家爲鄉五百家黨也",
    "令殞": "下于敏反切韻沒也尒雅曰殞落也左傳云星殞如雨或作隕磒二形亦通也",
    "作縛": "下直兖反尒雅云十羽謂之縛左傳云縛謂卷物也按經以髮作縛卽卷髮爲結也今作篆字乃周宣王太史所作大篆秦相李斯小篆並字書名甚乖經旨也",
    "蝪𧋍": "上音亦下星歷反說文在壁曰蝘蜓在草曰𧋍蝪方言澤中曰𧋍蝪南楚謂之虵醫或謂之蠑螈字從虫易析皆形聲也經文下作蜡音乍乃十二月終大蜡祭名也執筆之人誤書也析音先戚反昔音私積反",
    "卑溼": "上府移反切韻下也下失入反切韻水沾也經文作濕俗字",
    "䓗蒜": "上倉紅反玉篇葷菜也尒雅云茖䓗細莖大葉下蘇貫反字書云葷菜也漢書云張騫使西域所得也本草云萩性熟除風殺虫久服損眼目也",
    "警覺": "上京影反孔注尚書云驚戒也亦覺也字書云寤也古今正字從言敬聲",
    "能羸": "下力追反賈逵注國語云羸病也杜注左傳云弱也許叔重云劣也字書疲也從羊𣎆聲也",
    "淤埿": "上依倨反韻英濁水中泥也下奴低反說文埿塗也從土泥聲經文作泥說文水名也非淤埿也",
    "纔受": "上昨哉反說文纔僅也考聲暫也五經音義從糸毚音士咸反狡兔也從㲋兔也㲋音丑略反鑱攙讒之類並同",
    "瘰癧": "上郎果反字書曰筋結病也二字並從疒騾歷省聲",
    "鑠鑁": "上書藥反下亾梵反真言中字也",
    "烏蒭沙摩": "或云烏樞瑟摩梵語輕重也此云穢跡舊云不淨潔金剛俗呼火頭金剛是也",
    "車輅": "上九魚反詩云輶車鑾鑣也下洛故反周禮有五輅隨飾爲名天子所乘大輅也文選序云椎輪爲大輅之始也",
    "悉𠆙": "下音亭夜反字書無文翻譯之家用影梵聲",
    "煥爛": "上呼貫反說文火光也下郎旦反說文大熱也考聲光也明也從火闌聲",
    "虹霓": "上戶公反尒雅云螮蝀虹也郭注云俗云美人虹下五兮反尒雅云霓爲挈貳郭云雌霓也釋文云雄曰虹雌曰霓亦作蜺字",
    "𦧇掠": "上神帋反字書云舌取物也又作舓經文作䑛俗字下又作擽同音離斫反字統云擊也又刮掠也從手諒省",
    "殑伽沙": "上疑等反下魚佉反舊云恒河沙梵語西國河神名也涅盤經云恒河女神是",
    "﨟鞨": "上盧盍反上胡葛反梵語不求字義",
    "猶豫": "上以周反切韻仍也下羊泇反字書云先也備也考聲云猶豫不定也爾雅云猶如麂陸氏釋文云隴西謂犬子爲猶行時豫在人前",
    "毘舍": "或云吠舍梵語也此乃巨富多財通於高貴或稱長者或封邑号者也",
    "首陀": "梵語不正也應云戍達羅此姓之徒務於田業耕墾播植賦於王臣多爲民庶",
    "拒𰚇": "上其呂反切韻捍也格也玉篇違也下徒歷反尒雅𰚇匹也切韻當也又主也軰也從殳適省聲也",
    "𥜒禱": "上於琰反切韻𥜒禳也從示厭聲經文作厭音於豔反弃也惡也非𣝓禳字下都㬶反切韻求福也論語云禱於上下神祇也",
    "伺斷": "上相吏反切韻伺候也玉篇察也釋名伺思也下從管反韻英云絕也說文截也從斤𢇍古文絕字也經文作𣂾或作断皆訛也",
    "螫彼": "上商隻反說文云蟲行毒也又作蠚經文作螫音呼各反亦通",
    "蛇蠍": "上社遮反下軒謁反方言云自關而西泰晉之間謂蝲𧔣或謂之蠍蠍卽四方通語釋名云蠍歇也謂歇其尾也字從虫歇聲經文作蝎爾雅音曷蝤蠐也",
    "毘鉢尸": "或云毗婆尸或云微鉢尸梵語輕重也此譯云勝觀如來或云淨觀或云勝見亦云種種觀過去莊嚴劫中佛也",
    "尸棄": "梵語訛略也正云式棄那此云持髻或云有髻卽持髻如來也",
    "毘舍浮": "或云毗溼婆部皆古譯梵語此云遍一切自在也謂於一切得自在故或云一切有也",
    "拘留孫": "或云拘留秦應云迦羅鳩忖駄此云所應斷已斷也卽賢劫千佛之首也",
    "羯諾迦牟尼": "或云拘那含牟尼或云迦那迦牟尼此云金色仙或云金山如來也",
    "迦攝波": "亦作葉字此翻爲飲光一家姓氏也",
    "釋迦牟尼": "釋迦能姓也牟尼寂默也如下廣釋",
    "喬荅摩": "舊云瞿曇。案慈恩法師引釋迦譜云。釋迦帝王歷代相承。逆賊中興。賊王恐奪社稷。遂誅釋迦之種殄滅親族令無胤嗣。時有仙人遍觀遺族見有娠孕者後必生男。乃預陳詞兾將繼統母允其請。後果生男。長至髫年釋星復見。賊王恐懼。尋訪所居知居山中。伺仙不在密令摛捉。長竿穿之告示國人令息異意。仙人還至不見其子。乘急追訪覩其若斯乃作神通救之。知命不濟仍降微雨少令醒覺。化現一女勸令交會。必若不從能姓便絕。兒從父誨乃共交通遺體旣流墮染泥土。仙人收取牛糞裹之置甘蔗園中。日暖光炙時滿十月變成一男。仙人還養後得爲王。自此釋迦重得繼位。故喬荅摩者。此云甘蔗種或曰日炙種。若毀之曰牛糞種泥土種也。喬荅摩。摩是男聲。或云喬曇彌。彌是女聲也",
    "坎窟": "上苦感反切韻險也小罍也形似壺也下苦骨反玉篇云穴也從穴屈聲也",
    "羯泚": "下千札反梵語也按字水深又清水也",
    "苗稼": "上武儦反切韻田苗考聲云未秀者也說文云從草在田上也下古訝反詩云俾民稼穡書云種曰稼歛曰穡說文從禾嫁省聲",
    "祠祀": "上似慈反爾雅云春祭爲祠郭注祠又言飲也釋名云祠詞也謂陳詞以請也下詳里反切韻祭祀也爾雅云商曰祀郭注取四時一終也二字皆從示音視也",
    "涎洟": "上敘連反切韻涎口液也下以脂反說文鼻液也二字並從水延夷聲也又音他計反",
    "疥癩": "上公薤反切韻瘡疥也顧野王云疥瘙也卽風瘙也又作疥下落代反字書云惡疾也說文作㾢經文作癩俗字也",
    "痔漏": "上治里反切韻云漏病也顧野王云後分病也",
    "癕疽": "上又作癰同於恭反字書云癰癤也玉篇腫也從疒雍聲下七余反顧野王云疽亦癕也說文從疒且聲音子余反",
    "瘡癬": "上楚良反瘡痍也禮記云頭有瘡則沐下息淺反切韻疥也顧野王云乾瘍也音羊",
    "踰繕那": "舊云由延或曰由旬亦云踰闍那梵語聲轉也此無正翻或云十六里或云四十里卽自古聖王軍行一日程也",
    "微鉢尸": "或云毗婆尸梵語一也如上卷已釋",
    "羯句忖那": "舊云拘留孫亦云迦羅鳩孫駄如前已釋",
    "琰魔": "上以冉反梵語也舊云閻羅或云爛魔義翻爲平等王或云雙世謂典生死罪福之業主守八寒八熱等地獄於五趣中追攝罪人捶拷治罰決斷善惡更無休息也",
    "索訶世界": "舊云娑婆梵語也此云堪忍卽釋迦如來所主忍土也",
    "鑠底": "上商灼反又作爍字下丁以反梵語此云槊卽槍戟也",
    "脂膏": "上旨夷反釋名云脂砥也著面軟滑如砥石也爾雅水脂也郭注肌膚如氷雪氷雪脂膏也下古蒿反切韻膏肥也澤也禮記云天子降膏露也",
    "吠陜": "上借音微閉反下失𮉼反梵語不求字義也",
    "澍雨": "上朱樹反淮南子云春雨之灌萬物無地而不澍無物而不生也說文從水尌聲尌音同上下雨字說文云一像天冂像雲覆也丨卽下也四點像雨空中雰霏也冂音覓丨音古本反會意字也",
    "𩕳泯達羅": "上寧頂反次民忍反梵語也舊云尼民陁羅訛也此云持邊謂七金山最外第七重山也此依慧菀法師釋",
    "蛟龍": "上音交郭注山海經云蛟似虵而四脚小頭細頸卵生大者十數圍子如一二斛甖能吞人說文蛟亦龍屬也下力鍾反說文云鱗蟲之長也能幽能明能巨能細脊分而登天秋分而潛淵也󱷏飛形從肉從童省聲也或從尨作俗也",
    "盎祁羅": "上鳥浪反下巨支反梵語龍王名也",
    "雲雹": "下龐邈反白虎通云雹之言合也陰氣專精凝合爲雹也鄭注禮記云陽爲雨陰氣脅之疑爲雹也從雨包聲",
    "稻𦼮": "上徒晧反本草云稻米主溫中令人多熱秔米主益氣止煩泄說文沛國謂稻爲糯今江東通呼秔米爲稻米也下古旱反說文衆草莖也從草幹聲",
    "沃潤": "上鳥穀反考聲云沃灌也說文問從水夭聲下如順反切韻潤澤也又益也從水閏聲閏字從王在門內也鄭注禮記云天子每月就明堂而聽朔閏月非常月也聽其朔故於明堂門內也",
    "蚖蝮": "上玩丸反虵類也玄中記云蚖虵身長三四尺有四足形如守宮尋脊有針利如刀甚毒惡中人不逾半日卽死下芳服反陸氏釋文云蝮虵鼻上有針大者百餘斤一名返鼻一名蝮虺二字並從虫元復形聲字",
    "訥泚": "上奴骨反下青禮反真言字也",
    "頗𪘨": "上普我反下卓皆反真言中字不求訓解",
    "被螫": "下舒隻呼各二反皆得說文蟲行毒也又虵有螫毒不可觸其尾也",
    "𰮍膳": "上効交反賈注國語云𰮍爼也鄭箋毛詩云爼䤈也凡非穀而食曰肴說文肴啖也從肉爻聲爻音同上下時戰反玉篇膳美食也從肉善聲經文二字並從食作餚饍俗用字非",
    "󱮶草": "上士臻反字書木叢生也考聲草木雜生也從草臻聲經文從木作榛音臻似栗而小非秦草義也",
    "土堆": "下對雷反王逸注楚詞云堆高皃又正體作𠂤云小阜也今俗從追作塠非也古文作㕍今時不用",
    "泫然": "上玄絹反韻詮云泫泣皃又露光也說文從水玄聲下然語詞也字從肉犬逐之下灬以然之灬音必搖反",
    "鴝鵒": "上具俱反下音欲周禮云鴝鵒不渡濟淮南子云鴝鵒一名寒皐異菀云重午日掐鴝鵒重舌能學人語二字皆從鳥句谷聲經文作鸜鸜鵲名非此用也",
    "蜂蠆": "上敷容反又音薄紅反郭注爾雅云在地中作房者爲土蜂啖其子卽馬蜂也下丑芥反切韻毒蟲也考經援神契云蜂蠆垂芒爲其毒在後也說文從䖵夆聲䖵音昆夆音同上爾雅從逢作蠭皆同",
    "癧瘻": "上卽擊反切韻瘰𤻤病也下力鬪反玉篇㿈瘻也顧野王云中多蟲也瘰音力果反㿈音於恭反",
    "抽擲": "上勅鳩反韻譜云拔也切韻引也去也或作紬音同說文從手由聲下直炙反古文作擿玉篇投也切韻振也案抽擲二字卽大樂金剛薩埵以左拳安𭦫側右手執金剛杵擲弄作密印法也",
    "驕佚": "上舉妖反玉篇馬六尺也諸侯章云在上不驕御注云諸侯列國之君貴在人上而能不驕則免危也下夷質反切韻佚樂也作逸過也縱也同音",
    "脚踏": "上正作腳音居勺反釋名曰脚却也以其坐時却後也下又作蹋同徒盍反切韻踐蹋也考聲以足蹈也說文從足𦐇聲𦐇音塔",
    "揮斫": "上許歸反切韻揮霍也考聲奮灑也韻英振也動也下之若反韻英云刀斫物也",
    "竦竪": "上息栱反爾雅曰竦懼也切韻敬也顧野王云上也跳也國語云竦善抑惡也下又作豎同臣庾反庾音以主反玉篇立也又童僕之未冠者",
    "誹謗": "上方未反說文云誹亦謗也又音方微反下補曠反考聲云謗毀也從言旁非皆聲",
    "聾瞎": "上魯東反說文云耳不通也從耳龍聲經文作𦗤不成字下呼八反字書云目不見物也又云一眼無睛也從目害省聲字",
    "傴瘂": "上於武切韻不伸也玉篇虺也孫鄉子曰周公背傴也下又作𤺘啞二形皆非本字音烏雅反考聲云口不能言也說文從疒亞聲疒音女厄反",
    "痳痢": "上力尋反切韻尿病也藥證病源痳有五種謂冷勞氣食血也玉篇痳小便難也從疒林聲經文從水作淋以水沃也非此用下力至反切韻痢病也顧野王云瀉痢也說文云從疒刹聲疒女厄反",
    "痔病": "上直里反說文云後病也前寶樓閣經上卷中已釋",
    "瘻瘡": "上盧侯反切韻瘡瘻也集訓云瘡久不瘥也下楚良反禮記云頭有瘡則沐也說文二字並從疒婁倉皆聲疒音女厄反",
    "髀脛": "上蒲米反古文又作䠋說文股外也又音方爾反說文從骨卑聲經文從肉作䏶俗字下刑定反玉篇云足䠊膓前大骨也說文云足胻也胻音幸䠊音肥也",
    "疥癬": "上皆隘反周禮云夏時有養疥之疾集訓云風瘡也文字集略從虫作蚧說文云搔也從疒介聲下先剪反集訓云癬徙也謂侵淫移徙也說文乾瘍也從疒鮮聲搔音掃刀反隘音櫻介反瘍音羊也",
    "疱癩": "上薄教反說文從皮作皰面生熟瘡也亦作皰俗作䩅下來大反廣雅癩傷也蒼頡篇痛也說文正作癘惡疾也從疒厲省聲也厲來大反疒音女厄反",
    "優曇鉢羅": "次徒含反梵語也舊云優曇正云烏曇鉢羅此云祥瑞雲奇異天花也世間無此花若如來下生金輪出現以大福德力故感得此花出現也",
    "制底": "梵語或云支提或云制多亦云制帝一也無正翻義譯云靈廟謂安佛舍利等塔廟也或云積聚謂人天積聚求福之所",
    "埿捏": "上奴低反說文埿塗也言水土相雜也尼卽聲也經文作泥水名也毛詩疏云泥本中衛之小邑非經用下奴結反切韻以手搦也又捺也從手涅省聲也",
    "插箭": "上楚洽反切韻㓨入也又作插皆非說文從手臿作插臿音同上以干入曰也下煎線反俗字也正作󱶎本竹名也似葦而藂生可爲矢笴因名矢爲箭從竹前聲笴音干旦反",
    "厭禱": "上於艷於琰二反字書作𥜒謂𥜒穰也考聲云厭魅也又著也說文作猒從犬甘肉也下都皓反切韻請也字書云祈於天神也論語云請於上下神祇也",
    "撚成": "上年典反方言云續也顧野王云謂相接續也說文從手然聲下市征反切韻云畢也就也說文云從戊丁聲",
    "輻𨊾": "上方六反字書車輻也道德經云三十輻共一轂而無轂之用下文兩反切韻車輞也說文二字並從車福罔省聲",
    "躭嗜": "上又作妉同丁含反爾雅云妉般樂也切韻過樂也下常利反書云甘酒嗜欲嗜亦躭也又作𩝙同說文從耳作耽",
    "諠𠆴": "上俗作喧說文作讙三形同況袁反韻英諠譁語聲也字書諠亦𠆴也下奴教反切韻不靜也考聲猥𠆴也從人在市內也又作鬧俗作𡗚省略也",
    "踣地": "上蒲北反又作仆同爾雅曰疐仆也郭注云頓躓倒仆也切韻踣斃也謂前倒也疐音竹利反與躓音義皆同",
    "𢯪開": "上恥革反考聲云𢯪亦開也又裂也古今正字作捇從手赤聲古文作牌音同上下正體門字也說文從門幵聲也二戶爲門二干爲幵幵音牽",
    "筏羅痆斯": "痆音儜軌反梵語國名也或云婆羅痆斯古經云波羅奈國是",
    "輪樘": "下澤耕反字書云樘柱也亦作樘說文亦云柱也從木堂聲案輪樘卽塔上持露盤之柱杆也十二因緣經云八人得起塔從如來下至輪王八露盤已上皆是佛塔自輪王已下安一露盤見之不得禮以非聖塔故",
    "均亭": "上居勻反字書均平也下特丁反考聲亭亦平也今亭子取其四面亭均也均從土勻聲亭從高丁省聲經從金作鈞謂三十斤也亭從人作停謂𠐌也並非畫壇四角均亭字也",
    "纔聞": "上正作纔從毚音在裁反廣雅纔暫也東觀漢記云僅也不久也毚音士咸反",
    "摩捫": "上莫婆反玉篇以手摩挲也挲音索柯反下莫莽反說文捫卽撫持也聲類云捫亦摸也二字並從手麻門聲也",
    "痰癊": "上淡甘反考聲云鬲中水病也說文從疒炎聲下邑禁反字林作𤷜心中淡水病也韻詮云癊亦痰也二字互訓從疒陰聲也經文從草作蔭非也",
    "瘶瘧": "上乘奏反考聲云瘶氣衝喉病也蒼頡篇寒熱爲病也文字典說從疒欶聲欶音同上經文從口作嗽非下魚約反切韻痁疾也字書從疒虐聲經文單作虐苛酷也非痁疾義苛音何酷音哭痁音失廉反",
    "眼脈": "上五限反釋名云眼限也謂視物有限也從目限聲下莫獲反切韻血脈也釋名云脈幕也謂絡幕一體也說文從肉派省聲經文作脉俗字也",
    "拓鉢": "上他各反切韻手承物也下北末反字書或作𥁊同卽盂器也圖澄傳云澄燒香咒鉢須臾生青蓮花西域志云佛鉢在乾他越國也",
    "三界冥": "下莫經反又莫定反爾雅晦也切韻暗也夜也說文云月從十六日始冥故字從六日冖音覓聲也亦覆蓋之形也經從水作溟卽溟濛小雨皃又溟海也非冥暗也又有從宀具作𡨋非本字宀音莫仙反",
    "祝詛": "上之受反說文作詶亦詛也今作咒俗字下側據反古文作𥛜釋名云祝屬也以善惡之辞相屬著也詛阻也謂使人行阻限於言也經文從口作咀音才與反咀嚼也非經義也",
    "鉞斧": "上員月反下方矩反尚書云王左杖黃鉞孔注云以黃飾斧也從金戉聲戉音同上從戈𠄌聲𠄌音厥作戊非也",
    "蹋處": "上徒合反切韻蹴也顧野王云蹋踐也字林躡也經文從沓作踏亦通沓音同上從氺不從水氺古文別字也",
    "上鐫": "下子泉反切韻鑽也斲也說文破木也又曰琢金石也從金雋聲雋音徂兗反從隹臥弓有作隽非本字",
    "粉捏": "上芳刎反米糏也博物志云紂燒鉛作胡粉也下奴結反字書以手按搦也從手圼聲圼音同上",
    "毘沙門": "梵語也或云毘舍羅娑拏或云吠室羅末拏此譯云普聞或云多聞其王最富寶物自然衆多人聞故也主領藥叉羅刹藥叉此云傷謂能傷害人",
    "振多摩尼": "或云真多末尼皆梵語輕重也此譯云如意珠是也",
    "呵利帝": "梵語也或呵里底上借音呼可反底音丁以反此譯云歡喜或云天母也",
    "斷緒": "上徒管反切韻絕也說文截也從斤㡭會意字㡭古文絕字繼字亦從　經文作斷省略或作斷俗用也下徐呂反引緒也切韻由緒也字書續也又繭緒也從糸著省聲",
    "甘脃": "上甘美也甞也說文作曰口含一也下七醉反玉篇弱也考聲云嫩也古今正字從肉絕省聲言肉凝易破也經文多從危作脆俗字也",
    "針鋒": "上職林反又作鍼同說文云綴衣針也管子曰女子有一針一刀一錐然後成爲女也下敷容反切韻云劒刃也亦利也從金夆聲也",
    "枯䩌": "上苦姑反切韻朽也從本古聲也下卽消反說文云面皮枯黑也從面焦形聲字經文從火作燋謂燒物傷火也",
    "戶樞": "下昌朱反爾雅曰樞謂之椳郭璞注云門扉樞機廣雅樞本也謂戶扇轉處說文云從木區聲也",
    "左笡": "下且夜反埤蒼云逆插搶也從竹且聲也",
    "掣開": "上昌世反說文引而縱之也爾雅曰掣曳也郭注云謂牽地也曳音餘世反扡音他二字俗或入聲",
    "撼手": "上含感反廣雅撼動也說文云搖也從手感聲",
    "掣拍": "上昌列反挽也又音昌世反前已釋訖下普伯反以手撫也",
    "捶擊": "上之累反考聲云亦擊也下古歷反切韻打也說文從手𣪠聲也",
    "賀糝": "下音乘感反經作糝真言句也不求字義",
    "不憚": "下徒旦反切韻憚怒也又惡也論語云過則勿憚改注云憚難也說文從心單聲也",
    "鷄鴈": "上又作雞同古奚反說文云鷄知時之畜也郭璞注爾雅云陽溝巨鶤皆古之鷄名也鶤音昆下五晏反禮記曰孟春之月鴻鴈來賓鄭箋毛詩云大曰鴻小曰鴈爾雅曰舒鴈鵝也",
    "阿閦鼙": "閦或作𨳖同初六反鼙或作鞞同薄迷反梵語也古云阿插皆非正音也依梵本惡蒭毘夜此云無動卽東方無動如來也毘夜二字都合一聲呼也",
    "珂雪": "上苦何反說文貝屬也從玉可聲也字書以白貝飾馬腦也下雪字從彐音手也",
    "彎弓": "上烏關反韻集云彎謂挽弓曲勢也說文云從弓䜌聲也下居戎反切韻云弓矢也釋名云弓穹也謂張之穹穹然世本云黃帝臣揮作弓說文云像弓之形",
    "𢹂索": "上戶珪反切韻提也又離也說文從手嶲聲也經文作携或作擕皆非本字下蘇各反方言繩之別名也",
    "茅薦": "上莫包反切韻草名也爾雅曰芓明也郭注引左傳云前茅慮無也下作甸反考聲云薦進也切韻草薦席也古今正字並從草薦聲薦音同上",
    "庳脚": "上皮媚反周禮庳猶短也顧野王云卑下也從厂從卑聲也厂音呵旦反",
    "指𢅎": "下古了反如前已釋",
    "牆形": "上匠羊反聲類云牆垣也說文垣牆敝也從嗇爿聲也爿音同上經文作牆廧𡒅三形皆非",
    "怯弱": "上去劫反切韻怯怕也字林云懼也從心去弱聲也下而斫反顧野王云弱尫也韻英云劣也從弜氺省弜音強氺音別",
    "固悋": "上古誤反切韻堅也又牢也說文蔽也郭注爾雅云掔然牢固之意也掔音慳下良刃反字書鄙財物也或作恡亦通上固經文作頋謂廻視也非本字也",
    "荳蔲": "上徒候反下呼候反切韻荳蔲藥名也本草云實如李實味辛而香可食令人益氣止瀉二字並從草豆𡨥皆聲經文單作豆乃穀豆之字非藥名也",
    "盪滌": "上徒朗反切韻云盪搖動也易曰八卦相盪滌也考聲洗盪也從皿湯在其上會意字皿明丙反經文從草作蕩藥名也非此用下徒歷反切韻淨也亦除也洗滌也",
    "嬋娟": "上市連反下於緣反切韻嬋娟舞貌也考聲云好姿態貌一字並從女蟬捐省聲也",
    "馝馞": "上蒲結反又作䭱或作飶玉篇云火香也又音普蔑反下蒲骨反玉篇大香也二字並從香必孛聲也孛音勃",
    "殃咎": "上於良反玉篇云禍惡也韻英云凶也亦咎也從歹央聲歹音五達反央音同上下其夕反爾雅曰咎病也切韻愆惡也說文從人各謂人各心相違卽咎生也經文從一點作咎或從卜作咎皆誤書也",
    "假藉": "上古雅反切韻且也又借也下慈夜反說文以蘭及草藉地祭也從草藉聲藉音情亦反經文從竹作籍非也",
    "調擲": "上徒聊反集訓云謂和也亦調弄也下直隻反古文作擿振也說文投擲也從手鄭聲",
    "置胯": "上竹吏反切韻安也說文云委也從罒直聲下開化反考聲兩股間也或作跨越也非此用也",
    "顰眉": "上符真反考聲顰蹙眉也下莫丕反說文云目上毛也像眉之形也玉篇云𮄊眉而聽也經文從口作嚬笑也非顰眉字也作眉眉皆通用已久時世共傳也",
    "緋裙": "上甫微反說文繒色下又作帬裠二形同渠云反字林衣也釋名云上曰裠下曰裳也從衣君聲",
    "竝豎": "上蒲逈反說文云雙立也切韻比也從二立今經作並俗字也下殊主反玉篇小童未冠者也切韻立也說文作豆經文從立俗用字",
    "網橛": "上文兩反說文云庖羲氏結網以漁也從糸罔聲罔音同上或作网󱹬像交結形也下其月反爾雅曰樴謂之杙郭璞注云橛也又作橜樴音特杙音羊式反從木弋",
    "噦嗌": "上乙劣反說文逆氣上也下伊昔反韻集云喉上也爾雅從齒作齸郭璞注云江東名咽爲齸也漢書宣帝崩邑王至京師城下不哭云嗌痛也",
    "欬瘶": "上苦槩反說文云謦欬也從欠亥聲也下蘇奏反肺病也說文從疒欶聲疒女厄反欶音同上經文從口作咳嗽二形皆非本字",
    "反蹙": "上府遠反不順切韻覆也從又厂聲又音手反音罕下㐄育反就也二手中指蹙上節如寶形印法也說文從戚足聲也經文或從就作蹵本字也",
    "絣之": "上伯萠反字書云振黑繩也集訓云絣撣也或從手作拼亦通字誥作𰭙古字也撣音彈",
    "㧙左指": "上駢蔑反考聲拗祕也拗音鵶絞反拗柲手指作印法也",
    "爲鞘": "下霄曜反考聲云刀劒室也從革肖聲也或從韋作韒亦通",
    "蟠於": "上伴僈反廣雅云蟠曲也方言云龍未昇天蟠在穴中謂之蟠龍也說文從虫從番聲番音同上僈音母官反",
    "莽莫枳": "上莫牓反下經以反或云莫計或云莫鷄皆梵語經重也卽金剛部母名字也",
    "熾盛": "上尺志反考聲熾亦盛也說文猛火也字書明光也從火熾省聲下承政反切韻長也方言云廣大也說文多也從皿成聲",
    "羅睺": "下胡釣反案字方言云一瞻也今云羅睺卽梵語也或云攞護此云暗障能障日月之光卽暗曜也",
    "計都": "亦梵語或云鷄兜或云計覩此云蝕伸亦暗曜也案羅睺計都常隱不現遇日月行次卽蝕亦名建墜二曜也蝕音食",
    "彗孛": "上徐醉反下蒲沒反爾雅云彗星爲攙槍郭璞注云彗亦謂之孛言其形孛孛似掃彗也李淳風云彗孛所犯皆凶攙初銜反搶楚庚反",
    "太白": "五星傍通祕訣云太白西方金之精一名長庚徑一百里其色白而光明也將軍之像出入循軌伏見以時將軍有功與熒惑合有兵其行一年一周天去日不過五十度",
    "鎮星": "中央土之精也一名地侯徑五十里其色黃其行遲二十九年一周天下星字說文從晶作曐云萬物之精也古文作𠻖像形也晶音精亦精光也",
    "忿怒": "上敷粉反說文云亦怒也從心分聲又音敷問反下乃故反玉篇恚也切韻瞋怒亦音弩今案忿怒像金剛頂瑜伽經云諸佛菩薩依二種輪現身有異一者法輪現真實身所修行願報得身故二者教令輪現忿怒身由起犬悲現威猛故也",
    "設咄嚕": "次都忽反下離古反或云窣覩嚕皆梵語輕重此云冤家卽於一切善法作冤害者",
    "纂歷": "上作管反韻英云集也爾雅釋詁云纂繼也說文云從糸算聲也算音蘇管反經文從莫作纂不成字也下郎的反切韻經歷也爾雅曰歷數也說文從止厤聲厤音同上經文作曆乃曆日字非纂歷也",
    "迺辟": "上奴改反切韻語辭也爾雅曰仍迺郭璞注云迺卽乃也釋文云古乃字也下必益反命也考聲召也切韻除也",
    "常袞": "下公穩反禮記玉藻云天子龍袞以祭鄭注云袞畫龍於衣上也案常袞卽潤文翰林學士姓名也",
    "拄腭": "下我各反口中上腭也說文云口上河也作谷谷音強略反口上畫重八像腭形也",
    "擘開": "上絣夌反廣雅云擘分也說文云揮也亦開也從手辟聲也",
    "聯鎻": "上輦鱣反聲類云聯不絕也說文連綴也從耳耳連於頰也從絲連不絕會意字也下蘇果反字書云釣鎻相連也",
    "持鍬": "下七消反俗字也亦作鍫正作鐰古文作𣂁爾雅云𣂁謂之疀郭注云鍬鍤字也方言云趙魏之間謂鍤爲鍬江東呼鐅巴蜀謂鍬爲鍤皆方俗異名也鐅音片蔑反鍤音插也",
    "蹲踞": "上音存下居御反考聲狐蹲也釋名蹲存也謂存其後不著於席也踞箕踞也禮云無箕踞也箕音基",
    "屈蔞草": "上軍律反下力句反似白茅而蔓生也今俗呼爲長命草也",
    "㪻一杓": "上居怨反切韻器𰙗物也又云抒水也從斗䜌聲䜌音戀𰙗音以沼反今𰙗㪻字也",
    "臍腰": "上徂奚反切韻膍臍也下以霄反玉篇腰脊也上作𦝫字",
    "二空": "案瑜伽持明儀作諸印契用五輪十波羅蜜五輪謂地水火風空二手各以小指爲頭依次輪上經言並二空卽並竪二大拇指也經作二腔音苦江反乃羊腔字書寫誤也甚乖經義",
    "虎狼": "上呼古反說文云山獸君也淮南子云虎嘯谷風生也從人虍聲虍音呼虎爪似人故從人或作󱴳廟諱不成字又作𧆞俗變非體下魯堂反說文云似犬白頰銳頭爾雅曰牝狼其子獥也獥音胡狄反",
    "𢝐咎": "上去乾反又作愆爾雅作諐釋言云逸諐過也下其　反切韻過也災也爾雅云咎顇病也說文人各相違也從人各經文作𠧨咎皆非本字",
    "駕馭": "上古訝反字書駕乘也詩云駕我其𮩴音之戌反下牛倨反切韻駕也世本云骸服牛乘馭馬周禮有五馭鳴和鑾逐水曲過表止舞交衢逐禽佐也說文從馬又又卽手會意字也經文作御侍也使也非駕馭字也",
    "傲誕": "上五倒反切韻慢也倨易也考聲云自高也爾雅曰傲謔也下徒旦反字書云大也切韻信也顧野王云欺也從言延聲也謔音香虐反",
    "臭穢": "上尺救反切韻凡氣總名也考聲云腥臭也說文從犬自自卽鼻也會意字古文作殠俗作臰經文從口作𭊴無此字",
    "妙灋": "下方乏反古文法字也今多用法字說文則法也切韻常也又數也",
    "馭宇": "宇玉矩反宇宙也集訓云寰宇也切韻大也又邊也從宀于聲宀音莫仙反",
    "沃盪": "上烏酷反韻詮云沃灌也聲類云以水淋下也下徒朗反切韻滌盪也又搖動也從皿湯聲",
    "絣地": "上北萠反切韻振黑繩也從糸并聲經文從手作絣音普耕彈也非此用",
    "蘇摩呼": "上蘇字借上聲呼梵語也此云妙臂",
    "魔䤈首羅": "古舊梵語也正云麼係濕嚩囉此云大自在卽色界天主也",
    "搵蘇": "上烏困反切韻按也方言云搵抐物入水也抐音奴困反下素姑反紫蘇草也按經搵蘇字合作酥切韻酥乳酪也",
    "擲於": "上直炙反切韻云投也振也又拋擲也古文作擿",
    "": "已上三經並無可音訓",
    "身帔": "下丕義反考聲云巾帔也切韻衣帔也說文云從巾皮聲或音披襜也非霞帔也",
    "輕縠": "下胡谷反韻詮云穀似羅而細也切韻云羅縠也從糸穀聲穀音谷",
    "交縫": "下扶用反爾雅曰緎羔裘之縫也說文紩衣也從糸逢聲緎音域紩音袟縫亦音逢",
    "商佉": "上失良反下羗奢反梵語也或作餉佉上音失量反此云蠃卽所吹法蠃也俗作螺字",
    "澄睟": "上直陵反切韻水清也考聲云澄定也說文云凝也亦作徵字下雖遂反玉篇深視也字書云潤澤也從目醉省聲作睟俗字也",
    "披擐": "上音被字書云加也考聲服也下音患桂菀珠叢云以身貫穿衣甲也五經音義亦音古患反",
    "謦欬": "上口冷反說文云亦欬也下苦戴反說文逆氣也亦瘶也音蘇奏反有作咳音胡來反非",
    "遍捫": "下莫奔反聲類云捫摸也集訓云撫摩也說文撫持從手門聲",
    "險詖": "上香撿反說文云阻難也從阜僉聲下彼義反切韻佞也說文云險詖也從言彼省聲也",
    "準繩": "上之允反切韻度也平準也下食陵反玉篇索也字書直也尚書曰木從繩則正也世本云倕作準繩也",
    "蘇彌盧": "舊云須彌或云彌樓皆梵言訛也今正云蘇彌盧此翻爲妙高也卽俱舍論云妙高層有四是也又云蘇彌盧欲天梵世各一千唐梵互舉一名也",
    "疲厭": "上音皮賈注國語疲勞也廣雅勌也從疒皮聲下伊焰反考聲飽也亦倦也說文云從犬甘肉作厭犬甘於肉也今俗變作厭字通用",
    "摩伽陁": "梵語也或云摩竭陀或云摩竭提或云墨竭提一也此云無毒害謂此國法不行刑戮其有犯死罪者但送置寒林也或云大體國言五印度中此國最大統攝諸國故也又云遍聡慧言聡慧之人遍其國內也皆隨義立名也",
    "一婆訶": "下音呵梵語也此云圌又作篅同音市緣反卽倉圌也",
    "側捩": "上阻力反切韻傍側也下綀結反玉篇云拗捩也從手戾聲戾音同上說文作戾犬在戶下也經文從糸作綟廣韻麻小結也非側捩手指結印義",
    "瑜伽": "梵語也或云瑜祁或云庾誐皆訛也此云相應案大論有四種相應謂乘相應境相應行相應果相應也",
    "記䇷": "下方列反切韻分䇷也考聲決也說文從言作謝亦同經文從草作莂埤蒼云穊種移蒔也非記䇷字",
    "欠陷": "上去劒反說文云少也下戶𪛏反𪛏於陷反玉篇入也切韻潰沒也又墮也說文云作臽小坑也從人在臼音舊",
    "墊下": "上都念反尚書曰下民昏墊孔傳云言天下民昏瞀墊溺也玉篇云墊下也瞀音務",
    "雜插": "上徂合反切韻云集也穿也字林衆也下楚洽反考聲㓨入也從手臿聲臿音同上作𢰔插皆非本字",
    "真多摩尼": "楚語或云振多末尼或云質多麼柅一也此云如意珠也抳音尼𭣼",
    "牸牛": "上疾吏反顧野王畜母也方言云牛牝曰牸牡曰特其子曰犢也皆從牛形聲也",
    "㝱寐": "上莫弄反說文云寐而有覺也從宀從爿夢周禮以日月星辰占六㝱之吉凶也一日正二日𰱹三日思四日悟五日憘六日懼也下蜜二反寑也息也從㝱省未聲也經文單作夢俗用亦通也",
    "嚕地囉": "上離古反下借音離加反梵語也此云血呼玦反",
    "卻送": "上正體却字也",
    "懵字": "莫亘反影梵聲也不求字義亘古鄧反",
    "睫瞤": "上卽葉反說文云目傍毛釋名云睫插也謂插於目匡也又云臉上毛也從目捷省聲也下如均反又作眴切韻目臉動也從目閏聲",
    "耶輸陁羅": "輸式朱反梵語也或云耶戍達羅正云以戍多囉此翻爲持譽也",
    "齧損": "上研結反禮記云無齧骨說文云齧噬也從齒㓞聲㓞音口黠反經文作嚙非",
    "筏羅捺斯": "筏音伐或云波羅痆斯亦云波羅奈梵語西域國名也",
    "雷電": "上嚕迴反說文作靁易曰天雷無妄論衡云陰陽氣激也下堂練反玉篇云閃電也釋名曰電𣧠也謂乍現則𣧠滅也說文陰陽激輝也從雨电音申",
    "蝗蟲": "上音皇考聲飛蝗也爾雅曰食苗心螟食葉𧎢食節賊食根蟊案並蝗蟲異名也下正體蟲字爾雅曰有足謂之蟲無足謂之豸",
    "擗地": "上房益反字林云擗撫擊也爾雅云擗撫心也郭注云謂椎胸也",
    "驚愕": "下五各反韻集云愕亦驚也說文從心咢聲咢音同上說文云正作㖾字也",
    "趒驀": "上他弔反切韻趒越也說文從走兆聲經文從足作跳或作跳皆俗字下莫伯反聲類云踰也切韻謾驀也說文云騙馬上也從馬莫聲也",
    "縛𢷏": "上符籰反籰王縛反考聲云繫也說文云束也從糸搏省聲經文從專作縛音傳誤書也下簿角反韻集云相𢷏也或作撲音普卜反非相𢷏字",
    "乾燥": "下古寒反宇樣云本音䖍借爲乾溼字下蘇老反說文火乾也從火喿聲喿音噪",
    "蚯蚓": "上音丘下音引切韻虫名也下亦作螾禮記月令云孟夏月蚯蚓出爾雅云螼蚓郭璞注云江東呼寒蚓也螼音羗引反",
    "牛𡲘": "下奴弔反考聲云溺也說文云從水𡱕省聲今經文作尿俗字通用",
    "髆傭": "上音愽考聲股上脾也說文云肩髆也從骨專聲經文從肉作膊音普博反謂乾脯也非經義下丑龍反鄭箋毛詩云滽均也說文云均直也從人庸聲有作𦟛俗用字亦通也",
    "迸竄": "上北諍反韻集云迸散也考聲云逃也說文云從走作𧻓下七亂反字林云逃竄也切韻亦誅也尚書云竄三苗於三危也說文云藏也從鼠在穴中會意字也",
    "搵嚕地囉": "搵烏困反韻集云搵抐按物入水也抐音嫩也嚕離古反囉離吒反嚕地囉三字梵語此云血也",
    "龜鼈": "上鬼爲反說文云龜舊也外骨而內肉者也從它龜頭似它天地之性也廣肩無雄龜鼈之類也以它爲雄像四足頭尾之形也下卑滅反說文云水介蟲也從黽敝聲有從魚作鱉非也",
    "噤口": "上渠飲反字統云寒而口閉也說文云從口禁聲有作䫴怒而切齒也非噤口字也",
    "蔓藤": "上無怨反韻集云瓜蔓也下徒登反切韻云苰藤草也考聲云藤蘿也",
    "所齧": "研結反說文云從齒㓞聲音口黠反經文作嚙非也",
    "驅擯": "上豈俱反考聲云奔也又逐也詩云弗馳弗驅說文云從馬區聲經作駈俗字下必刃反切韻云擯𢇛也集訓云弃也說文云從手賓聲",
    "𥳋子": "上作貪反韻集云䅤頭者也又音作憾反𥳋綴也從竹叅聲也",
    "脚鋜": "下仕角反顧野王云鎖足也韻略云足鋜也從金浞省聲經文作鎙俗或亦音朔戈屬非此用也浞音同上",
    "槊印": "上說文云作矟雙角反通俗文曰矛長丈八尺謂之槊經文從金作鎙俗用非也下於刃反韻集云符印也釋名云印信也因也封物因付信也從爪從卪古文作印字卪音節",
    "熒惑日": "卽火星直曰也五星傍通祕訣云熒惑南方火之精也一名罰星徑七十里其色赤光其行二年一周天仁王經中已具釋訖",
    "捨覩嚧": "或云率覩嚕亦云設咄嚕皆梵語訛轉也此云惌家也",
    "濺灑": "上煎線反說文云從贊作灒汚灑也下沙雅反亦散灑與濺字訓同",
    "薏苡": "上音意下音以顧野王云卽千珠也本草云薏茨性平主筋骨拘攣不可伸屈者又益氣二字並從草意以皆聲",
    "縈繞": "上伊營反下饒少反毛詩傳云縈縱也說文云收𤙻也從糸熒省聲繞纏也從糸堯聲",
    "涕泣": "上他禮反韻集云目汁也古今正字從水弟聲也下去急反切韻哭泣也集訓云無聲出涕曰泣也",
    "泚那": "上千禮反梵語也案字水㴱清泚貌也",
    "虵蠍": "上射遮反毛詩云惟虺惟蛇周易云虵豸屬也說文從它作蛇它音徒何反下許謁反毒蟲名也",
    "米嚲羅": "嚲音多可反梵語也此云死人屍也",
    "痠憷": "上素官反韻集云痠疼痛也考聲云骨痛也說文云從疒酸省聲下瘡舉反音譜云憷痛也顧野王云心利也從心楚聲又音初去反經文或單作楚荆楚也又州名非本字",
    "婆誐𮢥": "上去聲下亾范反經作𮢥俗梵語也舊云婆伽婆或云薄伽梵亦云薄伽伴皆訛此翻爲世尊六義總名",
    "鑠訖底": "上書灼反下丁禮反梵語也此云戟經中云手操鑠訖底卽威怒王所持戟槊也下底字經文或作底音止非梵語本音",
    "嚩日囉": "上音無滿反日囉二字合聲呼正梵語云舊云伐闍羅或云跋折羅此云金剛案經云或執嚩日囉卽無動尊所持金剛持是也",
    "糠粃": "上苦剛反亦作糠韻略云米皮也下補几反亦作秕顧野王云穀不成也國語云軍無秕稈也並從禾同",
    "棘刺": "上紀力反韻集云小棗木名也下又作㓨音七賜反爾雅云茦刺也郭璞注云草刺針也茦音初革反方言云凡草木而㓨人者也",
    "脹顋": "上知亮反考聲云滿也切韻肘脹也從肉張省聲下蘇來反說文顋頷也頷音胡感反字書云頰也經文作腮俗字也",
    "跣足": "上蘇典反集訓云足親於地也從足先聲下卽玉反爾雅曰足趾也從口止作足經文作足書寫人草變非也",
    "應踏": "下徒合反說文云著地行皃從足沓聲沓音同上又作蹋切韻云蹴蹋也案經合作蹋字作踏又音他荅反",
    "䋿珮": "上烏恢反說文云五色絲飾也從糸畏聲下蒲妹反韻英云玉珮也禮記云古之君子必以珮玉比德也",
    "香緌": "上許良反說文云香芬也正從黍其作𪏽或作薌穀氣也經文從草作萫非本字下儒佳反玉篇云冠纓也爾雅曰褘緌也郭注云香纓也交絡帶繫於體因名褘緌也從糸委聲經文作蕤乃葳蕤藥名也又蕤賓五月律管名案經以䋿𤧑香緌嚴飾大悲觀自在身也作萫蕤字甚乖經意",
    "𣱦氳": "上符分反下於云反說文氛氳祥氣或作氛元氣也二字並從气分昷聲气音氣也",
    "閒谷": "上古晏反韻集云溝㵎也爾雅云山夾水曰澗或作澗字俗用亦通下古鹿反玉篇山谷也爾雅曰水注谿曰谷又谷養也老子云谷神不死是爲玄牝也",
    "掣擊": "上昌列反韻詮云挽也字書云引也又音昌制反下古歷反切韻擊打說文云從手𣪠聲也𣪠音喫",
    "鉀縚": "上古狎反音譜云鎧𧿵也五經文字並單作甲云兵甲也下他刀反又作絛慆二形云綿絲繩也又音他到反",
    "指攪": "上職雉反韻略云手指也又指撝也斥也下古巧反玉篇手動也說文云從手覺聲也",
    "馺𩣯": "下蘇合反梵語也案字馺𩣯馬疾行皃也",
    "槲樹": "上胡谷反木名也考聲葉似松而細爾雅云樕撲心郭注云槲樕別名從木斛聲經文作穀亦通用",
    "毘那夜迦": "梵語也舊云頻那夜迦或毘那夜但迦或云吠那野迦吠借音微一反此云鄣礙神謂人形象頭能與一切作障礙故",
    "銅杓": "上徒紅反切韻云金一品也山海經云女林之山其陽多赤銅說文云赤金也從金同聲下市若反韻略云杯杓也從木勺聲勺音斫",
    "㪻油": "上居怨反字書云欥㪻物也從斗䜌聲欥音以沼反亦㪻也",
    "蘿蔔": "上音羅下蒲北反俗字也爾雅作蘆菔郭璞注云蘆菔蕪菁屬也紫花大葉根可啖也本草云性冷利五藏能除五藏中惡氣服之令人白淨又制麵毒若飲食過度可生食之",
    "痿黃": "痿於隹反考聲溼病也集訓云足不及也釋名云痿萎也如草木葉萎死於地也從疒委聲下胡光反爾雅云玄黃病也郭注云󱴾󱸹玄黃皆人病之通名而說者便爲馬病失其義也",
    "蘡薁": "上益盈反下於六反考聲云草名可食似葡蔔而小其子黑色說文云二字並從草嬰奧俱聲也",
    "椶櫚": "上子紅反下力居反韻集云栟櫚木名也考聲云栟櫚木有葉無枝二字從木㚇閭聲栟音并",
    "菖蒲": "上尺良反下薄胡反切韻菖蒲草名似蘭可以爲席也本草云菖蒲藥名八月採根百節者爲良也蘭音良刃反",
    "𪍿麥䴬": "上古猛反說文麥皮也方言云卽今大麥也下與職反字書無此字新字林云䴬麥芒也案麥字從來夂白虎通云麥金也金王而生火王而死也𪍿從礦省聲䴬從弋諧聲也久音雖",
    "江㹠": "上古腔反下徒論反俗字正作豚言江㹠卽江海水中大魚也其形類󱱰故以爲名風波欲起此魚先出水上出沒須臾有風浪起也",
    "鮫魚": "上古肴反說文云海魚名也皮有文可以飾刀劒也從魚交聲下語居反說文云水蟲也從𧢲水作󱹏爾雅曰魚膓謂之乙魚尾謂之丙郭注云皆似篆書字因以名焉",
    "瘡疥": "上楚良反古文作創𭃅刃破也釋名云瘡傷也言體有傷破也禮云頭有瘡則沐下音介又作疥說文云瘙也從疒介聲作疥亦同",
    "󱰿婆": "上又作󱱢音女林反梵語果木名也",
    "騷毘羅": "上蘇刀反梵語此云漉水囊",
    "釘橜": "上丁定反考聲以丁釘木也下其月反韻略云杙也爾雅云在地者謂之臬郭璞注云卽門橜也或作橛字",
    "歐逆": "上烏口反切韻吐也又作嘔同食療本草云猪膽止乾嘔也",
    "杙上": "上羊式反爾雅曰樴謂之杙郭注云卽橜也又作弋訓同樴音持方言北人謂橜爲樴也",
    "家貲": "上古牙反爾雅云牖戶之閒謂之扆其內謂之家說文云家居也字從宀豭省聲也宀莫仙反深屋皃豭音古牙反下卽移反說文云貲貨也又財也從貝此聲",
    "鄔波駄耶": "上安古反或云郁波第耶梵語輕重也此翻爲近誦爲以弟子年小不離於師常逐常近受而誦也鄔波馱耶亦翻爲親教舊譯爲知罪知無罪名爲和尚或云和闍並于闐等國訛轉也本非印度之雅言",
    "割䏶": "上正割字爾雅云割裂也韻集割剝也又斷截也下傍禮反俗字也正作䯗切韻股也從骨坒聲坒音比",
    "飢饉": "上古文作𩚮又作饑同音几治反下音覲爾雅云穀不熟爲饑郭注云五穀不成也又曰蔬不熟爲饉注云凡草菜可食者通名爲蔬春秋穀梁傳云二穀不升謂之飢三穀不升謂之饉五穀不升謂之災也災正災字",
    "剜割": "上烏桓反埤蒼云剜猶剈也廣雅義同說文云剜挑也從刀從𡖅音琓經文作剜字俗",
    "羯闌鐸迦": "下音薑佉反舊名迦闌陀亦云迦闌鐸迦皆梵語訛轉也本云羯嬾馱迦此云好聲鳥謂王舍城側有大竹林此鳥棲止多在其林因以名焉",
    "患痔": "上胡慣反考聲病也集訓云憂也切韻苦也惡也說文云從心串聲串音古患反下直里反切韻漏病也考聲云後病也說文云從疒峙省聲疒女厄反",
    "薜舍離": "舊云維耶離或云毘耶離正云吹舍釐此云廣嚴在恒河南中天竺也",
    "婆羅痆斯": "痆女黠反亦云波羅捺斯舊云波羅奈亦梵語西域國名也",
    "荻苗": "上徒歷反亦西域國名彼國多出此草因以爲名焉",
    "樗蒱": "上丑居反爾雅云栲山樗也下薄胡反爾雅曰楊蒱柳郭注云可以爲箭也案樗蒱二字戲也博物志云老子入胡因作樗蒲",
    "間錯": "上古莧反爾雅云間代也玉篇間廁切韻間迭也隔也下倉各韻集云雜也考聲東西爲交上下爲錯律文從糸作𦅘與橺同切韻桾也非間錯義",
    "嫂怪": "上蘇皓反爾雅釋親云兄之妻爲嫂弟之妻爲婦說文云從女叟聲又作嫂古文律文從更作㛐俗用字也下古壞反切韻怪異也又作恠字",
    "恍惚": "上虎晃反下呼骨反字林云心不明也老子云恍恍惚惚其中有物二字並從心光忽聲下或作忽",
    "嗢柁南": "上烏沒反次徒可反梵語也此翻爲集總散亦云足跡或云欇施皆隨義譯卽偈頌也",
    "獷戾": "上古猛反字書惡也顧野王云犬不可附也下郎計反爾雅云罪也切韻乖違也說文云曲也字從犬出戶下也二字並從犬律文從禾作穬乃禾𦬆也非獷戾也",
    "羅弶": "上魯何反韻略云網羅也詩云逢此百羅爾雅云鳥𮊁謂之羅或作羅下其亮反說文取獸具也從弓諒省聲也",
    "毘訶羅": "訶音呵或云微賀羅梵語聲轉也此云寺也或云僧伽藍摩此云衆園律云造五百毘訶羅卽五百寺也",
    "船舶": "上食川反方言云關東曰船關西曰舟說文云從舟沿省聲沿與專反沿路之沿鉛錫之鉛皆放此律文從公作船作舡皆俗字下傍陌反切韻海中大船也從舟白聲",
    "一撮": "倉适反适古活反字書云以手撮物也筭經云六十四黍爲一圭四圭爲一撮從手最聲又音臧适反謂手撮也",
    "傘插": "上蘇旱反廣韻傘蓋也陸氏本作繖下楚洽反說文刺人也從手臿聲臿音同上從手人臼也律文作插或作插皆誤書也",
    "土榻": "上他古反尚書曰土爰稼穡說文云土吐也能吐生萬物也從二二地之數也亅象地中物出也丨古本反下亦作㯓㒆同吐盍反字書云牀榻也從木𦐇聲𦐇音同上",
    "陂湖": "上彼宜反尚書云澤障曰陂爾雅曰陂者曰陂郭注云地不平也說文云從𨸏皮聲下戶吳反切韻江湖也廣雅曰湖亦池也從水胡聲也",
    "逃避": "上徒刀反集訓云亡也去也說文云竄也切韻走避也從辵兆聲辵丑略反亦作󱶅字下毘義反韻集藏也違也又去也迴也孝經曾子避席注云起荅也",
    "天竺國": "竺音篤或云身毒或云賢豆或云印度皆訛正云印特伽羅此云月西域記云謂諸群生輪迴不息無明長夜莫有司存其猶白日旣隱宵月斯繼良以彼土賢聖繼軌導凡利物如月照臨故以名焉",
    "摩揭陀": "或云摩竭提亦云墨竭提皆梵語訛轉也自古翻傳隨義立名或云不至言其國隣敵不能侵至也又云遍聰慧言聰慧之人遍其國內也又言無毒害言其國法不行刑殺其有犯死罪但送寒林耳",
    "拓頰": "上他洛反集略云手拓物也下古叶反切韻面頰也案拓頰與搘頤義同也頰籀文又作𩠣古字也",
    "分陀利": "梵語訛略也或云奔茶利迦或云奔䋈哩迦此云白蓮花其花如雪如銀光奪人目甚香亦大多出彼池人間亦無䋈音奴雅反",
    "栗㚲毘": "姑吐涉反梵語舊云離車子亦云梨車毘此云貴族卽公子王孫也",
    "無藳": "下古老反切韻禾稈也又藁本謂草創之本也說文云草也從草槀聲槀音同上",
    "摩納婆": "梵語也此云儒童仙也",
    "弶伽河": "上其亮反梵語舊云恒河應云殑伽音魚等反西域河名此河本出無熱惱池南面以彼沙細最多故引爲喻",
    "阿遮利耶": "梵語也舊云阿闍利訛也此翻爲軌範師也或云教受",
    "翅翮": "上又作翄同施智反集訓云鳥翼也下胡革反玉篇云鳥羽也爾雅云羽本謂之翮郭璞注云鳥羽也從羽支鬲皆聲也",
    "福鞔": "下母桓反說文云覆葢也案律文云以百福輓萬字手卽諸經律百福莊嚴網鞔手也律文從車作輓音挽說文云引車也甚乖律意",
    "聰叡": "上倉紅反說文作聰尚書云聽曰聰孔傳云耳聡明審也說文云察也從耳怱聲怱音同上怱字從心怱音楚江反律文作聡俗字下悅惠反洪範云叡作聖鄭注禮記云思之精也廣雅云智也古今正字深明也從𣦻從目從谷省𣦻音殘律文作叡不成字也",
    "鐵矟": "上他結反說文云黑金也從金𢧜聲律文作鐵俗字下雙捉反博雅云兵器也韻詮云長矛也從矛肖形聲字也律文有作槊俗字",
    "𥬰立": "上楚革反說文作𠕋云符命也謂上聖符信教命以授帝位像簡𠕋連掇之形律文作束驅束也說文云馬撾也非𥬰立字",
    "餉伽": "上式亮反梵語或作商佉二字此云蠃卽今所吹法蠃是也",
    "赫赫": "呼格反韻集云明也盛也考聲云發也詩云赫赫師尹爾雅云赫赫迅也郭注云謂盛疾貌律文從火作焃火赤色也非赫赫義也",
    "鄔波索迦": "鄔音烏古反索蘇各反迦薑佉反梵語也舊云優婆塞訛也此云近事男卽持十善戒白衣也",
    "惡鴟": "下處脂反爾雅云怪鴟也郭注云卽鴟鵂也今江東通呼怪鳥又曰梟鴟注云卽土梟也或作𩿍俗字也律文作鵄非也",
    "搦殺": "上女陌反字統云捉搦也從手溺省聲又音女角反切韻持也下所八反爾雅云斬刺殺也作煞俗字也",
    "腳踏": "上居約反俗作脚切韻手腳也釋名云腳却也以其坐時却在後也下徒合反考聲云著地行也又作蹋字林云蹴也",
    "青輅": "上倉經反東方色也羅浮山記云男青女青皆木名今不取下洛故反釋名云天子所乘白輅以金玉象等隨所飾名之前第五卷已釋",
    "懷迂": "上戶乖反爾雅云懷來也切韻安也說文云從心褱聲褱音同上下王俱反顧野王云迂大也遠也韻集亦云遠也案懷迂思來遠賢也",
    "曲磵": "上丘玉反切韻委曲也下古安反或作㵎爾雅云山夾水曰澗顧野王云百磵也",
    "罐綆": "上古玩反集訓云汲水器從缶雚聲缶音芳久反雚音貫下古杏反玉篇云汲繩也說文云汲井綆也從糸更聲糸音覓字",
    "簸之": "上布火反說文揚也從箕跛省聲又音布箇反今之簸箕是也",
    "𦅘色": "上古莧反宜作間字也律文前第二卷已廣釋訖",
    "孚附": "上方無反詩云萬邦作孚玉篇孚信也又悅也說文云鳥孚卵也從爪從子象形下符遇反切韻云寄也又著也考聲相依附也從付自聲也",
    "㭰爪": "上卒髓反廣雅云𭪿口也字書云喙也說文從此束聲亦作觜𠲿二形束音千四反衆音暉衛反下側絞反切韻爪距也又手爪也說文云覆手曰爪象三指形又作又字",
    "褒灑陀": "上保毛反中沙鮓反梵語也舊云布薩訛略也此云長淨謂十五日說戒增長淨業也",
    "鷦鷯": "上卽霄反爾雅云挑蟲鷦郭注桃雀也俗呼巧婦下洛簫反切韻云鷦鷯小鳥也莊子云鷦鷯巢於深林不過一枝也說文云二字竝從鳥焦尞皆形聲字也",
    "婆羅門": "不正梵語也應云沒囉憾摩此云淨行或云梵行自相傳云我從梵王口生獨取梵名世業相傳習四圍陀論例多博智守志貞白其中聰明頴達者多爲帝王之師",
    "刹帝利": "上初八反亦梵語也此譯云田主卽上古已來王族貴種亦習四圍陀論博聞強記仁恕弘慈其有德貞福勝者衆立爲王也",
    "戍達羅": "亦梵語不正也應云戍㮈囉此有多名一義譯爲衆雜或廣務田疇播植蓄產或工巧雜藝或漁獵採捕或庸作賃力四姓之中此最居下也",
    "𡖦甥": "上五會反下音生爾雅云姑之子舅之爲甥甥曰謂我舅者吾謂之甥說文作󱴋訓同爾雅也",
    "蚊蟻": "上亡分反俗又作蚉正作蟁說文云齧人飛蟲也字從昬省以昬時而出也下牛倚反說文作螘蚍𧉈也爾雅云蚍蜉大螘小者螘從虫豈聲也今作蟻俗字",
    "阿笈摩": "笈其獵反或云阿含暮或云阿鋡皆梵語輕重異也此云藏亦云傳謂佛祕藏累代傳行或翻爲教卽長中增一雜第四種阿含也",
    "篣籬": "上步光反字林云蒡箕也似箕而小以竹爲之從竹旁聲旁音同上下音離韻略云笟籬笟音側教反",
    "筐箕": "上去王反玉篇云籠屬也春秋傳曰筐筥綺釜之器也方言云圓曰筐方曰筥筥音居許反錡音魚倚反下居之反世本云少康作箕箒也",
    "柿樹": "上鋤里反切韻果木名也本草云乾柿厚膓胃建脾消宿血又紅柿補氣續經𦜡又醂柿澁下焦建脾能化面上黑䵟久服甚良醂音力感切",
    "帷幕": "上洧悲反釋名云帷圍也言以自障圍也說文云在傍曰帷從巾隹聲也下摩各反顧野王云覆上曰幕說文音訓同從巾莫聲",
    "器皿": "上丘利反說文皿也從㗊從犬㗊衆口也音戢像器之形大以守之下武永反玉篇器總名也說文作竝盛物之形也",
    "雌獼猴": "上正作雌音此移反切韻雄雌也說文云牝曰雌從隹此聲也次作獼音武移反顧野王云獼卽猴孫也",
    "分析": "上府文反切韻割也賦也與也考聲分遍也說文云別也從八從刀分割之形下先戚反爾雅曰析木之間漢津也說文破木也從斤斤可以破木會意字",
    "爲讎": "下市流反切韻怨也匹也考聲仇敵也說文云猶󱷜也從言雔聲也雔音同上",
    "鞞闌底": "上簿迷反下丁禮反梵語未詳飜對",
    "僧伽胝": "梵語舊云僧伽梨亦云僧伽致此譯云合重謂割之合成重作也此一衣必割截成也餘二衣或割不割若法密部說一切有部等多不割若聖辯部大衆部等則割之若不割者直安怗角此依玄應法師解也",
    "轂輞": "上古鹿反考聲云車轂也說文云車堅也詩云文茵暢轂從車𣪊聲下文兩反正輞字從車罔聲律文作𨊾俗用字也",
    "溫渜": "上烏昆反切韻云和也善也玉篇良也考聲云溫柔也下乃管反說文云湯渜也又作暖煖㬉三形皆喧暖也律文作燸撿無此字",
    "草庵": "上亦作廾說文云百卉也從屮音丑列反像草木初生之形也並二屮艸也早聲下鳥含反切韻小草舍也韻英云庵廬也玉篇亦舍也從广奄聲也",
    "撈出": "上魯刀反玉篇云取也字林云撈摸取物也從手勞聲律文從水作澇音郎到反非撈出義下尺律反切韻進也遠也說文云出字從古文出字像四出之形律文從二山作出誤書也",
    "漩濄": "上辭選反說文云水回淵也從水旋形聲字律文單作旋謂旋旋次了也非此用下烏和反字林水𢌞流處也說文云從水過聲律文作渦音戈水名也非漩濄義也",
    "蝦蟇": "上胡加反下莫加反說文云水蟲也𣈆書慧帝於華林園聞蝦蟇聲謂左右曰鳴者爲官爲私乎古今正字蛙屬也從虫叚省聲下又作蟆從虫莫亦聲",
    "婚禮": "上呼昆反爾雅云婦之黨爲婚兄弟也壻之黨爲姻兄弟禮記云娶婦也婦陰也以昏時而入故曰婚也下盧啟反考聲云儀也釋名云禮體也謂知物大體周禮有五禮謂吉凶賓軍嘉禮也論語云不學禮無以立也古文作禮字",
    "黑瘦": "下所祐反切韻瘦損云說文云瘦臞也爾雅云臞瘠也郭璞注云齊人謂瘦爲臞音衢或作癯字瘦或作瘦字",
    "腹脹": "上方六反切韻心腹也爾雅云竺腹厚也顧野王云脾爲腹所以容重也亦五藏也從肉复聲复音復下猪亮反切韻脹滿也左傳痛也字書作痮同上音",
    "瘡殨": "上楚良反切韻瘡痍也古文作創釋名云瘡傷也謂身有所傷也禮記云頭有瘡則沐下胡對反集訓云肉爛也案瘡殨卽肉爛殨癑也癑音奴凍反律文作潰玉篇散亂也非瘡殨義也",
    "𭽫澀": "上七倫反又皴說文云皮細起也從皮夋聲夋音同上下色立反字書塞不通也說文云從四止二正二倒作歰又作濇音同上說文云不滑也",
    "䧫阬": "上胡刀反又作濠說文云城池也字書云隍濠也律文從土作壕俗字無水曰隍有水曰濠下客庚反切韻阮壍也爾雅云阬虛也郭注云阬壍也律文作坭坑皆俗傳誤也",
    "汎漲": "上孚劒反韻英汎多也玉篇濫也切韻云浮也又作泛下知亮反考聲云漲大水滿也從水張聲也",
    "湊聚": "上倉候反考聲聚也說文云水會也從水奏聲下慈庾反切韻集會也考聲衆也說文云集也從𠂢取聲乑音吟三人共立也",
    "𠕋立": "上初革反說文云土𠕋符命也謂上聖符信教命以授帝位像簡𠕋穿連之形也今或從竹作笧下立字切韻云住也成也又行立",
    "贍部金": "上時染反贍部梵語也金卽唐言舊梵云閻浮提或云閻浮利訛正云㣅謀立世阿毘曇論云有贍部樹生此洲北邊泥民陁羅河南岸於此樹下水底有贍部黃金古名閻浮檀金也㣅音蠶覽也",
    "指擿": "上職雉反說文手指也從手旨聲下他曆反玉篇撥也切韻發動也案律以指挑擿也從手適聲古文又音擲又張革反今不取但依初",
    "根栽": "上古痕反切韻云根枑也爾雅云天根互也郭注云角元下繫於氐若木之有根也下柤才反說文種也從木哉省聲律文作栽俗字無據也",
    "𦁛蕠": "上徒叶反切韻作㲲白㲲布也下尼居反玉篇草名也韻集云縕麻也從草絮音同上",
    "祭祠": "上子例反切韻享也祀也爾雅云祭天日燔柴說文云字從手持肉以示也下音詞爾雅云春祭曰祠郭注云祠猶食也音飤也",
    "朅地羅": "上褰㜸反梵語西方木名無正翻對類此方苦練木也爲堅硬堪爲橜釘也舊云佉陁羅木是也",
    "攪池": "上交巧反毛詩傳云攪亂也字書云撓也說文云動也從手攪聲下直离反廣雅云池沼也又曰停水曰池也",
    "懷妊": "上戶乖反切韻安也止也玉篇和也情懷也考聲懷抱也從心褱聲下汝鴆反考聲云身妊也說文云懷孕也從女壬聲又音如林反訓同",
    "輦輿": "上力展反說文云人輓車也在前人引之形從㚘音伴二夫也古者卿大夫亦乘輦自秦漢以來天子乘之玉篇云天子皇后所乘曰輦下余據與居二反說文云車輿也玉篇衆載也又舉也一曰車無輪曰輿從車舁會意字律文中作轝非",
    "左腋": "下之亦反玉篇云腋胳也亦脇下也又音亦從肉掖省聲",
    "儒語": "上人朱反切韻直也說文柔也禮記哀公問於孔子儒之行也從人需聲下魚舉反說文云直言曰論論難曰語從言吾聲案律文徐徐儒語卽和柔之語也作此濡字乃水名也非儒語用也",
    "薜室羅末拏": "上音蒲計反下尼加反梵語舊云毘沙門是也此云多聞卽北方天王名",
    "舌舓": "上時烈反說文云在口所以言也從千口口亦聲也下時紙反說文云舌取食也從舌易聲或作𦧇䑛皆俗律文作蚔音岐非誤書字",
    "談話": "上徒含反切韻言論也又戲調也說文云語也從言炎聲也下胡快反玉篇語話也說文云合會善言也詩云慎爾出話從言舌卽會意字",
    "跋窶": "上蒲末反下其矩反梵語也或云跋渠此翻爲聚謂篇章品類之異也卽四分律中楗度義同也",
    "畫牆": "上胡罵反爾雅云畫形也釋名云畫挂也以五色挂於物上也說文云從聿田四界聿所以畫也一卽地也律文作畫俗字下而羊反說文垣也從嗇片聲律文作󱸛或作𭎷皆非本字",
    "腳跌": "上又作脚音居約反集訓云手脚也釋名云脚却也以其坐時却在後也下徒結反切韻跌踢也踢他歷反韻詮云差跌也廣雅云行有失也說文從足失會意字也",
    "搖颺": "上餘昭反下餘亮反說文動也爾雅云扶搖謂之焱也焱音必遙反郭注云暴風從下上也颺謂風飛颺物也從風易聲又音羊",
    "蠅蛆": "上餘陵反玉篇蟲名也詩云營營青蠅說文云從虫黽聲黽音猛下七予反蠅所乳者也考聲肉中蛆也說文從肉作膽律文作蛆俗字也",
    "降誕": "上古巷反爾雅云降下也玉篇歸也考聲落也尚書云降二女於媯汭也下徒旱反切韻云誕大也信也玉篇欺也廣雅云誕育也說文云從言延聲亦作這",
    "恍迷": "上虎晃反玉篇云恍惚也老子云恍兮惚其中有物御注云物上道也自有而歸無還復至道故云其中有物也考聲恍心迷昧也從心光聲下莫奚反切韻云錯也說文云惑也從辵米聲辵音丑略反作辶變體也",
    "阿泥盧馱": "下唐位反梵語也或云阿㝹樓馱舊云阿那律正云阿泥律陁此云無滅羅漢名也謂天眼第一者也",
    "𧘂突": "上尺容反切韻當也向也考聲動道也又交道也玉篇亦𧘂揬也下徒骨反考聲云欺也韻英云觸也說文云犬從穴下欲出也",
    "舞蹈": "上無主反切韻歌舞也左傳云舞者所以節八音而行八風也爾雅云舞𨂜雩也說文從舛無省聲律文從人作儛非下徒到反切韻踐履也說文云從足舀聲也案手謂之舞足謂之蹈也律文作踏音徒荅反非舞蹈義也舛音川兖反",
    "知諳": "上陟离反切韻覺也考聲曉達也說文從口矢聲也下烏含反玉篇云諳信也韻英云記憶也從言音聲",
    "持篲": "上直之反說文云執持也從手寺聲下囚歲反爾雅釋草云葥王篲也郭注云似藜其樹可爲掃篲也江東呼爲落帚郭璞序云輒復擁篲清道也或作彗亦通律文從手作㨹非",
    "𨏦傷": "上良刃反玉篇云車聲也考聲云車輾也又作躙蹂踐也古今正字云從車閵聲也閵音同上下失良反切韻損也痛也或作慯",
    "穿舶": "上昌緣反切韻云通也韻集云穿破也玉篇云漏也下音白考聲云海中大船也從舟白聲也",
    "木槍": "上木字說文云木冒也謂冒地而生也作𡴅下像其根上像枝也下七羊反字林云槍矟也從木倉聲",
    "皤私": "上蒲波反具正云婆私瑟乇梵語也此云勝上或云最勝也",
    "觜端": "上卽委反埤倉作𭪿說文同鳥喙也律文從口作嘴字書無此字下多官反切韻云緒也正也考聲直也說文始也從立耑聲耑音同上云像物初生未舉其頭與豈字義同不從山",
    "絞頸": "上古巧反考聲云絞縛也爾雅云𮈜絞也郭注云糾絞繩索也下居郢反說文云項頸也從頁巠聲也",
    "稱賣": "上又作枰音處陵反說文云詮也又舉也亦音昌孕反知輕重也從禾爯聲爯音同上下莫懈反切韻云敗賣也考聲云貨賣也從士買聲也",
    "胄族": "上直又反尚書云命汝典樂教胄子孔傳云胄長也謂元子已下至卿大夫子苐也字林胤也說文云從由月聲月音上報反下昨木反韻詮云宗族也爾雅云父之從祖祖父爲族曾王父父之從祖祖母爲族曾王母又曰族晜弟之子相謂爲親同姓郭璞注云同姓之親無服也",
    "糠穢": "上苦崗反玉篇云米皮也又作穅字亦同說文云穀皮也從禾康聲下於廢反切韻云惡也字書云雜穢也顧野王云不潔也又作薉音訓皆同也",
    "嫁娶": "上古訝反字書云嫁家也考聲云婦人謂嫁曰歸爾雅釋親云同出爲姨郭注云謂俱已嫁也下七句反廣韻納婦也公羊傳云諸侯娶一國二國往媵之爾雅云媵送也音孕娶從女取聲也",
    "慵嬾": "上蜀容反說文云惰也字書云亦嬾也下落旱反切韻作懶心惰也郭注爾雅云勞苦者多惰音徒果反",
    "疆界": "上居良反爾雅云疆界邊衛圍垂也郭注云疆場境界邊旁守衛皆在外垂也說文云疆從土彊聲也界從田介像分界之形律文作彊正體強字非也",
    "黶子": "上於琰反切韻云面上黑黶子也字書云從黑厭聲也有作靨俗字也",
    "瘡疱": "上楚良反玉篇云瘡痍也禮記云頭有瘡則沐古文作創下防教反切韻作靤面瘡也說文正作皰皮起也今律文作疱俗字也",
    "曾孫": "上作登反爾雅釋親云子之子爲孫孫之子爲曾孫郭注云曾猶重也又曰曾孫之子爲玄孫玄孫之子爲來孫來孫之子爲晜孫晜孫之子爲仍孫仍孫之子爲雲孫也晜古文昆字郭注云晜後也",
    "百䡬": "下莫半反案百䡬卽釋迦上祖王名",
    "餘壻": "下又作𦕓聟二形皆俗字音蘇計反說文云女夫也爾雅釋親云女子子之夫爲壻婦之父母壻之父母相謂爲婚姻兩壻相謂爲亞郭注云江東呼同門爲僚壻也",
    "跣腳": "上蘇典反考聲徒跣謂脚觸於地也下脚字前根本藥事已具釋",
    "犇馳": "上博昆反文字集略云犇驚也說文作奔走也爾雅云大路謂之奔郭注云謂人行步趨走之處也下直离反切韻云馳逐也字書云馳騖也說文云從馬池省聲字",
    "晡剌拏": "舊云富蘭那訛也具正應云晡剌拏迦葉波晡剌拏此云滿迦葉波姓此云龜氏也此是計無因外道名也",
    "末揭梨子": "舊云末伽梨具足云末揭梨拘舍梨子末揭梨是姓拘舍梨是母名也此計苦樂不由因是自然外道也",
    "珊逝移": "上蘇乾反梵語外道名也前破僧事第二卷中已具解釋也",
    "阿末多": "舊云阿耆多鵄舍甘婆羅阿耆多此云無勝鵄舍此云髮甘婆羅此云衣此外道以人髮爲衣五熱炙身也",
    "腳陁迦旃延": "舊云迦羅鳩駄此云黑領迦旃延姓也此外道應物而起人若問有答有問無答無也",
    "眤揭爛陁": "舊云尼乾陁若提子尼乾陁此云無繼是外道總名也若提此云親友母名此計苦未有定因要必須受非道能斷",
    "跟趺": "上古痕反切韻云足後跟也下方無反玉篇脚趺也謂脚面也說文又從付作跗也",
    "摩納薄伽": "梵語舊云摩納婆亦云摩那婆此云儒童仙也",
    "薜陀咒": "上蒲計反梵語也舊云韋陁或云吠陁此云明卽明咒也",
    "轟然": "上呼宏反說文云群車聲字從三車",
    "圮岸": "上平鄙反字書云覆也圮亦毀也韻略云岸毀也尚書云方命圮族說文云從土已聲下五肝反切韻河岸也爾雅云重涯岸謂兩涯累者也",
    "背僂": "上補妹反切韻云脊背也爾雅云鮐背壽也郭注云背皮如鮐魚者猶耆也下力主反字書云傴僂疾也切韻云僂曲也玉篇曲行也從人縷省聲鮐音台",
    "瘦瘠": "上所救反下秦昔反切韻瘦損瘠病說文云瘦臞也爾雅云臞脙瘠也郭注云齊人呼瘠瘦爲臞脙音衢求說文作𤸃也",
    "諂語": "上丑琰反字書云詔詐從言臽音陷說文云從閻作讇云諛也下魚舉反切韻云言話也說文云語論也從言吾聲",
    "攀鞦": "上普班反說文云引也切韻戀也從手樊聲下七遊反韻英云車鞦也從革秋聲又作鞧緧䋺三形音訓並同也",
    "歔欷": "上朽居反下許旣反考聲悲也韻略云泣也顧野王云歔欷泣餘聲也說文云並從欠虛希聲也欷去聲",
    "攢搓": "上在九反考聲云叢生也韻集云合也說文云正體從贊作攢下七何反字林云手搓物令緊也二字並從手",
    "𢗅遽": "上莫郎反切韻云𢗅悕也說文作忙下其倨反玉篇云急也字書云戰慄也又窘也從辵豦聲作遽俗辵丑略反豦音倨也",
    "拉摺": "上藍荅反何注公羊傳云拉折也古今正字摧也從手立聲說文作󱶍下之涉反玉篇云亦折也字林云摺疊衣服也",
    "鐵𭪿": "上他結反說文云黑金也神異經云南方有獸名曰齧鐵大如水牛其糞可作兵器也下又作觜字林云鳥喙也律文作唃非",
    "韛袋": "上又作㰆同蒲拜反說文韋囊也考聲云吹火具也律文作排船後木名也非此用下徒耐反說文作帒盛物帒也",
    "皴腫": "上七綸反說文云皴皮細起也或作皴同律文從足作踆說文云退也非此用下之隴反說文云病也釋名云腫鍾也謂熱所鍾也從肉重聲",
    "黕色": "上都感反字書滓垢也字林黑色也下所力反切韻云顏色也又色澤美好也",
    "妙翅": "下施智反說文云鳥羽也又作翄同案妙翅卽金翅鳥也梵語舊云迦婁羅正云誐魯拏此云金翅亦云妙翅此鳥具四生胎卵等能食四生龍如前已釋",
    "恐嚇": "上丘隴反切韻云驚也爾雅云恐懼也從心巩聲巩音拱下呼格反玉篇云嚇怒也字書云呼怒聲也從口赫聲也",
    "囂埃": "上許嬌反韻英云喧囂也說文云聲也謂气出頭上也從㗊頁頁頭也㗊音戢气音氣下烏開反說文云細塵也從土矣聲也",
    "獯狐": "准律文合作𪇑鶘二字上音勳下音胡集訓云𪇑鶘鵂𪅳怪鳥也形如土梟晝伏夜出好食虵鼠也今作獯卽獯鬻匈奴別名也作狐卽鬼所乘獸也律次下文云或作野狐頭是",
    "斤斲": "上舉忻反說文云斫木也象斤之形切韻十六兩也下竹角反集訓云削也說文云斲亦斫也從斤𠁁聲字書作𦘣音訓同或作𣃆𧯞二形皆非本字",
    "捫摩": "上莫奔反字書摸也考聲云摩捫摸𢱢也從手門聲下莫何反韻英云摩挲亦捫摸也",
    "囈言": "上魚祭反又作䆿說文云睡語驚也從口藝聲作䆿從𮄥省臬聲也臬魚結反下言字說文云從口辛聲也辛音𠍴也",
    "浣濯": "上作澣同胡管反字書云洗浣也下直角反切韻云濯亦洗也禮記云浣衣濯冠以朝說文云從水幹聲也",
    "鄔波馱耶": "上烏古反梵語也舊云和尚訛此云親教謂親能教受餘弟子故以名焉",
    "輪轂": "上力迍反切韻云車輪周禮云軨方以象地葢之象天輪圓以象日月也下古屋反玉篇車轂詩云文茵暢轂老子云三十輻共一轂也",
    "優樓頻螺": "梵語訛略也具正云鄔盧頻螺迦葉波鄔盧頻螺此云木瓜爲胷前有𤸇似木瓜果因以爲名迦葉波此云飲光卽姓也",
    "澡漱": "上子皓反說文云澡洗也禮記云儒有澡身浴德陳言而伏靜下蘇秦反切韻漱口也𣈆書孫楚謂王武子曰所以漱石欲礪其齒律文作藻謂蘋藻水草交爲文也非澡漱義也",
    "警寤": "上居影反考聲云警戒也說文云寤也字書云覺察也禮記云將上堂其聲揚鄭注謂警內人也下吾放反說文云寤覺也從𮄥省吾聲也律文作驚說文馬逸也作窹楚人謂竈也並非警窹字也",
    "未曙": "上說文未味也五行木老於未象重𰆰葉也木有滋味也𰆰音枝下常恕反切韻云曉也考聲云明也說文云謂旦日未出從日署聲",
    "馭牝": "上牛據反說文云駕也周禮有五馭謂鳴和鑾逐水曲過袁止舞交衢逐禽左也世本云骸服牛相王乘韓哀作馭也下毘忍反爾雅云牝騇郭注云草馬也騇音舍",
    "襞褺": "上必益反下徒叶反字書云襞掠重褺衣裳也並從衣辟執聲律文下作𢮕音𦯧謂𢮕度物也非襞褺義也",
    "霏霏": "芳非反切韻云雰霏雪落皃從雨非聲也雰音撫文反",
    "躓害": "上陟利反說文云礙也字書云躓頓也從足質聲下戶艾反說文云傷也從宀宀家也口言也丰聲害從家中起也律文作害俗字手音介",
    "怪愕": "上古壞反論語云子不語怪王肅注云怪異也律文作恠亦通下五各反切韻驚也從心咢聲也咢音同上",
    "瓦礫": "上五寡反爾雅云瓦豆謂之登古考史云昆吾氏始作瓦下郎擊反字林砂礫也釋名云礫小石子也律文作礰石聲也非瓦礫義也",
    "捲打": "上玉篇渠圓反顧野王云無捲無勇也捲力也切韻作拳屈手也廣雅云拳拳憂也下切韻都挺反擊也秦音得耿反說文云以杖擊也又去聲",
    "牸豺": "上疾吏反切韻牛牝也玉篇母牛也下士諧反爾雅云豺狗足郭注云脚似狗禮記云豺乃祭獸也從豸才聲豸文尒反",
    "捺洛迦": "下姜佉反或云那落迦梵語異也此云苦器或云苦具謂受苦之器具卽八寒八熱無間等大地獄總名也",
    "咍然笑": "上呼來反方言言楚人謂笑曰咍下私妙反禮記云執紼不笑臨喪不笑說文云欣笑也從犬戴其竹樂然後笑有作㗛𠸍二形皆非",
    "橜杙": "上其月反下與職反爾雅云樴謂之杙郭注云橜也在地者謂之臬郭注云卽門橜也又作橛樴音特臬魚列反",
    "迸血": "上北諍反說文迸散也或作𧻓字下呼𤤭反切韻云濃血也釋名云血濊也謂流濊汚也濊呼栝反水聲",
    "爬摑": "上蒲巴反切韻搔爬也或作把下古獲反玉篇云掌耳也音譜云以手摑搭也從手國聲也",
    "火爒": "上呼果反尚書云火日炎上世本云燧人鑽木作火也下力小反說文云炙也考聲云火逼也從炙尞聲律文從火作燎亦通尞音聊燧音遂",
    "薄伽畔": "下薄半反梵語或云薄伽梵舊翻爲世尊謂世出世間咸尊重故六義如前已釋卽十号之中第十号",
    "呾他揭多": "上當割反梵語舊云多他阿伽度或云但他誐多此云如來也卽十之中第一号也",
    "霶霈": "上普郎反下普葢反切韻云霶霈大雨也字書云雨盛皃二字並從雨滂沛形聲字也律文作滂沛水流皃非大雨義",
    "索訶界": "上蘇各反次音呵梵語舊云娑婆此翻爲堪忍界也",
    "旭上": "上許玉反切韻云早朝也說文云旦日出皃又明也從日九聲下時掌反說文云登也古文作上字又作尚二音同上",
    "朝曦": "上陟遙反切韻曉也爾雅云朝旦早也老子云飄風不終朝下許羈反切韻日光也從日羲聲也",
    "貧窶": "上符巾反字書窮也乏也古文作穷下其矩反切韻貧無禮也爾雅云窶貧也郭注云謂貧陋",
    "样來": "样音羊廣雅云槌也字書引廣雅作椎字老子云椎輪車",
    "繩棬": "上食陵反切韻索也又直也尚書云木從繩則正下丘員反切韻云器似斗屈竹爲也案繩棬卽以繩作棬形用搭物也律文作𢃩與󱸭同小憒也",
    "貆貈": "上呼官反下下各反爾雅云貈子貆穆天子傳云天子獵於漆澤得玄貈以祭河宗律文作獾狢二字音同俗字亦通用",
    "匱乏": "上求位反說文云竭也切韻云亦乏也下房法反說文云貧也亦匱也左傳云反正爲乏也字不從之也",
    "伉儷": "上苦浪反下郎計反字書云等也又敵也顧野王云不能庇其伉儷是也",
    "倏歸": "上式竹反切韻倏忽也說文云疾也從犬攸作倏犬倏走疾也律文作儵爾雅云儵儵嘒嘒離禍毒也又青黑繒也非倏疾義下舉韋反切韻云還也就也又安靜也",
    "誤舛": "上五故反切韻云錯誤也說文作悞同下昌兖反說文云乖也亦錯也云對臥也從夕音若瓦反井音陟駕反律文作舛非本字也",
    "卒歲": "上子聿反說文云終也切韻云盡也旣也字從求一聲也律文作𣨛爾雅云𣨛徂落殪𣦸也義乖於卒歲下相𨦣反爾雅云夏曰歲郭注云取歲星行一次也說文云從二止作𣥗戌聲也",
    "殉命": "上辭閏反廣韻云以生人送葬也亦求也顧野王云用力從死也凶身從物爲殉也下眉病反切韻云使也教道也玉篇云信也說文從口令卽聲",
    "褰衣": "上去乾反顧野王云齊魯謂捨曰褰禮記云暑母褰裳鄭注云褰袪也下於機反世本云黃帝臣胡曹姓作衣也上曰衣下曰裳也",
    "𡍩廠": "上丑格反俗作坼同切韻裂也亦破毀也下尺亮又尺兩二反字譜云車廠字林云露舍也從广敞聲也广音儼",
    "草苫": "下失占反爾雅云白蓋謂之苫郭注云白茅苫也今江東呼爲蓋音胡臘反",
    "踰城": "上與俱反考聲云踰越也過也顧野王云無踰我里也又作逾同下市征反崔豹古今注云城者盛也所以盛受人物也說文云所以盛民也從土成聲也",
    "窺覘": "上去規反玉篇小視說文云從穴規聲也字書又作闚同下丑占反切韻云窺也玉篇云公侯之信伺也又音勑艷反也",
    "瓦鍋": "上五寡反又作凡像瓦之形下古和反字書云鐵器也說文作󱷖云釜有足有喙以土爲之也又作堝切韻云甘堝也今作鍋或云溫器也",
    "跳躑": "上亭遙反下呈亦反前第十二卷中已訓釋訖",
    "癕瘡": "上於容反又作癰切韻㿈疽瘡也下楚良反玉篇瘡痍也古文作創禮記云頭有創則沐",
    "秔米": "上古行反釋文云稻米也本草云炊作乾飯食之止痢又作粳俗字下莫禮反說文穬粟實也象禾實之形也",
    "或歍": "下音烏切韻云以口相就也字書云從欠烏聲也律文從口作嗚謂嗚呼哀歎聲非歍唼義也",
    "牀𤖖": "上士莊反考聲云牀榻也又作床俗字通用也說文云從木爿聲爿音牆下古皇反字書云牀𤖖也謂橫木也律文作桄謂恍榔木名也今俗亦用爲床桄字也",
    "歐變": "上謳口反考聲云歐謂欲吐也字書云胃中病也說文云吐也從欠區聲律文作漚音烏侯反亦於侯反謂久漬非歐義下彼春反化也切韻通也說文從文䜌聲",
    "鵂鶹": "上朽尤反下音留考聲云恠鳥也集訓云鵂鶹卽𪇑鶘惡鳥也爾雅云鵅鵋䳢郭注云今江東呼鵂鶹爲鵋䳢也鵅音格鵋音忌䳢音欺案此鳥晝伏夜飛鵂鶹𪇑鶘皆取所鳴爲名也形如角鷹蒼黑色好食虵鼠也",
    "摘取": "上陟革反考聲云手摘物也說文作揥取也律文作擿又音他曆反下七庾反切韻收也覓也從耳從又又卽手也律文作取俗字也",
    "衣裓": "下古得反衣前襟也又云婦人之衣大帶也",
    "躊躇": "上紂流反下音除考聲云躊躇心不決定不卽行也韓詩外傳云躊躇猶俳佪不進也廣雅云猶豫也二字並從足壽著聲也",
    "駙馬": "上符遇反駙馬官名也字書副也皇偘云周穆王好養馬有人能調良者以女妻之出近天子之馬因名駙馬漢書金曰磾善掌御馬有此官名",
    "婚媾": "上呼昆反禮云婦陰也娶婦以昏時人故曰婚也爾雅云婦之黨爲婚壻之黨爲姻也下古侯反字書云重婚曰媾也",
    "髀肉": "上傍禮反切韻云股髀也說文從骨卑聲也又作䯗亦通律文作䏶非下說文作肉象筋肉之形今變體作肉字",
    "寶輅": "上博抱反切韻珍也瑞也亦賝也禮記云地不藏寶也古文作珤從玉缶聲下洛故反卽大輅也案五輅隨飾爲名以寶飾曰寶輅也",
    "目瞤": "上其鹿反玉篇云離爲目目者氣之精明也說文云象目之形也古文作󱵜下如輪反考聲目臉動也又作眴律文作𥌎音而緣反目皮垂也非瞤動義",
    "鶉鳥": "上常倫反字林云䳺鶉也淮南子云蝦蟇化爲鶉也爾雅云鳥之雌雄不可別者以翼右掩左雄也",
    "鞌𰹫": "上鳥寒反切韻鞌𩋋也或作鞍俗字非下兵媚反說文云馬𰹫也詩云六𰹫如絲從絲𨊥作𬘍象形也從口從亾作轡𮝲皆非",
    "欶癰": "上所角反字書云口噏也或作嗽律文作嗍非下於容反切韻云癰疸瘡也律文作㿈俗字",
    "吁嗟": "上況于反考聲吁疑恠之詞也從口于聲律文作噓音朽居反吹噓也非吁嗟字下子邪反切韻云咨嗟發歎詞也",
    "金㡌": "下莫報反切韻巾㡌說文作曰云小見蠻夷頭衣也或作冐覆也並也用也",
    "脚跟": "下古痕反切韻足後跟也",
    "野干": "梵語悉伽羅此云野干案青黃色形如狗羣行夜鳴聲如狼郭注莊子云野干能緣木廣雅云巢於危巖高木又音夜干與狐異也禪經云見一野狐又見野干明是二物也律文作犴音岸又莪寒反說文胡地犬也非野干字",
    "牽拋": "上苦堅反切韻引也挽也考聲云進也說文云從冖牛玄聲也冖葵營反作牽非下疋皃反字書云拋車所以飛塼石者也又音普包反今不取也",
    "楩樹": "上房連反字指云麥類爾雅云棆無疪郭注云楩屬似豫章釋文又音婢善反棆音倫同",
    "妊胎": "上汝朕反又如林反說文云孕也切韻身妊也從女上聲也律文作姙俗字下湯來反考聲云胞胎孕也爾雅云胎始也郭注云肧胎未成亦物之始也",
    "重裹": "上直容反切韻云複也考聲云重疊也下古火反切韻云包裹也聲類云裹束纏縛也從衣果聲也",
    "鞾鞵": "上許󱸔反󱸔於鞾反釋名云鞾本胡服趙武靈王所好服也從革華聲也或作靴亦通下戶佳反切韻云鞵屩履屬也從革膎省今作鞋通用膎音同鞵佳音古鞋反",
    "獰惡": "上乃庚反切韻云獰惡也或作獰考聲云人不善情也下烏各反正作惡又烏故今不取",
    "鵮啄": "上苦咸反說文云鳥鵮物也又作㪠律文作呫他筐反甞也又而涉反非鵮義也下竹角反切韻云鳥啄物也說文云從口豖聲豖丑玉反琢𣵠皆從此也",
    "弶柵": "上其亮反韻英云取獸具也從弓京聲也下楚革反切韻村柵也說文云堅木也從木冊聲冊音同上",
    "抖擻": "上都苟反下蘇走反考聲云抖上舉也擻亦振也二字從手斗數皆聲也律文作捒非本字也",
    "老貓": "下莫交反切韻食鼠獸名方言云似虎而小人家養以捕鼠也",
    "掊地": "上薄交反字林音手掊也律文作瓟說文云似瓠可爲飲器也非掊地字也",
    "蘇呾羅": "呾音怛梵語也舊云修多羅亦云素怛纜義翻爲經也",
    "毘奈耶": "或云鼻奈耶或云毘那耶皆梵語輕重也此云調伏藏卽律也",
    "阿毘達磨": "舊云阿毘曇訛也此云對法卽論藏也",
    "饕餮": "上吐刀反下他結反字林云貪財曰饕貪食曰餮也",
    "詃誘": "上決兖下音酉韻略云詃諀誘引也玉篇云相勸動也又教也並從言形聲字",
    "敗績": "上蒲邁反廣韻云自破曰敗也爾雅云圮敗覆也郭注云謂毀覆也從文貝聲下子曆反爾雅云績功勳也郭注云謂功勞也字書積業也成也說文作績字",
    "馭馬": "上牛據反前破僧事第八卷已具釋",
    "怨讎": "上於袁反玉篇云枉也下市流反切韻怨也禮記云父之讎弗與共戴天也鄭注云父者子之天也殺已之天與共戴天非孝子也",
    "薜陀論": "上蒲計反薜陁梵語舊云韋陁或云吠陁此翻爲明卽西域四明論也",
    "楔木": "上先結反切韻云木楔也卽以楔去楔也律文作榍謂門閫也非木楔義",
    "襃灑陀": "上保毛反次沙假反梵語也此云長淨卽半月和合說戒增長淨法也舊云布薩訛也",
    "俱瑟恥羅": "梵語羅漢名具足應云摩訶俱瑟恥羅此云大膝以膝蓋大故因以爲名也",
    "摩窒里迦": "窒下結反或云摩但里迦或云摩得勒伽皆梵語輕重也此云本母卽論藏",
    "鉢喇底木叉": "喇卽遏反舊云波羅提木叉此云別解脫卽七衆別解脫戒卽律藏也",
    "佇立": "上直呂反切韻云久立也又作泞爾雅作宁釋宮云門屏之間謂之宁郭注云人君視朝所宁立處也",
    "疲倦": "上符羈反韻集云勞也字書亦倦也說文云從疒皮聲也下渠卷反切韻云疲也猒也玉篇懈也或作勌亦同",
    "榻席": "上吐盍反說文云牀榻也又作㒆字同下样石反薦席也大戴禮云武王踐祚有席銘詩云我心匪席不可卷也說文從巾󱲁聲󱲁音疾有作蓆非也",
    "白鸖": "下下各反說文云似鵠長啄字從霍聲也左傳衛懿公好鸖有乘軒鸖霍音同上前已釋訖",
    "氍毹": "上具愚反下數初反舊音義云西戎胡語也考聲云織毛爲文彩卽毛布也聲類云毛席也或作𣯸𣰰字",
    "揵稚": "梵云臂吒揵稚臂吒此云打揵稚所打木也",
    "鷹隼": "上於陵反切韻鳥名也月令云驚蟄之日鷹化鳩也下息允反考聲云今之鷂也廣雅云鷙鳥也爾雅云鷹隼醜其飛也翬音暉也",
    "侏儒": "上音朱下乳朱反鄭注禮記云侏儒者短人也韻英云小也古今正字竝從人朱需形聲也",
    "祆祠": "上呼煙反胡神官名方言云本胡地多事於天謂天爲祆因以作字",
    "䵩狗": "上力脂反字林音力奚反黃黑色也通俗文云班黑日䵩也下狗說文云從犬句作狗律文作㺃非本字",
    "兄嫂": "下蘇晧反爾雅云兄之妻爲嫂禮記云叔嫂不通問說文云從叜作㛮",
    "堅鞕": "下五孟反切韻云堅牢也說文云從革更聲也或從石作硬亦通用",
    "脚跌": "徒結反切韻差跌也謂脚失也從足失聲也",
    "烏鷲": "上鄔都反說文孝烏也純黑而反哺者曰鳥小而不哺者鵶也下疾溜反考聲云黑色鳥也從鳥就形聲字也",
    "兩骽": "下吐猥反切韻云骽股說文云股髀也又作脮同律文作腿俗字非",
    "革屣": "上古核反改也字書云獸皮去毛也又更也說文云三十年一世可更革也故從三十口口卽國也下所綺反切韻云履不躡跟也舊音義云言革屣者西域皮底鞋也",
    "疿子": "上方未反切韻云熱生細瘡也律文中脚生佛子如芥子顆今詳佛字與疿字書寫人誤不可比丘脚上生佛子甚乖律意也",
    "䩺頭": "上烏紅反廣韻云吳人謂鞾靿曰䩺案卽鞾靺等䩺也律文作𦃽非",
    "脚踝": "下胡瓦反說文云足跟也顧野王云架衣負繩及踝也從足果聲",
    "式叉摩拏": "下尼加反梵語舊云式叉摩那此翻爲正學女卽學戒尼也謂持六法者也",
    "剔頭": "上他歷反案剔頭應作𩮜字說文云除髮也今作剔謂割肉解骨也非除髮用也",
    "羯恥那": "或云迦絺那舊云加提皆梵聲訛轉也此云功德衣卽自恣竟所受衣也",
    "繚緣衣": "上力小反切韻繚繞也下以絹反玉篇云衣緣也考聲云緣飾也爾雅云衣有緣者謂之純郭注云衣緣飾也",
    "瘂默": "上烏雅反說文云不能言也從疒亞聲又作亞俗用非本音厄笑聲也",
    "奧箄迦": "皆如字呼梵語也此云可尒或云應如是也",
    "娑度": "梵語也律文云荅云娑度此云善哉也",
    "誥誓": "上古到反誥告也周書云成王將黜殷作大誥孔傳云陳大道以誥天下衆國也下時制反說文云約也周書武王伐殷作泰誓孔傳云大會以誓衆也爾雅云誥誓謹也郭璞注云皆所以約勒謹戒衆也",
    "典謨": "上多殄反爾雅云典常也虞書將遜位於虞舜作堯典孔傳云言堯可爲百代常行之道也下莫胡反謨議也虞書臯陶失厥謨大禹成厥功作大禹皐陶謨孔傳云大禹謨九功皐陶謨九德也禹稱大大其功謨謀也",
    "班彪": "上布還反姓也出扶風風俗通云楚令尹鬪班之後也下甫休說文云虎文也案班彪卽人姓名也",
    "慷慨": "上苦朗反下苦槩反說文云慨太息也文字集略云慷慨竭誠也二字竝從心康旣皆聲也",
    "襟腑": "上居音反切韻衣襟也字書云袍襦袂也爾雅云衣背謂之襟卽交領下方矩反切韻胏腑也王叔和脈經云心如未敷蓮花與大膓小膓合爲腑也或作府",
    "將㢮": "㢮詩紙反切韻釋也爾雅云㢮易也玉篇云名解也顧野王云去離也弓解也又作號爾雅作㢮也",
    "纂龍樹": "上作管反切韻云集也爾雅云纂繼也謂嗣續也說文云從系算聲下龍樹二字西域造論菩薩名也算音蘇管反",
    "悰上人": "上藏宗反切韻云慮也說文樂也從心宗聲也卽大唐彥悰法師名",
    "捃摭": "上君運反方言云捃取也下之石反說文云拾也考聲云收取也從手摭省下亦作拓從手石聲也",
    "狄道": "上徒曆反案狄道隴西地名也唐書云高祖神堯皇帝姓李隴西狄道人也有本作秋字甚乖",
    "徙寓": "上斯氏反說文云移也切韻云遷也爾雅云遷運徙也郭注云今江東通言遷徙說文云從彳二止半行也下牛具反玉篇云寄也從宀禺聲也禺音同上",
    "抽簪": "上勑鳩反切韻云去也考聲云除也又拔也說文云從手由聲下側岑反考聲云槧冠簪飾也說文云從竹朁聲也朁音潛又才紺反",
    "殫玉講": "上當安反孔注尚書云殫盡也說文訓同從歺單聲案本傳云究金言殫玉牒或作牒字破邪論中琳公啟與此同亦作牒字卽白牒梵夾經論也今此別傳作玉講於義未詳矣",
    "隱遁": "下屯嫩反玉注楚詞云潛隱也鄭注禮記云逃遁廣雅云避世也或從辵豚作遯也豚音徒魂反",
    "鏗鍠": "上客行反禮記云子夏曰鐘聲鏗鏗是也又撞擊之聲也下音宏毛詩傳云鐘鼓鍠鍠爾雅云鍠鍠樂也說文云鐘鼓聲也從金皇聲也傳文作鍧音呼宏反鐘鼓相雜聲也",
    "隤紐": "上徒雷反廣雅云隤壤也韓詩云遺也考聲云物下墜也說文云從阜貴聲下女九反說文云絲也結可解者也從系丑聲",
    "韜韞": "上吐刀反說文藏也切韻云寬也下於粉反切韻云韞藏也論語云韞匵而藏諸說文云從韋舀昷皆聲韋音違韋說文云柔皮也",
    "還莅": "上戶關反切韻云退也返也玉篇同爾雅云復也下力至反切韻云臨也爾雅云臨莅視也又作涖蒞二形竝同",
    "箴規": "上職林反切韻云箴戒也考聲云規諫也從竹咸聲又作葴草名也下居隳反玉篇圖也考聲視也字從夫見也字統云大夫識見必合規矩故從夫也有作規非也",
    "蠢蠢": "尺允反切韻云出也爾雅云蠢作也又云蠢不遜也說文云蟲動也從䖵春聲䖵音昆蟲總名也",
    "衮龍": "上古本反禮記玉藻云天子龍衮以祭鄭注云先王之服雜采曰藻衮畫龍於衣也禮記或借卷字作衮讀",
    "禿丁": "上他谷反說文云無髮也從人在禾下也文字音義云蒼頡出見禿人伏於禾下因以制字也",
    "三元": "史記云五氣遍運二靈體分以陽發故氣冲爲天以陰凝故氣沈爲地天地形別爲之兩儀以人參之三元備矣",
    "五運": "下王問反爾雅云遷運徙也史記云伏犧以木德或曰春皇神農以火德木生火故也黃帝以土德以火生土故少昊以金德土生金故顓頊以水德金生水故以木火土金水五行相生終而復始謂之五運又周以木德漢以火德秦非正運王在木火之間也",
    "勛華": "上訓雲反下畫瓜反卽堯舜二帝名堯曰放勛舜曰重華虞書云放勛欽明孔傳云放上世之功化而以敬明也舜典云重華協於帝孔傳云華謂文德言其光文重合於堯俱聖明也",
    "接踵": "下之隴反切韻云足後也考聲云繼也又住也儀禮云舉前曳踵也或作㣫說文云相躡行也卽繼前跡",
    "褫運": "上池爾反蒼頡篇云褫徹也說文云奪也易曰以訟受服終朝三褫也從衣虒聲音戈",
    "戲譚": "上香義反切韻云戲弄也爾雅云戲謔也郭注云謂調戲也下徒含反切韻云誇也大也又作談音徒甘反廣韻云言論戲調也與譚稍異也",
    "荐雷": "上前薦反爾雅云荐𧏐再也周易云洊雷震王弼注云荐重也周易或作洊說文作瀳三形雖異訓義一也",
    "蟄戶": "上直立反說文云藏也一曰蟲豸聲也禮記月令云驚蟄之曰桃始花說文云從虫執形聲也",
    "憤懣": "上汾吻反論語云不憤不發下門本反王逸注楚詞云懣亦憤也蒼頡篇云悶也說文煩也從心滿聲古文亦作懑字",
    "惄焉": "上寧曆反毛詩傳云惄愁也爾雅云念惄思也說文云憂也從心叔聲也叔正體𠦑字也",
    "磣黷": "上初錦反下音獨陸禨漢祖功臣頌云茫茫宇宙上磣下黷波振四海塵飛五缶今此傳云二義磣黷四海沸騰波振塵飛義與彼同又破邪論中亦琳公啟作磣黷二字今別傳作黲毒二字並誤",
    "原燎": "上牛袁反爾雅云廣平曰原下力召反尚書云若火之燎於原也說文云放火也從火尞聲也",
    "烽燧": "上敷容反又作㷭字書云候望火也下徐醉反釋名云夜曰烽晝曰燧說文云二字並從火夆遂聲",
    "羽檄": "上王句反說文云鳥羽也下胡狄反爾雅云無枝爲檄也說文云符檄三尺書也從木激省聲或從手非",
    "刁斗": "上鳥聊反下當口反孟康漢書云以銅爲之受一斗晝炊飲食夜擊警衆持行隨軍也今改爲金鉦是古今正字云斗有柄並象形字也",
    "昊天": "上胡老反爾雅云夏爲昊天郭注云言氣晧旰也說文作昦從日夰聲夰音晧下天字釋名云以舌腹言之天顯也在上高顯也又天之言坦也坦然高遠故字從一大也旰音月旦反",
    "胥悅": "上息余反孔注尚書云胥相也公羊傳曰胥盟者何曰相盟也鄭箋詩云皆也說文從肉疋聲音疏傳文作𦙃俗字非體也",
    "庠序": "上似羊反禮記云有虞氏養老於上庠庶老於下庠上庠太學下庠小學說文從广詳省聲下徐舉反玉篇云東序西序之學也爾雅云東西牆謂之序郭注云所以序別內外",
    "無辜": "下古胡反爾雅云辜辟戾罪也郭注云皆刑罪也說文云從辛古聲或有從手作辜變體誤書也",
    "躃踊": "上房益反爾雅云辟撫心也郭注云椎胸也或作擗禮記作辟下餘隴反切韻云䠊也或作踊禮記云歎斯辟鄭注云辟撫心也又云辟斯踊矣鄭注云踊躍也晏子云踴貴履賤",
    "太宰𧯻": "下音丕鄙反鄭注禮記云大宰行人官名也說文云從壴否聲傳文從壹丕作噽俗字壹音竹句反",
    "謗讟": "上博傍反孔注論語云謗訕也杜注左傳云謗毀也說文從言旁聲下同目反杜注左傳云讟誹謗也廣雅云惡也郭注方言云謗誣怨痛曰讟說文云從言讀聲",
    "大駭": "下侯揩反說文云驚也孫炎云禹疏九河北河功難衆懼不成故曰徒駭字從馬亥聲",
    "赫胥": "上呼格反下息余反古帝号也史記云女媧共工大庭栢皇中央栗陸驪連赫胥尊盧渾沌旲英有巢朱衰葛天陰康無懷氏等除共工十五世皆襲伏犧之号雒甄曜度曰伏犧女媧紀各一萬六千八百歲也",
    "密譖": "下側讖反說文云毀也字書云讒也論語云浸潤之譖字從言朁聲也朁音潛傳本作譖俗字非體",
    "穿鑿": "上昌緣反切韻云通也下在各反考聲云鑿也古考史云孟莊子作鑿說文云所以穿木也從金𣫩省聲𣫩音作也",
    "倫嫓": "上力迍反切韻比也考聲云道理也又類也下疋閉反爾雅云妃嫓也郭注云相偶嫓也說文云配也從女𣬉聲𣬉音閉迷反妃音配",
    "狡猾": "上古巧反切韻云疾也說文云狂也從犬交聲下戶八反尚書云蠻夷猾夏孔傳云猾亂也說文云從犬骨亦聲也",
    "於莒": "下居許反玉篇云草名也釋文云國名春秋時所封亦羸姓之後也",
    "壈坎": "上盧感反下苦感反說文云險陷也謂難進也從土稟欠皆聲",
    "腠理": "上倉奏反鄭注儀禮云腠皮膚理也考聲云皮膚內也古今正字從肉奏形聲字也",
    "搢紳": "上津信反鄭注禮記云搢猶插也注周禮云搢謂插笏於紳帶之間若帶劒也下尖真反考聲云紳大帶也廣雅云紳猶束也論語云子張書諸紳說文云從糸申聲也",
    "志緝": "下七入反切韻云緝績也爾雅云緝熈光也注引詩云學有緝熈于光明也字從糸口耳會意字也",
    "汲郡": "上金邑反考聲云汲郡今衛州是說文云從水及聲",
    "𨶑然": "上苦覓反字書云寂靜也說文云從門臭聲臭音古覓反犬視也從犬目",
    "遒華": "上就由反毛詩傳云遒周也考聲云盡也切韻云聚也說文云從辵酋聲酋音同上",
    "郁郁": "於六反切韻文也論語云郁郁乎文哉或作戫古文作彧皆文彩貌也",
    "悚慴": "上粟勇反杜注左傳云悚懼也說文作𢥠今作悚俗字通用下之涉徒叶二反爾雅云恐慴懼也切韻云伏也與懾義同",
    "𰔨𧷤": "上他頜反考聲云通也韻詮云引取也從手𥥽𥥽音深𥥽從穴求也傳本作探俗字下柴責反韻英云深幽也古今正字幽深也從𦣞貴聲𦣞以而反責正作賚字",
    "碑誄": "上彼皮反釋名云碑本葬時所樹臣子追述君父之功書其上也下力軌反考聲云誄壘也述亡者而敘哀情也說文云誄諡也從言耒聲也耒音盧會反",
    "辛諝": "上息隣反姓也夏啟封支子於莘莘辛聲相近因爲辛氏下胥旅反鄭注周禮云有才智之稱也案辛諝卽唐太子中舍姓名",
    "靦容": "上天典反爾雅云靦姡也郭云面姡然也姡音戶刮反鄭箋毛詩云姡然有面目也考聲云不知慙也說文云從面見聲也",
    "爝火": "上音爵字書云火炬也說文以火拂除袄也從火爵聲也下呼果反書云火曰炎上也",
    "寰中": "上戶關反說文云寰宇也字書以四海爲寰中也今傳文云非夫契彼寰中孰能爲茲高論也作此鐶字恐非此用",
    "尺鷃": "上或作赤同下音晏爾雅云鳸鷃郭注云鷃雀也或作鴳考聲云小鳥也地穴作巢者從鳥晏聲也鳸音戶",
    "大鵬": "下音朋大鳥也莊子云北溟有魚曰鯤化爲鳥曰鵬又垂天之翼搏風九萬里也說文從鳥朋聲也",
    "王謐": "音蜜爾雅云謐寧靜也案此卽人名",
    "劉璆": "渠幽反爾雅云西北方之美者有璆琳琅玕焉郭注云璆琳美玉名今案劉璆人姓名也",
    "礪鉛": "上力制反說文云砥礪也考聲云磨石也顧野王云崦嵫山多砥礪也下與專反切韻云錫也尚書云青州貢鉛說文云青金也從金沿省聲案沿路舟船之字皆同也今作鈆俗",
    "貽訓": "上與之反切韻云貺也爾雅云貽遺也郭注云相歸遺也說文從貝台聲台音同上下許運反說文誡也又導也廣韻云男曰教女曰訓尚書序云典謨訓誥誓命之文凡百篇以弘至道也",
    "流遁": "上力求反考聲放也切韻云遷也字菀云流移也說文云從水㐬㐬音他忽反倒書古文㜽字㜽音子下又作遯說文逃也字書云隱也從辵豚聲",
    "本系": "上說文云作本從木一如木之有根下胡計反切韻云緒也爾雅云糸繼也說文云從糸丿聲糸音覓丿音曳延丿也",
    "沙汰": "上音所加反切韻沙亦汰也下音太考聲云濤汰洗也案沙汰卽如沙中濤洗其金取精妙者也",
    "推劾": "恒得反顧野王云案獄相告證之辭也說文推有罪人也從力亥聲或從刃從刀作𠜨𠛳二形皆非",
    "縲絏": "上累追反下先拽反孔注論語云縲黑繩也絏攣也所以拘罪人也古今正字並從糸字累曳皆聲也俗亦作紲字",
    "檮昧": "上音桃杜注左傳云檮杌也謂無所知貌也從木燾省聲也下昧字說文云爽且明也從日未聲也杌音五骨反",
    "叨簉": "上討刀反下搊瘦反杜注左傳云簉副也考聲云廁也齊也說文云從草造聲造七到反傳文從竹俗",
    "餔糟": "上補乎反切韻唼食也離騷云餔其醩歠其醨又音步今不取下音遭說文亦作醩酒滓也從酉曹聲也",
    "歠醨": "上川劣反切韻大欱也音呼合反下呂支反說文云薄酒也從酉离聲也",
    "菁華": "上卽盈反毛詩云葑菲卽蕪菁也字書云菁美也又與精義同從草青聲也",
    "逗遛": "上頭候反下音留說文云逗亦止也又引也字書云逗遛也說文云二字並從辵豆留皆聲也",
    "媒衒": "上莫杯反說文云媒娉也字書云媒也言謀合於親姻也從女某聲下黃絹考聲云行且賣也說文正作𧗳自媒也",
    "橘柚": "上居聿反說文云果名也周禮云踰江淮北化爲枳地氣然也下余救反字書云似橘而大皮厚廣志云成都柚大如斗郭注爾雅云柚似橙而酢生江南也二字並從木矞由皆聲也",
    "𣛼梨": "上側加反爾雅云𣛼梨曰鑽之郭注云𣛼似梨而酢澁也下力脂反說文云果名也魏文詔云真定之梨大如拳甘如蜜也",
    "皦然": "上古了反說文云明也又玉篇云白皃字從白敫聲音羊酌反從白放光也",
    "負扆": "下於豈反爾雅云󱶸戶之間謂之扆禮記疏云如綈素屏風畫以斧文亦謂之斧扆也說文云從戶衣聲",
    "苻姚": "上房無反前秦姓也史記云健本洛陽臨渭人因其家池中蒲生有異遂以蒲爲姓後孫背上草付字却爲苻氏下餘昭反後秦姓也自姚越仲至泓立三十四年爲劉𥙿所滅",
    "諤諤": "五各反說文云𧮈諤也字書云直臣言也從言咢聲咢音同上",
    "拓跋": "上他各反下盤末反後魏姓也魏書云黃帝昌意少子受封於北地以土德王北人謂土爲拓謂后爲跋故以拓跋爲氏至孝文帝因讀周易見乾卦云元者萬善之始遂改爲元氏也",
    "劉向": "下式亮反漢書云劉向高祖親弟劉德之子本名更生後改爲向字子政武帝時爲中壘挍尉之官也",
    "闞澤": "上苦濫反人姓名也",
    "太微": "星名也七曜天文經云太微官垣十星在翼北主天子南宮爲帝王十二諸侯之府入翼九度去北辰七十六度",
    "鐫石": "上子緣反字書云鑽也說文云琢金石也從金雋聲也雋音徂兖反從隹臥弓雋字從此有本作鎸誤書也",
    "扈多": "上胡古反跋扈縱恣也今案扈多人姓名",
    "敻遠": "上休娉反劉兆注公羊傳云敻亦遠也說文視也又深遠也從𡕥人在穴上也𡕥音火劣反亦視也",
    "邕邕": "或作雍或作廱並略同爾雅云雍雍優優和也郭注云和樂也於容反說文作邕和也",
    "徼妙": "上古弔反考聲云邊外也韻詮云小道也道德經云常無欲以觀其妙常有欲以觀其儌御注云性失於欲迷乎道無欲觀妙本則見邊徼矣",
    "李聃": "下他甘反老子姓名也史記韓非列傳云姓李名聃苦縣人也周定王元年乙卯生於李樹下簡王二年爲守藏令十三年爲柱下史敬王元年壬午年八十五西出散關或云葬於槐里",
    "盪瘵": "上徒朗反易云盪滌也又洗除也說文從皿湯聲皿明丙反傳文作蕩非下齋薤反毛詩傳云瘵病也爾雅亦病也從疒祭聲",
    "夕殞": "上祥石反說文暮也從日半見也下于敏反切韻殞沒也又死也從反員聲音五達反",
    "麟麕": "上西珍反公羊傳云麟者仁獸也有聖王則至其郊爾雅云麟麕身牛尾一角角端有肉下輒筠反公羊傳云有麋而角也說文云此𰪡文麕字俗通作麏字",
    "天利": "案帝年曆後周武帝立十九年保定五年天和七年健德六年自建德三年二月普滅佛法也今傳文作天利五年誤書也應爲和字也",
    "掏攪": "上道刀反埤蒼云掏抒也古今正字從手匋聲匋音同上下交咬反說文云手動也從手覺聲",
    "䡈試": "上江岳反說文云䡈見也又明也爾雅云直也古今正字試優劣也從車爻聲傳文從交作較俗字亦通也",
    "騰驤": "上徒登反考聲云馳也奔勇也玉篇云躍也說文從馬滕省聲下息良反字書云馬騰躍也考聲云逸也說文云馳也從馬襄聲襄音同上",
    "桀紂": "上具列反夏之末王号也史記云帝發之子爲湯所伐死於鳴條之野諡法曰賊仁多侈曰桀下直久反殷之末帝也史記云帝乙之子也爲武王所伐敗於牧野懸首白旗諡法曰殘義損善曰紂紂緯辛也",
    "燉煌": "上遁魂反下音皇漢書云燉煌郡卽沙州也武帝元年分酒泉郡置之杜林注云燉煌以爲古瓜州也古今正字二字並從火敦皇皆聲",
    "癃跛": "上六忠反蒼頡篇云癃痼疾也說文云從疒隆聲也下布火反切韻足跛也從足波省聲也",
    "皐繇": "上古勞反下音姚尚書皐陶爲帝舜謀古文作𠧨繇二形今作皐陶二形說文從白𠦍聲今或從自非也𠦍音滔案皐陶卽舜之臣也",
    "八埏": "下衍仙反漢書音義云八埏卽地之八際也古今正字從土延聲",
    "澘然": "上所姦反毛詩云澘然涕淚下也從淋目會意也",
    "淑忒": "上殊六反爾雅云淑善也說文云清湛也從水叔聲俗作洲詩云淑不善逆也下他德反爾雅云爽忒也郭注云用心差錯不專一也",
    "撞擊": "上宅江反說文云撞突也字書云撞亦擊也從手童聲也",
    "杜衡": "上徒古反下戶庚反山海經云天帝之山有草焉其狀如葵其臭如䕷蕪名曰杜衡郭璞注云香草也本草云䕷蕪卽虵牀也音縻無二字杜衡有本作杜衡誤書甚乖也",
    "蘩𧂉": "上附袁反下薄波反爾雅云蘩𧂉蒿也郭注云白蒿又云蘩之醜秋爲蒿也",
    "懕懕": "伊占反平聲爾雅云懕懕媞媞安也郭注云好人安靜之容也說文云從心厭聲也傳文單作厭音於艷反見也非此用媞音大兮反",
    "𡠜母": "上暮蒲反古時醜女也一云黃帝后",
    "鸋鴂": "上侫丁反下古穴反爾雅云鵄鴞鸋鴂鴃郭璞注鵄類也說文從鳥寧夬聲也夬音古快反",
    "汨𤄷": "上冥壁反下音羅江水名也在長沙郡也上說文從水冥省聲下𤄷字傳文單作羅非又上汨字傳文或從曰作汩卽汩沒字音骨全別也",
    "薜茘": "上蒲計反說文薜蘿也蔓也生者也下郎計反字書云香草名也",
    "蘭葩": "下怕巴反說文云葩花也從草白巴俱聲也",
    "纘祖宗": "上作管反說文云纘繼也字書云承繼也從糸𮚋聲說文作𮚋字祖音則古反爾雅云祖王父也又曰父之考爲王父王父之考爲曾祖王父曾祖王父之考爲高祖王父郭注云加王者尊之酋猶重也言高者最在上也宗音作冬反說文云尊也白虎通云宗廟先祖之宗貌也孝經云爲之宗廟以鬼享之也",
    "納麓": "下盧谷反虞書云納於大麓孔傳云麓錄也納舜使大錄萬機之政也晉中興書云九月癸卯皇太后臨朝稱制司徒王導錄尚書也字從林鹿聲也",
    "保釐": "上博抱反切韻云保安也考聲云養也說文云使也下力脂反尚書云允釐百工孔傳云允信釐治也又曰帝釐下土孔傳云言舜理四方",
    "淳源": "上常倫反廣韻云朴也說文云水清也作漳又作淳字也下愚袁反說文云水泉曰源山海經曰河出崐崘西北隅李巡云河水始出其色白郭璞注爾雅云潛流地中汩漱沙壤衆水溷淆宜其濁黃也",
    "薨變": "上呼弘反爾雅云崩薨死也郭璞注云古者死亾尊卑同稱故尚書云堯曰殂落舜曰陟方乃死字書云天子曰崩諸侯曰薨說文云從死瞢省聲瞢音莫登反",
    "杳邈": "上烏皎切韻杳冥也孝聲云深也顧野王云寬廣貌御注老子云杳冥不測也下莫角反說文遠也韻集云邈漸也從辵貌聲錄文作邈俗字",
    "珠璫": "上音朱字書云蚌中之精也下都郎反文字集略云耳飾也說文穿耳施珠曰璫從玉當聲",
    "涇渭": "上音經山海經云涇水出長城北山北入渭郭璞注云今涇水出安定朝郍縣西岍頭山東南經新平扶風至京兆高陸縣入渭水也下音謂山海經云渭水出鳥鼠同穴山東注河入華陰北郭璞注云鳥鼠同穴山今隴西首陽縣也",
    "驪珠": "上里知反莊子云夫千金之珠必在九重之淵驪龍頜下若能得之遭其睢也彼驪龍悟時子安得哉說文云從馬麗聲也",
    "燕珉": "上於田反切韻云古國名爾雅云燕曰幽州下武巾反考聲云美石次玉山海經云岐山之陰多白珉郭璞注云珉石似玉也說文云從玉民聲有作珉字爲唐朝廟諱民書不就也",
    "趙璧": "上直小反切韻郡名也下必益反晏子云曾子將行晏子送之曰和氏璧井里之朴良工修之則爲國寚爾雅云肉信好謂之璧郭注肉邊也好孔也",
    "縱櫂": "上子用反說文云縱緩也一曰舍也從糸從聲下亦作棹音直教反說文船檝也方言云吳人謂棹爲橈音饒所以進舟也從木濯省聲也",
    "駟馬": "上息利反爾雅云天駟房也郭注云龍爲天馬故房四星謂之天駟說文云從馬四聲也下莫下反說文云馬字四點像足頭尾具王以乘之像形字也論語云齊景公有馬千駟注云四千疋也",
    "狂瞽": "上渠王反字書云病也韓子曰心不能審得失之地則謂之狂說文從犬王聲也下公戶反孔注尚書云無目曰瞽舜父有目不能分別好惡故時人謂之瞽也",
    "蓍龜": "上式之反說文云蓍生千歲三百莖筮者以爲策也周易云蓍之德圓而神下居追反說菀云靈龜五彩似玉似金背陰向陽上高像天下平法也禮記云故先王秉蓍龜以決吉凶也",
    "大頀": "胡故字書云大頀殷湯樂名也",
    "泥洹": "上奴低反下胡官反或云般泥洹或云泥越或云般涅盤或但云涅盤皆梵言訛略也正云波利儞嚩南此云圓寂嚩音無可反",
    "編摭": "上卑連反說文云編次簡也謂古以竹簡書字故排連編次也下之石反字書云摭拾也玉篇摭取也亦作拓字",
    "穰麌梨": "上借音如兩反次音虞矩反梵語也此云藥王或云藥君也",
    "摩訶支那": "訶音呵舊云振旦或云真那應云摩賀振郍此云大唐或云大漢舊云大夏皆隨代義翻也卽今中華國是",
    "彬彬": "鄙中反論語云文質彬彬然後君子包咸注云彬彬文質相半之貌也",
    "郍爛陁": "上正那字梵語西域寺名也此翻爲施無猒在中印度境",
    "𥚫興": "上說文作弇字音衣檢反爾雅云弇曰爲蔽雲郭注云暈氣五彩覆日也又釋言云弇蓋也說文從廾合廾音拱今錄文作揜說文閉也又音烏敢反手大物也於此用疎也",
    "龜茲": "漢書音義上音丘下音慈國名也或云屈支亦云月支或云鳩茨或名烏孫皆一也案西番諸國多因王名或隨地隨山故有多名也卽安西之地",
    "勿提堤犀魚": "堤音低犀音西龜茲國番語三藏名也錄自注云此云蓮花精進也",
    "牛昕": "上語求反姓也姓菀云本自殷周封微子於宋其裔司宼牛父𰏙師敗於狄子孫以王父字爲氏也下火斤反說文云且明日將出也從日斤聲也",
    "索綏": "上蘇各反姓也燉煌人也下息遺反案字安也說文車絡也今案卽人名也",
    "弱齡": "上而斫反字書云弱劣也玉篇云不強下郎丁反顧野王云古謂年爲齡說文云從齒令聲案弱齡卽未冠之前也故禮記云男子二十冠而字鄭云成人矣也",
    "膠輵": "上古肴反爾雅云䵑膠也郭注云膠黏䵑也字林云謂相著也下古遏反玉篇作轇輵二字廣韻云戟形也䵑音女六反",
    "芟夷": "上所銜反字書云伐草也考聲云剪也說文云從草殳會意字殳音殊下以脂反切韻云等也考聲云滅也爾雅云易也說文云從大弓作夷有從戈作夷非也",
    "姥陀羅尼": "上莫補反字書云老母也說文云女師也又作姆字同上今案姥卽觀自在菩薩部姥陁羅尼名号",
    "輸波迦羅": "上弍逾反迦音姜佉反梵語卽唐開元朝西域三藏梵名也此云善無畏",
    "殉法": "上辞閏反說文云以生人送葬也顧野王云亾身從物爲殉也字從歹句聲歹午達反㱙骨殘也㱙音朽",
    "屢奮": "上良遇反字書云數也考聲云疾也爾雅云亟也郭注亟亦數也下方問反字書云動也韻集云揚舉也說文翬也從大鳥在田翬奮其羽也佳卽鳥也翬音暉",
    "悼屈原": "上徒到反字書云哀也考聲云傷也又憐也從心掉省聲也屈九勿反姓屈名原字典平楚爲三閭大夫王甚重之爲靳尚等姤其能共讚毀之乃被流放後遊於湘潭行吟澤畔著離騷云滄浪之水清可以濯吾纓滄浪之水濁可以濯吾足也",
    "撫膺": "上孚武反爾雅云撫掩之也郭注云撫掩猶撫拍也下於凌反說文云賀也案撫膺合作拊字爾雅云辟拊心也郭璞注云謂椎胷也椎音直追反",
    "津涯": "上將隣反切韻云津液也又潤也說文云濟也郭璞云津涉也謂涉渡也下五佳反切韻云水際也郭注爾雅云水邊曰涯峻而水深者曰岸也",
    "繁賸": "上附袁反切韻云槪也字書云繁多也下正作𧷽音實證反考聲云增也廣韻云益也或作賸又音孕說文云送也",
    "玄惲": "下於粉反重也諜也又厚也今案玄惲法師本名世道爲避屆諱故稱其字",
    "紕繆": "上疋彌反考聲云繒欲破也下明救反字書云亂也訛也禮記云一物紕繆民不得其死也鄭注云紕錯也字林作紕繆字謬悞也失也繆又音武休反",
    "宂雜": "上而隴反考聲云散也漢書云桓帝置宂從僕射聲類云宂散雜無食之人也字林作󱷷云猥雜貌也",
    "詭說": "上歸偉反毛詩云無縱詭隨鄭箋云無聽放詭隨人爲惡也淮南子云蘇秦以百詭成一信許叔重注云詭慢也說文云責也從言危聲",
    "瑣屑": "上蘇果反爾雅云瑣瑣小也郭璞注云謂才器細陋說文作𧴪小皃也下先結反切韻云盡也又云末也",
    "源派": "上愚袁反說文云水泉曰源字書云水本也漢書云張騫使西域窮河源其山多玉石而不見崑崙西域傳云河有兩源一出蔥嶺一出千闐也下疋封反考聲分流也說文云邪流作𠂢同有作派俗字非也",
    "承祧": "上署陵反字書云承次也考聲云承奉也說文從了手双作承了音節双音拱下吐彫反字書云祧遠祖廟也",
    "襃貶": "上保毛反顧野王云襃謂揚其美也鄭注禮記云進也說文云衣博褥裾從衣保聲下兵奄反鄭注周禮云減也考聲云黠也說文云貶損也從貝乏聲也",
    "歐噦": "上謳狗反左傳云伏㢭歐血是也說文云歐猶吐也從欠區聲𢎿音滔下冤越反禮記云子侍父不敢噫噦嚏欬也說文云噦猶氣悟也從口歲聲噫厄界反嚏音帝欬音開葢反",
    "雜糅": "上徂合反切韻云雜集也又穿也考聲云衆也下女救反說文云糅亦雜也謂相參雜也字書從丑作粈又作𩚖字",
    "㴱穽": "上式針反爾雅云𤀹幽深也字書云深遠反下疾政反尚書云敜乃穽傳云穽陷也考聲云阮也謂陷獸阬也從穴井聲又作阱字音訓同敜音尼輒反",
    "濩落": "上胡郭反下郎各反廣雅云濩落寬廣無涯濟也字書云殞濩落䕪失志貌也"
}
