{
    "header": {"title": "藏逸經書標目", "author": "明密藏禪師道開遺筆"},
    "圓覺經大疏": "江西省城北龍光寺應方禪師有舊本。其徒號竺章。",
    "圓覺經大鈔": "常州府有舊本。",
    "圓覺經略疏小鈔": "秀水東禪寺有板。",
    "法華經合論": "宋寂音尊者造。張商英附論秀水精嚴寺雲汀禪人。蘇州管東溟居士俱有舊本。今楞嚴寺就精嚴本刊行。",
    "法華要解": "溫陵環師解。今南北講席尚之。世多流行本。",
    "楞嚴論": "宋寂音尊者造。後有正受師釐入經。并有刪補。改名合論常熟錢順化文學有舊本。今秀水楞嚴寺如其本刊行。此論尚當求寂音原本。未經刪釐者。",
    "楞嚴廣註": "淨行所述。今秀水楞嚴寺有舊本。",
    "楞嚴要解": "溫陵環師撰。今南北有板流行。",
    "楞嚴會解": "元天如則師所述。今南北講席宗之。世多流行本。",
    "楞嚴管見": "我明泰法師撰。此書於經意雖不無得失。然亦有發前人未發者。",
    "維摩詰經註": "肇法師撰。南藏已收入。世亦多流行本。五臺山龍翻石有古本善。",
    "楞伽經註": "永樂間泐公奉敕註。已收入藏。",
    "楞伽會譯": "嘉靖間宜興荆山珂法師將三譯楞伽逐段會同釐入刊行。旣有三譯在藏。則此不必重收。况此經三譯。文義各自成家。亦不必會也。",
    "華嚴合論": "唐太宗時李長者造大論一百二十卷。後某釐入經。改名合論。北京本真座主嘉興東塔寺思修禪人。南京聚寶門內西小衚衕機房伍宅。俱有宋元板善本。伍宅本乃北京報國寺僧所遺者。今秀水東禪寺刊板流行。",
    "華嚴合論約語四本": "杭州刊行。旣有合論全文。則此似不必收矣。",
    "華嚴法界觀通玄記三卷": "本嵩法師述。北京有板。",
    "華嚴還源觀類解": "淨源法師述。北京有板。",
    "華嚴綸貫一卷": "復庵和尚撰。北京有板。",
    "原人論解": "圓覺法師述。",
    "華嚴疏鈔會本": "嘉靖間有妙明法師。憫念講席學人愚昧。乃以清涼疏鈔釐經入疏釐疏入鈔。經疏鈔科科段段釐開會入成書。如儒家經書集註相似。今南北講席咸宗之甚至將經疏鈔一併講解。無分源派根葉。殊失清涼老師作述之意。蓋疏以疏經。經明而疏爲賸語。鈔以鈔疏。疏明而鈔爲賸語。是要之鈔以明疏。疏以釋經。經以載道得意則經且爲長語也。况疏鈔乎。今不分經疏鈔。一併講解。是大可笑。卽儒生家師資訓詁。亦只會明註疏。以解經書本文。未有併註疏而講解之者也。或謂鈔不可入疏。而疏不可不入經。不知疏旣可以入經。鈔何獨不可以入疏乎。入疏者。入鈔之漸也。入疏之見。猶夫入鈔之見也。其愚一。其過同。第大小淺深差等耳。或又謂華嚴疏鈔。旣不應釐入。然圓覺略疏法華楞嚴要解會解諸書。作者已自釐入。亦將析而出之乎。予曰。子又何愚之甚也。彼旣作者原自會入。則其文義自是如彼其連屬。何容析出。此旣作者原自分析。則其文義自是如此其分殊。何容會入。大都一切經書註疏。或分或合。但仍作者之舊。則無復議矣。况今所會。起止配合。率多牽強。或不應起而起者有之。或不應截斷而截斷者有之。或配合不相當者有之。是又莫贖之罪也。或又謂若不會入。則學者惡能配合其文而求其義。予曰。文且不能配合。又安望能明其義乎。而要之一切註疏。又不爲此等愚昧設也。嗟夫。少智多愚。一唱百和。法華玄義文句。觀無量壽佛經疏鈔等。南北各有會本刊行矣。而華嚴疏鈔會本。近且重收入藏。使繼此而會註疏者愈出。入藏者愈重。則繁沓雜亂。可勝言哉。今凡註疏。藏中旣收入原本。則會本斷不可重收。卽已入者宜出之。",
    "華嚴會玄": "雲南某師。因懸談中意義事實艱深渺邈者。人多不曉乃搜考諸內外典籍。爲之音釋別錄其本。後講席無智者。遂亦釐入玄談名之曰會玄。講者亦併其文而講之。此其視會疏鈔講疏鈔者。其愚又當何如哉。近亦入藏。甚爲雜亂。宜出之。宜仍其舊本。另刻玄談音釋數卷。或流行。或入藏。皆可也。",
    "華嚴要解": "溫陵環公所述。幻余兄在燕京得此本示余。",
    "法華玄義文句摘要": "嘉興東塔寺了空有本。乃天台宗學人所摘者也。藏中旣有玄義文句全文。此不必重收。",
    "法華大意": "嘉興天𡩋寺法舟和尚俗徒太虛居士所撰。悉以儒家語詮釋。其知見邪惡不可當。而法舟乃印可其刊行。當應同入拔舌泥犁。葢法舟亦賣弄光影者也。有賸語一帙行於世。有眼者自能辨之。嗟乎。是父是子法舟太虛以之。",
    "起信論筆削記": "江南有板流行。",
    "金剛經疏論纂要刊定記": "圭峰纂要。長水刊記。今華亭泖塔有板流行。",
    "金剛經十七家註": "其間邪見甚多。非禪宗非教眼。不足取也。",
    "金剛科儀錄說記": "禪不禪。教不教。不足取也。近續入大藏宜出之。",
    "心經略疏慧燈集": "南北有流行板。",
    "心經管視": "武林妙峰座主述。板在昭慶寺。",
    "心經無垢子註": "此解甚邪見惡業。不足取也。卽大顛註亦邪淺。",
    "彌陀經句解": "深禪師述。今平洲新刻流行。",
    "大彌陀經註": "四川某師述。北京某庵新刻流行。但未經覽閱。未辨其邪正得失。",
    "龍舒淨土文": "",
    "淨土指歸": "大祐師述。秀水楞嚴寺有板。",
    "萬善同歸": "永明壽師撰。秀水楞嚴寺有板。五臺北臺溝中庵師。亦新刊行。",
    "淨土或問": "秀水東禪寺有板。乃天如則師所撰也。",
    "夢譚記": "武林妙峰座主所撰。板在昭慶寺。",
    "永嘉集註": "某師所述。甚膚淺差譌。不足取也。",
    "肇論集解": "淨源師集。",
    "肇論遊刃鈔": "未經閱覽。",
    "肇論註疏": "慈雲懺主註。居姑蘇堯峰。名遵式。",
    "地藏經孝衡疏鈔": "圭峰疏。遇榮鈔。",
    "釋迦成道記註": "唐王勃撰記。釋道誠註。今北京龍華寺刊行。",
    "出三藏記略": "",
    "翻譯名義集": "南藏收。北藏未收。",
    "折疑論": "釋妙明子撰。",
    "平心論": "",
    "鐔津集": "明教嵩和尚撰。藏中止收輔教編三卷。此應盡收入。",
    "冥樞會要": "未經覽閱。",
    "緇門警訓": "",
    "禪林寶訓": "",
    "續原教論": "我明沈士榮太史撰。",
    "大藏一覽": "",
    "佛祖統紀": "天台宗磐公作。南藏已收入。",
    "有門頌解": "妙峰覺法師述。",
    "五燈會元": "五燈今藏中止收景德傳燈。餘盡未收。而世亦鮮流行本。則此會元不得不收矣。今秀水東禪寺有板流行。",
    "續傳燈錄": "南藏已收。",
    "心燈錄": "𠀉玄素撰序。此書世尠流行。宜購求之。",
    "禪宗正脈": "嘉興真如寺蔤庵巹師採摘五燈會元中文。成書十卷。旣有五燈會元。則此書可無收矣。况此師所摘。多己意也。",
    "人天眼目": "宋智眼禪師採錄五宗綱要語句而成帙者也。可收。可不收。",
    "三聖詩": "寒山。拾得。豐干。",
    "古尊宿語錄四十八卷": "南藏已收入。太倉王鳳州居士有宋本善。",
    "四家語錄": "馬祖。百丈。黃蘖。臨濟。又黃蘖心要。",
    "僧寶傳": "宋寂音尊者撰。松江馬杜陵。常熟瞿元立。有宋元本。",
    "智證傳": "宋寂音尊者作。",
    "林間錄": "宋寂音尊者作。已上三書。秀水楞嚴寺俱刊行。",
    "諸方宿衲傳": "宋覺範師撰。",
    "石門文字禪": "宋覺範撰。已上二書。宜購求之。",
    "冷齋夜話": "宋覺範撰。秀水馮開之太史有鈔本。此書多語世諦言事。似不必收矣。",
    "高峯禪要": "五台山龍翻石有舊本善。秀水精嚴寺有板。",
    "天如賸語": "秀水東禪寺有板。有語錄五本。賸語或問宗乘詩文俱在內。",
    "雪巖欽語錄": "東禪寺有板。",
    "無見覩語錄": "天台華頂山有板。",
    "徑山寂照": "四會語錄。元叟端公至正元年集。",
    "雜毒海": "大珠禪師語錄。大慧禪師亦有雜毒海。乃與竹庵同頌古者也。又浙江衢州祥符寺有六十卷。乃宋僧編集古宿語。名禪宗雜毒海。",
    "正法眼藏三卷": "大慧杲和尚所錄。今常熟刊行。",
    "宗門武庫": "大慧杲師所撰。秀水精嚴寺有板。",
    "大慧年譜": "秀水馮開之太史有舊本。已上三書宜入附大慧語錄後。",
    "楚石語錄三十卷": "海鹽許星石居士有鈔本。今秀水楞嚴寺亦有刻本。禪師名梵琦。爲大慧第五代孫。觀其言句。真的骨血也。",
    "愚庵語錄": "諱智及。端元叟之子。與琦楚石同門。真師子兒也。",
    "全室語錄": "禪師名泐。字季潭。觀其言句。真作家人。",
    "㷀絕集": "此老乃鞦韆椿頭弄光景漢。非西來正脈。不宜收入。",
    "慈度集": "此僧乃㷀絕上足。其邪惡過師十倍。古德云。智過於師。慈度以之。",
    "法舟賸語": "師名道濟。號法舟。住秀水縣天寧寺。賸語刊行本郡精嚴寺。其佛法知見。殆㷀絕之流歟。",
    "笑巖集": "此老悟處。不如㷀絕深切。而知見稍正。然亦有氣息。無血脈。照到而用常不及。其殆有識治亂之智。而無敷治戡亂之才者乎。大都應機接物。權衡多執持不定。翻令藻鑑亦模糊不清。而面前多學人。立地狐鬼輩。且得以潛竊而依憑之。此其過安在哉。一則以自己悟處。不曾痛快徹底掀翻。猶存窠臼。二則以時無德山臨濟雲門石霜。毒手辢心。大爲叱咤。一轉擣巢穴。而盡死其偷心。三則以旣非天挺豪傑。又未嘗從尊貴胞胎中誕生。其紀綱政令。不能出自朕躬。而大寶真符。且無的紹。故坐此耳。嗟夫。我明二百年來。楚石季潭而後。拈花一脈。幾乎熄矣。幸師稍能識好惡。辨邪正。尚廼爾爾。彼淺解學語。顢頇儱侗輩。又惡足較哉。諺云。字更三寫。烏焉成馬。奈何吾師落筆便爾誵譌。而何責於二三。嗚呼痛哉。",
    "冰壺集": "師名□□號蘭風。當時以靜坐。得少光景。無師承喝破。遂認爲悟道。生大歡喜。爲魔所乘。由是豎指擎拳。胡言漢語。馮陵南北。以鐵嘴自稱。恬不知恥。蚤年著此書。後住蘇州天池山。年老力強。著作尤盛。萬曆辛巳。余坐夏武林。盡得覽閱。今忘其名矣。有于羅道五部六冊。悉爲評頌。而羽翼其流通者。其知見混濫。視法舟慈度法光輩。僅倍蓰什伯而貪婪媱惡。則千萬億。乃至算數譬喻所不能盡也。真近代魔種哉。",
    "五部六冊": "正德間山東卽墨縣有運糧軍人。姓羅名靜者。蚤年持齋。一日遇邪師授以法門口訣。靜坐十三年。忽見東南一光。遂以爲得道。妄引諸經語作證。說卷五部。曰苦功悟道。曰歎世無爲。曰破邪顯正鑰匙。曰泰山巍巍不動。其一則余忘之矣。破邪卷有上下二冊。故曰六冊。時有僧大寧者。親承而師事之。而蘭風又私淑而羽翼之。俾其教至今猖熾宇內。無從撲滅。曰無爲。曰大乘。曰無念等。皆其教之名也。或三更靜夜。咒詛盟誓。以密傳口訣。或緊閉六門。握拳拄舌。默念默提。救拔當人以出苦海。或謂夫人眼視耳聽手持足行的。現成是佛。大佛小佛。男佛女佛。所作所爲。無非佛事。何分淨染。何事取舍。何假修持。但臨命終時。一絲不挂。卽歸家鄉耳。如此則皆其教之法也。蟻屯鴇聚。唱偈和佛。邪媱混雜。貪昧卑汚。莫可名狀。而愚夫愚婦。率多樂於從事。而恣其貪媱。雖禁之使不歸向。有不可得。此其教雖非白蓮。而爲害殆有甚于白蓮者乎。大寧復著有孝義二冊。歸空記。法舟偈。其徒寓江西南城縣北羊血渡者。復著有心經了義。金剛了義等卷若干冊。皆山歌野曲之文也。",
    "羅湖野錄": "釋曉瑩述。于中甫處得來。號仲溫。江西人。",
    "覺苑遺芳": "莆陽沙門達本集。",
    "禪門宗要": "閩僧雪山祖曼集。舊有刊行本。今已湮沒。比得錄本。虞山錢存虛者。",
    "雨花集": "國初香嚴古溪禪師所撰。雖有上堂偈頌。其實畫龍摸象者也。",
    "賓主盤桓": "平廓愚師著。",
    "冬谿集內外各二卷": "師住秀水精嚴寺。師參學未徹悟。而文字則善。",
    "石屋集": "",
    "四家頌古": "天童。雪竇。投子。丹霞。",
    "頌古聯珠": "南藏已收入。",
    "評唱碧巖集十卷": "雪竇頌。圜悟評。從容菴錄三卷。天童頌。萬松評。空谷集三卷。投子頌。虛堂集三卷。丹霞頌。俱林泉評。今少林師資上堂所講演。入室所背誦者。此也。嗟夫。一花五葉。節外春光。印度真丹。其來尚矣。故凡一語一默一棒一喝。乃至豎拳豎指。斬貓斬蛇。百千三昧。如金剛王寶劍出匣。毒盡肝腸。剜盡心膽。直下令人命根斷。偷心死。更無汝立地轉身處。亦無抵當迴避處。奈何繼此而拈頌代別出焉。此亦萬不得已。借刀殺人。曲就俯循。傍敲暗擊。其用心亦良苦矣。奈何繼此而評唱又出焉。波濤洶湧。枝葉蔓延。而根源喪盡。此殆與癡婦養兒。惟念饑寒。健與衣食。兒不至病且死不已者。夫何異。碧巖集。大慧業已斧其板。火其書。正所謂當仁不讓。圓頓教勿人情也。奈何近代以來。講評唱鈔秘要者又出焉。此其禍葢始自無智比丘。濫膺住持。參學者雲集。上堂啞口。入室無言。何以縻學衆而度時光。飾檀越而需利養。遂效講席而出此計。少智多愚。一唱百和。垂至今日。醜不可言。以秘要爲奇貨。以尋行數墨識字問義爲作家。又其表表者。則習學現成句語。流滑口耳。規取絹帕。以爲他日利養張本。如近日幻休老人。得法子領絹帕者。不下干人。雖從昔諸大老。得人未有如斯之盛。翻令直指真風。不啻三乘曲說。不立正脈。無殊義學繁文。而不知末後拈花。東來面壁。乃至立雪斷臂。覆舟捐軀。種種不恤以橫身唱此者。此其心何心哉。而震旦衆生。所賴以不滯名言。得翻情臼而出生死者。亦恃有此。故雪竇有一言之失。而來枯椿獵犬之譏。太陽有密付之宗。而致揭膀告人之辱。此其心又何心哉。且古人上堂。奔雷掣電。倒嶽傾河。寧有解說文字者乎。古人入室。或一喝耳聾。或微言面熱。或推門折足。吹毛死心。寧有鈔寫秘要。口耳傳習。類世儒童蒙訓詁之學者乎。古人參學。一點不到。則結舌填胸。一語有差。則毛寒骨豎。五斗蓋不可謂不了生死。一絡索不可謂已絕凡情。要在真參實悟而已。寧有習爲現語。以油滑口嘴者乎。古者得人。獨馬祖。石霜。雪峯。雲門爲盛。其餘不過钁頭邊覓取一箇半箇。寧有領絹帕稱法子至千人者乎。是今日宗門。誠講席不若。而今日少林。誠戲場利局無二矣。上負佛祖熱血心腸。下瞎衆生清淨眼目。吾恐鑊湯罏炭。拔舌釘身。端不爲十惡衆生設。而于此輩有待也。嗚呼。習染未久。公道猶存。斬新改圖。是所望于智者。雖然。愚人之情。習高尚則不足。習汚下則有餘。源不塞。流不止。根不撥。枝不亡。非復大慧一炬。悉皆令入無餘火光三昧。欲其不講演。不背誦。不鈔謄。不可得也。或曰。如師所言。則十二部修多羅。千七百則舊葛籐。亦將付之一炬乎。余曰。不然。凡在教乘。不獨經論。卽註疏家一句一字。一音一義。有補經論者。無妨珍重流通。獨宗門下事。誠無舌人解語。卽終日言說。累牘盈篇。實未嘗談一事。而况古人葛籐。雖千七百則。欲覓一元字腳。寧可得耶。第有半滴野狐涎吐唾未盡者。則豈惟千言萬語。簇錦攢花。敷布世間。足以亂朱混雅。所當不惜身命以爭。深惡痛絕。以謝佛祖而報深恩。卽一言半偈。亦不可不嚴辨緇素。別是非。而垂一定之鑒。孟軻氏曰。經正則庶民興。此又繼祖位報佛恩者大綱要令。又曰。孔子作春秋而亂臣賊子懼。此又不肖區區饒舌狗馬心也。",
    "逃虛集": "獨菴衍公所著。",
    "道餘錄": "獨菴衍公所著。",
    "孤月語錄": "五台山北山寺有板。",
    "蠶骨集": "無際禪師所著。禪師。四川人。",
    "玉芝集": "㷀絕法舟之類也。",
    "通明語錄": "有禪人告以大智禪師所撰。計二十八本。板在遵化北四十里禪林寺。北京報國寺延菴方丈。龍佛寺上方丈延明乃師寂菴。南城守居衚衕蘇道士。俱有本。此書未知邪正何如當求一覽閱。大智禪師不知爲誰。亦不知何時人。然所告禪者乃孟浪人。多不足信也。"
}
